[{"query_id":1000678,"passage_id":7262615,"ranking":1,"query_text":"where did captain james cook explore?","passage_text":"Where did James Cook go on his voyage? A: The English explorer Captain James Cook made three voyages between 1768 and 1779. On the first, he mapped New Zealand and the eastern coast of Australia. O... Full Answer >","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":7262618,"ranking":2,"query_text":"where did captain james cook explore?","passage_text":"Why did Captain James Cook explore? A: Captain James Cook set out on his first expedition to find the planet Venus, went about his second expedition to find the southern continent and went out o... Full Answer > Filed Under:","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4075458,"ranking":3,"query_text":"where did captain james cook explore?","passage_text":"Occupation: Explorer; Born: October 27, 1728 in Marton, England; Died: Killed by natives at the Hawaiian Islands on February 14, 1779; Best known for: Exploring the South Pacific; Biography: James Cook was a British navigator and explorer who sailed and mapped much of the South Pacific. Where did Captain Cook grow up? James Cook was born on October 27, 1728 in Marton, England. His father was a farmer, but as James grew older he began to feel the lure of the sea. At around the age of 18 he took an apprenticeship as a merchant seaman.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4075457,"ranking":4,"query_text":"where did captain james cook explore?","passage_text":"by James Cook and edited by A. Grenfell Price Who better to tell the story of the voyages of Captain Cook than the captain himself. Purchase this paperback edition of Explorations of Captain James Cook in the Pacific","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":7262612,"ranking":5,"query_text":"where did captain james cook explore?","passage_text":"Purchase this paperback edition of The Journals of Captain Cook. Explorations of Captain James Cook in the Pacific As Told by Selections of His Own Journals, 1768-1779. by James Cook and edited by A. Grenfell Price. Who better to tell the story of the voyages of Captain Cook than the captain himself.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4075463,"ranking":6,"query_text":"where did captain james cook explore?","passage_text":"CAPTAIN JAMES COOK PowerPoint PPT Presentation. CAPTAIN JAMES COOK . British Explorer. His life. James Cook was born on October 27, 1728 in Main-Cleveland in the North Riding of Yorkshire. His birthplace was a thatched cottage.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4823217,"ranking":7,"query_text":"where did captain james cook explore?","passage_text":"Captain James Cook's last stop was in February, 1779 at the Sandwich Islands (Hawaii) where he was killed in a fight with islanders over the theft of a boat. Cook's explorations dramatically increased European knowledge of the world.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":8668801,"ranking":8,"query_text":"where did captain james cook explore?","passage_text":"James Cook Biography. James Cook was a British explorer, captain and cartographer. Explore this biography to learn more about his profile, childhood, life and timeline. See the events in life of James Cook in Chronological Order. Quick Facts.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4286288,"ranking":9,"query_text":"where did captain james cook explore?","passage_text":"Captain James Cook. 'Discoverer' of Hawaii. In 1778, 257 years after the death of Ferdinand Magellan, Captain James Cook landed on the shores of Hawaii. Capt. Cook was an exceptional navigator, cartographer and captian from a nation of explorers.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":3114308,"ranking":10,"query_text":"where did captain james cook explore?","passage_text":"About Captain James Cook Captain James Cook FRS RN (7 November [O.S. 27 October] 1728 â\u0080\u0093 14 February 1779) was an English explorer, navigator and cartographer, ultimately rising to the rank of Captain in the Royal Navy.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":739572,"ranking":11,"query_text":"where did captain james cook explore?","passage_text":"Captain James Cook (1728 - 1779) Portrait of Captain James Cook, by John Webber Â© Cook was an 18th century explorer and navigator whose achievements in mapping the Pacific, New Zealand and Australia radically changed western perceptions of world geography.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":7262611,"ranking":12,"query_text":"where did captain james cook explore?","passage_text":"Cook, James (1728â\u0080\u00931779) A navigator, surveyor and explorer, who captained three expeditions to the Pacific between 1768 and 1779. He surveyed the coasts of New Zealand and eastern Australia, and explored part of the seaboard of Antarctica. He was able to show that the supposed â\u0080\u0098Great Southern Continentâ\u0080\u0099 did not exist.","bm25_label":"high","relevance_label":1.0},{"query_id":1000678,"passage_id":8190075,"ranking":13,"query_text":"where did captain james cook explore?","passage_text":"The Death of Captain James Cook, 14 February 1779 is a painting by Johann Zoffany. The painting records the loss of the British explorer Captain James Cook. The painting was completed in 1794 some years after the death of Cook in 1779. Other paintings of the death of Cook were painted earlier.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":6734960,"ranking":14,"query_text":"where did captain james cook explore?","passage_text":"On February 14, 1779, Captain James Cook, the great English explorer and navigator, is murdered by natives of Hawaii during his third visit to the Pacific island group.n February 14, 1779, Captain James Cook, the great English explorer and navigator, is murdered by natives of Hawaii during his third visit to the Pacific island group.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":2652839,"ranking":15,"query_text":"where did captain james cook explore?","passage_text":"Captain James Cook stands for it all. He is definitely the greatest navigator and explorer who ever has been. The time Captain Cook lived must be the most exiting age of this millennium.ut I had other ideas, and made my own choice on the voting. Photo. Captain James Cook (1728-1779): the greatest explorer who ever has been! A portrait by Nathaniel Dance painted in 1776, the year in which Cook set off on his last journey (also used as cover on the book of ....).","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4286283,"ranking":16,"query_text":"where did captain james cook explore?","passage_text":"Captain Cook killed in Hawaii. On February 14, 1779, Captain James Cook, the great English explorer and navigator, is murdered by natives of Hawaii during his third visit to the Pacific island group.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":7262614,"ranking":17,"query_text":"where did captain james cook explore?","passage_text":"Cook, James (1728-1779) English explorer. James Cook was one of the foremost figures of the Age of Exploration. During his career, Cook circumnavigated the globe twice, and captained three voyages of discovery for England. Cook made significant contributions to the fields of surveying, cartography, advanced mathematics, astronomy, and navigation.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4075446,"ranking":18,"query_text":"where did captain james cook explore?","passage_text":"Captain James Cook FRS (7 November 1728[NB 1] â\u0080\u0093 14 February 1779) was a British explorer, navigator, cartographer, and captain in the Royal Navy.","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":2652833,"ranking":19,"query_text":"where did captain james cook explore?","passage_text":"Captain James Cook (1728-1779) - the greatest explorer in the world. In October previous year I joined BBC News Online's poll to vote for the greatest explorer of the millennium. Two British explorers, Brian Jones and David Hempleman-Adams had nominated their top 10 lists.But I had other ideas, and made my own choice on the voting.Photo. Captain James Cook (1728-1779): the greatest explorer who ever has been! A portrait by Nathaniel Dance painted in 1776, the year in which Cook set off on his last journey (also used as cover on the book of ....).ut I had other ideas, and made my own choice on the voting. Photo. Captain James Cook (1728-1779): the greatest explorer who ever has been! A portrait by Nathaniel Dance painted in 1776, the year in which Cook set off on his last journey (also used as cover on the book of ....).","bm25_label":"high","relevance_label":0.0},{"query_id":1000678,"passage_id":4075460,"ranking":20,"query_text":"where did captain james cook explore?","passage_text":"As Cook was exploring during the American Revolution, Benjamin Franklin wrote to the captains of America's warships telling them to not attack or harass Cook's ships. Activities Take a ten question quiz about this page. More Explorers: Roald Amundsen; Neil Armstrong; Daniel Boone; Christopher Columbus; Captain James Cook; Hernan Cortes; Vasco da Gama","bm25_label":"high","relevance_label":0.0}]