[{"query_id":1000519,"passage_id":7263156,"ranking":1,"query_text":"where did the ottomans deport the armenians","passage_text":"On June 2, Germanyâ\u0080\u0099s parliament, the Bundestag, voted to declare the mass killings of Armenians by Ottoman Turks in 1915 a genocide. The Germans are not the first to take this step and they will not be the last. But the location and timing of this genocide resolution distinguish it. When the Ottomans began to deport Armenians during World War I, Germany was their closest ally. German officers and soldiers had no direct role in the deportations, which wiped out almost the entire Armenian population of the empire, but they did nothing to stop them.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7263152,"ranking":2,"query_text":"where did the ottomans deport the armenians","passage_text":"Armenian notables deported from the Ottoman capital in 1915 Save The deportation of Armenian intellectuals, sometimes known as Red Sunday (Western Armenian: Ô¿Õ¡Ö\u0080Õ´Õ«Ö\u0080 Õ¯Õ«Ö\u0080Õ¡Õ¯Õ« Garmir giragi), [2] was an event during the Armenian Genocide in which leaders of the Armenian community in the Ottoman capital of Constantinople, and later other locations, were arrested and moved to two holding centers near Ankara.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7263157,"ranking":3,"query_text":"where did the ottomans deport the armenians","passage_text":"On this day in 1915, in the latest of a disturbing series of Turkish aggressions against Armenians during World War I, Mehmed Talat, the Ottoman minister of the interior, announces that all Armenians living near the battlefield zones in eastern Anatolia (under Ottoman rule) will be deported to Syria and Mosul.","bm25_label":"high","relevance_label":1.0},{"query_id":1000519,"passage_id":8582620,"ranking":4,"query_text":"where did the ottomans deport the armenians","passage_text":"Armenian Genocide, campaign of deportation and mass killing conducted against the Armenian subjects of the Ottoman Empire by the Young Turk government during World War I (1914â\u0080\u009318). Armenians charge that the campaign was a deliberate attempt to destroy the Armenian people and, thus, an act of genocide.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":5103853,"ranking":5,"query_text":"where did the ottomans deport the armenians","passage_text":"L.A. Unified Recognizes April As Commemoration of the Armenian Genocide of 1915. It is estimated that over 2 million Christians of Armenian, Greek and Assyrian descent were systematically deported and executed by the Ottoman government from 1915-23.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":1119095,"ranking":6,"query_text":"where did the ottomans deport the armenians","passage_text":"The policy of genocide against the Armenian population of the Ottoman Empire started with the annihilation of the male population and subsequent deportation the rest of the people into the Syrian deserts. These deportations quickly turned into â\u0080\u009cdeath marchesâ\u0080\u009d. Deportation caravans mostly consisted of old people, women and children.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7596209,"ranking":7,"query_text":"where did the ottomans deport the armenians","passage_text":"Armenian Genocide. Introduction. In 1915, leaders of the Turkish government set in motion a plan to expel and massacre Armenians living in the Ottoman Empire. Though reports vary, most sources agree that there were about 2 million Armenians in the Ottoman Empire at the time of the massacre. By the early 1920s, when the massacres and deportations finally ended, some 1.5 million of Turkeyâ\u0080\u0099s Armenians were dead, with many more forcibly removed from the country.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7263160,"ranking":8,"query_text":"where did the ottomans deport the armenians","passage_text":"In some places, they raped women and forced them to join Turkish â\u0080\u009charemsâ\u0080\u009d or serve as slaves. Muslim families moved into the homes of deported Armenians and seized their property. In 1922, when the genocide was over, there were just 388,000 Armenians remaining in the Ottoman Empire. The Armenian Genocide Today","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":8385693,"ranking":9,"query_text":"where did the ottomans deport the armenians","passage_text":"how many people died in the armenian genocide top of list it is estimated that one and a half million armenians perished between 1915 and 1923 there were an estimated two million armenians living in the ottoman empire on the eve of w w i well over a million were deported in 1915","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":8582626,"ranking":10,"query_text":"where did the ottomans deport the armenians","passage_text":"In May the Ottoman Parliament passed legislation formally authorizing the deportation. Throughout summer and autumn of 1915, Armenian civilians were removed from their homes and marched through the valleys and mountains of Eastern Anatolia toward desert concentration camps. The deportation, which was overseen by civil and military officials, was accompanied by a systematic campaign of mass murder carried out by irregular forces as well as by local Kurds and Circassians.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":2853519,"ranking":11,"query_text":"where did the ottomans deport the armenians","passage_text":"Though reports vary, most sources agree that there were about 2 million Armenians in the Ottoman Empire at the time of the massacre. By the early 1920s, when the massacres and deportations finally ended, some 1.5 million of Turkeyâ\u0080\u0099s Armenians were dead, with many more forcibly removed from the country. Today, most historians call this event a genocideâ\u0080\u0093a premeditated and systematic campaign to exterminate an entire people.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":6651076,"ranking":12,"query_text":"where did the ottomans deport the armenians","passage_text":"During the 15th century, Armenia was absorbed into the mighty Ottoman Empire. Did You Know? American news outlets have also been reluctant to use the word â\u0080\u009cgenocideâ\u0080\u009d to describe Turkeyâ\u0080\u0099s crimes. The phrase â\u0080\u009cArmenian genocideâ\u0080\u009d did not appear in the New York Times until 2004. The Ottoman rulers, like most of their subjects, were Muslim. They permitted religious minorities like the Armenians to maintain some autonomy, but they also subjected Armenians, who they viewed as â\u0080\u009cinfidels,â\u0080\u009d to unequal and unjust treatment.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7244917,"ranking":13,"query_text":"where did the ottomans deport the armenians","passage_text":"During the 15th century, Armenia was absorbed into the mighty Ottoman Empire. Did You Know? American news outlets have also been reluctant to use the word â\u0080\u009cgenocideâ\u0080\u009d to describe Turkeyâ\u0080\u0099s crimes. The phrase â\u0080\u009cArmenian genocideâ\u0080\u009d did not appear in the New York Times until 2004. The Ottoman rulers, like most of their subjects, were Muslim.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":4816792,"ranking":14,"query_text":"where did the ottomans deport the armenians","passage_text":"The events of World War I in the Ottoman Empire, where approximately two million Christian inhabitants were killed or disappeared traceless, are usually described as the 1915 genocide or the Armenian genocide since the Armenians constituted up to 1.5 million of these victims.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":1119088,"ranking":15,"query_text":"where did the ottomans deport the armenians","passage_text":"Armenian Genocide. Introduction. In 1915, leaders of the Turkish government set in motion a plan to expel and massacre Armenians living in the Ottoman Empire. Though reports vary, most sources agree that there were about 2 million Armenians in the Ottoman Empire at the time of the massacre.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7263153,"ranking":16,"query_text":"where did the ottomans deport the armenians","passage_text":"At the beginning of the 20th century, there were about 2.5 million Armenians living in the Ottoman Empire, mostly concentrated in the six provinces of Eastern Anatolia. A significant number of Armenians also lived beyond the eastern border of the Ottoman Empire, in territory held by Russia.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7263154,"ranking":17,"query_text":"where did the ottomans deport the armenians","passage_text":"It claims there was no deliberate attempt to wipe out the Armenian population, that the move to deport them was a defensive position after Armenians sided with Russians in the war, and that as many Turks and other Muslims as Armenian Christians died in the fighting.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":8202307,"ranking":18,"query_text":"where did the ottomans deport the armenians","passage_text":"Armenians have been throughout throughout historic past. Armenians settled in Lebanon en masse after the Armenian Genocide. in general it grow to be the western Armenians that have been slaughtered and deported, so the Genocide survivors took their language and way of existence with them and settled in Beirut and Syria.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":3963314,"ranking":19,"query_text":"where did the ottomans deport the armenians","passage_text":"What is the Armenian Genocide? [top of list] The atrocities committed against the Armenian people of the Ottoman Empire during W.W.I are called the Armenian Genocide. Genocide is the organized killing of a people for the express purpose of putting an end to their collective existence.","bm25_label":"high","relevance_label":0.0},{"query_id":1000519,"passage_id":7263155,"ranking":20,"query_text":"where did the ottomans deport the armenians","passage_text":"While the world was focused on battle in Europe, the Ottoman Empire began a systematic campaign to eliminate the Armenian people within its borders.[4] Ottoman authorities created a propaganda campaign claiming that Armenians were a threat to national security, in part because of some Armeniansâ\u0080\u0099 support of Russia in the ongoing World War.","bm25_label":"high","relevance_label":0.0}]