[{"query_id":1000170,"passage_id":6321188,"ranking":1,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood enters the right atrium, the chamber on the upper right side of the heart. When the blood enters the right atrium, most of it flows through the foramen ovale into the left atrium. Blood then passes into the left ventricle (lower chamber of the heart) and then to the aorta (the large artery coming from the heart).hen the blood enters the right atrium, most of it flows through the foramen ovale into the left atrium. Blood then passes into the left ventricle (lower chamber of the heart) and then to the aorta (the large artery coming from the heart).","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":6301228,"ranking":2,"query_text":"where does blood come from before it enters the left atrium","passage_text":"De-oxygenated blood enters the right atrium of the heart and flows into the right ventricle where it is pumped through the pulmonary arteries to the lungs. Pulmonary veins return the now oxygen-rich blood to the heart, where it enters the left atrium before flowing into the left ventricle.rteries always take blood away from the heart, regardless of their oxygenation, and veins always bring blood back. In general, arteries bring oxygenated blood to the tissues; veins bring deoxygenated blood back to the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":7389734,"ranking":3,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood enters the right atrium, the chamber on the upper right side of the heart. When the blood enters the right atrium, most of it flows through the foramen ovale into the left atrium. Blood then passes into the left ventricle (lower chamber of the heart) and then to the aorta (the large artery coming from the heart).","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":6420533,"ranking":4,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood that has traveled through the body returns to the heart and enters the right atrium. This blood flows through the tricuspid valve into the right ventricle. The right ventricle pumps the blood to the lungs, where it absorbs oxygen.Oxygen-rich blood returns from the lungs and enters the heart through the left atrium. Blood passes from the left atrium through the mitral valve and into the left ventricle.lood that has traveled through the body returns to the heart and enters the right atrium. This blood flows through the tricuspid valve into the right ventricle. The right ventricle pumps the blood to the lungs, where it absorbs oxygen.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":5724171,"ranking":5,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood enters the right atrium, the chamber on the upper right side of the heart. When the blood enters the right atrium, most of it flows through the foramen ovale into the left atrium. Blood then passes into the left ventricle (lower chamber of the heart) and then to the aorta (the large artery coming from the heart). From the aorta, blood is sent to the heart muscle itself in addition to the brain.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":4407063,"ranking":6,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood coming from ____________ enters superior and inferior vena cavae which empties into right atrium, then right ventricle, pulmonary arteries and to lungs. Oxygenated blood from lungs passes thru pulmonary veins to left atrium, then to left ventricle which pumps it through _________________ to body.Pulmonary circulation is path of blood from right ventricle through lungs and back to heart.lood coming from ____________ enters superior and inferior vena cavae which empties into right atrium, then right ventricle, pulmonary arteries and to lungs. Oxygenated blood from lungs passes thru pulmonary veins to left atrium, then to left ventricle which pumps it through _________________ to body.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":8448836,"ranking":7,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood moves through each side of the heart systematically. Deoxygenated blood is delivered into the right atrium. It then enters the right ventricle, from where it is pumped out into the pulmonary artery and to the lungs. Oxygenated blood returning in the pulmonary veins flows into the left atrium.eoxygenated blood is delivered into the right atrium. It then enters the right ventricle, from where it is pumped out into the pulmonary artery and to the lungs. Oxygenated blood returning in the pulmonary veins flows into the left atrium.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":3155271,"ranking":8,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Mitral regurgitation is where blood leaks back through the mitral valve in the heart as the valve does not close properly. This increases the pressure in the left atrium and in the blood vessels coming from the lungs.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":2591810,"ranking":9,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Â· just now. Report Abuse. Oxygenated blood flows from the lungs to the left atrium contractions (heart muscle) cause the blood to leave the atrium and enter the left ventricle. Further contraction causes the blood to leave the atrium and enter the aorta.Under the pressure created by the continuously beating heart, the blood flows through the aorta (major artery), reaching the point where the aorta branches off towards the upper body (face, neck brain etc) and the lower body. just now. Report Abuse. Oxygenated blood flows from the lungs to the left atrium contractions (heart muscle) cause the blood to leave the atrium and enter the left ventricle. Further contraction causes the blood to leave the atrium and enter the aorta.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":7389735,"ranking":10,"query_text":"where does blood come from before it enters the left atrium","passage_text":"When the blood enters the right atrium, most of it flows through the foramen ovale into the left atrium. Blood then passes into the left ventricle (lower chamber of the heart) and then to the aorta (the large artery coming from the heart).","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":4130309,"ranking":11,"query_text":"where does blood come from before it enters the left atrium","passage_text":"The pulmonary arteries take blood into the lungs, where it is oxygenated. From there, oxygenated blood travels back to the left side of the heart through the pulmonary veins, at which time it enters the left atrium. From the left atrium, blood flows through the mitral valve into the left ventricle.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":952943,"ranking":12,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood that has traveled through the body returns to the heart and enters the right atrium. This blood flows through the tricuspid valve into the right ventricle. The right ventricle pumps the blood to the lungs, where it absorbs oxygen.Oxygen-rich blood returns from the lungs and enters the heart through the left atrium. Blood passes from the left atrium through the mitral valve and into the left ventricle.The left ventricle, the largest and most muscular of the four chambers, is the main pumping chamber of the heart.When the left ventricle contracts, blood is pumped through the aortic valve into the main artery of the body (aorta).lood that has traveled through the body returns to the heart and enters the right atrium. This blood flows through the tricuspid valve into the right ventricle. The right ventricle pumps the blood to the lungs, where it absorbs oxygen.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":2196147,"ranking":13,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Blood moves through each side of the heart systematically. Deoxygenated blood is delivered into the right atrium. It then enters the right ventricle, from where it is pumped out into the pulmonary artery and to the lungs. Oxygenated blood returning in the pulmonary veins flows into the left atrium.lood moves through each side of the heart systematically. Deoxygenated blood is delivered into the right atrium. It then enters the right ventricle, from where it is pumped out into the pulmonary artery and to the lungs. Oxygenated blood returning in the pulmonary veins flows into the left atrium.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":3209266,"ranking":14,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Mitral regurgitation is where blood leaks back through the mitral valve in the heart as the valve does not close properly. This increases the pressure in the left atrium and in the blood vessels coming from the lungs.This may lead to various problems and symptoms, depending on the severity of the leak.n mitral regurgitation the valve does not close properly. This causes blood to leak back (regurgitate) into the left atrium when the left ventricle contracts. Basically, the more open the valve remains, the more blood regurgitates, the more severe the problem.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":7264060,"ranking":15,"query_text":"where does blood come from before it enters the left atrium","passage_text":"The red blood that enters the fetus passes through the fetal liver and enters the right side of the heart. The red blood goes through one of the two extra connections in the fetal heart that will close after the baby is born. The hole between the top two heart chambers (right and left atrium) is called a patent foramen ovale (PFO). This hole allows the reddest blood to go from the right atrium to left atrium and then to the left ventricle and out the aorta. As a result the blood with the most oxygen gets to the brain. Blood coming back from the fetusâ\u0080\u0099s body also enters the right atrium, but the fetus is able to send this blue blood from the right atrium to the right ventricle (the chamber that normally pumps blood to the lungs).","bm25_label":"high","relevance_label":1.0},{"query_id":1000170,"passage_id":5322450,"ranking":16,"query_text":"where does blood come from before it enters the left atrium","passage_text":"The blood then moves to the right atrium of the heart. In the fetus, there is an opening between the right and left atrium (the foramen ovale), and most of the blood flows through this hole directly into the left atrium from the right atrium, thus bypassing pulmonary circulation.ome of the blood moves from the aorta through the internal iliac arteries to the umbilical arteries, and re-enters the placenta, where carbon dioxide and other waste products from the fetus are taken up and enter the maternal circulation. î\u0081\u0081 î\u0081\u0082 î\u0080\u0092.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":3209265,"ranking":17,"query_text":"where does blood come from before it enters the left atrium","passage_text":"14. Mitral regurgitation is where blood leaks back through the mitral valve in the heart as the valve does not close properly. This increases the pressure in the left atrium and in the blood vessels coming from the lungs. This may lead to various problems and symptoms, depending on the severity of the leak.n mitral regurgitation the valve does not close properly. This causes blood to leak back (regurgitate) into the left atrium when the left ventricle contracts. Basically, the more open the valve remains, the more blood regurgitates, the more severe the problem.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":8093648,"ranking":18,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Some of the blood entering the right atrium does not pass directly to the left atrium through the foramen ovale, but enters the right ventricle and is pumped into the pulmonary artery.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":4472719,"ranking":19,"query_text":"where does blood come from before it enters the left atrium","passage_text":"The upper two are called atria and the lower two are called ventricles. The right atrium receives blood depleted of oxygen from all parts of the body and releases it to the right ventricle. The right ventricle pumps blood into the lungs where blood gets oxygenated and flows into the left atrium. From there it enters the left ventricle.","bm25_label":"high","relevance_label":0.0},{"query_id":1000170,"passage_id":6108001,"ranking":20,"query_text":"where does blood come from before it enters the left atrium","passage_text":"Deoxygenated blood enters the right atrium, and passes through the tricuspid valve to the right ventricle. The blood is then pumped through the pulmonary artery to the lungs t â\u0080¦ o become oxygenated. From the lung blood comes through pulmonary veins to the section of the heart called the left atrium.The left atrium pumps to the left ventricle. The left ventricle pumps out through aorta to the rest of the body to deliver the oxygen. Once delivered, it returns to the right atrium to begin the cycle once more.rom the lung blood comes through pulmonary veins to the section of the heart called the left atrium. The left atrium pumps to the left ventricle. The left ventricle pumps out through aorta to the rest of the body to deliver the oxygen. Once delivered, it returns to the right atrium to begin the cycle once more.","bm25_label":"high","relevance_label":0.0}]