[{"query_id":1002938,"passage_id":7258856,"ranking":1,"query_text":"when was itsfunneh born","passage_text":"ItsFunneh is best known as a YouTube Star who was born in Canada on Tuesday, October 31, 1995. ItsFunneh is currently 22 years old. ItsFunneh's birth sign is Scorpio. Scroll below and go to Page 2 to see our most recent 2017 and 2018 Estimated Net Worth for ItsFunneh as well as ItsFunneh's estimated 2017 earnings, income, and salary!","bm25_label":"high","relevance_label":1.0},{"query_id":1002938,"passage_id":4855858,"ranking":2,"query_text":"when was itsfunneh born","passage_text":"Statistics for ItsFunneh. ItsFunneh statistics recorded at 05.10.2015 00:27, since that time ItsFunneh played 153 hours on 124 servers, the last time he(she) played ItsFunneh 2 days, 17 hours, 27 minutes ago (2017.04.14 09:48). Now ItsFunneh offline.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":4855853,"ranking":3,"query_text":"when was itsfunneh born","passage_text":"By using our site, you consent to the use of the cookie, you can read more in the section Privacy. ItsFunneh statistics recorded at 05.10.2015 00:27, since that time ItsFunneh played 153 hours on 124 servers, the last time he(she) played ItsFunneh 2 days, 17 hours, 27 minutes ago (2017.04.14 09:48).","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":7258855,"ranking":4,"query_text":"when was itsfunneh born","passage_text":"ItsFunneh is 1 of 1 people on AlphaLife with the first name ItsFunneh and is also a member of people who are 22 years old, celebs who are known for being YouTube Stars, and famous figures with the birth sign of Scorpio!","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":7258858,"ranking":5,"query_text":"when was itsfunneh born","passage_text":"Everything about ItsFunneh . Before fame, family details, birthday, popularity, pictures and more.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":7258849,"ranking":6,"query_text":"when was itsfunneh born","passage_text":"His sisters are fellow YouTubers PaintingRainbows, GoldenGlare, ItsFunneh and LunarEclipse. Associated With. Jentplays is also known for posting Roblox content to YouTube.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":7258854,"ranking":7,"query_text":"when was itsfunneh born","passage_text":"His sisters are fellow YouTubers PaintingRainbows, GoldenGlare, ItsFunneh and LunarEclipse. Associated With Jentplays is also known for posting Roblox content to YouTube.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":4143218,"ranking":8,"query_text":"when was itsfunneh born","passage_text":"(Characters belong to ItsFunneh) Funneh Marina is a 19 year old princess who had a normal royal life. Then, she had to get married to a prince she didn't know and she th...","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":4143223,"ranking":9,"query_text":"when was itsfunneh born","passage_text":"An ItsFunneh Fanfic love storyð\u009f\u0092\u0098 Funneh. A beautiful, ordinary, blue haired girl who is going to transfer at YH or in other words Yandere High.As she starts her first d... roleplay","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":7258850,"ranking":10,"query_text":"when was itsfunneh born","passage_text":"Funneh doesn't work on it much because she's to busy with her first channel, ItsFunneh. - -Career When Funneh was around 10 or 11 years old, her parents bought her first ever camera, and on it she would record skit-type videos, and put them into Windows Movie Maker and edit them, and she would show the videos to her family.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":3048940,"ranking":11,"query_text":"when was itsfunneh born","passage_text":"To be borne is defined as to be held up, supported or moved by steady pressure. 1  An example of borne is when a house has held up a roof. 2  An example of borne is when facts support the conclusions in a report. 3  An example of borne is when boats are moved by the tides.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":4364665,"ranking":12,"query_text":"when was itsfunneh born","passage_text":"William Henry Harrison (resident of Ohio when elected President- was born in Virginia) . Ulysses Grant (born in Ohio, not a resident of Ohio when elected President) . Rutherford Hayes (born , lived and buried in Ohio) . James a Garfield (born , lived and buried in Ohio) . Benjamin Harrison (born in Ohio, not a resident of Ohio when elected President) . William McKinley (born , lived and buried in Ohio) . William Howard Taft (born in Ohio and a resident of Ohio when elected President. Lived in Washington after he was president and is buried there.) . Warren Harding (born , lived and buried in Ohio)","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":8772297,"ranking":13,"query_text":"when was itsfunneh born","passage_text":"Pandora: search forâ\u0080¦ Johnny Mathis â\u0080¢ When A Child Is Born. Wikipedia: search forâ\u0080¦ Johnny Mathis â\u0080¢ The Essential Johnny Mathis â\u0080¢ When A Child Is Born. Spotify: search forâ\u0080¦ Johnny Mathis â\u0080¢ The Essential Johnny Mathis â\u0080¢ When A Child Is Born. allmusic: When A Child Is Born.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":6614064,"ranking":14,"query_text":"when was itsfunneh born","passage_text":"A child is born out of wedlock if the child's parents 1) were not married when the child was conceived, 2) were not married when the child was born, and 3) have not married since the child was born. A child is automatically considered legitimate if the child was born when the parents were married.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":4649497,"ranking":15,"query_text":"when was itsfunneh born","passage_text":"Could you tell me your name, please and where were you born? My name is Emanuel Tanay and I was born in Vilna, which at that time when I was born wasn't Poland, it was Russia when my mother was born and it was Lithuania when my mother went to secondary school and it was Lithuania, capitol of Lithuania Republic now, but it was Poland when I was born. Were you raised in Vilna?","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":6297842,"ranking":16,"query_text":"when was itsfunneh born","passage_text":"When was Matthew williamson born? already exists. already exists as an alternate of this question. exists and is an alternate of. What's next after the Origami Yoda series is complete? Will you write sequels of any of your other books? Is Matthew williamson gay? When was born Matthew Espinosa? When was Lexi Matthews born? When was Mackenzie Sol ...hen was Matthew williamson born? already exists. already exists as an alternate of this question. exists and is an alternate of. What's next after the Origami Yoda series is complete? Will you write sequels of any of your other books? Is Matthew williamson gay? When was born Matthew Espinosa? When was Lexi Matthews born? When was Mackenzie Sol ...","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":8772295,"ranking":17,"query_text":"when was itsfunneh born","passage_text":"Amazon: buy When A Child Is Born. Hype Machine: search forâ\u0080¦ Johnny Mathis â\u0080¢ When A Child Is Born. Last.fm: search forâ\u0080¦ Johnny Mathis â\u0080¢ The Essential Johnny Mathis â\u0080¢ When A Child Is Born. Pandora: search forâ\u0080¦ Johnny Mathis â\u0080¢ When A Child Is Born. Wikipedia: search forâ\u0080¦ Johnny Mathis â\u0080¢ The Essential Johnny Mathis â\u0080¢ When A Child Is Born. This song is by Johnny Mathis and appears on the compilation album The Essential Johnny Mathis (2004).","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":2314617,"ranking":18,"query_text":"when was itsfunneh born","passage_text":"And Abraham was a hundred years old, when his son Isaac was born unto him. Douay-Rheims Bible When he was a hundred years old: for at this age of his father was Isaac born. Darby Bible Translation And Abraham was a hundred years old when his son Isaac was born to him. English Revised Version And Abraham was an hundred years old, when his son Isaac was born unto him. Webster's Bible Translation And Abraham was a hundred years old, when his son Isaac was born to him. World English Bible","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":5587596,"ranking":19,"query_text":"when was itsfunneh born","passage_text":"a giraffe can weigh about 110 when born. A baby giraffe weighs about 110 pounds when born.","bm25_label":"high","relevance_label":0.0},{"query_id":1002938,"passage_id":3226978,"ranking":20,"query_text":"when was itsfunneh born","passage_text":"Jacob was 130 years old when he entered Egypt (Gen. 47:9) and therefore had been born in 2005 B.C. Isaac was sixty when Jacob was born (Gen 25:26), and Abraham was 100 when Is â\u0080¦ aac was born (Gen. 21:5). Therefore, Abraham was 160 years old being born in 2165 B.C.","bm25_label":"high","relevance_label":0.0}]