[{"query_id":1003875,"passage_id":2183064,"ranking":1,"query_text":"where was the mediterranean gecko introduced","passage_text":"To some they are pests, to others welcome guests because of their appetite for insects. Photo E. Brown. In Texas there are two species of introduced house geckos, the Mediterranean house gecko, Hemidactylus turcicus, and the common house gecko, Hemidactylus frenatus. House geckos are common in suburban and urban areas.Both house gecko species have bulging, lidless eyes with vertical pupils and sticky toe pads.n Texas there are two species of introduced house geckos, the Mediterranean house gecko, Hemidactylus turcicus, and the common house gecko, Hemidactylus frenatus. House geckos are common in suburban and urban areas.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":7825371,"ranking":2,"query_text":"where was the mediterranean gecko introduced","passage_text":"In Texas, Mediterranean Geckos occur around homes and other buildings in Texas. They are widespread across the Galveston-Houston region. The Mediterranean gecko is an introduced species; it is native to Southern Europe and Northern Africa. Geckos have adapted well to living in and around homes.","bm25_label":"high","relevance_label":1.0},{"query_id":1003875,"passage_id":7825374,"ranking":3,"query_text":"where was the mediterranean gecko introduced","passage_text":"Status and Distribution of the Mediterranean Gecko (Hemidactylus turcicus) in Virginia. The Mediterranean Gecko (Hemidactylus turcicus) is native to the Mediterranean area but included on the North American Introduced Species Checklist (. ) because of its human-mediated dispersal. It was first reported in the United States from Key West, Florida (Fowler, 1915).","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":6036776,"ranking":4,"query_text":"where was the mediterranean gecko introduced","passage_text":"In Texas there are two species of introduced house geckos, the Mediterranean house gecko, Hemidactylus turcicus, and the common house gecko, Hemidactylus frenatus. House geckos are common in suburban and urban areas. Both house gecko species have bulging, lidless eyes with vertical pupils and sticky toe pads.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":6335306,"ranking":5,"query_text":"where was the mediterranean gecko introduced","passage_text":"A-The geckos you have are an introduced species, probably the Mediterranean gecko, which has become an established resident that thrives in many Florida cities as well as some warm weather areas elsewhere.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":6036774,"ranking":6,"query_text":"where was the mediterranean gecko introduced","passage_text":"Mediterranean Gecko (Hemidactylus turcicus) - Introduced. Description: 4 - 5 in (10 - 13 cm). Unlike any native lizard, geckos have sticky toe pads, vertical pupils, and their large eyes lack eyelids. Indo-pacific geckos are generally light gray or almost white in color but may have some darker mottling. This species is most easily distinguished from the similar indo-pacific gecko by its bumpy or warty skin.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":2417754,"ranking":7,"query_text":"where was the mediterranean gecko introduced","passage_text":"Common house gecko. The common house gecko (Hemidactylus frenatus) (not to be confused with the Mediterranean species Hemidactylus turcicus known as Mediterranean house gecko), is a native of Southeast Asia. It is also known as the Pacific house gecko, the Asian house gecko, house lizard, or Moon Lizard.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":1302300,"ranking":8,"query_text":"where was the mediterranean gecko introduced","passage_text":"Common house gecko. The common house gecko (Hemidactylus frenatus) (not to be confused with the Mediterranean species Hemidactylus turcicus known as Mediterranean house gecko), is a native of Southeast Asia. It is also known as the Pacific house gecko, the Asian house gecko, house lizard, or Moon Lizard. Contents.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":7147854,"ranking":9,"query_text":"where was the mediterranean gecko introduced","passage_text":"The Texas banded gecko (Coleonyx brevis) is difficult to distinguish from the western banded gecko; it occurs only in the Chihuahuan Desert of southeastern New Mexico and west Texas. Geckos seen on sidewalks and house walls of urban areas are Mediterranean geckos (Hemidactylus turcicus), an introduced species with warty skin and lacking movable eyelids. There are eight subspecies of the western banded gecko, four in the desert regions of the Southwest: 1  Desert (C.v. variegatus) southeastern California, southwestern Nevada and western Arizona. 2  San Diego (C.v. abbotti) Pacific slopes of southern California into northern Baja.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":1189213,"ranking":10,"query_text":"where was the mediterranean gecko introduced","passage_text":"Geckos (Gekkonidae) are a group of lizards that include about 930 species. Among the more common species of geckos are the tokay gecko, crested gecko, gargoyle gecko, dwarf gecko, leopard gecko, mediterranean gecko, western banded gecko, and the New Caledonian gecko.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":6036780,"ranking":11,"query_text":"where was the mediterranean gecko introduced","passage_text":"Mediterranean house geckos, Hemidactylus turcicus, are an introduced species that can reach lengths of 4-5 inches. They have a rounded snout and bumps on the upper surface of their body (Fig 1.). The tail is cylindrical and slightly flattened and tapers toward the tip and is banded with brown stripes.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":7825376,"ranking":12,"query_text":"where was the mediterranean gecko introduced","passage_text":"FIGURE 3. Shown above is a juvenile Mediterranean Gecko basking in the sun while nestled in a lawn during late-winter in the Galveston-Houston region. FIGURE 4. Mediterranean Geckos hatch from eggs.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":2552626,"ranking":13,"query_text":"where was the mediterranean gecko introduced","passage_text":"This biome actually goes by several names. It is found surrounding large parts of the Mediterranean Sea and is thus sometimes called the Mediterranean Biome, others call it a Woodland Biome, while others call it a Shrub or Chaparral Biome.Chaparral Community near Malibu, California.arge animals simply can't stand the heat of day in many of these locations, and it's hard for a large animal to burrow. Mediterranean Gecko-Hemidactylus turcicus. Left: The Mediterranean Gecko is a nocturnal insectivore of the Mediterranean Biome.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":4472199,"ranking":14,"query_text":"where was the mediterranean gecko introduced","passage_text":"Geckos (Gekkonidae) are a group of lizards that include about 930 species. Among the more common species of geckos are the tokay gecko, crested gecko, gargoyle gecko, dwarf gecko, leopard gecko, mediterranean gecko, western banded gecko, and the New Caledonian gecko.ost geckos are nocturnal hunters that feed on insects, spiders and other small invertebrates. The tokay gecko is a large species whose diet includes heftier prey such as small lizards, birds and mammals.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":2552630,"ranking":15,"query_text":"where was the mediterranean gecko introduced","passage_text":"As already mentioned, this biome is most frequent from 30 to 40 north or south latitude (see map). The largest cluster is in the Mediterranean basin, but significant areas of this habitat exist also in South America, the western coast of southern Africa, California, and in the southwestern tip of Australia.arge animals simply can't stand the heat of day in many of these locations, and it's hard for a large animal to burrow. Mediterranean Gecko-Hemidactylus turcicus. Left: The Mediterranean Gecko is a nocturnal insectivore of the Mediterranean Biome.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":4776895,"ranking":16,"query_text":"where was the mediterranean gecko introduced","passage_text":"Bugs!!! All geckos will hunt and eat living bugs introduced in their enclosure. Some geckos however are frugivorous (fruit eating) and can be offered prepared diets along with\/instead of live foods. See below for Prepared Gecko Diets and the geckos that eat these diets. Crickets.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":8452418,"ranking":17,"query_text":"where was the mediterranean gecko introduced","passage_text":"The Mediterranean gecko is a relatively small, 4 - 5 in (10 - 13 cm), species that has become ubiquitous in certain areas of the United States. Unlike any native lizard, geckos have sticky toe pads, vertical pupils, and their large eyes lack eyelids.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":7825370,"ranking":18,"query_text":"where was the mediterranean gecko introduced","passage_text":"Description. The Mediterranean gecko is a relatively small, 4 - 5 in (10 - 13 cm), species that has become ubiquitous in certain areas of the United States. Unlike any native lizard, geckos have sticky toe pads, vertical pupils, and their large eyes lack eyelids.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":6335308,"ranking":19,"query_text":"where was the mediterranean gecko introduced","passage_text":"Predictions by herpetologists are that geckos will become more and more prevalent in the Coastal Plain of the Southeast. Q-I live in Lake Charles LA and have a little house invader that I think is a Mediterranean gecko based on the photographs on your website. We have them living in the walls of our home.","bm25_label":"high","relevance_label":0.0},{"query_id":1003875,"passage_id":6036779,"ranking":20,"query_text":"where was the mediterranean gecko introduced","passage_text":"Prey: Geckos eat a wide variety of insects, spiders, and other invertebrates. Reproduction: Female Mediterranean geckos lay several clutches of two eggs throughout the summer. Instances of communal nesting have been reported, with several females laying their eggs together under bark, in crevices, or in moist soil.","bm25_label":"high","relevance_label":0.0}]