[{"query_id":1003351,"passage_id":1725651,"ranking":1,"query_text":"when stimulus generalization occurs","passage_text":"In technical terms, stimulus generalization occurs when a previously-unassociated or new stimulus that has similar characteristics to the previously-associated stimulus elicits a response that is the same or as similar to the previously-associated response.timulus generalization is when stimuli elicit similar responses to previously-conditioned stimuli that share certain qualities. Stimulus generalization occurs in both classical and operant conditioning situations.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":332505,"ranking":2,"query_text":"when stimulus generalization occurs","passage_text":"Stimulus generalization is when stimuli elicit similar responses to previously-conditioned stimuli that share certain qualities. Stimulus generalization occurs in both classical and operant conditioning situations.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":4048665,"ranking":3,"query_text":"when stimulus generalization occurs","passage_text":"In technical terms, stimulus generalization occurs when a previously-unassociated or new stimulus that has similar characteristics to the previously-associated stimulus elicits a response that is the same or as similar to the previously-associated response.timulus Generalization and Operant Conditioning. Potty training is a good example of stimulus generalization in operant conditioning. When a child is learning to use the toilet, rewards are often used to increase the desired behaviors.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":3215615,"ranking":4,"query_text":"when stimulus generalization occurs","passage_text":"2.) Avoid danger. : is the association between the conditioned stimulus and the unconditioned stimulus which generally occurs gradually in classical conditioning. : the timing between the conditioned stimulus and the unconditioned stimulus also influences learning.Classical conditioning is most reliable and effective when the conditioned stimulus is presented just before the unconditioned stimulus. : responding similarly to a range of similar stimuli..) Avoid danger. : is the association between the conditioned stimulus and the unconditioned stimulus which generally occurs gradually in classical conditioning. : the timing between the conditioned stimulus and the unconditioned stimulus also influences learning.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":332501,"ranking":5,"query_text":"when stimulus generalization occurs","passage_text":"In technical terms, stimulus generalization occurs when a previously-unassociated or new stimulus that has similar characteristics to the previously-associated stimulus elicits a response that is the same or as similar to the previously-associated response.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":7257766,"ranking":6,"query_text":"when stimulus generalization occurs","passage_text":"Stimulus Generalization. Stimulus generalization is the tendency of a subject to respond to a stimulus or a group of stimuli similar but not identical to the original CS. For example, a subject may initially make the desired response when exposed to any sound (that is, to a generalized stimulus) rather than making such a response only to a specific sound. Such generalization can occur in both classical and operant conditioning (if a CS is used).","bm25_label":"high","relevance_label":1.0},{"query_id":1003351,"passage_id":5227395,"ranking":7,"query_text":"when stimulus generalization occurs","passage_text":"Discussion. 1  Explain why muscle contraction does not occur below threshold stimulus. 2  The maximum stimulation voltage used was 3  _____. Explain why force of contraction changes with muscle fiber length. 4  Compare the maximum force generated when stimulation frequency was increased with the maximum force generated at threshold stimulus. 5  Explain why 6  ... Iniscussion. 1  Explain why muscle contraction does not occur below threshold stimulus. 2  The maximum stimulation voltage used was 3  _____. Explain why force of contraction changes with muscle fiber length. 4  Compare the maximum force generated when stimulation frequency was increased with the maximum force generated at threshold stimulus. 5  Explain why 6  ... In","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":1263436,"ranking":8,"query_text":"when stimulus generalization occurs","passage_text":"Generalization. Generalization occurs when a person learns a response to a particular stimulus and then makes the same response to similar stimuli. For example, if a person was conditioned to fear dogs, generalization might take the form of that person fearing all four-legged animals, such as a horse or a goat.lassical conditioning includes two requirements. First, a natural relationship must exist between a stimulus, such as an object or an event, and a reaction. Second, the stimulus that elicits the reaction is paired with a neutral stimulus, typically for several trials.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":5984566,"ranking":9,"query_text":"when stimulus generalization occurs","passage_text":"1 Feedback regulation mechanisms are important to homeostasis. 2  Feedback regulation occurs when the response to a stimulus has an effect of some kind on the original stimulus. 3  The type of response (increase or decrease in the stimulus) determines what the feedback is called.eedback regulation occurs when the response to a stimulus has an effect of some kind on the original stimulus. The type of response determines what the feedback is called. Negative feedback occurs when the response to a stimulus reduces the original stimulus.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":8715883,"ranking":10,"query_text":"when stimulus generalization occurs","passage_text":"Feedback regulation occurs when the response to a stimulus has an effect of some kind on the original stimulus. The type of response determines what the feedback is called. Negative feedback occurs when the response to a stimulus reduces the original stimulus.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":5504982,"ranking":11,"query_text":"when stimulus generalization occurs","passage_text":"Proper stimulus control, is said to have four characteristics: 1  The behavior occurs immediate when the conditioned stimulus is given. 2  The behavior never occurs in the absence of the stimulus. 3  The behavior never occurs in response to some other stimulus.  No other behavior occurs in response to this stimulus.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":332502,"ranking":12,"query_text":"when stimulus generalization occurs","passage_text":"Response generalization has to be distinguished from stimulus generalization; the latter is a process in which reinforcing a response in the presence of a specific stimulus increases the likelihood the same response will occur in the presence of similar stimulus events.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":5504980,"ranking":13,"query_text":"when stimulus generalization occurs","passage_text":"Proper stimulus control, is said to have four characteristics: 1  The behavior occurs immediate when the conditioned stimulus is given. 2  The behavior never occurs in the absence of the stimulus.  The behavior never occurs in response to some other stimulus.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":8140281,"ranking":14,"query_text":"when stimulus generalization occurs","passage_text":"the initial stage in classical conditioning: the phase associating a neutral stimulus with an unconditioned stimulus so that the neutral stimulus comes to elicit a conditioned response .5 seconds what is the optimal time between a neutral stimulus and an unconditioned stimulus for acquisition to occur? before for acquisition to occur, the conditioned stimulus must come _____ the unconditioned stimulus extinction -the diminishing of a conditioned response that occurs when an unconditioned stimulus does not follow a conditioned stimulus -a gradual decrease -must be NO RESPONSE for this to happen","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":3653263,"ranking":15,"query_text":"when stimulus generalization occurs","passage_text":"The magnitude of the change of the membrane potential in a graded potential is dependent upon the strength of the stimulus. The larger stimulus, the greater change in potential. Graded potentials are not the nerve signals that travel along an axon, but do influence their generation. If depolarization occurs, then voltage-gated ion channels open and develop an action potential. Actions potentials are the nerve impulses that occur when the membrane voltage reaches a certain value, known as the threshold.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":1725648,"ranking":16,"query_text":"when stimulus generalization occurs","passage_text":"Stimulus Generalization is when an organism responds to a new stimulus in the same way as a previously encountered stimulus, based on similarity of the stimuli and the organism s history of reinforcement with the previous stimulus.timulus Generalization is when an organism responds to a new stimulus in the same way as a previously encountered stimulus, based on similarity of the stimuli and the organism s history of reinforcement with the previous stimulus.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":8189485,"ranking":17,"query_text":"when stimulus generalization occurs","passage_text":"Habituation is the decrease of a response to a repeated eliciting stimulus that is not due to sensory adaptation or motor fatigue. Sensory adaptation (or neural adaptation) occurs when an organism can no longer detect the stimulus as efficiently as when first presented and motor fatigue occurs when an organism is able to detect the stimulus but can no longer respond efficiently.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":7311003,"ranking":18,"query_text":"when stimulus generalization occurs","passage_text":"Conditioned and unconditioned responses are behaviors that result from specific stimuli. An unconditioned response is behavior that occurs naturally due to a given stimulus.However, a stimulus prompts a conditioned response only when someone has come to associate that stimulus with another.For example, when a person yelps upon being bitten by an insect, the yelp is an unconditioned response.n unconditioned response is behavior that occurs naturally due to a given stimulus. However, a stimulus prompts a conditioned response only when someone has come to associate that stimulus with another.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":7257770,"ranking":19,"query_text":"when stimulus generalization occurs","passage_text":"Conditioned taste aversion is a type of learning in which the hedonic response to a gustatory stimulus is changed as a result of association with a toxic visceral stimulus (Grill, 1985). It is an unusual kind of conditioning because it can occur when the interval between the gustatory stimulus and the toxic stimulus is hours, it can occur in one trial, and it is resistant to extinction.","bm25_label":"high","relevance_label":0.0},{"query_id":1003351,"passage_id":3307108,"ranking":20,"query_text":"when stimulus generalization occurs","passage_text":"Learning process that occurs when a conditioned response is elicited from stimuli that is similar to the conditioned stimulus Conditioned stimulus- grasshopper to Conditioned response- fear. false. Classical conditioning occurs when a particular behavior is reinforced by its consequences.","bm25_label":"high","relevance_label":0.0}]