[{"query_id":1003114,"passage_id":2056895,"ranking":1,"query_text":"where was paul newman born","passage_text":"Paul Newman, Actor: The Hustler. Screen legend, superstar, and the man with the most famous blue eyes in movie history, Paul Leonard Newman was born on January 26, 1925, in Cleveland, Ohio, the second son of Theresa (Fetsko) and Arthur Sigmund Newman.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":3563223,"ranking":2,"query_text":"where was paul newman born","passage_text":"Paul Newman Actor, Butch Cassidy and the Sundance Kid Screen legend, superstar, and the man with the most famous blue eyes in movie history, Paul Leonard Newman was born on January 26, 1925, in Cleveland, Ohio, the second son of Theresa (Fetsko) and Arthur Sigmund Newman.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":7753910,"ranking":3,"query_text":"where was paul newman born","passage_text":"Paul Newman 1970s Japanese Stickers | Road to Perdition UK Dvd. Screen Calendar 1981 incl. Paul Newman Fully Scanned - Wonderful Photos. He was born Paul Leonard Newman on the 26th of January, 1925, in Shaker Heights, an affluent suburb of Cleveland. His father, Arthur, was Jewish and ran a profitable sports goods store.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":2056897,"ranking":4,"query_text":"where was paul newman born","passage_text":"Paul Newman (I) (1925â\u0080\u00932008) Actor | Producer | Director Screen legend, superstar, and the man with the most famous blue eyes in movie history, Paul Leonard Newman was born on January 26, 1925, in Cleveland, Ohio, the second son of Theresa (Fetsko) and Arthur Sigmund Newman.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":2056893,"ranking":5,"query_text":"where was paul newman born","passage_text":"Paul Newman (I) (1925â\u0080\u00932008) Screen legend, superstar, and the man with the most famous blue eyes in movie history, Paul Leonard Newman was born on January 26, 1925, in Cleveland, Ohio, the second son of Theresa (Fetsko) and Arthur Sigmund Newman. Paul's father was Jewish, the son of emigrants from Poland and Hungary; he owned a successful sporting goods store.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":7753907,"ranking":6,"query_text":"where was paul newman born","passage_text":"The religion and political views of Paul Newman. Paul Newman was born and raised in Shaker Heights, Ohio, just outside of Cleveland. He died in Westport, Connecticut in 2008 of lung cancer. Newmanâ\u0080\u0099s father was of Jewish descent and though his mother practiced the Christian Science religion, she was born and raised a Catholic.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":7753905,"ranking":7,"query_text":"where was paul newman born","passage_text":"Paul Newman. Paul Newman (born January 26, 1925 - September 26, 2008) was an American actor. He was born in Shaker Heights, Ohio. His mother was a Slovak; his father was a Jew who had one parent from Hungary and the other from Poland. He was known especially for the 1969 movie Butch Cassidy and the Sundance Kid.","bm25_label":"high","relevance_label":1.0},{"query_id":1003114,"passage_id":6040689,"ranking":8,"query_text":"where was paul newman born","passage_text":"A Summary of the Contents of Paul Newman's Will and Codicil. Estate Planning. Paul Newman, born in Shaker Heights, Ohio, in 1925, was one of Hollywood's best-known actors, starring in over 60 movies and winning an Oscar for his role as Fast Eddie Felson in the 1986 movie, The Color of Money.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":6040681,"ranking":9,"query_text":"where was paul newman born","passage_text":"Mini Bio (1) Screen legend, superstar, and the man with the most famous blue eyes in movie history, Paul Leonard Newman was born on January 26, 1925, in Cleveland, Ohio, the second son of Theresa (Fetsko) and Arthur Sigmund Newman. Paul's father was Jewish, the son of immigrants from Poland and Hungary; he owned a successful sporting goods store.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":866052,"ranking":10,"query_text":"where was paul newman born","passage_text":"Overview (5) Mini Bio (1) Screen legend, superstar, and the man with the most famous blue eyes in movie history, Paul Leonard Newman was born on January 26, 1925, in Cleveland, Ohio, the second son of Theresa (Fetsko) and Arthur Sigmund Newman.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":28173,"ranking":11,"query_text":"where was paul newman born","passage_text":"Paul Newman's Own Paul Newman Rolex Daytona To Go Up For Auction. 1  Paul Newmanâ\u0080\u0099s own Rolex Cosmograph Daytona Reference 6239 (photo by Henry Leutwyler for WSJ Magazine) 2  Paul Newman and Joanne Woodward at the 1973 Cannes Film Festival. 3  Paul Newmanâ\u0080\u0099s own Paul Newman Rolex Daytona watch will be auctioned in October.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":7753902,"ranking":12,"query_text":"where was paul newman born","passage_text":"He accomplished this with an uncanny ability to break new ground. Paul L. Newman, was born in Cleveland, Ohio, on January 26, 1925. His father Arthur and mother Theresa (an emigrant from what is now Slovakia) raised Paul and his brother in Shaker Heights, Ohio.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":28177,"ranking":13,"query_text":"where was paul newman born","passage_text":"Paul Newman's Own Paul Newman Rolex Daytona To Go Up For Auction. The Paul Newman Rolex Daytona is the most mythical and legendary timepiece in existence. The â\u0080\u009cPaul Newmanâ\u0080\u009d predicate is today used to denote a Rolex Cosmograph Daytona Oyster with the reference numbers 6239, 6241, 6262, 6263, 6264, or 6265.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":7753908,"ranking":14,"query_text":"where was paul newman born","passage_text":"He accomplished this with an uncanny ability to break new ground. Early Days. Paul L. Newman, was born in Cleveland, Ohio, on January 26, 1925. His father Arthur and mother Theresa (an emigrant from what is now Slovakia) raised Paul and his brother in Shaker Heights, Ohio.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":6040684,"ranking":15,"query_text":"where was paul newman born","passage_text":"Son Scott died in 1978 of a drug overdose, and Newman and Woodward were still married at the time of Newman's death from lung cancer on September 26, 2008. The value of the late actor's estate was estimated to be worth over $600 million. Summary of the Contents of Paul Newman's Will and First Codicil. Paul Newman, also known as Paul L. Newman, signed his Last Will and Testament Westport, Connecticut, on April 11, 2008, and then signed a short First Codicil to the will on July 24, 2008.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":8401230,"ranking":16,"query_text":"where was paul newman born","passage_text":"The best thing Cat on a Hot Tin Roof has going for it is one truly remarkable acting performance. And that performance comes from neither Elizabeth Taylor nor Paul Newman. There's nothing wrong with the work turned in by Taylor and Newman, they are both perfectly fine in their roles.akes you wish they gave Oscars for ensemble acting. Cat on a Hot Tin Roof is truly an actor's movie, and it is one of those rare films where every single actor is perfect. Paul Newman and Elizabeth Taylor are both brilliant as Brick and Maggie Pollitt, respectively.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":7753906,"ranking":17,"query_text":"where was paul newman born","passage_text":"Paul Newman: obituary. Paul Newman: obituary. The actor Paul Newman, who has died aged 83, became so famous for his dazzling looks, and the bluest eyes in the business, that it is impossible to think of him as other than a celebrity. Yet his many faceted, contradictory character renders the star image superficial.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":7753909,"ranking":18,"query_text":"where was paul newman born","passage_text":"Paul Newman: obituary. Blue-eyed star's acting career was just one facet of a man who was America's biggest philanthropist in proportion to his own wealth. Paul Newman. Paul Newman: obituary. Blue-eyed star's acting career was just one facet of a man who was America's biggest philanthropist in proportion to his own wealth.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":8401231,"ranking":19,"query_text":"where was paul newman born","passage_text":"Makes you wish they gave Oscars for ensemble acting. Cat on a Hot Tin Roof is truly an actor's movie, and it is one of those rare films where every single actor is perfect. Paul Newman and Elizabeth Taylor are both brilliant as Brick and Maggie Pollitt, respectively.akes you wish they gave Oscars for ensemble acting. Cat on a Hot Tin Roof is truly an actor's movie, and it is one of those rare films where every single actor is perfect. Paul Newman and Elizabeth Taylor are both brilliant as Brick and Maggie Pollitt, respectively.","bm25_label":"high","relevance_label":0.0},{"query_id":1003114,"passage_id":6040686,"ranking":20,"query_text":"where was paul newman born","passage_text":"Paul Newman dies at 83. The screen legend Paul Newman has died at the age of 83 after losing a long battle against cancer. Newman died yesterday at his farmhouse near Westport, Connecticut, said his publicist, Jeff Sanderson. He was surrounded by family and close friends.","bm25_label":"high","relevance_label":0.0}]