[{"query_id":1007473,"passage_id":7251748,"ranking":1,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"User: _______ sediments originate from elements in seawater that precipitate out of solution. A. Hydrogenous B. Biogenous C. Turbidigeous D. Terrigenous. Weegy: Hydrogenous sediments originate from elements in seawater that precipitate out of solution.","bm25_label":"high","relevance_label":1.0},{"query_id":1007473,"passage_id":7251742,"ranking":2,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Q: _____ sediments originate from elements in seawater that precipitate out of solution. A. Hydrogenous B. Biogenous C. Turbidigeous D. Terrigenous","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":1394482,"ranking":3,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"_____ sediments originate from elements in seawater that precipitate out of solution. Hydrogenous A narrow region between two air masses of different densities is a","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":7231460,"ranking":4,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"ROCK GYPSUM. Rock gypsum is a chemical precipitate formed by the evaporation of cencentrated solutions such as seawater. It ranges in texture from massive\/granular to fibrous depending on the size and shape of the gypsum crystals. Sediment type: chemical; Composition: gypsum; Grain Size: varible, commonly fibrous or granular and medium to fine grained","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":2926083,"ranking":5,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"a biogenic sediment that forms from the accumulation of planyt debris is known as _____ name a category of sedimentary rocks formed by the precipitation of minerals dissolved in a lake, river, or seawater?","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":3797232,"ranking":6,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Deposition of Sediments. Sedimentary Rocks are formed when sediments have been deposited and undergone lithification, a process that includes compaction(through burial) and cementation (mineral precipitation from intergranular aqueous solutions), or when masses of intergrown crystals precipitate from aqueous solution.eposition of Sediments. Sedimentary Rocks are formed when sediments have been deposited and undergone lithification, a process that includes compaction(through burial) and cementation (mineral precipitation from intergranular aqueous solutions), or when masses of intergrown crystals precipitate from aqueous solution.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":213626,"ranking":7,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Rocks made from particles of eroded sediment are called clastic sedimentary rocks, rocks made from the remains or living things are called biogenic sedimentary rocks, and those that form by minerals precipitating out of solution are called evaporites.ocks made from particles of eroded sediment are called clastic sedimentary rocks, rocks made from the remains or living things are called biogenic sedimentary rocks, and those that form by minerals precipitating out of solution are called evaporites.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":7251750,"ranking":8,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"hydro=water; minerals that have precipitated directly from seawater; also called authigenic sediments (authis= in place of, on the spot) because they were formed in the place they now occupy.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":3898740,"ranking":9,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"1. Carbonate sediments and sedimentary rocks are formed from the accumulation of carbonate minerals precipitated either organically or inorganically from seawater. The minerals are either calcium carbonate (calcite, aragonite) or calcium-magnesium carbonates (dolomite).","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":6260864,"ranking":10,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Non-Clastic, or chemical, sedimentary rock is formed from dissolved minerals. These rocks are made of chemical sediments that have been dissolved from minerals. Solid minerals â\u0080¦ precipitate out of the solution in water.These minerals layer, and the water above them causes the pressure which forms the rock.hese rocks are made of chemical sediments that have been dissolved from minerals. Solid minerals â\u0080¦ precipitate out of the solution in water. These minerals layer, and the water above them causes the pressure which forms the rock.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":7251746,"ranking":11,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"The distribution of sediment particles from these different origins within ocean sediments at different locations is determined by many factors including grain size, location of origin, susceptibility to decomposition or dissolution in seawater, and the mechanisms of particle transport.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":1583260,"ranking":12,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Deposition of Sediments. Sedimentary Rocks are formed when sediments have been deposited and undergone lithification, a process that includes compaction(through burial) and cementation (mineral precipitation from intergranular aqueous solutions), or when masses of intergrown crystals precipitate from aqueous solution.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":8216138,"ranking":13,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Deposition of Sediments. Sedimentary Rocks are formed when sediments have been deposited and undergone lithification, a. process that includes compaction(through burial) and cementation (mineral precipitation from. intergranular aqueous solutions), or when masses of intergrown crystals precipitate from. aqueous solution.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":3331549,"ranking":14,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"IX. Chemical and organic sedimentary rocks â\u0080\u0094 lumped together as â\u0080\u0098chemically formed sedimentary rocksâ\u0080\u0099 1. Derived from material that was once in solution and precipitates to form sediment a. Directly precipitated: result of physical processes, b. Through life processes (biochemical origin) 2.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":6044038,"ranking":15,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Rocks made from particles of eroded sediment are called clastic sedimentary rocks, rocks made from the remains or living things are called biogenic sedimentary rocks, and those that form by minerals precipitating out of solution are called evaporites.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":2367565,"ranking":16,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"A rock is a solid natural object composed of one, or in most instances, a combination of minerals. Rocks can lithify from sediments, solidify from melt, precipitate out of sat â\u0080¦ urated solutions, or metamorphose from other rock types.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":458479,"ranking":17,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"All major rock salt deposits originated from the evaporation of seawater at some time during the geologic past. Approximately 78 percent of the mineral matter in normal seawater is sodium chloride. Upon evaporation of about nine-tenths of the volume of seawater, rock salt is precipitated. Calcium sulfate (gypsum and anhydrite) and potassium and magnesium salts also are precipitated.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":4898861,"ranking":18,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"After deposition, sediments are compacted as they are buried beneath successive layers of sediment and cemented by minerals that precipitate from solution. Grains of sediment, rock fragments and fossils can be replaced by other minerals during diagenesis.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":5453713,"ranking":19,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Marine sediment, any deposit of insoluble material, primarily rock and soil particles, transported from land areas to the ocean by wind, ice, and rivers, as well as the remains of marine organisms, products of submarine volcanism, chemical precipitates from seawater, and materials from outer space (e.g., meteorites) that accumulate on the seafloor.","bm25_label":"high","relevance_label":0.0},{"query_id":1007473,"passage_id":2607926,"ranking":20,"query_text":"_______ sediments originate from elements in seawater that precipitate out of solution.","passage_text":"Non-clastic sedimentary rocks form from the precipitation (Precipitation is the separating of a solid from a solution) of minerals from ocean water or from the breakdown of the shells and bones of sea creatures. Sea animals such as coral produce calcium carbonate solutions that harden to form rock.edimentary rocks are formed in three ways from these different sized sediments. A sedimentary rock is a layered rock that is formed from the compaction, cementation, and the recrystallization of sediments.","bm25_label":"high","relevance_label":0.0}]