[{"query_id":1007696,"passage_id":7251215,"ranking":1,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"When a second EPSP arrives at a single synapse before the effects of the first have disappeared, what occurs? temporal summation EPSP's (excitatory postsynaptic potentials) occur when extra _____ ions enters a cell. soduim If the chemically gated soduim channels in the postsynaptic membrane were completely blocked, synaptic transmission (would not or would) fail.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7251219,"ranking":2,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"When a second EPSP arrivesat a single synapse before the effects of the first one have disappeared, what occurs? Temporal Summation Which of the following are a type of glial cell found in the peripheral nervous system?","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7251223,"ranking":3,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"When a second EPSP arrivesat a single synapse before the effects of the first one have disappeared, what occurs? Temporal Summation: Which of the following are a type of glial cell found in the peripheral nervous system? Satellite and Schwann cells","bm25_label":"high","relevance_label":1.0},{"query_id":1007696,"passage_id":7146990,"ranking":4,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"Presynaptic facilitation results when an axoaxonic synapse causes an action potential arriving at the postsynaptic axon terminal to release more neurotransmitter and thereby cause a larger EPSP. Note that this type of synapse only influences the effect of another neuron at its synapse with a postsynaptic neuron.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7143819,"ranking":5,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"-EPSPs and IPSPs can occur at the same time in a neuron-2 EPSPs occurring at slightly different times at the same synapse can sum to generate an action potential-2 EPSPs occurring at different synapses on the same neuron can sum to generate action potential","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":1995972,"ranking":6,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"These are the opposite of inhibitory postsynaptic potentials (IPSPs), which usually result from the flow of negative ions into the cell or positive ions out of the cell. EPSPs can also result from a decrease in outgoing positive charges, while IPSPs are sometimes caused by an increase in positive charge outflow. The flow of ions that causes an EPSP is an excitatory postsynaptic current (EPSC). EPSPs, like IPSPs, are graded (i.e. they have an additive effect). When multiple EPSPs occur on a single patch of postsynaptic membrane, their combined effect is the sum of the individual EPSPs. Larger EPSPs result in greater membrane depolarization and thus increase the likelihood that the postsynaptic cell reaches the threshold for firing an action potential","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":2294739,"ranking":7,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"Temporal summation is the linear addition of graded potentials that overlap in time; that is, a second potential arrives before the first one from that source has finished. Spatial summation occurs when there is simultaneous arrival of graded potentials originating from more than one synaptic input. Summation occurs at the trigger zone. Typically a multipolar neuron has many active synapses at a given time, with multiple potentials being produced at each.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7143822,"ranking":8,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"Discuss summation of postsynaptic potentials: -IPSPs tend to inhibit or prevent EPSPs from being able to cause neurons to fire action potentials. -EPSPs and IPSPs can occur at the same time in a neuron. -2 EPSPs occurring at slightly different times at the same synapse can sum to generate an action potential.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":727608,"ranking":9,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"The balance between EPSPs and IPSPs is very important in the integration of electrical information produced by inhibitory and excitatory synapses. Graph displaying an EPSP, an IPSP, and the summation of an EPSP and an IPSP. When the two are summed together the potential is still below the action potential threshold.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":6104220,"ranking":10,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"It is the total summation of the EPSPs and IPSPs that determines whether a neuronâ\u0080\u0099s charge is sufficient to cross the potential threshold. Transcript: GABA occurs in 30-40% of all synapses-only glutamate is more widely distributed. Neurons in every region of the brain use GABA to fine-tune neurotransmission.Increasing GABA at the neuronal synapse inhibits the generation of the action potential of the neuron, thereby making it less likely to excite nearby neurons.A single neuron may have thousands of other neurons synapsing onto it.ecreasing the action potential: GABA is the primary inhibitory neurotransmitter, which means it decreases the neuronâ\u0080\u0099s action potential. When the action potential drops below the threshold potential, the neuron will not excite nearby neurons.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7251218,"ranking":11,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"The buildup of depolarization when EPSP's arrive in rapid succession is called _____ summation. temporal The buildup of depolarization when EPSP's arrive at several places on the neuron is called _____ summation.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":6914417,"ranking":12,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"how does it make the nervous system more efficient? What is myelination and when does it primarily occur?-at birth, infants will have relatively few synapses-within the first 2 years, there is an abundance of new synapses, with the complexity of synapses increasing with age.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7251217,"ranking":13,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"The same_____can have different effects depending on the properties of the_____. neurotransmitter, receptor If a second stimulus arrives before relaxation phase has ended, a second more powerful contraction occurs.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":933580,"ranking":14,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"The results in the table below show that when there was no delay between the first and second message, but then a week's delay before the judgment, a primacy effect occurred. When there was a delay between the first and second message, but no gap between the second message and the judgment, then a recency effect occurred. First message Delay after first message?","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7251214,"ranking":15,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"Multiple times-Rapid, repeated stimuli at one synapse: Spatial Summation: Multiple locations-many stimuli, arrive at multiple synapses: Calcium is important in the synapse because it ____? it allows myosin to bind to actin. Tetrodotoxin is a toxin that blocks voltage-gated sodium channels. What effect does this substance have on the function of neurons?","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":8263884,"ranking":16,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"EPSPs and IPSPs compete with each other at numerous synapses of a neuron; this determines whether or not the action potential at the presynaptic terminal will regenerate at the postsynaptic membrane.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":7251221,"ranking":17,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"The same_____can have different effects depending on the properties of the_____. neurotransmitter, receptor: If a second stimulus arrives before relaxation phase has ended, a second more powerful contraction occurs. This is called_____. wave summation: Treppe: repeated stimulations immediately after relaxation phase: Incomplete Tetanus","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":6011527,"ranking":18,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"In temporal summation, a single presynaptic neuron stimulates the creation of action potentials in a postsynaptic neuron when it. Fires at a fast enough rate that the sum of EPSPs in the postsynaptic neuron moves above threshold. î\u0081\u0081 î\u0081\u0082 î\u0080\u0092.uppose that the net summation of EPSPs and IPSPs is a depolarization that brings the membrane potential of the trigger zone of the postsynaptic neuron to -60 mV. Since -60 mV is below threshold, an action potential will not occur in the postsynaptic neuron.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":8263881,"ranking":19,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"At excitatory synapses, the ion channel typically allows sodium into the cell, generating an excitatory postsynaptic current. This depolarizing current causes an increase in membrane potential, the EPSP.","bm25_label":"high","relevance_label":0.0},{"query_id":1007696,"passage_id":4114090,"ranking":20,"query_text":"when a second epsp arrives at a single synapse before the effects of the first have disappeared, what occurs?","passage_text":"PMS (Pre-menstrual Syndrome) PMS (Pre-menstrual Syndrome) is a term used to describe any symptoms which occur any time after ovulation and disappear almost as soon as the period arrives. So the crucial point is not what symptoms you experience but when.","bm25_label":"high","relevance_label":0.0}]