[{"query_id":1008911,"passage_id":7249792,"ranking":1,"query_text":"what's the meaning of the name blackburn","passage_text":"Blackburn - Name Meaning, What does Blackburn mean? Thinking of names? Complete 2017 information on the meaning of Blackburn, its origin, history, pronunciation, popularity, variants and more as a baby boy ... Blackburn Name Meaning & Blackburn Family History at Ancestry.com. Blackburn census records.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":7249797,"ranking":2,"query_text":"what's the meaning of the name blackburn","passage_text":"Blackburn [black-burn] as a boys' name is of Old English origin, and the meaning of Blackburn is black brook. Place name. Used as a given name mostly in the 19th century. In Scotland, burn is the term for a little brook.","bm25_label":"high","relevance_label":1.0},{"query_id":1008911,"passage_id":4916238,"ranking":3,"query_text":"what's the meaning of the name blackburn","passage_text":"Pastor Davey Blackburn 'Confused' About Pregnant Wife's Murder. Pastor Davey Blackburn of Resonate Church in Indianapolis, Indiana. It's really hard to sort through all of the emotions of what we're feeling about all this, Blackburn told ABC News.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":1616010,"ranking":4,"query_text":"what's the meaning of the name blackburn","passage_text":"The spinning jenny is attributed to James Hargreaves. He was born in Oswaldtwistle, near Blackburn, around 1720. Blackburn was a town with a population of about 5,000, known for the production of Blackburn greys, cloths of linen warp and cotton weft.he most common story told about the invention of the device and the origin of the Jenny in the machine's name is that a daughter (or his wife) named Jenny knocked over one of their own spinning wheels.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":2811995,"ranking":5,"query_text":"what's the meaning of the name blackburn","passage_text":"Releases - October 30, 2015. DOC # Last Name First Name Middle Name Type of Release Released From. 175538 Dunning Jeffery L Discharged - Administrative Minimum Expiration Blackburn Corr. Complex. 205892 Mills Bradley Discharged - Administrative Minimum Expiration Blackburn Corr.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":2865713,"ranking":6,"query_text":"what's the meaning of the name blackburn","passage_text":"But I wanted to get to the heart of Steve and find out what's behind the character, says show boss Stuart Blackburn. By David Brown. Steve McDonald is to be hit by depression in what show boss Stuart Blackburn has described as a huge storyline for the Coronation Street stalwart.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":6744422,"ranking":7,"query_text":"what's the meaning of the name blackburn","passage_text":"Origin of Ip, Meaning of Ip. Origin: This is the name used by wardrobers of the king in Scotland. The original name was Wardrobe. It was changed to all the spellings seen today in America.rigin of Ip, Meaning of Ip. Origin: The surname origin Tippins or Tipping anciently spelled Typpyng comes from a small village called Clayton-Le-Dale located approximately 5 miles from the city of Blackburn in Lancaster County, England. Tippng hall was the family seat at the time of King Edward III, 1328-1377.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":4174971,"ranking":8,"query_text":"what's the meaning of the name blackburn","passage_text":"Blackburn is bounded to the south by Darwen, with which it forms the unitary authority of Blackburn with Darwen; Blackburn is its administrative centre. At the time of the UK Government's 2001 census, Blackburn had a population of 105,085, whilst the wider borough of Blackburn with Darwen had a population of 140,700. Blackburn had a population of 106,537 in 2011, a slight increase since 2001.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":7249799,"ranking":9,"query_text":"what's the meaning of the name blackburn","passage_text":"Blackburn and Darwen together make up Blackburn with Darwen unitary authority. The village of Wilpshire, is 2.5 miles (4.0 km) north of Blackburn, and forms part of the Blackburn urban area, although it is in the Ribble Valley local government district.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":2865715,"ranking":10,"query_text":"what's the meaning of the name blackburn","passage_text":"Steve McDonald is to be hit by depression in what show boss Stuart Blackburn has described as a huge storyline for the Coronation Street stalwart.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":4453426,"ranking":11,"query_text":"what's the meaning of the name blackburn","passage_text":"blackburn rovers shop. Follow blackburn rovers shop to get email alerts and updates on your eBay feed. Unfollow blackburn rovers shop to stop getting updates on your eBay feed. Great.You're now following blackburn rovers shop in your eBay feed.lackburn rovers shop. Follow blackburn rovers shop to get email alerts and updates on your eBay feed. Unfollow blackburn rovers shop to stop getting updates on your eBay feed. Great.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":6744421,"ranking":12,"query_text":"what's the meaning of the name blackburn","passage_text":"Origin: The Blankenship name is ultimately derived from the name Blenkinsopp, which is the name of a castle in Northumberland, England. Most alternative spellings of Blankenship also derive from this root name.rigin of Ip, Meaning of Ip. Origin: The surname origin Tippins or Tipping anciently spelled Typpyng comes from a small village called Clayton-Le-Dale located approximately 5 miles from the city of Blackburn in Lancaster County, England. Tippng hall was the family seat at the time of King Edward III, 1328-1377.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":7249798,"ranking":13,"query_text":"what's the meaning of the name blackburn","passage_text":"Blackburn has an Olympic-sized ice rink housed at the 3,200-seat Blackburn Arena. The arena is the home of the Blackburn Hawks and Lancashire Raptors ice hockey teams, both of which play in the English National Ice Hockey League. Cultural references. Blackburn is mentioned in The Beatles song A Day in the Life.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":4453425,"ranking":14,"query_text":"what's the meaning of the name blackburn","passage_text":"Follow blackburn rovers shop to get email alerts and updates on your eBay feed. Unfollow blackburn rovers shop to stop getting updates on your eBay feed.Great. You're now following blackburn rovers shop in your eBay feed.lackburn rovers shop. Follow blackburn rovers shop to get email alerts and updates on your eBay feed. Unfollow blackburn rovers shop to stop getting updates on your eBay feed. Great.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":4453421,"ranking":15,"query_text":"what's the meaning of the name blackburn","passage_text":"Blackburn Rovers Football Shirts. If you call Ewood Park home during the football season then we have a Blackburn Rovers Football Shirt and Blackburn Rovers kit for you. Help Rovers move their way up the league and show your true colours by wearing one of our Blackburn Rovers football shirts this season.elp Rovers move their way up the league and show your true colours by wearing one of our Blackburn Rovers football shirts this season.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":4453422,"ranking":16,"query_text":"what's the meaning of the name blackburn","passage_text":"If you call Ewood Park home during the football season then we have a Blackburn Rovers Football Shirt and Blackburn Rovers kit for you.Help Rovers move their way up the league and show your true colours by wearing one of our Blackburn Rovers football shirts this season.elp Rovers move their way up the league and show your true colours by wearing one of our Blackburn Rovers football shirts this season.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":4453424,"ranking":17,"query_text":"what's the meaning of the name blackburn","passage_text":"Content Filter: Safe. Change. You are browsing zazzle's Blackburn t-shirts section where you can find many styles, sizes, and colors of Blackburn shirts available for customization or ready to buy as is.Most tee shirt orders ship in 24 hours.ontent Filter: Safe. Change. You are browsing zazzle's Blackburn t-shirts section where you can find many styles, sizes, and colors of Blackburn shirts available for customization or ready to buy as is.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":4453428,"ranking":18,"query_text":"what's the meaning of the name blackburn","passage_text":"Celebrate the start of the football league by choosing one of our football league kits & shirts, whatever team you support from Blackburn Rovers to Sheffield Wednesday we have the right kit for you. Blackburn Rovers Football Shirts.elebrate the start of the football league by choosing one of our football league kits & shirts, whatever team you support from Blackburn Rovers to Sheffield Wednesday we have the right kit for you. Blackburn Rovers Football Shirts.","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":8227732,"ranking":19,"query_text":"what's the meaning of the name blackburn","passage_text":"Starr Chewning-Blackburn added 2 new photos â\u0080\u0094 eating dinner at Long John Silvers Seafood with Christina Blackburn-Stevens and 2 others. Â·","bm25_label":"high","relevance_label":0.0},{"query_id":1008911,"passage_id":3363512,"ranking":20,"query_text":"what's the meaning of the name blackburn","passage_text":"Despite the buzz over Provost Peter Salovey's appointment as Yale's next president, most students are still unsure what role the provost plays in the University administration. Reporters Clinton Wang and Dean Blackburn surveyed students to find out what they think the Provost does.","bm25_label":"high","relevance_label":0.0}]