[{"query_id":1009749,"passage_id":7248212,"ranking":1,"query_text":"what's a longshoreman?","passage_text":"A longshoreman wouldn't have called a fishwife what I called you, you blessed child. In a Little Town Rupert Hughes He stretched out a hand which would have done credit to a longshoreman.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":4869198,"ranking":2,"query_text":"what's a longshoreman?","passage_text":"Full Definition of LONGSHOREMAN. : a person who loads and unloads ships at a seaport. See longshoreman defined for English-language learners. See longshoreman defined for kids.ADVERTISEMENT.ull Definition of LONGSHOREMAN. : a person who loads and unloads ships at a seaport. See longshoreman defined for English-language learners. See longshoreman defined for kids.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":7248218,"ranking":3,"query_text":"what's a longshoreman?","passage_text":"Pay by Experience Level for Longshoreman Pay by Experience for a Longshoreman has a positive trend. An entry-level Longshoreman with less than 5 years of experience can expect to earn an average total compensation of $53,000 based on 67 salaries provided by anonymous users. Average total compensation includes tips, bonus, and overtime pay.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":7248216,"ranking":4,"query_text":"what's a longshoreman?","passage_text":"A Longshoreman with late-career experience which includes employees with greater than 20 years of experience can expect to earn an average total compensation of $83,000 based on 18 salaries. Key Stats for Longshoreman","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":1719707,"ranking":5,"query_text":"what's a longshoreman?","passage_text":"The 55-year-old has been a longshoreman for almost 35 years and, though he isn't concerned about pay levels, is frustrated about training issues. He worked a variety of jobs on the docks in Manhattan: checker, billing clerk, longshoreman, winch driver, truck loader and timekeeper.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":4869201,"ranking":6,"query_text":"what's a longshoreman?","passage_text":"A longshoreman, also sometimes called a harbor worker or a dock laborer, is primarily responsible for loading and unloading cargo on a docked ship.Longshoremen typically work in teams to systematically move and sort shipping containers, oil barrels, and other cargo. longshoreman, also sometimes called a harbor worker or a dock laborer, is primarily responsible for loading and unloading cargo on a docked ship.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":486390,"ranking":7,"query_text":"what's a longshoreman?","passage_text":"Noun. 1. lumper-a laborer who loads and unloads vessels in a port. dock worker, docker, dockhand, dock-walloper, dockworker, loader, longshoreman, stevedore.laborer, labourer, manual laborer, jack-someone who works with their hands; someone engaged in manual labor.umper-a laborer who loads and unloads vessels in a port. dock worker, docker, dockhand, dock-walloper, dockworker, loader, longshoreman, stevedore.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":8272937,"ranking":8,"query_text":"what's a longshoreman?","passage_text":"Connors was born Kevin Joseph Connors in Brooklyn, New York, the son of Marcella (Londrigan) and Alban Francis Allan Connors, a longshoreman, immigrants from the Dominion of Newfoundland (now part of Canada).onnors was born Kevin Joseph Connors in Brooklyn, New York, the son of Marcella (Londrigan) and Alban Francis Allan Connors, a longshoreman, immigrants from the Dominion of Newfoundland (now part of Canada).","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":4869202,"ranking":9,"query_text":"what's a longshoreman?","passage_text":"Adorable animal families that will make you aww. A longshoreman, also sometimes called a harbor worker or a dock laborer, is primarily responsible for loading and unloading cargo on a docked ship. Longshoremen typically work in teams to systematically move and sort shipping containers, oil barrels, and other cargo. longshoreman, also sometimes called a harbor worker or a dock laborer, is primarily responsible for loading and unloading cargo on a docked ship.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":5254416,"ranking":10,"query_text":"what's a longshoreman?","passage_text":"On the East Coast, wages for a longshoreman start at $20 per hour, or $41,600 per year, and rise over six years to $35 per hour, or $72,800.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":1719709,"ranking":11,"query_text":"what's a longshoreman?","passage_text":"A stevedore, dockworker, docker, dock laborer, wharfie, wharf rat, lumper, whombler, and\/or longshoreman is a waterfront manual laborer who is involved in loading and unloading ships. 1 Etymology.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":4869197,"ranking":12,"query_text":"what's a longshoreman?","passage_text":"Definition of LONGSHORING. : the act or occupation of working as a longshoreman.ADVERTISEMENT.inpouring, outpouring, rip-roaring, wood-boring.efinition of LONGSHORING. : the act or occupation of working as a longshoreman. ADVERTISEMENT. inpouring, outpouring, rip-roaring, wood-boring.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":8220710,"ranking":13,"query_text":"what's a longshoreman?","passage_text":"The Jones Act vs. the Longshoreman and Harbor Workersâ\u0080\u0099 Compensation Act for Maritime Workers 29.08.2017 Special Federal Laws Apply When Maritime Workers Are Hurt or Killed on the Job in Indiana or Illinois","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":2431641,"ranking":14,"query_text":"what's a longshoreman?","passage_text":"Jackson was born in 1911 in the heart of musical ferment, New Orleans. By the age of four, she was singing in the childrenâ\u0080\u0099s choir of the church of her father, Johnny Jackson, who was a longshoreman, barber, and Baptist preacher.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":4126685,"ranking":15,"query_text":"what's a longshoreman?","passage_text":"In the United Kingdom, men who load and unload ships are usually called dockers, in Australia dockers or wharfies, while in the United States and Canada the term longshoreman, derived from man-along-the-shore, is used.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":5150608,"ranking":16,"query_text":"what's a longshoreman?","passage_text":"The true story of Danny Greene, an impoverished but charismatic young Irish-American who rises to power as president of the longshoreman's local union and is charged with corruption but evades serious jail time by becoming an FBI informant.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":4126688,"ranking":17,"query_text":"what's a longshoreman?","passage_text":"In Canada, the term stevedore has also been used, for example, in the name of the Western Stevedoring Company, Ltd., based in Vancouver, B.C., in the 1950s. Synonyms for stevedore include: docker, dock laborer, wharfie, 'wharf rat, lumper, and\/or longshoreman.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":7248219,"ranking":18,"query_text":"what's a longshoreman?","passage_text":"A longshoreman, also sometimes called a harbor worker or a dock laborer, is primarily responsible for loading and unloading cargo on a docked ship. Longshoremen typically work in teams to systematically move and sort shipping containers, oil barrels, and other cargo.","bm25_label":"high","relevance_label":1.0},{"query_id":1009749,"passage_id":1719710,"ranking":19,"query_text":"what's a longshoreman?","passage_text":"longshoreman - a laborer who loads and unloads vessels in a port. dock worker, docker, dockhand, dock-walloper, dockworker, loader, lumper, stevedore. laborer, labourer, manual laborer, jack - someone who works with their hands; someone engaged in manual labor.","bm25_label":"high","relevance_label":0.0},{"query_id":1009749,"passage_id":4245615,"ranking":20,"query_text":"what's a longshoreman?","passage_text":"CHILI WITH A LILâ\u0080\u0099 DABâ\u0080\u0099LL ALWAYS DO IN CONNECTICUT. Itâ\u0080\u0099s tough to top the taste of the longshoreman special. That would be chili, which is served with dabs and horseradish cream and can warm things up even in the thick of a January norâ\u0080\u0099easter.","bm25_label":"high","relevance_label":0.0}]