[{"query_id":1010277,"passage_id":1828125,"ranking":1,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Athena Parthenos was the name given to a gigantic chryselephantine statue of the Greek goddess Athena discovered inside the Parthenon in Athens. Made of silver, ivory and gold, it was sculpted by the renowned ancient Greek sculptor Phidias and is considered today as the most famous cult image of Athens.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":5424807,"ranking":2,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Phidias created a gold and ivory statue of Athena which stood either in the Parthenon, known as the Temple of Athena Parthenos ('Athena the Virginâ\u0080\u0099 in Greek), or in the centre of the Acropolis near the smaller temple of Athena.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":2614085,"ranking":3,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"The Glorious Parthenon. We can only imagine how glorious the Parthenon must have appeared in the middle of the fifth century B.C., with worshippers gathered in its towering central sanctuary paying tribute to a 40-foot, gold-and-ivory statue of the goddess Athena.","bm25_label":"high","relevance_label":1.0},{"query_id":1010277,"passage_id":3050291,"ranking":4,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"The Glorious Parthenon. Posted 01.29.08; NOVA; We can only imagine how glorious the Parthenon must have appeared in the middle of the fifth century B.C., with worshippers gathered in its towering central sanctuary paying tribute to a 40-foot, gold-and-ivory statue of the goddess Athena.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":8012680,"ranking":5,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"We can only imagine how glorious the Parthenon must have appeared in the middle of the fifth century B.C., with worshippers gathered in its towering central sanctuary paying tribute to a 40-foot, gold-and-ivory statue of the goddess Athena.he Parthenon was an expression and embodiment of Athenian wealth, and it was a symbol of Athenian political and cultural preeminence in Greece in the middle of the fifth century.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":773929,"ranking":6,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"The Parthenon is the best known building on the Acropolis and was the temple of Athena, the virgin goddess of wisdom and the arts and the patron goddess of Athens. Inside this 100 by 230 ft. architectural marvel was a 40 ft. gold and ivory statue of Athena Parthenos (the virgin).","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":7793563,"ranking":7,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"And the great statue of Athena Parthenos inside the Parthenon, made of gold and ivory, held in the palm of her hand another image of Nike, some six feet tall, offering it to the Athenians as if to confirm their military predominance over the rest of Greece.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":3622874,"ranking":8,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"The most famous representation of Athena in the ancient world was undoubtedly the monumental gold and ivory statue of the goddess by Pheidias which resided in the Parthenon of Athens and was over 12 m high.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":7935973,"ranking":9,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"The Parthenon: The people of Athens built a great temple for Athena on the acropolis, or high point, of the city. The temple is known as the Parthenon. In it was a colossal gold and ivory statue of the goddess. During the annual Panathenaia festival, a procession was made to the statue and she was clothed in a new outfit.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":7593393,"ranking":10,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"We can only imagine how glorious the Parthenon must have appeared in the middle of the fifth century B.C., with worshippers gathered in its towering central sanctuary paying tribute to a 40-foot, gold-and-ivory statue of the goddess Athena.he Parthenon was built completely of marble from the base of the temple to its roof tiles. It had two large-scale pediments, each filled with over 20, larger-than-life-sized marble figures in compositions that extolled Athena and her power.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":8231658,"ranking":11,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Phidias, the most influential sculptor of the period, made two huge cult images plated with gold and ivory, the statue of Athena for the Parthenon and a seated statue of Zeus for the temple at Olympia that was one of the seven wonders of theâ\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":7091035,"ranking":12,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Athena offering Nice is a theme that derives from the 12 meter chryselephantine (gold and ivory) statue of Athena that decorated the main Parthenon hall, in the interior of the temple . The statue was created by the famous sculptor Phidias who carved all her majestic clothing in gold.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":8012685,"ranking":13,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Parthenon was important because it was the first democratic  building (importance in the modern day.) It was made of Ionic and  Doric order architecture with the statue of G â\u0080¦ oddess Athena made of  Gold & Ivory. A Comprehensive Historical Overview of the Parthenon The Parthenon is one of the many scenic landmarks you find in Greece. 2  It has a fascinating, ancient and intense history.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":8032756,"ranking":14,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Athena Parthenos (Ancient Greek: á¼\u0088Î¸Î·Î½á¾¶ Î Î±Ï\u0081Î¸Î­Î½Î¿Ï\u0082; literally, Athena the Virgin) is a lost massive chryselephantine (gold and ivory) sculpture of the Greek goddess Athena, made by Phidias and his assistants and housed in the Parthenon in Athens.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":1275236,"ranking":15,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Phidias was a Greek sculpture.he built the statue of Athena out of ivory and gold","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":7793564,"ranking":16,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"But the most glorious image of Athena, the one that expressed the power and wealth of Athens itself, was the Athena Parthenos, a colossal gold-and-ivory statue that Pheidias, supposedly the general overseer of the entire Periclean building program, created for the main room of the Parthenon.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":6663454,"ranking":17,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"The Greeks invented athletic contests and held them in honour of their gods. The Isthmos game were staged every two years at the Isthmos of Corinth. The Pythian games took place every four years near Delphi. The most famous games held at Olympia, South-West of Greece, which took place every four years. The ancient Olympics seem to have begun in the early 700 BC, in honour of Zeus. No women were allowed to watch the games and only Greek nationals could participate. One of the ancient wonders was a statue of Zeus at Olympia, made of gold and ivory by a Greek sculptor Pheidias. This was placed inside a Temple, although it was a towering 42 feet high.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":7793559,"ranking":18,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Athena Parthenos (Ancient Greek: á¼\u0080Î¸Î·Î½á¾¶ Ï\u0080Î±Ï\u0081Î¸Î­Î½Î¿Ï\u0082; literally, Athena the Virgin) is a lost massive chryselephantine (gold and ivory) sculpture of the Greek goddess Athena, made by Phidias and his assistants and housed in the Parthenon in Athens. Its epithet was an essential character of the goddess herself.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":3622877,"ranking":19,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"The name of the building most likely came from a cult statue of Athena Parthenos housed in the eastern room of the building. This magnificent structure was built of ivory and gold and was sculptured by the renowned sculptor Phidias. As with most buildings on the Acropolis it was dedicated to Athena to thank the Goddess for their success. The Parthenon was finally finished in 432 BC and was to show the world the dominance and power of Athens. The vast majority of the money used in the construction came from the Delian League funds. The Delian League was a treaty between the Greek states in league against the Persian Empire.","bm25_label":"high","relevance_label":0.0},{"query_id":1010277,"passage_id":1275243,"ranking":20,"query_text":"which greek deity was honored with a towering gold-and-ivory statue inside the parthenon?","passage_text":"Plutarch discusses Phidias' friendship with the Greek statesman Pericles, recording that enemies of Pericles tried to attack him through Phidias - who was accused of stealing gold intended for the Parthenon's statue of Athena, and of impiously portraying himself and Pericles on the shield of the statue.","bm25_label":"high","relevance_label":0.0}]