[{"query_id":1010287,"passage_id":7247530,"ranking":1,"query_text":"what year was mr. philbrick born","passage_text":"Frank Romeyn Philbrick Sr. Frank Romeyn Philbrick, 84, a retired dairy farmer of 40 years, died Tuesday, March 30, 1999, at St. Joseph Medical Center in Nashua. He had lived in Wilton and Mont Vernon. Mr. Philbrick was born Aug. 10, 1914, in Weare, the son of the late Romeyn and Alice (Goodale) Philbrick. He was educated in the Weare school system and began his farming career there. Mr. Philbrick later owned and operated dairy in farms in Bedford, Amherst and Mont Vernon. He also owned and operated the Mont Vernon Mobile Home Park.","bm25_label":"high","relevance_label":1.0},{"query_id":1010287,"passage_id":7247532,"ranking":2,"query_text":"what year was mr. philbrick born","passage_text":"Russell G. Philbrick, Sr. of Manchester, CT went home to the Lord on the evening of September 30, 2017 at age 97. Mr. Philbrick was born in 1920 in Plaistow, NH and shortly moved to a farm near Epsom, NH where his childhood years were spent. The family later moved to Kingston, NH. Mr. Philbrick served in the US Navy during WWII, first as a gunnery instructor at Dam Neck, VA and from 1944 on as a Gunners Mate 1st Class on the newly commissioned Battleship USS Wisconsin BB-64.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7247537,"ranking":3,"query_text":"what year was mr. philbrick born","passage_text":"He was born in Keene, March 2, 1962, the son of Perley and Sandra (Thayer) Philbrick, and had resided here all of his life. Mr. Philbrick graduated from Keene High School, class of 1980, and had been employed as a machinist with the G. S. Precision Company in Brattleboro.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7247536,"ranking":4,"query_text":"what year was mr. philbrick born","passage_text":"Mr. Philbrick enjoyed hunting and fishing and he played softball in his earlier years. Survivors include his parents of Keene; a daughter, Holly Philbrick of Vernon, Conn.; and a sister, Jill-Ann Ouellette of Montana.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7754260,"ranking":5,"query_text":"what year was mr. philbrick born","passage_text":"Nathaniel Philbrick (born June 11, 1956) is an American author and a member of the Philbrick literary family. He won the year 2000 National Book Award for his maritime history, In the Heart of the Sea: The Tragedy of the Whaleship Essex.hilbrick is married to Melissa Douthart Philbrick, who is Executive Director of Remain Nantucket. They have two children Jennie and Ethan. He moved to Nantucket, Massachusetts in 1986, and is a leading authority on the history of the island.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7754262,"ranking":6,"query_text":"what year was mr. philbrick born","passage_text":"Personal life [edit]. Nathaniel Philbrick was born on June 11, 1956, in Boston, Massachusetts, the son of Marianne (Dennis) and Thomas Philbrick, a professor of English. He currently lives in Nantucket, Massachusetts. Philbrick is married to Melissa Douthart Philbrick, who is Executive Director of Remain Nantucket.They have two children Jennie and Ethan. He moved to Nantucket, Massachusetts in 1986, and is a leading authority on the history of the island.hilbrick is married to Melissa Douthart Philbrick, who is Executive Director of Remain Nantucket. They have two children Jennie and Ethan. He moved to Nantucket, Massachusetts in 1986, and is a leading authority on the history of the island.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7754263,"ranking":7,"query_text":"what year was mr. philbrick born","passage_text":"Nathaniel Philbrick was born on June 11, 1956, in Boston, Massachusetts, the son of Marianne (Dennis) and Thomas Philbrick, a professor of English. He currently lives in Nantucket, Massachusetts.Philbrick is married to Melissa Douthart Philbrick, who is Executive Director of Remain Nantucket.They have two children Jennie and Ethan. He moved to Nantucket, Massachusetts in 1986, and is a leading authority on the history of the island.hilbrick is married to Melissa Douthart Philbrick, who is Executive Director of Remain Nantucket. They have two children Jennie and Ethan. He moved to Nantucket, Massachusetts in 1986, and is a leading authority on the history of the island.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7247535,"ranking":8,"query_text":"what year was mr. philbrick born","passage_text":"Services for Mr. Philbrick will be private. Calling hours will be held Tuesday from 6 to 8 p.m. at the Fletcher Funeral Home & Cremation Services, 33 Marlboro St., Keene. Friends are invited.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":8451034,"ranking":9,"query_text":"what year was mr. philbrick born","passage_text":"Vernon) in 1788, and is among the first settlers in Vienna. On the original Vienna plan surveyed by Jedediah Prescott in 1802, the name Allen appears on Lot #84 west of Mill Stream in the area of Vienna Village, and at the head of Flying Pond. Mr. Philbrick's name appears on the same lot, east of Mill Stream.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7754267,"ranking":10,"query_text":"what year was mr. philbrick born","passage_text":"Quotes by Nathaniel Philbrick. â\u0080\u009cHope was all that stood between them and death.â\u0080\u009d. â\u0080\u0095 Nathaniel Philbrick, In the Heart of the Sea: The Tragedy of the Whaleship Essex.Like. â\u0080\u009cMelville's example demonstrates the wisdom of waiting to read the classics.uotes by Nathaniel Philbrick. â\u0080\u009cHope was all that stood between them and death.â\u0080\u009d. â\u0080\u0095 Nathaniel Philbrick, In the Heart of the Sea: The Tragedy of the Whaleship Essex.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":5970778,"ranking":11,"query_text":"what year was mr. philbrick born","passage_text":"Biography. Reina King was born in the year of 1975 to Mr. Thomas and Mrs. Gloria King. She is also the younger sister of actress Regina King. Reina began her acting career with the role as Caroline (Rodger's and Nadine's adopted child) on the hit show What's Happening Now!â\u0080¦ more.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7247529,"ranking":12,"query_text":"what year was mr. philbrick born","passage_text":"Quotes by Rodman Philbrick. â\u0080\u009c 1 The only real treasure is in your head. â\u0080\u009c 2 Books are like truth serum-- if you don't read, you can't figure out what's real.â\u0080\u009d. â\u0080\u009c 3 Pain is just a state of mind.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7495914,"ranking":13,"query_text":"what year was mr. philbrick born","passage_text":"Mrs. Bernice Ward was born February 20, 1924 in Colorado County, to the late Mr. and Mrs. Jessie and Early Howard. She was a dutiful worker and member of Garwood Church of God for forty-five years. She was currently serving as president of the Mission Society and Church Secretary for twenty-five years.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":5237794,"ranking":14,"query_text":"what year was mr. philbrick born","passage_text":"Candice Philbrick. Principal | Deloitte Consulting LLP. Candice is a principal with Deloitte Consulting LLP, and currently serves on its Board as the Secretary. She has more than 25 years of experience in technology-enabled transformation, merger integration, and business strategy.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":2328212,"ranking":15,"query_text":"what year was mr. philbrick born","passage_text":"Performers who were nominated as Best Actor for the same character in different films in different years include: 1  Fredric March and James Mason as Norman Maine in A Star is Born (1937) and A Star is Born (1954). 2  Robert Donat and Peter O'Toole as Mr. Arthur Chipping (Mr.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":8566723,"ranking":16,"query_text":"what year was mr. philbrick born","passage_text":"Mike was born to Mr. & Mrs. Eddie Lee Colter Sr. At just 8 years of age he knew that acting would be his life long ambition when he saw the film A ...","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":8677504,"ranking":17,"query_text":"what year was mr. philbrick born","passage_text":"According to Mr. Willoughby, Jamie was born in the year of the ox (1721). Click here for the characteristics of those born in the year of the ox. It's an external link. You will have to press the back button in your browser to return to Lallybroch.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":3923215,"ranking":18,"query_text":"what year was mr. philbrick born","passage_text":"Bull Markets Since 1871: Duration and Magnitude April 17, 2013 by Tobias Carlisle Butler|Philbrick|Gordillo and Associates have an interesting post called What the Bull Giveth, the Bear Taketh Away on the duration and magnitude of all bull and bear market periods in U.S. stocks since 1871.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":6483264,"ranking":19,"query_text":"what year was mr. philbrick born","passage_text":"Mrs. Nitzsche died Sunday night, March 1, after an illness of short duration. Death was attributed to aortic insufficiency. She was 57 years of age. Maude Zettie Nitzsche was born on October 4, 1878, in Jackson county, Illinois, a daughter of Mr. and Mrs. William P. Wilson.","bm25_label":"high","relevance_label":0.0},{"query_id":1010287,"passage_id":7872588,"ranking":20,"query_text":"what year was mr. philbrick born","passage_text":"And thatâ\u0080\u0099s about all what we know for a fact. The details of Prestonâ\u0080\u0099s life before his service in Boston and after the trial are very sketchy. Even the the age and the exact bith and death years are disputed. According to Michael Burganâ\u0080\u0099s book â\u0080\u009cThe Boston Massacreâ\u0080\u009d publisehd by Compas Point Books, 2005, Preston was the exact same age as Samuel Adams. Mr. Burgan writes that Preston was born in 1722 and died in 1798. Admas, the famous leader of the Boston patriots was also born in the same year.","bm25_label":"high","relevance_label":0.0}]