[{"query_id":1014884,"passage_id":8535042,"ranking":1,"query_text":"what type of material is farberware bowl made of","passage_text":"Thank you for purchasing Farberware. Farberware is dedicated to producing a trusted brand of product. Farberware is manufactured and inspected to ensure high quality standards. They are guaranteed to be free from defects in materials and workmanship under normal household use for the lifetime of the cookware.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":7240642,"ranking":2,"query_text":"what type of material is farberware bowl made of","passage_text":"When it comes to smaller jobs around the kitchen, nothing handles tiny tasks like this Set of 2 Mini Silicone Spatulas from Farberware. Perfect for scooping out small jars and getting all of the batter out of a bowl, each spatula in this convenient set is made with a scratch-resistant silicone head and a sturdy wooden handle. 1  Set includes 2 mini spatulas. 2  Care: Hand wash. 3  Material: Silicone, wood. 4  Imported.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":7240637,"ranking":3,"query_text":"what type of material is farberware bowl made of","passage_text":"With the exception of the aluminum base, vintage Farberware pans are made of easy clean stainless steel. Always a plus. So enjoy cooking up a storm in some â\u0080\u009cnewâ\u0080\u009d vintage Farberware pans.","bm25_label":"high","relevance_label":1.0},{"query_id":1014884,"passage_id":8535047,"ranking":4,"query_text":"what type of material is farberware bowl made of","passage_text":"Pros: Affordable, reasonably rugged, a step above throw away pots n pans. 1  Cons: Fit and finish as well as material heft and quality reduced over the years. Farberware is a long established name in US domestic cookware. Many of us including myself remember the ?classic? Farberware pots and pans our mothers used. The older cookware while by no means the most expensive was attractive and utilitarian. Manufacturing requires a great many trade offs in an attempt to satisfy a given market at a price that matches what that target group is willing to spend.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":7240639,"ranking":5,"query_text":"what type of material is farberware bowl made of","passage_text":"This item Farberware Classic Plastic Mixing Bowls, Assorted, Set of 3. 1  OXO Good Grips 3-Piece Mixing Bowl Set, Blue\/Green\/Yellow. 2  Pyrex Prepware 3-Piece Glass Mixing Bowl Set. 3  Stainless Steel Mixing Bowls by Finedine (Set of 6) Polished Mirror Finish Nesting Bowls, Â¾ - 1.5 - 3 - 4 - 5 - 8 Quart - Cooking Supplies.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":8535040,"ranking":6,"query_text":"what type of material is farberware bowl made of","passage_text":"Pros: Affordable, reasonably rugged, a step above throw away pots n pans. Cons: Fit and finish as well as material heft and quality reduced over the years. Farberware is a long established name in US domestic cookware. Many of us including myself remember the ?classic? Farberware pots and pans our mothers used. The older cookware while by no means the most expensive was attractive and utilitarian.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":329734,"ranking":7,"query_text":"what type of material is farberware bowl made of","passage_text":"Bowl (or â\u0080\u009cHeadâ\u0080\u009d). A hookah â\u0080\u009cbowlâ\u0080\u009d or â\u0080\u009cheadâ\u0080\u009d is what holds your shisha and sits at the very top of the hookah. Bowls are normally made from ceramic or clay, however you can find hookah bowls made from a wide variety of materials, such as pyrex, marble, wood, and metal.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":329732,"ranking":8,"query_text":"what type of material is farberware bowl made of","passage_text":"A hookah â\u0080\u009cbowlâ\u0080\u009d or â\u0080\u009cheadâ\u0080\u009d is what holds your shisha and sits at the very top of the hookah. Bowls are normally made from ceramic or clay, however you can find hookah bowls made from a wide variety of materials, such as pyrex, marble, wood, and metal.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":8535049,"ranking":9,"query_text":"what type of material is farberware bowl made of","passage_text":"Farberware 50049 Prepare favorite meals from start to finish with this Farberware Classic Series 15 Piece Stainless Steel Cookware Set. Farberware has been trusted by families for over 100 years, and this cookware set continues that tradition for a ...","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":4688479,"ranking":10,"query_text":"what type of material is farberware bowl made of","passage_text":"Mostly in ivory or wood, often with relief carving or other types of decorations such as lacquer and inlay of other materials. Kagamibuta Netsuke. The combination of the lid and the bowl: the lid is usually a metal disc bearing relief or engraved carving, and the bowl is made of ivory or wood. Ryusa Netsuke. Manju-shaped netsuke with openwork design.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":5155970,"ranking":11,"query_text":"what type of material is farberware bowl made of","passage_text":"The earliest residents. of Pennsylvania depended on rocks as the raw. materials for much of what they used. They. used iron-bearing minerals as paint pigments. Bowls and other vessels were made of clay and. talc-bearing rocks.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":2630196,"ranking":12,"query_text":"what type of material is farberware bowl made of","passage_text":"These types of splints are typically made from plastics, aluminum, or plaster material. Internal splints are positioned within the nostrils. What it is being used for will determine what is made out of. The most common material for an internal nasal splint is silicone.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":8157955,"ranking":13,"query_text":"what type of material is farberware bowl made of","passage_text":"Fly Fishing Leader and Tippet â\u0080\u0093 Materials. The materials that fly fishing leader and tippet are made of are of two main types: monofilament and fluorocarbon. These two types of materials coincide primarily with the type of fishing you are doing. I wonâ\u0080\u0099t get into all of the technical details between what monofilament is and what fluorocarbon is.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":6985486,"ranking":14,"query_text":"what type of material is farberware bowl made of","passage_text":"Polyester fabric is, by definition, synthetic: a fabric made by chemical synthesis rather than from natural materials ... What Is Polyester Crepe... Types of Polyester Fabric. ... Polyester crepe material is a man-made fabric.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":4083422,"ranking":15,"query_text":"what type of material is farberware bowl made of","passage_text":"What is an offset spatula? Spatulas are great for a variety of kitchen tasks, from scraping the last bit of batter out of a mixing bowl to gently stirring some scrambled eggs in a nonstick pan. Spatulas can be made from a variety of materials, but your average spatula seems to be made from silicone more often than not these days.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":7193608,"ranking":16,"query_text":"what type of material is farberware bowl made of","passage_text":"Clothing materials. Clothing is generally made of cloth. There are many different types of cloth, with different names and uses. Main differences between types of cloth include how the cloth was made (woven, knitted, felted, and how those techniques were implemented), what fiber it was made from, and what weight the cloth is.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":3575498,"ranking":17,"query_text":"what type of material is farberware bowl made of","passage_text":"As recounted by Isidore of Seville, the craftsman who invented the technique brought a drinking bowl made of flexible glass before Caesar who threw it to the floor, whereupon the material dented, rather than shattering.The inventor then repaired the bowl easily with a small hammer.s recounted by Isidore of Seville, the craftsman who invented the technique brought a drinking bowl made of flexible glass before Caesar who threw it to the floor, whereupon the material dented, rather than shattering. The inventor then repaired the bowl easily with a small hammer.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":1361008,"ranking":18,"query_text":"what type of material is farberware bowl made of","passage_text":"PREPARATION\/PLANNING * Be sure that the material is made of asbestos cement. Other material cannot stand up to the weather, so if it is exposed to the wind and rain then it is asbestos cement. If the shed\/garage is lined internally with another type of board, and you are unsure about what it is â\u0080\u0093 SEEK ADVICE.REPARATION\/PLANNING * Be sure that the material is made of asbestos cement. Other material cannot stand up to the weather, so if it is exposed to the wind and rain then it is asbestos cement. If the shed\/garage is lined internally with another type of board, and you are unsure about what it is â\u0080\u0093 SEEK ADVICE.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":1895377,"ranking":19,"query_text":"what type of material is farberware bowl made of","passage_text":"WHAT WEâ\u0080\u0099RE MADE OF. What are o.b.Â® tampons made of? What are o.b.Â® tampons made of? o.b.Â® tampons are made of two types of rayon and a polyester string. The cover for o.b.Â® ORIGINALâ\u0084¢ is made of polyester\/polyethylene non-woven material and that of o.b.Â® PRO COMFORTÂ® is made of polyethylene\/polypropylene film.","bm25_label":"high","relevance_label":0.0},{"query_id":1014884,"passage_id":7240645,"ranking":20,"query_text":"what type of material is farberware bowl made of","passage_text":"Stainless Steel and Black Plastic Handle Marked on the bottom: Farberware Stainless Steel 762 China 09037 M 5 Holds 2 to 2 quarts. Find this Pin and more on Vintage or Unusual Items by wesellitall. Vtg Farberware Stainless Steel Tea Kettle Tea Pot Model #762 See More","bm25_label":"high","relevance_label":0.0}]