[{"query_id":1017276,"passage_id":7237951,"ranking":1,"query_text":"define diencephalic syndrome","passage_text":"diencephalic syndrome as a cause of failure to thrive in early childhood, we analyzed a series of cases to define characteristic features to help early diagnosis of diencephalic syndrome.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7237952,"ranking":2,"query_text":"define diencephalic syndrome","passage_text":"Definitions of Diencephalic Syndrome: Ophanet, a consortium of European partners, currently defines a condition rare when it affects 1 person per 2,000. They list Diencephalic Syndrome as a rare disease.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7237945,"ranking":3,"query_text":"define diencephalic syndrome","passage_text":"What are the Signs and Symptoms of Diencephalic Syndrome? The signs and symptoms of Diencephalic Syndrome can vary widely from one individual to another, and these symptoms include: Prolonged absence of weight gain is commonly observed: Loss of body fat (emaciation) despite a healthy caloric intake may be a sign of Diencephalic Syndrome.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7237947,"ranking":4,"query_text":"define diencephalic syndrome","passage_text":"The topic Paramedian Diencephalic Syndrome you are seeking is a synonym, or alternative name, or is closely related to the medical condition Diencephalic Syndrome. Quick Summary: Diencephalic Syndrome is a rare neurological disorder caused by a tumor located in the diencephalon, an area of the brain that contains the thalamus and hypothalamus The hypothalamus controls the pituitary gland; and together they are responsible for a vast amount of hormonal control in the body","bm25_label":"high","relevance_label":1.0},{"query_id":1017276,"passage_id":7237948,"ranking":5,"query_text":"define diencephalic syndrome","passage_text":"diencephalic syndrome of infancy. 1. profound emaciation after initial normal growth, locomotor hyperactivity and euphoria, usually with skin pallor, hypotension, and hypoglycemia; usually due to neoplasm involving the anterior hypothalamus.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7237946,"ranking":6,"query_text":"define diencephalic syndrome","passage_text":"Definitions of pituitary diencephalic, synonyms, antonyms, derivatives of pituitary diencephalic, analogical dictionary of pituitary diencephalic (English) English Â» English â\u0086\u0094 search","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":1630876,"ranking":7,"query_text":"define diencephalic syndrome","passage_text":"The primary structures involved in the processing of memory within the medial temporal lobe are the hippocampus and the amygdala. One of the most common causes of diencephalic amnesia is Wernicke-Korsakoff syndrome, a disorder caused by a thiamine deficiency, usually related to chronic alcoholism.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7237944,"ranking":8,"query_text":"define diencephalic syndrome","passage_text":"Pituitary Diencephalic Syndrome (n.) 1. Neoplastic, inflammatory, infectious, and other diseases of the hypothalamus. Clinical manifestations include appetite disorders; AUTONOMIC NERVOUS SYSTEM DISEASES; SLEEP DISORDERS; behavioral symptoms related to dysfunction of the LIMBIC SYSTEM; and neuroendocrine disorders.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":2994857,"ranking":9,"query_text":"define diencephalic syndrome","passage_text":"The lateral ventricles (one and two) are located in the cerebrum, the third ventricle separates the right and left diencephalic structures, while the fourth ventricle is associated with the pons and medulla.he lateral ventricles (one and two) are located in the cerebrum, the third ventricle separates the right and left diencephalic structures, while the fourth ventricle is associated with the pons and medulla.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7590961,"ranking":10,"query_text":"define diencephalic syndrome","passage_text":"This is the manifestation of upper brainstem and diencephalic ischemia caused by occlusion of the rostral basilar artery, usually by an embolus. Patients present with changes in the level of consciousness.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":4415423,"ranking":11,"query_text":"define diencephalic syndrome","passage_text":"The lateral ventricles (one and two) are located in the cerebrum, the third ventricle separates the right and left diencephalic structures, while the fourth ventricle is associated with the pons and medulla.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7237949,"ranking":12,"query_text":"define diencephalic syndrome","passage_text":"Thus the diencephalic endorphin and mesencephalic enkephalin neurons stimulate the serotonin neurons at the bulbus (28-30) The serotoninergic neurons at the dorsal horn of the spinal cord stimulate the intermediate neurons at the dorsal horn.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":7237950,"ranking":13,"query_text":"define diencephalic syndrome","passage_text":"The translations of diencephalic from English to other languages presented in this section have been obtained through automatic statistical translation; where the essential translation unit is the word Â«diencephalicÂ» in English.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":3505528,"ranking":14,"query_text":"define diencephalic syndrome","passage_text":"The subthalamic nucleus (STN) is a diencephalic gray matter portion of the basal ganglia, and the only portion of the ganglia that produces an excitatory neurotransmitter, glutamate. The role of the subthalamic nucleus is to stimulate the SNr-GPi complex and it is part of the indirect pathway.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":6777382,"ranking":15,"query_text":"define diencephalic syndrome","passage_text":"Cuboid syndrome, which is relatively common but not well defined or recognized, is known by many other names, including lateral plantar neuritis, cuboid fault syndrome, peroneal cuboid syndrome, dropped cuboid, locked cuboid and subluxed cuboid.uboid syndrome, which is relatively common but not well defined or recognized, is known by many other names, including lateral plantar neuritis, cuboid fault syndrome, peroneal cuboid syndrome, dropped cuboid, locked cuboid and subluxed cuboid.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":5307081,"ranking":16,"query_text":"define diencephalic syndrome","passage_text":"Most cancer predisposition syndromes associated with the development of sarcoma manifest in childhood. In some instances, such as Li-Fraumeni syndrome, malignancy is the defining phenotype of the syndrome.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":3085068,"ranking":17,"query_text":"define diencephalic syndrome","passage_text":"Define syndrome. syndrome synonyms, syndrome pronunciation, syndrome translation, English dictionary definition of syndrome. n. 1. A group of symptoms that collectively indicate or characterize a disease, disorder, or other condition considered abnormal. 2. a. A complex of...","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":8130792,"ranking":18,"query_text":"define diencephalic syndrome","passage_text":"Celiac artery compression syndrome (also referred to as celiac axis syndrome, median arcuate ligament syndrome, and Dunbar syndrome) is defined as chronic, recurrent abdominal pain related to compression of the celiac artery by the median arcuate ligament.he syndrome is also referred to as celiac axis syndrome, median arcuate ligament syndrome, and Dunbar syndrome.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":1114232,"ranking":19,"query_text":"define diencephalic syndrome","passage_text":"Celiac artery compression syndrome is defined as chronic, recurrent abdominal pain related to compression of the celiac artery by the median arcuate ligament. It is also referred to as celiac axis syndrome, median arcuate ligament syndrome, and Dunbar syndrome.","bm25_label":"high","relevance_label":0.0},{"query_id":1017276,"passage_id":5933311,"ranking":20,"query_text":"define diencephalic syndrome","passage_text":"ALS is the most common of these syndromes. In this paper the term motor neuron disease will be used in the general sense defined by Brain, and the term ALS in the sense of a specific syndrome, as defined by Charcot. Primary lateral sclerosis was first clearly described by Spiller [5] and [6] .","bm25_label":"high","relevance_label":0.0}]