[{"query_id":1017773,"passage_id":7237211,"ranking":1,"query_text":"what time period does mindhunter take place","passage_text":"And getting a front row seat to the thoughts of a killer is exactly what Mindhunter gives the viewer. One of the smartest things that this show does is its most unexpected trait. In a world where shows are increasingly graphic and we all stare at our screens screaming for blood, Mindhunter takes an intellectual","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":7237214,"ranking":2,"query_text":"what time period does mindhunter take place","passage_text":"It is that raw exploration of the human psyche that makes Mindhunter so powerful. It asks what are you capable of, and how does someone get to that point. The show hints at exploring some of the most prolific killers of that time, including Manson and BTK Killer.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":7237217,"ranking":3,"query_text":"what time period does mindhunter take place","passage_text":"Mindhunter takes place in the 70s, a quintessential time for the evolution of both serial killers and the FBI agents who pioneered a way to study and stop these prolific killers. The agents, Holden Ford (Jonathan Groff) and Bill Tench (Holt McCallany) work on a new branch of the FBI, the behavioral science unit.","bm25_label":"high","relevance_label":1.0},{"query_id":1017773,"passage_id":7252708,"ranking":4,"query_text":"what time period does mindhunter take place","passage_text":"Get an answer for 'In what time period does The Hunger Games take place?' and find homework help for other The Hunger Games questions at eNotes","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":3683142,"ranking":5,"query_text":"what time period does mindhunter take place","passage_text":"Question and answer. Where does the initiating event take place, what time of day does the event take place, and what the weather is like are all questions that should be answered in the: a. Objectives. b.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":5220988,"ranking":6,"query_text":"what time period does mindhunter take place","passage_text":"Hanna High School) Questioning the Story: Tweet Over what exact period of time does the film's story take place? In real life, Coach Harold Jones first lured Radio onto the field with a bottle of soda (not a water bottle) in 1964.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":677704,"ranking":7,"query_text":"what time period does mindhunter take place","passage_text":"Amount of Time Off. To qualify for time off through FMLA, employees must be employed for at least 12 months and have worked a minimum of 1,250 hours. The 12 month period does not have to be consecutive, but does need to take place within a seven year period.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":3683138,"ranking":8,"query_text":"what time period does mindhunter take place","passage_text":"User: Where does the initiating event take place, what time of day does the event take place, and what the weather is like are all questions that should be answered in the: a. Objectives. b. Scenario. narrative. c. Exercise Planning Workshop. d. Scope.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":292398,"ranking":9,"query_text":"what time period does mindhunter take place","passage_text":"I have orientation day scheduled for monday jan 27. what exactly does orientation day consist of? is this the start of my training period or does that take place at a later date? is this just a single day event?","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":219485,"ranking":10,"query_text":"what time period does mindhunter take place","passage_text":"Samurai Champloo question?? Can anyone tell me what time period Samurai Champloo takes place in? I'm writing a story and I want to have it in the same time period as this show, but I'm not quite sure when it is. And I'm not a big fan about history so are there any pointers about samurai and the Shogunate you can give me to put in... show more Can anyone tell me what time period Samurai Champloo takes place in? I'm writing a story and I want to have it in the same time period as this show, but I'm not quite sure when it is.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":5446671,"ranking":11,"query_text":"what time period does mindhunter take place","passage_text":"IGNITION TIMING. When combustion occurs it does not take place instantly. It requires a period of time. Depending on the RPM the power stroke can be .05 of a second at 1200 rpm to .0057 of a second at 10,500 rpm.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":5154747,"ranking":12,"query_text":"what time period does mindhunter take place","passage_text":"What does feuded mean? Feud can be defined as a bitter conflict between two parties. It may take place between two or more individuals or between two or more groups of people for example clans and f â\u0080¦ amilies. They generally have a long history and may go on for longs periods of time before they are dissolved.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":1999056,"ranking":13,"query_text":"what time period does mindhunter take place","passage_text":"when does The Legend of Tarzan take place? There's no official word on the time period of the Tarzan novels, but many have assumed through the context clues and general state of the world in the novels (British Empire colonizing Africa, etc.) that the early 1900s seem to be the key Tarzan time period.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":8168761,"ranking":14,"query_text":"what time period does mindhunter take place","passage_text":"What time era does the video game Oblivion take place? Bible = BABYL = Babyl-On = BABYLON = the place of luxury and greed ?. A very well known place of manipulating.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":2237191,"ranking":15,"query_text":"what time period does mindhunter take place","passage_text":"What time era did hamlet the prince of denmark take place? There is a reference to tributes paid to the Danes in the text, so that would most likely place it in the period of the Danelaw (886-954). Edit","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":4057320,"ranking":16,"query_text":"what time period does mindhunter take place","passage_text":"What is the temporal structure of the poem? Does it take place in one time (the present, the past, the future) or does it move back and forth between times? Does it present single actions in time or continuing actions? Does it bring different times together or set them apart (e.g., â\u0080\u009cthenâ\u0080\u009d vs. â\u0080\u009cnowâ\u0080\u009d)?","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":4057318,"ranking":17,"query_text":"what time period does mindhunter take place","passage_text":"TIME; SETTING. 1  What is the temporal structure of the poem? Does it take place in one time (the present, the past, the future) or does it move back and forth between times? 2  Does it present single actions in time or continuing actions? Does it bring different times together or set them apart (e.g., â\u0080\u009cthenâ\u0080\u009d vs. â\u0080\u009cnowâ\u0080\u009d)?","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":2250028,"ranking":18,"query_text":"what time period does mindhunter take place","passage_text":"When Does Menopause Start? Menopause is the point in time (not a period of time) when a woman has gone for 12 months without her menstrual period. This signals that she has passed her child bearing years and that her ovarian eggs have been depleted. Menopause takes place at the age of 51, although it may be much earlier or later for some women. Studies have indicated that women as young as 30 have reached menopause. When Does Postmenopause Start? Postmenopause is the period of time immediately following menopause.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":4852865,"ranking":19,"query_text":"what time period does mindhunter take place","passage_text":"1 36% - What is the average time that it may take to get a federal tax refund this year done by mail? 2  20% - What is the average length of time it takes to get your refund anticipation check from h r block?3  34% - Average time it takes for fed refund to be released with a ga state tax offest being in place?he average waiting period for the refund is 21 days.... 0. 0. The average waiting period for the refund is 21 days, this is after the return has been accepted by IRS.","bm25_label":"high","relevance_label":0.0},{"query_id":1017773,"passage_id":3532962,"ranking":20,"query_text":"what time period does mindhunter take place","passage_text":"Other Similar FunTrivia Questions & Answers Does anyone know what year the movie Grease takes place in? 1  Does anyone know what year the movie Grease takes place in?","bm25_label":"high","relevance_label":0.0}]