[{"query_id":1019602,"passage_id":6359271,"ranking":1,"query_text":"what supplement can give you strength","passage_text":"I hope that helps you sort out your valgus knees, and gives you an appreciation of how you can target your supplemental strength and conditioning training to improve your athletic potential and reduce injury. Itâ\u0080\u0099s not just about how much you do in training, itâ\u0080\u0099s more about what you do.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":1779157,"ranking":2,"query_text":"what supplement can give you strength","passage_text":"Well, the answer to all these questions is nothing but- HeadLock Muscle Growth! This dietary supplement can be your secret to a competitive edge and give the additional strength and power you need for an enhanced performance in the gym.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":359018,"ranking":3,"query_text":"what supplement can give you strength","passage_text":"Creatine supplements can provide a 10 to 15% boost in overall strength, and a lean muscle mass gain of up to 10 pounds. Because of their popularity, creatine supplements are extremely cost-effective, giving an athlete the most bang for his supplement buck. Creatine supplements come in powder, pill or liquid forms.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":5068820,"ranking":4,"query_text":"what supplement can give you strength","passage_text":"What You Need to Know about H2O >>>. Creatine is a popular supplement in the fitness industry because it works. When loaded properly, creatine can be extremely effective in terms of increasing strength and muscle size.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":8526534,"ranking":5,"query_text":"what supplement can give you strength","passage_text":"Creatine is a dietary supplement that is popular for building athletic strength. Whether you should take it depends on your goals, your health and what other supplements or prescription drugs you may already be taking.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":6123291,"ranking":6,"query_text":"what supplement can give you strength","passage_text":"Incoming search terms: 1  vitamins to strengthen nails. 2  vitamin to strengthen nails. 3  what can you take to strengthen your nails. 4  what supplements promote nail strength. 5  what vitamin do you take to strengthen nails. 6  how to strengthen toenails.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":8526533,"ranking":7,"query_text":"what supplement can give you strength","passage_text":"Creatine is a dietary supplement that is popular for building athletic strength. Whether you should take it depends on your goals, your health and what other supplements or prescription drugs you may already be taking. Your body makes creatine naturally.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":4569030,"ranking":8,"query_text":"what supplement can give you strength","passage_text":"This is the creatine product from LEGION, my line of science-based, naturally sweetened workout supplements. RECHARGE gives you the proven strength, size, and recovery benefits of creatine monohydrate plus the muscle repair and insulin sensitivity benefits of L-carnitine L-tartrate and corosolic acid.his is the creatine product from LEGION, my line of science-based, naturally sweetened workout supplements. RECHARGE gives you the proven strength, size, and recovery benefits of creatine monohydrate plus the muscle repair and insulin sensitivity benefits of L-carnitine L-tartrate and corosolic acid.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":4569026,"ranking":9,"query_text":"what supplement can give you strength","passage_text":"Find A Creatine Powder That Really Works! Creatine can be one of the best supplements to help you add strength, definition and muscle and itâ\u0080\u0099s great for recovery.ind A Creatine Powder That Really Works! Creatine can be one of the best supplements to help you add strength, definition and muscle and itâ\u0080\u0099s great for recovery.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":6774444,"ranking":10,"query_text":"what supplement can give you strength","passage_text":"So knowing your personal strengths and weaknesses can give you a lot of insights in understanding and changing yourself. And it will help you to make the right decisions. Please do the little exercise and reveal your own personal strengths and weaknesses.Write them into a comment and I might comment back on them later.tâ\u0080\u0099s also important not to confuse strengths with likes. What you like to do is not necessarily what you do best. It can be, but itâ\u0080\u0099s not a given. Of course, for a successful career you want to combine these two in order to overlap your strengths with your passion.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":7234681,"ranking":11,"query_text":"what supplement can give you strength","passage_text":"Letâ\u0080\u0099s take a look at the best strength boosting and muscle building supplements that actually work. Creatine Creatine is the best strength-boosting supplement you can take because it actually delivers a short-term energy supply to your bodyâ\u0080\u0099s muscles. Your muscles will be able to exert more energy when you supplement with creatine before a workout allowing you to lift heavier weight.","bm25_label":"high","relevance_label":1.0},{"query_id":1019602,"passage_id":1529782,"ranking":12,"query_text":"what supplement can give you strength","passage_text":"It increases the supply of hormones towards your muscles. Headlock muscle growth supplement makes your body active, hard, solid and strong. Hence if you are getting the strength, muscle growth, boost of hormones and energy from this supplement then what else so you want from it!","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":6639845,"ranking":13,"query_text":"what supplement can give you strength","passage_text":"Best Answer: You didn't give units of area for me to work with, but I will tell you what I can. Medium strength concrete would fail at about 28 MPa (4,000 pounds per square inch).High strength concrete would fail at about 40 MPa (6,000 pounds per square inch). In a 5 X 5 section, it would be able to hold 10000 pounds if it is medium strength, 150000 pounds if it is high strength.Source(s): My mechanics of materials course.est Answer: You didn't give units of area for me to work with, but I will tell you what I can. Medium strength concrete would fail at about 28 MPa (4,000 pounds per square inch).","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":529637,"ranking":14,"query_text":"what supplement can give you strength","passage_text":"Whatever the reason, too little of this essential vitamin can sap your bone strength, and some research links a deficiency of vitamin D to chronic fatigue syndrome. What to do: A blood test can determine whether you're getting enough of your daily D. If not, a supplement can get you to the amount you need each day.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":2883746,"ranking":15,"query_text":"what supplement can give you strength","passage_text":"Minimize Your Risk. Hereâ\u0080\u0099s what you can do to get the benefits of acetaminophen while minimizing your risk: Use regular-strength (not extra-strength) acetaminophen, so that you take only 650 mg per dose rather than 1,000 mg. There is no evidence that an extra-strength dose gives more or longer pain relief.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":317649,"ranking":16,"query_text":"what supplement can give you strength","passage_text":"Top 10 Pre-Workout Supplements. 1. 4 Gauge â\u0080\u0093 Explosive pre workout. Load up your guns! 4 Gauge is a brand new powerful pre workout supplement in shotgun shell bottle that has been designed to ramp up energy levels, increase strength, power and stamina, without the unwanted side-effects. Their unique formula can give you: Boosted energy levels â\u0080\u0093 Safely, without high stimulants.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":7234682,"ranking":17,"query_text":"what supplement can give you strength","passage_text":"The Best Supplements for Strength and Muscle Building. The supplement industry is not a very regulated industry, so you will see tons of products and claims on miracle supplements promising to increase your muscle mass or strength. Most of these supplements DO NOT work.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":8361504,"ranking":18,"query_text":"what supplement can give you strength","passage_text":"Yes, creatine is often combined with other muscle building supplements. You can find it in protein powders, pre-workouts and mass gainers, to help increase muscle mass, strength and performance. If you prefer to supplement it with a few individual supplements, consider stacking it with beta-alanine.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":8526532,"ranking":19,"query_text":"what supplement can give you strength","passage_text":"Creatine is a dietary supplement that is popular for building athletic strength. Whether you should take it depends on your goals, your health and what other supplements or prescription drugs you may already be taking. Your body makes creatine naturally. You also get it in your diet, especially from fish and meat.","bm25_label":"high","relevance_label":0.0},{"query_id":1019602,"passage_id":3937463,"ranking":20,"query_text":"what supplement can give you strength","passage_text":"Supplemental insurance policies can help pay for many expenses that arenâ\u0080\u0099t covered by your primary health insurance, giving you peace of mind and the freedom to focus on what matters.","bm25_label":"high","relevance_label":0.0}]