[{"query_id":1021327,"passage_id":7303670,"ranking":1,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman Middle School in Cedar Hill, Texas is named for her. Bessie Coleman Boulevard in Waxahachie, Texas, where she lived as a child is named in her honor.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7231860,"ranking":2,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman Middle School located in Cedar Hill, Texas - TX. Find Bessie Coleman Middle School test scores, student-teacher ratio, parent reviews and teacher stats. We're an independent nonprofit that provides parents with in-depth school quality information. Schools","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7913018,"ranking":3,"query_text":"what school did bessie coleman attend","passage_text":"1 Discussion: Ask students what they think the author's purpose was for writing the book and what they learned about Bessie Coleman that they didn't already know. 2  Ask students what they think the Bessie Coleman Aero Club is like today.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7148245,"ranking":4,"query_text":"what school did bessie coleman attend","passage_text":"Today we tell about Bessie Coleman, the first African American woman pilot. Bessie Coleman was born in Atlanta, Texas, in eighteen ninety-two. Her mother was African American. Her father was part African American and part American Indian. Her family was poor. Bessie had to walk more than six kilometers to go to school.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7303665,"ranking":5,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman, 1892-1926: She Dared to Dream and Became the First African-American Female Pilot. FAITH LAPIDUS: I'm Faith Lapidus. STEVE EMBER: And I'm Steve Ember with People in America in VOA Special English. Today we tell about Bessie Coleman, the first African-American woman pilot. FAITH LAPIDUS: Bessie Coleman was born in Atlanta, Texas, in eighteen ninety-two. Her mother was African-American. Her father was part African-American and part American Indian. Her family was poor. Bessie had to walk more than six kilometers to go to school.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7148242,"ranking":6,"query_text":"what school did bessie coleman attend","passage_text":"Soon after the end of World War One, Bessie Coleman left for France. She attended the famous flight school, Ecole d'Aviation des Freres Caudron, in the town of Le Crotoy in northern France. She learned to fly in a plane that had two sets of wings, one over the other. She completed seven months of flight training.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7303672,"ranking":7,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman is on Facebook. Join Facebook to connect with Bessie Coleman and others you may know. Facebook gives people the power to share and makes...","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":979093,"ranking":8,"query_text":"what school did bessie coleman attend","passage_text":"Sources: 1  Bessie Coleman â\u0080\u0093 Wikipedia - http:\/\/en.wikipedia.org\/wiki\/Bessie_Coleman. 2  BessieColeman.com - http:\/\/www.bessiecoleman.com\/. 3  biography.com â\u0080\u0093 Bessie Coleman - http:\/\/www.biography.com\/people\/bessie-coleman-36928. 4  American Experience (PBS) - http:\/\/www.pbs.org\/wgbh\/amex\/flygirls\/peopleevents\/pandeAMEX02.html.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":3003435,"ranking":9,"query_text":"what school did bessie coleman attend","passage_text":"As the other children began to age and find work in the fields, Bessie assumed some new responsibilities around the Coleman house. She kept her eyes on her sisters and helped her mother work in her garden. Bessie began school at the age of six and had to walk 4 miles each day to her all-black school.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":8197396,"ranking":10,"query_text":"what school did bessie coleman attend","passage_text":"Hart, Philip S. (1996), Up in the Air: The Story of Bessie Coleman, Trailblazer Biographies, First Avenue Editions, ISBN 978-0876149782 Johnson, Dolores (1997). She Dared to Fly: Bessie Coleman. New York: Benchmark Books. ISBN 978-0761404873. Plantz, Connie (2001). Bessie Coleman: First Black Woman Pilot. African-American Biographies.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7231857,"ranking":11,"query_text":"what school did bessie coleman attend","passage_text":"She found that apparently there were none in the United States. Bessie learned that she would have a better chance in Europe. She began to study French at a language school in Chicago. She also took a higher-paying job supervising a public eating place so she could save money. Soon after the end of World War One, Bessie Coleman left for France. She attended the famous flight school, Ecole d'Aviation des Freres Caudron, in the town of Le Crotoy in northern France. She learned to fly in a plane that had two sets of wings, one over the other. She completed seven months of flight training.","bm25_label":"high","relevance_label":1.0},{"query_id":1021327,"passage_id":7148251,"ranking":12,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman: Bessie Coleman, American aviator and a star of early aviation exhibitions and air shows. Sources vary on the year of Colemanâ\u0080\u0099s birth. One of 13 children, she grew up in","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":979095,"ranking":13,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman Biography. Bessie Coleman was born in Atlanta, Texas, in 1892. The family soon moved to a farm near Dallas. Her father, George Coleman, moved to Indian Territory, Oklahoma, in 1901, where he had rights, based on having three Indian grandparents.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7148244,"ranking":14,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman did not live to establish her own flying school. But she had said that if she could create the minimum of her plans and desires, she would have no regrets. She had accepted the dangers of her job because she loved flying. Her influence continues today. In nineteen ninety-two, the Chicago City Council passed a resolution praising her.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":3003438,"ranking":15,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman Biography. Bessie Coleman was the first African American to earn an international pilot's license. She dazzled crowds with her stunts at air shows and refused to be slowed by racism (a dislike or disrespect of a person based on their race).","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":3003436,"ranking":16,"query_text":"what school did bessie coleman attend","passage_text":"Coleman was born in Texas in 1892. Her mother and father were African American. She had two brothers and a young sister. Her parents were sharecroppers. When Coleman was two, her family moved to Waxahachie, Texas where Bessie went to school. She loved reading and was very good at math.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":8197393,"ranking":17,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman. Elizabeth Bessie Coleman (January 26, 1892 â\u0080\u0093 April 30, 1926) was the first female African American pilot ever to hold an international pilot license. She fought discrimination to follow her dream of becoming a pilot.","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":4769322,"ranking":18,"query_text":"what school did bessie coleman attend","passage_text":"Brioche Doree - Chicago O'Hare International Airport (ORD), Terminal 1, Gate C20, 10000 Bessie Coleman Dr., 10000 West O'Hare Avenue, Chicago Burrito Beach - 5600 Mannheim Road, Chicago CIBO Express Gourmet Market - Chicago O'Hare International Airport (ORD), Terminal 2, Main Building, 10000 Bessie Coleman Dr., 10000 West O'Hare Avenue, Chicago CNN Newsstand - Terminal 3, Gate H6, Bessie Coleman Drive, Chicago","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":8197389,"ranking":19,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman was an American civil aviator. She was the first woman of African-American descent, and the first of Native American descent, to hold a pilot license. She achieved her international pilot license in 1921. Born to a family of sharecroppers in Texas, she went into the cotton fields at a young age but also studied in a small segregated school and went on to attend one term of college at Langston University. She developed an early interest in flying, but African Americans, Native Amer","bm25_label":"high","relevance_label":0.0},{"query_id":1021327,"passage_id":7913025,"ranking":20,"query_text":"what school did bessie coleman attend","passage_text":"Bessie Coleman. From Wikipedia, the free encyclopedia. Bessie Queen Bess Coleman (January 26, 1892 - April 30, 1926), was the first African American woman to become an airplane pilot, and the first American woman to hold an international pilot's licence. She was also the first black licensed pilot in the world. Ms. Coleman was married briefly to Charles Wilson Pankey.","bm25_label":"high","relevance_label":0.0}]