[{"query_id":1024305,"passage_id":7227453,"ranking":1,"query_text":"what nationality is dr. nowzaradan","passage_text":"dr nowzaradan nationality dr nowzaradan son dr nowzaradan wife Viewers of TLC's My 600-lb Life have been introduced to Dr. Younan Nowzaradan. Find out details about his wiki, family, and nationality right here.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7227447,"ranking":2,"query_text":"what nationality is dr. nowzaradan","passage_text":"You can catch the show on Saturdays, but before that, here's Dr. Nowzaradan's wiki. Dr. Nowzaradan is back with the hit TV show My 600-lb Life on TLC. You can catch the show on Saturdays, but before that, here's Dr. Nowzaradan's wiki.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7227419,"ranking":3,"query_text":"what nationality is dr. nowzaradan","passage_text":"Where Is Dr. Nowzaradan From? Dr. Younan Nowzaradan, M.D., F.A.C.S is from Iran and was born on October 11, 1944. That makes Dr. Nowzaradanâ\u0080\u0099s age 74,","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":3435260,"ranking":4,"query_text":"what nationality is dr. nowzaradan","passage_text":"Dr. Nowzaradan is a leader in the performance of surgical techniques laparoscopically. Today, surgeries of all types, not just bariatric, are performed using the less invasive technique. Dr. Nowzaradan has published numerous papers on laparoscopy.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":1866748,"ranking":5,"query_text":"what nationality is dr. nowzaradan","passage_text":"About Me. Dr. Younan Nowzaradan has been serving patients with compassionate care for over 30 years. He has dedicated much of his career to advocating quality medical management for those struggling with obesity. Dr. Nowzaradan firmly believes in the care of the obese without discrimination or prejudice. Dr. Nowzaradan, A Leader in Laparoscopic Surgical Techniques. As a general and vascular surgeon, he was the first doctor in Houston to propose, research and adopt the benefits of laparoscopic surgery for procedures previously unconsidered.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7603650,"ranking":6,"query_text":"what nationality is dr. nowzaradan","passage_text":"Dr. Nowzaradan - Wiki, Wife, Age, Net Worth. Delores Nowzaradan (m. Younan Nowzaradan (born October 11, 1944) is a surgeon who appears on the reality series, My 600-lb Life. He's based in Houston and specializes in gastric bypass surgery. Many call him by his nickname, Dr. Now. He is from Iran and graduated from the University of Tehran in 1970. UT is one of Iran's most prestigious universities, explaining why Dr.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7603653,"ranking":7,"query_text":"what nationality is dr. nowzaradan","passage_text":"Jonathan Nowzaradan is Dr. Nowzaradan's son and the producer of My 600-lb Life. He also produced Shipping Wars and Half Ton Teen. Jonathan hopes the series inspires people to lose weight.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":3435261,"ranking":8,"query_text":"what nationality is dr. nowzaradan","passage_text":"Most recently Dr. Nowzaradan was featured in the A&E show Heavy. Dr. Nowzaradan has performed successfully a variety of weight loss surgery; such as the lap band system - Realize Band Inamed Lap Band, Sleeve gastricatony, Roux-en Y gastric bypass, duodenal gastric switch, and biliopancreatic diversion.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7227451,"ranking":9,"query_text":"what nationality is dr. nowzaradan","passage_text":"For Dr. Nowzaradan, a patientâ\u0080\u0099s diet is of paramount importance, because how they maintain their body dictates how they become healthy. Ever since Dr. Nowzaradan has been featured on the reality show My 600-lb Life, people have become curious to know more about him. So, here are some details from Dr. Nowzaradanâ\u0080\u0099s wiki.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7227418,"ranking":10,"query_text":"what nationality is dr. nowzaradan","passage_text":"Prior to their marriage, Delores did secretarial work. Once they got married, Delores stopped working. She stayed home and raised their children. Delores also cared for Younanâ\u0080\u0099s mother for over 20 years. Dr. Nowzaradan Malpractive. Rumors about Dr. Nowzaradan being fired are false but he was sued for malpractice.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":3435263,"ranking":11,"query_text":"what nationality is dr. nowzaradan","passage_text":"Dr. Younan Nowzaradan MD. Overview. Dr. Younan Nowzaradan is a surgeon in Houston, Texas and is affiliated with multiple hospitals in the area, including St. Anthony's Hospital and St. Joseph Hospital. He received his medical degree from Tehran University of Medical Sciences School of Medicine and has been in practice for more than 20 years.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7227446,"ranking":12,"query_text":"what nationality is dr. nowzaradan","passage_text":"Bariatric surgeon Dr. Nowzaradan, whose age is 74, helps obese people lose weight with a combination of surgery and special diets. The emotionally draining stories are seen on My 600-lb Life. Though his net worth is only $4.0 million, Dr. Nowzaradan dedicated his life to helping people and caring for them.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7227444,"ranking":13,"query_text":"what nationality is dr. nowzaradan","passage_text":"Dr. Nowzaradan is from Iran and was born on October 11, 1944. That makes Dr. Nowzaradanâ\u0080\u0099s age 72 with years of experience in treating patients who suffer from life-threatening obesity. Even though Dr. Nowzaradanâ\u0080\u0099s nationality is Iranian, he has been working in the United States for more than four decades. He is a surgeon, who specializes in gastric bypass surgery. Advertisement","bm25_label":"high","relevance_label":1.0},{"query_id":1024305,"passage_id":1866754,"ranking":14,"query_text":"what nationality is dr. nowzaradan","passage_text":"Nowzaradan firmly believes in the care of the obese without discrimination or prejudice. Dr. Nowzaradan, A Leader in Laparoscopic Surgical Techniques As a general and vascular surgeon, he was the first doctor in Houston to propose, research and adopt the benefits of laparoscopic surgery for procedures previously unconsidered.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7227422,"ranking":15,"query_text":"what nationality is dr. nowzaradan","passage_text":"Younan Nowzaradan October 11, 1944 (age 73) Spouse Delores Nowzaradan (m. 1975â\u0080\u00932002) Occupation General and vascular surgeon Younan Nowzaradan (born October 11, 1944) is a surgeon who appears on the reality series, My 600-lb Life. He's based in Houston and specializes in gastric bypass surgery. Many call him by his nickname, Dr. Now.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":3435257,"ranking":16,"query_text":"what nationality is dr. nowzaradan","passage_text":"Younan Nowzaradan, MD. Dr. Nowzaradan is one of the pioneers of the minimally invasive laparoscopic technique and has published numerous scientific papers on these subjects. He is board certified by ABS (American Board of Surgery) and holds professional memberships in the following organizations: ACS (American College of Surgeons)","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":1866746,"ranking":17,"query_text":"what nationality is dr. nowzaradan","passage_text":"Meet My 600-Lb Lifeâ\u0080\u0099s Dr. Younan Nowzaradan, gastric bypass surgeon extraordinaire. Jan. 28, 2015 | 8:16 pm | Author : Asa Hawks | Categories : If youâ\u0080\u0099ve ever watched TLCâ\u0080\u0099s popular docu-series My 600-Lb Life, then youâ\u0080\u0099ve been introduced to Dr. Younan Nowzaradan, the gastric bypass surgeon from Houston Obesity Surgery who performs all of the procedures on the show.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7603648,"ranking":18,"query_text":"what nationality is dr. nowzaradan","passage_text":"Dr. Nowzaradan then performed an umbilical hernia removal and tummy tuck surgery on Jones in December 2015. Jones said the tummy tuck turned out great, but the hernia removal: not so much. â\u0080\u009cI went in with the belly button and Iâ\u0080\u0099d like to know what you did with it?â\u0080\u009d","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7264108,"ranking":19,"query_text":"what nationality is dr. nowzaradan","passage_text":"Dr. Nowzaradan's Diet Plan For â\u0080\u0098My 600-Lb Lifeâ\u0080\u0099 Patients: How TLC Reality Stars Lose Weight After Gastric Bypass. As viewers of â\u0080\u009cMy 600-Lb Lifeâ\u0080\u009d know, gastric bypass surgery is not magic. While the procedure helps people control their appetite, they must follow a strict diet to lose weight and maintain results. Dr. Younan Nowzaradan, the doctor featured on TLCâ\u0080\u0099s hit show, has his patients follow a high-protein, low-carb diet to drop pounds and keep the weight off.","bm25_label":"high","relevance_label":0.0},{"query_id":1024305,"passage_id":7603652,"ranking":20,"query_text":"what nationality is dr. nowzaradan","passage_text":"Dr. Nowzaradan Diet Plan Dr. Now is often seen trying to convince his patients on My 600-lb Life to lose weight. He informs them that they will die if they don't change their eating habits. Dr. Now also tells his patients to change their eat healthier after surgery.","bm25_label":"high","relevance_label":0.0}]