[{"query_id":1024835,"passage_id":7226565,"ranking":1,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Penetrant Removal Method Penetrants are also classified by the method of removing the excess penetrant. â\u0080¢Solvent Removable penetrants are removed by wiping with a cloth dampened with solvent. They are supplied in aerosol cans for portability and are primarily used for spot checks. â\u0080¢Water Washable penetrants are removed with a course spray of water.","bm25_label":"high","relevance_label":1.0},{"query_id":1024835,"passage_id":7226567,"ranking":2,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Penetrant systems are classified into four methods of excess penetrant removal. 1  These include the following: 2  Method A: Water-Washable. 3  Method B: Post-Emulsifiable, Lipophilic. 4  Method C: Solvent Removable. 5  Method D: Post-Emulsifiable, Hydrophilic.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":7226569,"ranking":3,"query_text":"what method of penetrant removal is solvent removable","passage_text":"1.2 This test method also provides a reference: 1.2.1 By which a visible penetrant examination method using the solvent-removable process recommended or required by individual organizations can be reviewed to ascertain its applicability and completeness.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":7226564,"ranking":4,"query_text":"what method of penetrant removal is solvent removable","passage_text":"surface with cloth or absorbent paper moistened with solvent. To minimize removal of penetrant from discontinuities, care shall be taken to avoid use of excess solvent. Flushing or flooding the surface with solvent, following application of penetrant and prior to developer application, is prohibited.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":7226566,"ranking":5,"query_text":"what method of penetrant removal is solvent removable","passage_text":"penetrant examination utilizing the solvent-removable process. It is a nondestructive testing method for detecting discontinui-ties that are open to the surface, such as cracks, seams, laps, cold shuts, laminations, isolated porosity, through leaks, or lack of fusion and is applicable to in-process, ï¬\u0081nal, and maintenance examination.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":8259440,"ranking":6,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Some substances, such as primer, can remove fats and oils. Other substances, such as prep, polish remover and other solvents, can remove moisture from the skin. These substances diminish the protective action of the skin and make it easier for substances to penetrate the skin.The skin allergy really begins with a process called sensitization.ther substances, such as prep, polish remover and other solvents, can remove moisture from the skin. These substances diminish the protective action of the skin and make it easier for substances to penetrate the skin. The skin allergy really begins with a process called sensitization.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":6333373,"ranking":7,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Alternative Removal Methods. You may need a stronger solvent to remove some types of tree sap, but if you're removing sap from a painted surface, you you don't want to use a solvent that damages the paint.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":5619993,"ranking":8,"query_text":"what method of penetrant removal is solvent removable","passage_text":"In the direct method caffeine is removed by soaking the materials directly in a solvent; the solvent is directly applied to the beans. On the other hand, in the indirect method the caffeine-laden water is transferred to a separate tank and treated with a solvent; in this case the solvent never touches the beans.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":6783434,"ranking":9,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Another way to remove wallpaper is to use steam. Place the steamer on the surface of the wall to penetrate glue. View original photo. You can rent a commercial wallpaper steamer as an alternative to solvents.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":2019136,"ranking":10,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Acetone and the ingredients in non-acetone remover are all safe solvents when used sparingly. And lastly, acetone dissolves polish faster than non-acetone removers. What Is A Solvent?","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":17036,"ranking":11,"query_text":"what method of penetrant removal is solvent removable","passage_text":"A better remedy is to use a penetrating finish, where a water-repellent and fungicide can be mixed with a resin and solvent to form what is named a water-repellent preservative. 20 A more costly method is to introduce the small molecule pieces of the polymer chain into the wood and polymerize them in the wood. better remedy is to use a penetrating finish, where a water-repellent and fungicide can be mixed with a resin and solvent to form what is named a water-repellent preservative. 20 A more costly method is to introduce the small molecule pieces of the polymer chain into the wood and polymerize them in the wood.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":1666272,"ranking":12,"query_text":"what method of penetrant removal is solvent removable","passage_text":"2) The Directâ\u0080\u0093Solvent Based Process. In this method of decaffeination the beans are steamed for about 30 minutes in order to open their pores. Once the coffee beans are receptive to a solvent, they are repeatedly rinsed with either methylene chloride or ethyl acetate for about 10 hours to remove the caffeine.s Iâ\u0080\u0099ve mentioned above, the decaffeination of coffee involves the use of a decaffeination agent. In solvent-based processes a chemical solvent is added either directly or indirectly to selectively remove the caffeine.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":4401144,"ranking":13,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Mastic must be removed using wet methods when it contains asbestos fibers. This can be done by dissolving the mastic with a suitable solvent, then using a HEPA-filter equipped vacuuming device to remove and pick-up the resulting slurry. Mastic cannot be ground, sanded or abraded to accomplish removal. Any","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":2876062,"ranking":14,"query_text":"what method of penetrant removal is solvent removable","passage_text":"naphtha - any of various volatile flammable liquid hydrocarbon mixtures; used chiefly as solvents. remover - a solvent that removes a substance (usually from a surface); paint remover; rust remover; hair remover. alcahest, alkahest, universal solvent - hypothetical universal solvent once sought by alchemists.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":4457059,"ranking":15,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Older Floors. Quite similar to completely refinishing any hardwood floor, the procedure calls for removal of existing finish and the color that has penetrated into the surface of the wood itself. The amount of removal will be dependant on how deep the stain has penetrated or what the original color was.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":7676134,"ranking":16,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Thus large amounts of surfactant and organic solvent, which are added to the system, must be separated and removed from the final product. As a result, it is expensive to fabricate silver nanoparticles by this method.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":3447487,"ranking":17,"query_text":"what method of penetrant removal is solvent removable","passage_text":"2) The Directâ\u0080\u0093Solvent Based Process. In this method of decaffeination the beans are steamed for about 30 minutes in order to open their pores. Once the coffee beans are receptive to a solvent, they are repeatedly rinsed with either methylene chloride or ethyl acetate for about 10 hours to remove the caffeine.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":7226570,"ranking":18,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Fluorescent Liquid Penetrant Examination Using the. Solvent-Removable Process1. This standard is issued under the ï¬\u0081xed designation E 1219; the number immediately following the designation indicates the year of. original adoption or, in the case of revision, the year of last revision. A number in parentheses indicates the year of last reapproval.","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":8816469,"ranking":19,"query_text":"what method of penetrant removal is solvent removable","passage_text":"The formulated solvents clean, soften and remove contaminants while the light viscosity oils ensure deep penetration into hard to reach moving parts. The high-grade petroleum oils provide optimum lubrication under extreme temperatures (-60 to 475 degrees Fahrenheit) and tremendous pressure (up to 3000 pounds).","bm25_label":"high","relevance_label":0.0},{"query_id":1024835,"passage_id":7716244,"ranking":20,"query_text":"what method of penetrant removal is solvent removable","passage_text":"Organic solvents are widely used in everyday living. From disinfectant treatment to removing tough grease stains, learn more about what organic solvents are. Discover some of the more common solvents and understand their useful applications.","bm25_label":"high","relevance_label":0.0}]