[{"query_id":1026799,"passage_id":5492304,"ranking":1,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"Organ Donation. Heart. Over 2,600 people are waiting for a heart transplant nationwide. Some conditions that might make a transplant necessary are cardiomyopathy, heart failure, myocarditis, and heart disease. The heart can be preserved outside of the body for 4 to 6 hours before transplant into a recipient. Transplants are blood typed and matched for the size and weight of the donor. Liver","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":5492302,"ranking":2,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"The following information will help you understand more about organs and tissue that can be donated: Organ Donation Heart. Over 2,600 people are waiting for a heart transplant nationwide. Some conditions that might make a transplant necessary are cardiomyopathy, heart failure, myocarditis, and heart disease. The heart can be preserved outside of the body for 4 to 6 hours before transplant into a recipient. Transplants are blood typed and matched for the size and weight of the donor. Liver. Some conditions that could make a liver transplant necessary are birth defects of the liver or bile duct, chronic liver infections like hepatitis, or drug and alcohol damage. The liver can be preserved outside of the body for 4 to 16 hours. Transplants are blood typed and matched for the size and weight of donor. A donated liver can sometimes be split between two recipients, so one donor can be the source of two liver transplants.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":317895,"ranking":3,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"In addition to blood transfusions, organs from a person with type O blood (either O+ or O-) can be transplanted in people with any blood type, although additional tests are necessary to ensure a safe match. For plasma, AB- is the universal donor type.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":3625012,"ranking":4,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"The OPTN's secure transplant information database contains all national data on the candidate waiting list, organ donation and matching, and transplantation. This system is critical in helping organ transplant institutions match waiting candidates with donated organs. Institutions also rely on the database to manage time-sensitive, life-critical data of all candidates, before and after their transplants.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":4403207,"ranking":5,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"The HLA system and solid-organ transplantation . In solid-organ transplantation, HLA-matching means absence of HLA antigens in the donor that could be the target of anti-HLA antibodies present in the recipient. The matching is not between the antigens in the recipient and those in the donor, like in bone-marrow transplantation.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":2020295,"ranking":6,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"1 The kidney often lasts longer. 2  A transplanted kidney from a living donor often lasts longer. 3  This is partly due to more time being available to do the necessary tests to get a better tissue match between donor and recipient. 4  A better tissue match means higher compatibility and less risk of organ rejection.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":7261014,"ranking":7,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"xenotransplant; xenotransplantation. Hypernyms (xenotransplantation is a kind of...): organ transplant; transplant; transplantation (an operation moving an organ from one organism (the donor) to another (the recipient)) Learn English with...","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":7950925,"ranking":8,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"There is a shortage of organs available for donation with many patients waiting on the transplant list for a donation match. About 20 patients die each day waiting for an organ on the transplant list. When an organ donor does arise, the transplant governing bodies must determine who receives the organ.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":6724429,"ranking":9,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"To date, most donor organs have come from deceased donors. Kidney transplants are the most common type of transplant surgery; the least common single-organ transplants are the intestines. Depending on the organ needed, organs are matched using several characteristics, including blood type and size of the organ needed.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":6919066,"ranking":10,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"UNOSâ\u0080\u0099 computer system stores information about every person who is waiting for a transplant, and matches donor organs with transplant candidates 24 hours a day, 365 days a year.When a patient is â\u0080\u009cadded to the list,â\u0080\u009d a transplant hospital adds a patientâ\u0080\u0099s medical information into UNOSâ\u0080\u0099 computer system.NOSâ\u0080\u0099 computer system stores information about every person who is waiting for a transplant, and matches donor organs with transplant candidates 24 hours a day, 365 days a year.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":7088143,"ranking":11,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"Liver Transplant Waiting List In order to undergo a liver transplant, a patient must be placed on the national waiting list. The list is managed by the United Network for Organ Sharing , which collects and manages all data that pertain to the patient waiting list, organ donation and matching, and transplantation occurring on the OPTN, the nation's organ transplant network.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":3985156,"ranking":12,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"This is because the person's immune system detects that the antigens on the cells of the organ are different or not matched.. Mismatched organs, or organs that are not matched closely enough, can trigger a blood transfusion reaction or transplant rejection.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":3349517,"ranking":13,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"What is a kidney transplant? A kidney transplant is a surgery done to replace a diseased kidney with a healthy kidney from a donor. The kidney may come from a deceased organ donor or from a living donor. Family members or others who are a good match may be able to donate one of their kidneys. This type of transplant is called a living transplant. People who donate a kidney can live healthy lives with one healthy kidney.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":8149553,"ranking":14,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"Structure in any organization is inevitable-- an organization, by definition, implies a structure. Your group is going to have some structure whether it chooses to or not. It might as well be the structure which best matches up with what kind of organization you have, what kind of people are in it, and what you see yourself doing.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":6919064,"ranking":15,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"The higher the MELD score the sicker the patient, and the higher on the transplant waiting list. UT Southwest Medicine reports livers are only matched for blood type (A, B, O, AB) and size. Unlike other organs, special tissue typing is not necessary to determine which liver donor makes the best match.he higher the MELD score, the more advanced the liver disease is, and the sooner the patient will be allocated a liver for transplant. Very helpful articles and videos to understand more about liver transplants and the steps for evaluation include: 1  John Hopkins Medicine. www.hopkinsmedicine.org.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":5774417,"ranking":16,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"The primary functions of the Organ Center are to: 1  assist in placing donated organs for transplantation. 2  assist in gathering donor information and running the donor\/recipient computer matching process. 3  assist with transportation of organs and tissues for the purposes of transplantation.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":4578384,"ranking":17,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"Why It Is Done. A tissue type test is done to: See if the antigen pattern for donated tissue or organs (including a blood platelet transfusion or bone marrow transplant) is a match. The success of a transplant depends on how closely the antigen patterns match.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":6544587,"ranking":18,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"Last year, more than 28,000 people received organ transplants, more than 40,000 received corneal transplants and hundreds of thousands received tissue transplants, yet 6,590 died awaiting organ transplants. A surge in the number of donors is necessary to save more lives.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":5774422,"ranking":19,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"Factors in organ allocation. How organ matching works. When a transplant hospital accepts a person as a transplant candidate, it enters medical dataâ\u0080\u0094information such as the personâ\u0080\u0099s blood type and medical urgency and the location of the transplant hospitalâ\u0080\u0094about that candidate into UNOSâ\u0080\u0099 computerized network.","bm25_label":"medium","relevance_label":0.0},{"query_id":1026799,"passage_id":4787840,"ranking":20,"query_text":"what kind of match is necessary for an organ transplant","passage_text":"The higher the MELD score the sicker the patient, and the higher on the transplant waiting list. UT Southwest Medicine reports livers are only matched for blood type (A, B, O, AB) and size. Unlike other organs, special tissue typing is not necessary to determine which liver donor makes the best match.he Methodist Hospital is the largest liver transplant center in Texas, and one of the largest in the United States. The MELD score is calculated by determining the patients bilirubin, creatinine, and INR. The MELD score ranges from 5-40.","bm25_label":"medium","relevance_label":0.0}]