[{"query_id":1026711,"passage_id":7861043,"ranking":1,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Dolores Oâ\u0080\u0099Riordan, Lead Singer of The Cranberries, Dies Dolores Oâ\u0080\u0099Riordan, Lead Singer of The Cranberries, Dies By The New York Times - Mon, 01\/15\/2018 - 19:06 Breaking News: The lead singer of The Cranberries has died at 46. Dolores Oâ\u0080\u0099Riordan performed hit singles like Zombie with the Irish rock band.","bm25_label":"high","relevance_label":1.0},{"query_id":1026711,"passage_id":7861046,"ranking":2,"query_text":"who died in the groupthe cranberries new york times","passage_text":"The ferocity and fragility in frontwoman Dolores Oâ\u0080\u0099Riordanâ\u0080\u0099s voice made her central to the band, writes Una Mullally of the New York Times. The ferocity and fragility in frontwoman Dolores Oâ\u0080\u0099Riordanâ\u0080\u0099s voice made her central to the band, writes Una Mullally of the New York Times. Dolores O'Riordan, lead singer of The Cranberries, has died at age 46.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":4800368,"ranking":3,"query_text":"who died in the groupthe cranberries new york times","passage_text":"By THE NEW YORK TIMES. Alfred Emanuel Smith, four times Governor of this State, who rose from the sidewalks of New York to eminence in public life and in the hearts of many Americans, died early today at the age of 70 in Rockefeller Institute Hospital.y THE NEW YORK TIMES. Alfred Emanuel Smith, four times Governor of this State, who rose from the sidewalks of New York to eminence in public life and in the hearts of many Americans, died early today at the age of 70 in Rockefeller Institute Hospital.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":602292,"ranking":4,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Dolores Oâ\u0080\u0099Riordan of the Cranberries dies aged 46 â\u0080\u0093 video obituary Dolores Oâ\u0080\u0099Riordan, the lead singer with the multi-platinum band the Cranberries, has died aged 46. The news was confirmed by her publicist in a statement, but no cause of death has yet been announced. Oâ\u0080\u0099Riordan, who had to cancel a tour with a reunited Cranberries in 2017 because of a back problem, had been in London for a recording session.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":8791094,"ranking":5,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Dolors O'Riordan, who led The Cranberries to international fame, died at age 46 while in London for a recording session. Dolors O'Riordan, who led The Cranberries to international fame, died at age 46 while in London for a recording session.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":7993075,"ranking":6,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Pioneering radio and television psychologist Dr Joy Browne has died at 71. 1  Pioneering radio and television psychologist Dr Joy Browne has died at 71. 2  Browne â\u0080\u0093 who offered advice and inspiration on air for almost four decades - died on Saturday in New York City, according to the New York Times.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":7993080,"ranking":7,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Pioneering radio and television psychologist Dr Joy Browne has died at 71. Browne â\u0080\u0093 who offered advice and inspiration on air for almost four decades - died on Saturday in New York City, according to the New York Times. Her brother David Oppenheim confirmed her death to the newspaper, but did not reveal the cause.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":7861042,"ranking":8,"query_text":"who died in the groupthe cranberries new york times","passage_text":"By Una Mullally The New York Times Thu., Jan. 18, 2018 DUBLINâ\u0080\u0094If you watched MTV in the winter of 1994, it was impossible to ignore â\u0080\u009cZombieâ\u0080\u009d by the Cranberries.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":2375516,"ranking":9,"query_text":"who died in the groupthe cranberries new york times","passage_text":"BETHEL, Conn. (AP)  Jan Miner, a New York stage actress who gained fame as Madge, the manicurist in Palmolive television ads, died Sunday. She was 86. Miner, who lived in nearby Southbury, had been in failing health and died at the Bethel Health Care Facility, her agent, Michael Thomas, told The New York Times. From the 1940s to the 1980s, Miner appeared on and off Broadway and in productions in St. Louis, New Haven and Stratford.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":4794812,"ranking":10,"query_text":"who died in the groupthe cranberries new york times","passage_text":"1 Dollree Mapp, the Cleveland woman who successfully checked police power in a landmark US Supreme Court case, died on October 31 at the age of 90 or 91, according to the New York Times.leveland Memory Project. 1  Dollree Mapp, the Cleveland woman who successfully checked police power in a landmark US Supreme Court case, died on October 31 at the age of 90 or 91, according to the New York Times.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":7993079,"ranking":11,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Deborah Feingold\/Corbis via Getty. Dr. Joy Browne, the radio and TV psychologist who lent her expert advice on air for nearly 40 years, has died. She was 71. Browne died on Saturday in New York City, The New York Times reports, noting that Browneâ\u0080\u0099s brother, David Oppenheim, confirmed the death but did not give a cause.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":6101115,"ranking":12,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Klugman died at the age of 90 in Woodland Hills, California from prostate cancer, on December 24, 2012. The New York Times referred to him and actor Charles Durning, who died the same day, as extraordinary actors ennobling the ordinary..","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":6334833,"ranking":13,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Tony Sheridan Dead: One-Time Beatles Frontman Dies At 72. Tony Sheridan, the British singer, songwriter and guitarist who once fronted the Beatles, died Saturday (Feb. 16) in Hamburg, Germany. He was 72. The news of his death was made public by his daughter Wendy Clare Sheridan-McGinnity, according to the New York Times.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":7324113,"ranking":14,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Pioneer Radio Psychologist Dr. Joy Browne Dead at 71. Dr. Joy Browne, the radio and TV psychologist who lent her expert advice on air for nearly 40 years, has died. She was 71. Browne died on Saturday in New York City, The New York Times reports, noting that Browneâ\u0080\u0099s brother, David Oppenheim, confirmed the death but did not give a cause.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":8717567,"ranking":15,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Estelle Getty was born Estelle Scher on July 25, 1923, in New York, New York (died on July 22, 2008). The Golden Girls is about four previously married women who live together in Miami, sharing their various experiences together and enjoying themselves despite hard times.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":8353151,"ranking":16,"query_text":"who died in the groupthe cranberries new york times","passage_text":"In the news. NEW YORK â\u0080\u0094 Charlie Murphy, older brother of Eddie Murphy and a comedy stand-up and performer in his own right, has died. Murphy died Wednesday in New York of leukemia, according to his... David Letterman's mom, who became unlikely star, dies at 95.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":2439047,"ranking":17,"query_text":"who died in the groupthe cranberries new york times","passage_text":"New York Times | 08.21.12 | 9:19 PM. NEW YORK â\u0080\u0094 Simon P. Gourdine, who became the highest-ranking black executive in professional sports in the 1970s when he was named the NBAâ\u0080\u0099s deputy commissioner and who later served as executive director of the leagueâ\u0080\u0099s players union, died Thursday in Englewood, N.J. He was 72.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":4209165,"ranking":18,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Dolores Oâ\u0080\u0099Riordan, the Irish musician who fronted international â\u0080\u009990s superstars The Cranberries, has died at the age of 46. â\u0080\u009cThe lead singer with the Irish band The Cranberries was in London for a short recording session.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":4643367,"ranking":19,"query_text":"who died in the groupthe cranberries new york times","passage_text":"Dolors O'Riordan, who led The Cranberries to international fame, died at age 46 while in London for a recording session.","bm25_label":"high","relevance_label":0.0},{"query_id":1026711,"passage_id":4052108,"ranking":20,"query_text":"who died in the groupthe cranberries new york times","passage_text":"The Weehawken trip was to a site Miranda had not yet visited: the duelling ground where, in July, 1804, Burr shot Hamilton, who died of his wounds the next day. At the time, duelling was outlawed in New York but tolerated in New Jersey.","bm25_label":"high","relevance_label":0.0}]