[{"query_id":1028711,"passage_id":7221251,"ranking":1,"query_text":"what is wells fargo go far reward","passage_text":"Wells Fargo announced yesterday an enhanced rewards program called Go Far Rewards. Here are the primary details: Pooling Rewards You can transfer points to a friend. (If there are no minimums on this, it would solve the problem â\u0080\u0098orphaned points,â\u0080\u0099 i.e. if you have $19 of rewards left and can send the points to a friend.)","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":689644,"ranking":2,"query_text":"what is wells fargo go far reward","passage_text":"1 Wells Fargo routing number Click here to go to Wells Fargo Bank RTN's by states. 2  What is Wells Fargo routing number. 3  Wells Fargo bankâ\u0080\u0099s clients often want to know what is their Wells Fargo routing number.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":349045,"ranking":3,"query_text":"what is wells fargo go far reward","passage_text":"For more information about the Wells Fargo Business Card Rewards program, read Wells Fargo Business Elite Card Rewards Program Terms and Conditions (PDF) and Cash Back Online Rewards Terms and Conditions (PDF).","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":7221252,"ranking":4,"query_text":"what is wells fargo go far reward","passage_text":"Reward Formula - The Wells Fargo Rewards Card allows you to earn one point for every dollar that you spend on the card. Points can be redeemed for a variety of rewards like travel, cash back, merchandise and gift cards. Fees - There is no annual fee for this card. A closer Look At Wells Fargo Rewards","bm25_label":"high","relevance_label":1.0},{"query_id":1028711,"passage_id":7939944,"ranking":5,"query_text":"what is wells fargo go far reward","passage_text":"No limit on the amount of cash you can earn. Cash doesnâ\u0080\u0099t expire. Use rewards to pay down a Wells Fargo loan. Redeem cash online or through a Wells Fargo ATM if youâ\u0080\u0099re a Wells Fargo bank customer. Redeem cash for gift cards, merchandise, travel, cash, digital rewards and charitable donations.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":5274038,"ranking":6,"query_text":"what is wells fargo go far reward","passage_text":"The Wells Fargo Visa Signature card does not charge an annual fee for usage. Given that the average annual fee charged for rewards cards is $30.83, the Wells Fargo Visa Signature is a good option for prospective cardholders looking for rewards, but not added costs.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":7939938,"ranking":7,"query_text":"what is wells fargo go far reward","passage_text":"Pros. 1  No limit on the amount of cash you can earn. 2  Cash doesnâ\u0080\u0099t expire. 3  Use rewards to pay down a Wells Fargo loan.  Redeem cash online or through a Wells Fargo ATM if youâ\u0080\u0099re a Wells Fargo bank 1  customer. Redeem cash for gift cards, merchandise, travel, cash, digital rewards and charitable donations.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":5274035,"ranking":8,"query_text":"what is wells fargo go far reward","passage_text":"Annual Fee. The Wells Fargo Visa Signature card does not charge an annual fee for usage. Given that the average annual fee charged for rewards cards is $30.83, the Wells Fargo Visa Signature is a good option for prospective cardholders looking for rewards, but not added costs.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":8152083,"ranking":9,"query_text":"what is wells fargo go far reward","passage_text":"If youâ\u0080\u0099re like me, the only reason you use credit cards is to earn cash back, points, or miles. But if thatâ\u0080\u0099s what youâ\u0080\u0099re after, youâ\u0080\u0099re going to be seriously disappointed with a Wells Fargo rewards card. They have 2 different versions and hereâ\u0080\u0099s why neither is worth the plastic theyâ\u0080\u0099re embossed on..","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":806458,"ranking":10,"query_text":"what is wells fargo go far reward","passage_text":"If yes, it would be the number far left at the bottom of the check. For example, this check... the routing number would be 000000186, it is the number between the|:. If you do not have the check, you can simply go to Routing & Account Number Information for Your Wells Fargo Accounts. Otherwise, you can go visit your local Wells Fargo branch and ask a quick question regarding the routing number.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":3619485,"ranking":11,"query_text":"what is wells fargo go far reward","passage_text":"To grant permission for the Wells Fargo Mobile app to access your camera, go to Settings > Privacy > Camera > Wells Fargo and make sure the Camera is ON for Wells Fargo. OR. Go to Settings > Wells Fargo and make sure the Camera is ON.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":7096704,"ranking":12,"query_text":"what is wells fargo go far reward","passage_text":"Wells Fargo Bank Customer Service Number Delineated Here With Complaints and Reviews No complaints and reviews so far for Wells Fargo Bank.To add review or complaint against Wells Fargo Bank Click Here.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":744353,"ranking":13,"query_text":"what is wells fargo go far reward","passage_text":"Credit Courtesy Wells Fargo. There are credit cards that offer cash-back rewards for goals as diverse as travel and saving for college. Now, as the housing market rebounds, Wells Fargo is stepping up its promotion of a card that can help borrowers pay down their home loan faster.here are credit cards that offer cash-back rewards for goals as diverse as travel and saving for college. Now, as the housing market rebounds, Wells Fargo is stepping up its promotion of a card that can help borrowers pay down their home loan faster.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":7221253,"ranking":14,"query_text":"what is wells fargo go far reward","passage_text":"With no annual fee, the Wells Fargo Rewards Visa is about $15.75 per year cheaper than the average credit card. Thatâ\u0080\u0099s something. Still, there are other fees to worry about, namely a 3% balance-transfer fee and a 3% foreign-transaction fee. Credit scores must be this tall to ride. You need good or excellent credit to get the Wells Fargo Rewards Card.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":2138565,"ranking":15,"query_text":"what is wells fargo go far reward","passage_text":"Wells Fargo\/Dillards HERE WE GO AGAIN! 1  Re: Wells Fargo\/Dillards HERE WE GO AGAIN! 2  Re: Wells Fargo\/Dillards HERE WE GO AGAIN! 3  Re: Wells Fargo\/Dillards HERE WE GO AGAIN! 4  Re: Wells Fargo\/Dillards HERE WE GO AGAIN! 5  Re: Wells Fargo\/Dillards HERE WE GO AGAIN! 6  Re: Wells Fargo\/Dillards HERE WE GO AGAIN! 7  Re: Wells Fargo\/Dillards HERE WE GO AGAIN! Called credit this morning about reconing my declined CLI since it did cost me a hp on TU. she pulls it up and says I see computer declined I would be happy to review your request for the CLI from $1k to $5k but I will need to obtain a new copy of your credit report which will be a hp is that okay?","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":7221260,"ranking":16,"query_text":"what is wells fargo go far reward","passage_text":"Summary - The Wells Fargo Rewards Card is their new rewards card and an improvement over the old version (which required a $19 annual fee if you opted in for the reward program). In this review, we'll see how it stacks up versus the reward cards from the big boys.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":744352,"ranking":17,"query_text":"what is wells fargo go far reward","passage_text":"Report Abuse. You have to ask Wells Fargo. Chances are they would process it as a cash advance. You would get hit with the 3% to 5% cash advance fee, depending on your card terms. Interest would begin to accrue a the higher cash advance rate -- way more than your mortgage interest rate.You also would not get any reward points.Reward points are only for purchases. It is unlikely that Wells Fargo would process the credit card as a purchase and pay the merchant fees.Source(s): BD.ou also would not get any reward points. Reward points are only for purchases. It is unlikely that Wells Fargo would process the credit card as a purchase and pay the merchant fees. Source(s): BD.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":7221257,"ranking":18,"query_text":"what is wells fargo go far reward","passage_text":"Travel Rewards - The Wells Fargo reward program appears to be the old style reward system whereby you need a certain amount of points to get a flight within the Continental USA. In the example that they gave on their website, you need a minimum of 25,000 points.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":6727398,"ranking":19,"query_text":"what is wells fargo go far reward","passage_text":"The Wells Fargo Visa Signature offers an APR between 12.15% and 25.99%, which is line with the national average APR range of 16.54% - 22.04%. With an average APR and a $0 annual fee, which is below the $36.10 national average, the Wells Fargo Visa Signature is an attractive rewards card.","bm25_label":"high","relevance_label":0.0},{"query_id":1028711,"passage_id":8152082,"ranking":20,"query_text":"what is wells fargo go far reward","passage_text":"That means your Wells Fargo rewards card is essentially nothing more than your typical 1% rebate card. And as a side note, that means your rewards debit card is earning around a 0.25% rebate.","bm25_label":"high","relevance_label":0.0}]