[{"query_id":1028752,"passage_id":7221036,"ranking":1,"query_text":"what is watamote","passage_text":"Although I still love the show, I feel let down by the Watamote ending. I didnâ\u0080\u0099t want it to be like this. To understand why I was let down by what the ending did wrong, I have to first explain what I think the rest of the series did right leading up to that. For the uninitiated, Watamote is about Tomoko, a teenage girl with severe social anxiety.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221040,"ranking":2,"query_text":"what is watamote","passage_text":"WataMote is an abbreviation of an outrageously long title and is an amalgam of all that is wrong with being a teenager; adolescence is a frustrating mess full of insecurity, doubt, sexual-frustration and fear.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221037,"ranking":3,"query_text":"what is watamote","passage_text":"Watching WATAMOTE in marathon viewing is not recommended, as for all of its humor, emotional resonance, and general entertainment value, it can be a very difficult series to watch in big chunks. Its content is so insightful about what it means to be socially maladjusted that those who ever stood on the social fringe during their school years may find themselves empathizing with Tomoko to an uncomfortable degree.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221038,"ranking":4,"query_text":"what is watamote","passage_text":"Watch this please: https:\/\/youtu.be\/UJh5hHeqmYs This was 5 facts about WataMote! Defiantly recommend you guys check out this anime, I thought it was pretty f... Skip navigation","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221032,"ranking":5,"query_text":"what is watamote","passage_text":"No Matter How I Look at It, Itâ\u0080\u0099s You Guys' Fault Iâ\u0080\u0099m Not Popular! commonly called 'WataMote', is a manga series written by Nico Tanigawa. It was made into an anime series which is directed by Shin Å\u008cnuma.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221034,"ranking":6,"query_text":"what is watamote","passage_text":"), commonly referred to as WataMote (ã\u0083¯ã\u0082¿ã\u0083¢ã\u0083\u0086), is a Japanese manga series written and illustrated by Nico Tanigawa . It began serialization on Square Enix's Gangan Comics Online service from August 4, 2011 and is published by Yen Press in North America.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":8130396,"ranking":7,"query_text":"what is watamote","passage_text":"Height: 147 cm. The protagonist of Watamote. She's bad at talking with people, nonetheless she wants to have friends and even a boyfriend. Unfortunately, her appearance, shyness, social anxiety, and lack of experience in communicating with everyone but her own family doesn't really help Tomoko make things better.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221039,"ranking":8,"query_text":"what is watamote","passage_text":"Watamote focuses on the mental foibles, breakdowns and the overall lack of social function of Tomoko Kuroki, a first year high school girl who hatches several failed schemes to become popular. Tomoko is a great character, not because she is spectacular in-and-of herself, but because she represents a realistic portrayal of adolescence in every day life.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221035,"ranking":9,"query_text":"what is watamote","passage_text":"Izumi Kitta (Japanese) Monica Rial (English) Tomoko Kuroki (é»\u0092æ\u009c¨ æ\u0099ºå­\u0090, Kuroki Tomoko) is the lead protagonist of No Matter How I Look At It, It's You Guys Fault I'm Not Popular! (Watamote). Socially inept and often desperate, the series chronicles her various attempts to try to be more popular at her school.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7221033,"ranking":10,"query_text":"what is watamote","passage_text":"No Matter How I Look at It, Itâ\u0080\u0099s You Guys' Fault Iâ\u0080\u0099m Not Popular!, commonly referred to as WataMote, is a Japanese manga series written and illustrated by Nico Tanigawa. It began serialization on Square Enix's Gangan Comics Online service from August 4, 2011 and is published by Yen Press in North America. A 4-panel spin-off manga was serialized in Gangan Joker between January 2013 and July 2015. An anime television adaptation by Silver Link aired in Japan between July and September 2013 ...","bm25_label":"high","relevance_label":1.0},{"query_id":1028752,"passage_id":3058085,"ranking":11,"query_text":"what is watamote","passage_text":"What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your favorite. What's your, what's your, what's your, what's your, what's your.","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":2737045,"ranking":12,"query_text":"what is watamote","passage_text":"whats good; whats gooday [whats good] B; What's good boys? whats good family? what's good for the geese? whats good in the hood; What's good mo; What's good nigga; What's good wit chu; what's good with the butt? Whats good wit it; whats goody; What's goodybags? What's Goy? What's Grapes? What's Gravity; What's gravy; whats gravy in the navy; what's growin' long; whats guanin","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":6809641,"ranking":13,"query_text":"what is watamote","passage_text":"20 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it0 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":1147809,"ranking":14,"query_text":"what is watamote","passage_text":"what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":1147811,"ranking":15,"query_text":"what is watamote","passage_text":"what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ... 62. what is: humulin, used for; and what is ...","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":1606419,"ranking":16,"query_text":"what is watamote","passage_text":"What is the opposite of obtuse? What is the opposite of obtunding? What is the opposite of obtunded? What is the opposite of obtund? What is the opposite of obtrusively? What is the opposite of obtrusive? What is the opposite of obtuse-angled? What is the opposite of obtusely? What is the opposite of obtuseness? What is the opposite of obtusenesses? What is the opposite of obtuser? What is the opposite of obtusest?","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":1338568,"ranking":17,"query_text":"what is watamote","passage_text":"What is the singular of of cyclopropaphanes? What is the singular of of cyclopropenes? What is the singular of of cyclopropeniums? What is the singular of of cyclopropenone? What is the singular of of cyclopropyls? What is the singular of of cyclopropylamine? What is the singular of of cyclopsams? What is the singular of of cyclopterids? What is the singular of of cyclopyrrolones? What is the singular of of cycloramas? What is the singular of of cyclorelease?","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":8154817,"ranking":18,"query_text":"what is watamote","passage_text":"What is the opposite of modification? What is the opposite of modifiably? What is the opposite of modifiable? What is the opposite of modicum? What is the opposite of modica? What is the opposite of modesty? What is the opposite of modifies? What is the opposite of modify? What is the opposite of modifying? What is the opposite of modish? What is the opposite of modishly?","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":1605952,"ranking":19,"query_text":"what is watamote","passage_text":"What is the opposite of biasedly? What is the opposite of biased? What is the opposite of bias crime? What is the opposite of bias? What is the opposite of biandry? What is the opposite of bi? What is the opposite of biases? What is the opposite of biasing? What is the opposite of biassed? What is the opposite of biasses? What is the opposite of biassing? What is the opposite of bib and tucker?","bm25_label":"high","relevance_label":0.0},{"query_id":1028752,"passage_id":7211423,"ranking":20,"query_text":"what is watamote","passage_text":"What is the opposite of aisle? What is the opposite of airy hope? What is the opposite of airy-fairy? What is the opposite of airy? What is the opposite of airworthy? What is the opposite of airworthiness? What is the opposite of ajar? What is the opposite of AJAX? What is the opposite of AKA? What is the opposite of aken? What is the opposite of akimbo? What is the opposite of akin?","bm25_label":"high","relevance_label":0.0}]