[{"query_id":1031679,"passage_id":7215423,"ranking":1,"query_text":"what is the survival rate of total gastrectomy","passage_text":"The 5-year overall survival rates (OSRs) of laparoscopic and open gastrectomy were 90.5% and 85.9%, respectively, and the 5-year disease-free survival rates (DFSRs) were 90.2% and 75.6%, respectively, with significant differences.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":7215417,"ranking":2,"query_text":"what is the survival rate of total gastrectomy","passage_text":"The study also compared the safety of laparoscopic gastrectomy, with respect to the 5-year survival rate and recurrence in terms of the oncologic results, with that of open gastrectomy. Methods This retrospective study included 424 patients with gastric cancer who had undergone gastrectomy at Busan Paik Hospital, Inje University, over a 5-year period from January 2010 to December 2014.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":7215415,"ranking":3,"query_text":"what is the survival rate of total gastrectomy","passage_text":"What is a total gastrectomy? Stomach cancer is often treated with a total gastrectomy, a complex surgery performed to remove the entire stomach. How doctors at CTCA perform a total gastrectomy. First, youâ\u0080\u0099ll first receive general anesthesia, which will make you unconscious (i.e., sleep) for the procedure and in order to provide pain control.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":7215418,"ranking":4,"query_text":"what is the survival rate of total gastrectomy","passage_text":"disease. The overall 5-year survival rate of all 86 patients was 88.3%, and the disease-speciï¬\u0081c 5-year survival rate was 95.6%. The overall 5-year survival rate of the 51 patients in the PG group (88.7%) was similar to that of the 35 patients in the TG group (87.6%; P Â¼ 0.971). The disease-speciï¬\u0081c 5-year survival rates were 97.1% (PG) and 93.4% (TG), respectively (P Â¼ 0.553; Table 3). Discussion The prognosis of patients with advanced gastric cancer located in the upper third of the stomach was reported to be worse than for other sites.7â\u0080\u00939 Thus, it is clear that total gastrectomy (TG) with D2 lymphadenectomy is indicated in patients with advanced gastric cancer located in the upper third of the stomach.","bm25_label":"high","relevance_label":1.0},{"query_id":1031679,"passage_id":4171305,"ranking":5,"query_text":"what is the survival rate of total gastrectomy","passage_text":"The surgeon makes a cut in the abdomen and removes all or part of the stomach, depending on the reason for the procedure. Depending on what part of the stomach was removed, the intestine may need to be re-connected to the remaining stomach (partial gastrectomy) or to the esophagus (total gastrectomy). Today, some surgeons perform gastrectomy using a camera. The surgery is done with a few small surgical cuts.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":4171309,"ranking":6,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Gastrectomy is surgery to remove part or all of the stomach. 1  If only part of the stomach is removed, it is called partial gastrectomy.  If the whole stomach is removed, it is called total gastrectomy.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":490047,"ranking":7,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Treatment of stage I gastric cancer may include the following: Surgery (total or subtotal gastrectomy). Surgery (total or subtotal gastrectomy) followed by chemoradiation therapy.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":7215419,"ranking":8,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Total gastrectomy for stomach cancer A total gastrectomy procedure may be a treatment option for: Patients with any stage of stomach cancer, depending on how widespread the disease is","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":490050,"ranking":9,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Treatment of stage II gastric cancer may include the following: Surgery (total or subtotal gastrectomy). Surgery (total or subtotal gastrectomy) followed by chemoradiation therapy or chemotherapy.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":7215421,"ranking":10,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Subtotal gastrectomy was performed in 133 cases, total gastrectomy was performed in 12 cases, and proximal gastrectomy was performed in 1 case. The mean tumor size was 22.2 mm, and the mean number of dissected lymph nodes was 35.6.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":7215424,"ranking":11,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Total gastrectomy for stomach cancer. A total gastrectomy procedure may be a treatment option for: Patients with any stage of stomach cancer, depending on how widespread the disease is; Cancer that has spread throughout the stomach; Cancer in the upper portion of the stomach","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":5894783,"ranking":12,"query_text":"what is the survival rate of total gastrectomy","passage_text":"A gastrectomy is a partial or total surgical removal of the stomach.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":3749343,"ranking":13,"query_text":"what is the survival rate of total gastrectomy","passage_text":"The treatment of stomach cancer depends on the size and location of the tumor, the stage of the disease and the patient's general health. Surgery is done to remove cancer tissue; in general, two procedures are common: partial (subtotal) gastrectomy and total gastrectomy.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":1708162,"ranking":14,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Gastrectomy is defined as partial when a part of the stomach is removed surgically and as total when the entire stomach is removed.Some authors further differentiate various types of partial gastrectomy on the basis of the amount of stomach removed, as follows: Antrectomy (30% resection).astrectomy is defined as partial when a part of the stomach is removed surgically and as total when the entire stomach is removed. Some authors further differentiate various types of partial gastrectomy on the basis of the amount of stomach removed, as follows: Antrectomy (30% resection).","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":1291590,"ranking":15,"query_text":"what is the survival rate of total gastrectomy","passage_text":"1 The treatment of stomach cancer depends on the size and location of the tumor, the stage of the disease and the patient's general health.  Surgery is done to remove cancer tissue; in general, two procedures are common: partial (subtotal) gastrectomy and total gastrectomy.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":1708160,"ranking":16,"query_text":"what is the survival rate of total gastrectomy","passage_text":"The types of gastrectomy procedures include: Partial gastrectomy is the removal of part of the stomach. Your doctor attaches your small intestine to the remaining healthy part of the stomach. Total gastrectomy is the removal of the entire stomach.Your doctor attaches the small intestine to the esophagus.Sleeve gastrectomy (also called vertical sleeve gastrectomy and stomach stapling) is the removal of a large part of the stomach to help with weight loss.Your doctor uses staples to create a smaller stomach and attaches the small intestine to the remaining stomach.1  Previous. 2  1.leeve gastrectomy (also called vertical sleeve gastrectomy and stomach stapling) is the removal of a large part of the stomach to help with weight loss. Your doctor uses staples to create a smaller stomach and attaches the small intestine to the remaining stomach. 1  Previous. 2  1.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":5894788,"ranking":17,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Gastric Sleeve: What is a Sleeve Gastrectomy?, Surgeons perform laparoscopic, sleeve gastrectomy by removing approximately 75-80 percent of the stomach UCLA Health myUCLAhealth","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":6675814,"ranking":18,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Gastric banding has a higher rate of serious late complications than the gastric bypass or sleeve gastrectomy. There is quicker weight loss with gastric bypass and laparoscopic sleeve gastrectomy with a time horizon of about 18 months for maximal weight loss compared to 36 to 60 months for banding.","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":7215422,"ranking":19,"query_text":"what is the survival rate of total gastrectomy","passage_text":"Read about a total gastrectomy surgery. This procedure is a complex surgery that involves the entire removal of the stomach for certain patients with stomach cancer. For Referring Physicians","bm25_label":"high","relevance_label":0.0},{"query_id":1031679,"passage_id":457107,"ranking":20,"query_text":"what is the survival rate of total gastrectomy","passage_text":"From 1975 to 1977, the five-year relative survival rate for the total population with leukemia was 34.1 percent, and from 2005 to 2011, the overall relative survival rate was 61.7 percent. From 2005-2011, the five-year relative survival rates overall were CML - 63.2 percent. CLL - 84.8 percent.","bm25_label":"high","relevance_label":0.0}]