[{"query_id":1031118,"passage_id":7899686,"ranking":1,"query_text":"who is carroll tire?","passage_text":"Carroll's Tire Warehouse. Carroll's Tire Warehouse is a pillar of the Porterville, CA community. Carroll's Tire Warehouse is a leader in offering name brand tires, custom wheels, auto repair and brake services for customers located in and around the Porterville, California area. We carry commercial tires, also.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7899691,"ranking":2,"query_text":"who is carroll tire?","passage_text":"Carroll's Tire Warehouse is a tire dealer and auto repair shop in Porterville CA. Carroll's Tire Warehouse has deals on Porterville CA tires, auto repairs and wheels.","bm25_label":"high","relevance_label":1.0},{"query_id":1031118,"passage_id":7899683,"ranking":3,"query_text":"who is carroll tire?","passage_text":"1 WELCOME TO CARROLL TIRE ONLINEâ\u0084¢ 1.1 ABOUT THIS GUIDE Whether youâ\u0080\u0099re a new Carroll Tire customer whoâ\u0080\u0099s ready to learn about the benefits of ordering online, or a frequent CTOâ\u0084¢ user whoâ\u0080\u0099d like a convenient reference guide, the Carroll Tire Onlineâ\u0084¢ User Guide is designed to help you and","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7899690,"ranking":4,"query_text":"who is carroll tire?","passage_text":"1 welcome to carroll tire onlineâ\u0084¢ 1.1 about this guide Whether youâ\u0080\u0099re a new Carroll Tire customer whoâ\u0080\u0099s ready to learn about the benefits of ordering online, or a frequent CTOâ\u0084¢ user whoâ\u0080\u0099d like a convenient reference guide, the Carroll Tire Onlineâ\u0084¢ User Guide is designed to help you and your business make the most of what Carroll Tire Onlineâ\u0084¢ has to offer. The CTOâ\u0084¢ User Guide is divided into short numbered topics that describe each major feature and function.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7899685,"ranking":5,"query_text":"who is carroll tire?","passage_text":"Find 1 listings related to Carroll Tire in Cuyahoga Falls on YP.com. See reviews, photos, directions, phone numbers and more for Carroll Tire locations in Cuyahoga Falls, OH. Start your search by typing in the business name below. What do you want to find?","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":8776191,"ranking":6,"query_text":"who is carroll tire?","passage_text":"WheelDealRacing, a Baltimore, Maryland area custom wheel, tire, and rim dealer is your one-stop home for rims and tires done right! WheelDealRacing is located in Westminster, Carroll County MD and offers the latest tire and rim products with our unprecedented service and tire and rim knowledge.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":1178925,"ranking":7,"query_text":"who is carroll tire?","passage_text":"We are your #1 source for Bridgestone Potenza RE970AS Pole Position Tires at great prices in Fort Worth, TX. Find your tires now! 110 Carroll St Fort Worth, TX 76107","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7899682,"ranking":8,"query_text":"who is carroll tire?","passage_text":"Welcome to Carroll's Tire Warehouse. Since 1977, Carrollâ\u0080\u0099s Tire Warehouse has serviced the automotive repair, tire, and wheel needs of customers throughout central California. Through the years we have expanded into 9 locations in Porterville, CA, Visalia, CA, Delano, CA, Tulare, CA, Hanford, CA, and Bakersfield, CA.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7899689,"ranking":9,"query_text":"who is carroll tire?","passage_text":"Â©2007 - 2018 Carroll Tire Company. All rights reserved. Privacy Policy | Terms of Service | FAQ | Help | Technical Support : 800-493-4142","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":8653851,"ranking":10,"query_text":"who is carroll tire?","passage_text":"The Queen of Hearts is a character from the book Alice's Adventures in Wonderland by the writer and mathematician Lewis Carroll. She is a foul-tempered monarch, that Carroll himself pictured as a blind fury, and who is quick to decree death sentences at the slightest offense.he Queen of Hearts is a character from the book Alice's Adventures in Wonderland by the writer and mathematician Lewis Carroll. She is a foul-tempered monarch, that Carroll himself pictured as a blind fury, and who is quick to decree death sentences at the slightest offense.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7899684,"ranking":11,"query_text":"who is carroll tire?","passage_text":"Related Articles for Carroll Tire more related articles Â» How to Winterize Your Car Â» All it takes is a little preparation to get your car winter-ready and to keep from getting into an icy situation. The June To-Do List Â»","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7899687,"ranking":12,"query_text":"who is carroll tire?","passage_text":"Welcome to Carroll Tire Online Due to inclement weather in the path of winter storm Inga, C43 Montgomery AL will be closed today. Numerous other locations have been affected but plan on opening on a limited basis and will likely have some route restrictions.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":6507591,"ranking":13,"query_text":"who is carroll tire?","passage_text":"Diahann Carroll Talks Of Love, Life And Those Legs. Arts & Life. Diahann Carroll Talks Of Love, Life And Those Legs. Diahann Carroll Talks Of Love, Life And Those Legs. Diahann Carroll, who wrote a new book The Legs Are The Last To Go, says of her legs: I am going to admit I'm very proud of them. ","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":2660218,"ranking":14,"query_text":"who is carroll tire?","passage_text":"View the profiles of professionals named Carla Carroll on LinkedIn. There are 57 professionals named Carla Carroll, who use LinkedIn to exchange information, ideas, and opportunities. LinkedIn","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":4452522,"ranking":15,"query_text":"who is carroll tire?","passage_text":"1 David Hicks portrayed by Arian Moayed: one of Carroll's followers who is shot in the leg and tortured by Ryan Hardy after helping Carroll escape. 2  He commits suicide in an Interrogation Cell with a suicide pill concealed under the skin of his hand. David Hicks portrayed by Arian Moayed: one of Carroll's followers who is shot in the leg and tortured by Ryan Hardy after helping Carroll escape. 2  He commits suicide in an Interrogation Cell with a suicide pill concealed under the skin of his hand.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":2735982,"ranking":16,"query_text":"who is carroll tire?","passage_text":"Pat Carroll, who was cast to voice Ursula, envisioned the character as part Shakespearean actress, with all the flair, flamboyance and theatricality, and part used-car salesman with a touch of con artist. Carroll, who is a contralto, deliberately deepened her voice for the role.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":5081015,"ranking":17,"query_text":"who is carroll tire?","passage_text":"White Rabbit was written by Grace Slick, who based the lyrics on Lewis Carroll's book Alice In Wonderland.Like many young musicians in San Francisco, Slick did a lot of drugs.hite Rabbit was written by Grace Slick, who based the lyrics on Lewis Carroll's book Alice In Wonderland.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":2660215,"ranking":18,"query_text":"who is carroll tire?","passage_text":"Keith Carroll. Keith Carroll (born 25 March 1931) is a former Australian rules footballer who played for Melbourne in the Victorian Football League (VFL) during the 1950s. Debuting in 1952, Carroll was a half back flanker who never cemented his spot in the Melbourne side until the 1956 season. He played 20 games that year, including Melbourne's win over Collingwood in the Grand Final and was a premiership player again the following season, playing on the half back flank.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":3320202,"ranking":19,"query_text":"who is carroll tire?","passage_text":"People Celebrity. Celebrity. 'Family' Star Carroll O'Connor, 76, Dies. Carroll Oâ\u0080\u0099Connor, 76, who trained for Shakespearean roles yet who will always be remembered as TVâ\u0080\u0099s most famously lovable bigot, died in a Culver City, Calif., hospital on Thursday of a heart attack, complicated by diabetes.","bm25_label":"high","relevance_label":0.0},{"query_id":1031118,"passage_id":7284520,"ranking":20,"query_text":"who is carroll tire?","passage_text":"Catholic Boy is the debut album by The Jim Carroll Band, led by Jim Carroll who is notable for publishing the 1978 memoir The Basketball Diaries, and poetry collections including Living at the Movies. It spawned two FM hits, It's Too Late and People Who Died. The front cover photograph was taken by Annie Leibovitz.","bm25_label":"high","relevance_label":0.0}]