[{"query_id":1033443,"passage_id":6919096,"ranking":1,"query_text":"what is the purpose of the fisa court","passage_text":"The Fisa memo details abuse by the Obama administration in surveilling the pre and post election campaign of the Trump administration What is FISA? FISA is the United States Foreign Intelligence Surveillance Court (FISA, also known as FISA Court), and was established in 1978 by the Foreign Intelligence Surveillance Act.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":248204,"ranking":2,"query_text":"what is the purpose of the fisa court","passage_text":"Doc â\u0080\u0093 If you really are asking what is the crime connected to the FISA warrant issue: The crime was using the unverified Steel dossier in submitting an application to to the FISA court to spy on Carter Page.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":2126018,"ranking":3,"query_text":"what is the purpose of the fisa court","passage_text":"How Section 206 Changed the Law. Section 206 amended the Foreign Intelligence Surveillance Act (FISA) so that a wiretap order issued by the secret FISA court no longer has to specify what type of communications that the order applies to.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":7796113,"ranking":4,"query_text":"what is the purpose of the fisa court","passage_text":"There were 1,856 applications in 2012 to the FISA Court for electronic surveillance and physical searches for foreign intelligence purposes, the Justice Department said. None were denied, but 40 were modified to some extent.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":7796117,"ranking":5,"query_text":"what is the purpose of the fisa court","passage_text":"The FISA Court's larger mission is to decide whether to grant certain types of government requests-- wiretapping, data analysis, and other monitoring for foreign intelligence purposes of suspected terrorists and spies operating in the United States.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":8366759,"ranking":6,"query_text":"what is the purpose of the fisa court","passage_text":"Intelligence Court Skeptical of Some FISA Applications: The Department of Justice has published the 2015 FISA report, which summarizes the use of the Foreign Intelligence Surveillance Act. The report also details the number of applications rejected or modified by the FISA Court (FISC).","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":8366758,"ranking":7,"query_text":"what is the purpose of the fisa court","passage_text":"First, we would like to talk with you about the use of FISA generally. Since September 11, the volume of applications to the Foreign Intelligence Surveillance Court (FISA court) has dramatically increased. In 2000, 1,012 applications for surveillance or search were filed under FISA.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":7796118,"ranking":8,"query_text":"what is the purpose of the fisa court","passage_text":"Intelligence Court Skeptical of Some FISA Applications Â» (May. 3, 2016) The Department of Justice has published the 2015 FISA report, which summarizes the use of the Foreign Intelligence Surveillance Act. The report also details the number of applications rejected or modified by the FISA Court (FISC).","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":3770699,"ranking":9,"query_text":"what is the purpose of the fisa court","passage_text":"Expertise at the FISA court: The bill creates a panel of amicus curie at the FISA court to provide guidance on matters of privacy and civil liberties, communications technology, and other technical or legal matters.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":2395637,"ranking":10,"query_text":"what is the purpose of the fisa court","passage_text":"There is a court called the Foreign Intelligence Surveillance Court (â\u0080\u009cFISCâ\u0080\u009d or â\u0080\u009cFISA Courtâ\u0080\u009d), which is basically a super secret court that oversees requests for FISA surveillance warrants. In fact, most of us didnâ\u0080\u0099t even know it existed before Russiagate began.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":8218122,"ranking":11,"query_text":"what is the purpose of the fisa court","passage_text":"Two New Judges Appointed to FISA Court Posted on Apr.06, 2015 in FISA by Steven Aftergood The Chief Justice of the United States has named two new judges to the eleven-member Foreign Intelligence Surveillance Court (FISC), the Court announced last week.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":5175846,"ranking":12,"query_text":"what is the purpose of the fisa court","passage_text":"PRISM began in 2007 in the wake of the passage of the Protect America Act under the Bush Administration. The program is operated under the supervision of the U.S. Foreign Intelligence Surveillance Court (FISA Court, or FISC) pursuant to the Foreign Intelligence Surveillance Act (FISA).","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":2395640,"ranking":13,"query_text":"what is the purpose of the fisa court","passage_text":"Who can be surveilled under FISA? Itâ\u0080\u0099s important to note that FISA applies to foreign targets. The only way our intelligence community can get a FISA warrant on a US person is if they show probable cause to the FISA court that the person is acting as an agent of influence of a foreign power. (They can be acting wittingly or unwittingly.)","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":7212498,"ranking":14,"query_text":"what is the purpose of the fisa court","passage_text":"Foreign Intelligence Surveillance Act (FISA) of 1978, 50 U.S.C. Â§ 1803 (enacted 1978). The FISA Court is not included in the U.S. Code for the Judiciary, but is hidden in the part of the","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":3435222,"ranking":15,"query_text":"what is the purpose of the fisa court","passage_text":"The United States Foreign Intelligence Surveillance Court (FISC, also called the FISA Court) is a U.S. federal court established and authorized under the Foreign Intelligence Surveillance Act of 1978 (FISA) to oversee requests for surveillance warrants against foreign spies inside the United States by federal law enforcement and intelligence ...","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":5054776,"ranking":16,"query_text":"what is the purpose of the fisa court","passage_text":"The United States Foreign Intelligence Surveillance Court (FISC, also called the FISA Court) is a U.S. federal court established and authorized under the Foreign Intelligence Surveillance Act of 1978 (FISA) to oversee requests for surveillance warrants against foreign spies inside the United States by federal law enforcement and intelligence agencies.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":4051143,"ranking":17,"query_text":"what is the purpose of the fisa court","passage_text":"The Act also gave the President authority to conduct electronic surveillance without a court order through the Attorney General and the FISA Court. FISA garnered national attention in 2005 after the Bush administration authorized unwarranted wiretapping of US phones by the National Security Agency.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":7380730,"ranking":18,"query_text":"what is the purpose of the fisa court","passage_text":"The emptiness of 'oversight' from the secret Fisa court. The supposed safeguard under the FAA is that the NSA annually submits a document setting forth its general procedures for how it decides on whom it can eavesdrop without a warrant. The Fisa court then approves those general procedures.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":8667799,"ranking":19,"query_text":"what is the purpose of the fisa court","passage_text":"FISA also established the United States Foreign Intelligence Surveillance Court (FISC), a special U.S. Federal court that holds nonpublic sessions to consider issuing search warrants under FISA. Proceedings before the FISC are ex parte, meaning the government is the only party present.","bm25_label":"medium","relevance_label":0.0},{"query_id":1033443,"passage_id":4817467,"ranking":20,"query_text":"what is the purpose of the fisa court","passage_text":"However, in a third case, the special review court for FISA, the equivalent of a Circuit Court of Appeals, opined differently should FISA limit the President's inherent authority for warrantless searches in the foreign intelligence area. In In re Sealed Case, 310 F.3d 717, 742 (Foreign Intel. Surv.","bm25_label":"medium","relevance_label":0.0}]