[{"query_id":1034595,"passage_id":7210726,"ranking":1,"query_text":"what is the phone number to spe","passage_text":"Spe Corporate Services has been in business for approximately 16 years. Spe Corporate Services has approximately 3 employees at this location. Jack Kindberg is the President at Spe Corporate Services. You can contact Jack at (661) 294-2037. The phone number for Spe Corporate Services is (661) 294-2037. There are 65 commercial tenants at 10202 Washington Blvd, Culver City, CA.","bm25_label":"high","relevance_label":1.0},{"query_id":1034595,"passage_id":6949798,"ranking":2,"query_text":"what is the phone number to spe","passage_text":"We've got 41 definitions for SPE Â» What does SPE stand for? What does SPE mean? This page is about the various possible meanings of the acronym, abbreviation, shorthand or slang term: SPE.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":1933404,"ranking":3,"query_text":"what is the phone number to spe","passage_text":"Medical Definition of SPES PHTHISICA. : a state of euphoria occurring in patients with pulmonary tuberculosis. What made you want to look up spes phthisica?edical Definition of SPES PHTHISICA. : a state of euphoria occurring in patients with pulmonary tuberculosis. What made you want to look up spes phthisica?","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":888227,"ranking":4,"query_text":"what is the phone number to spe","passage_text":"What is important here is the distance between the sponsoring company and the SPE. In the absence of adequate distance between the sponsor and the new entity, the latter will not be an SPE but only a subsidiary company. A good SPE should be able to stand on its feet, independent of the sponsoring company.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":2061165,"ranking":5,"query_text":"what is the phone number to spe","passage_text":"What is SPE. Society of Petroleum Engineers (SPE) is the largest individual-member organization serving managers, engineers, scientists and other professionals worldwide in the upstream segment of the oil and gas industry. SPE offers a unique opportunity to contribute to the profession through its programs and activities.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":6949792,"ranking":6,"query_text":"what is the phone number to spe","passage_text":"Looking for the definition of SPE? Find out what is the full meaning of SPE on Abbreviations.com! 'Solid Phase Extraction' is one option -- get in to view more @ The Web's largest and most authoritative acronyms and abbreviations resource.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":640517,"ranking":7,"query_text":"what is the phone number to spe","passage_text":"What does MEDICAL CODe 81001 stand for? 81001 is a CPT pathology and laboratory code for: Urinalysis, by dip stick or tablet reagent for bilirubin, glucose, hemoglobin, ketones, leukocytes, nitrite, pH, protein, spe â\u0080¦ cific gravity, urobilinogen, any number of these constituents; automated, with microscopy.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":4961925,"ranking":8,"query_text":"what is the phone number to spe","passage_text":"What is Kappa: The meme has become a sort of patron saint of light hearted trolling among the gaming community. Users typing Kappa into Twitch chat see a spe... What is Kappa: The meme has become a sort of patron saint of light hearted trolling among the gaming community. Users typing Kappa into Twitch chat see a spe... Skip navigation","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":7210734,"ranking":9,"query_text":"what is the phone number to spe","passage_text":"To assure compatibility, simply match sizes across parts when ordering. For example, if 6 mL SPE cartridges are used, then 6 mL SPE accessories are needed, so part numbers 26012 (empty cartridge), 26018 (frits), 26003 (tube caps), and 26007 (connectors) are the correct items to choose. The empty tubes are just that","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":4830608,"ranking":10,"query_text":"what is the phone number to spe","passage_text":"Our History. In 1957, the organization was officially founded as SPE, a constituent society of the American Institute of Mining Engineers (AIME). SPE became a separately incorporated organization in 1985. Our Board of Directors The SPE Board of Directors is the policy-making and governing body of SPE. SPE board committees oversee many of SPE's administrative and operating responsibilities. The board retains final authority on all SPE matters, including any actions the board committees may take.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":1933402,"ranking":11,"query_text":"what is the phone number to spe","passage_text":"Spes. In ancient Roman religion, Spes was the goddess of hope. Multiple temples to Spes are known, and inscriptions indicate that she received private devotion as well as state cult.pes. In ancient Roman religion, Spes was the goddess of hope. Multiple temples to Spes are known, and inscriptions indicate that she received private devotion as well as state cult.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":2769487,"ranking":12,"query_text":"what is the phone number to spe","passage_text":"The purpose of any equity owner of an SPE mortgage borrower that itself is a SPE constituent. entity should be limited to owning the equity interests in the SPE mortgage borrower, while an SPE. depositor's purpose should be limited to depositing the mortgage loans into the trust that will issue the.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":4708014,"ranking":13,"query_text":"what is the phone number to spe","passage_text":"1 what is the phone number for customer service ... I want to pay my bill. 2  Re: what is the phone number for customer service ... I want to pay my bill. 3  Re: what is the phone number for customer service ... I want to pay my bill. 4  Re: what is the phone number for customer service ... I want to pay my bill. what is the phone number for customer service ... I want to pay my bill. what is the phone number for customer service ...","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":5221100,"ranking":14,"query_text":"what is the phone number to spe","passage_text":"What is dove number. Read more. Positive: 10 %. ... Dove Cameron phone number 2015, Dove Cameron phone number real, Dove Cameron phone number with proof, what is cameron boyce phone number ...","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":4190582,"ranking":15,"query_text":"what is the phone number to spe","passage_text":"What is dantdm`s phone number? 1  64% - What is dantdm`s phone number pls tell now pls pls? 2  73% - What is dantdm phone number so i can call him? 3  66% - What is dantdm`s phone number i want to know in one hour? 4  65% - What is dantdm phone number in viber?plz tell for me? 5  66% - Can i have dantdm`s email or phone number? 6  83% - What is dantdm`s phone 7  ... 75","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":1933400,"ranking":16,"query_text":"what is the phone number to spe","passage_text":"Meaning of Spes. Latin-American name. In Latin-American, the name Spes means-hope.The name Spes originated as an Latin-American name. The name Spes is most often used as a girl name or female name.Latin-American Name Meaning-hope.Origin-Latin-America. Global Star Registery-Name a star after someone special!atin-American name. In Latin-American, the name Spes means-hope.The name Spes originated as an Latin-American name. The name Spes is most often used as a girl name or female name. Latin-American Name Meaning-hope. Origin-Latin-America.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":4059861,"ranking":17,"query_text":"what is the phone number to spe","passage_text":"Best Answer: Short answer would be spes as a noun or sperare as a verb. Here's a long answer, though, in case you're interested. It depends on how you use it, of course. Latin has some pretty specific declensions. Spes, -ei f. is the noun. spes, spei, spem, spe, sperum, or spebus.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":1933401,"ranking":18,"query_text":"what is the phone number to spe","passage_text":"The name, Spes Unica, embodies the hopes and dreams for what will happen in this academic building. Spes Unica Hall is a tribute to the rich educational tradition begun by our founder. It represents a future that will see Saint Maryâ\u0080\u0099s ever more widely recognized for the excellent education of women.or all alumnae and for those who will use Spes Unica Hall there is a connection with the Sisters of the Holy Cross and a call from Saint Maryâ\u0080\u0099s College to be people of hope. 1  Educating heart, mind, and soulKelley gives back to the community all that Saint Maryâ\u0080\u0099s gives her Â».","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":6194790,"ranking":19,"query_text":"what is the phone number to spe","passage_text":"SPE may be owned by one or more other entities and certain jurisdictions may require ownership by certain parties in specific percentages. Often it is important that the SPE not to be owned by the entity on whose behalf the SPE is being set up.PE's are typically used by companies to isolate the firm from financial risk. A company will transfer assets to the SPE for management or use the SPE to finance a large project thereby achieving a narrow set of goals without putting the entire firm at risk.","bm25_label":"high","relevance_label":0.0},{"query_id":1034595,"passage_id":2769489,"ranking":20,"query_text":"what is the phone number to spe","passage_text":"The ability of an SPE to incur indebtedness, other than the indebtedness that is supporting the rated. securities, should be limited. The nature of this limitation will depend on the SPE's role in the transaction. For example, the SPE mortgage borrower's organizational documentation and the transaction.","bm25_label":"high","relevance_label":0.0}]