[{"query_id":1034839,"passage_id":7210144,"ranking":1,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"While it's commonly said as The proof is in the pudding, this is actually a corruption of the original expression, The proof of the pudding is in the eating. This is just a traditional proverb without any known original author, but it was popularized by Cervantes in Don Quixote, 1605.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":7210138,"ranking":2,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"Answers. 1  While it's commonly said as The proof is in the pudding, this is actually a corruption of the original expression, The proof of the pudding is in the eating.. This is just a traditional proverb without any known original author, but it was popularized by Cervantes in Don Quixote, 1605.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":7210141,"ranking":3,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"Asker's rating. 1  While it's commonly said as The proof is in the pudding, this is actually a corruption of the original expression, The proof of the pudding is in the eating.. This is just a traditional proverb without any known original author, but it was popularized by Cervantes in Don Quixote, 1605.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":582907,"ranking":4,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"In a commentary this week on Morning Edition, Frank Deford said the proof is in the pudding.. A listener wrote in to say that keeping proof in a pudding would be messy. The original proverb is: The proof of the pudding is in the eating. And what it meant was that you had to try out food to know whether it was good.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":7210143,"ranking":5,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"The HBO made-for-tv movie â\u0080\u009cGame Changeâ\u0080\u009d on Sarah Palin was very well doneâ\u0080¦ it really shows that the proof is in the pudding. Did someone really say that? Yes on NPRâ\u0080\u0099s On the Media segment. What does it mean? To fully test something you need to experience it yourself. Origin: The original expression was â\u0080\u009cthe proof of the pudding is in the eatingâ\u0080\u009d where the word â\u0080\u009cproofâ\u0080\u009d really means â\u0080\u009ctestâ\u0080\u009d (like in geometry class). Different sources suggest different dates for when this phrase came into existence: 14th century according to the Oxford Dictionary of Quotations.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":582914,"ranking":6,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"The original was the proof of the pudding is in the eating. It was shortened to the proof of the pudding, and then here in America, it morphed again to the proof is in the pudding. Apparently, the proof of the listening is in the correcting. (SOUNDBITE OF MUSIC). INSKEEP: This is NPR News.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":5426069,"ranking":7,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"The original phrase is The proof of the pudding is in the eating! Which means you have to eat the pudding to know what's inside of it. The modern version of The proof is in the pudding. Implies that there is a lot of evidence that I will not go through at this moment and you should take my word for it, or you could go through all of the evidence yourself.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":7210146,"ranking":8,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"Origin: The original expression was â\u0080\u009cthe proof of the pudding is in the eatingâ\u0080\u009d where the word â\u0080\u009cproofâ\u0080\u009d really means â\u0080\u009ctestâ\u0080\u009d (like in geometry class). Different sources suggest different dates for when this phrase came into existence: 1  14th century according to the Oxford Dictionary of Quotations. 2  1605 printed example â\u0080\u0093 William Camdenâ\u0080\u0099s Remaines of a Greater Worke Concerning Britaine: â\u0080\u009cAll the proof of a pudding is in the eatingâ\u0080\u009d.","bm25_label":"high","relevance_label":1.0},{"query_id":1034839,"passage_id":5426066,"ranking":9,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"The expression is The proof of the pudding is in the Eating ( or tasting). Proof in this sense means test. So what we want to say i â\u0080¦ n Latin is The test of the food is the taste, or something like Sapor cibi temptatio.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":7210139,"ranking":10,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"Origin: The original expression was â\u0080\u009cthe proof of the pudding is in the eatingâ\u0080\u009d where the word â\u0080\u009cproofâ\u0080\u009d really means â\u0080\u009ctestâ\u0080\u009d (like in geometry class). Different sources suggest different dates for when this phrase came into existence: 14 th century according to the Oxford Dictionary of Quotations","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":6089405,"ranking":11,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"Who first wrote or said The proof is in the pudding? It seems to have stuck, but it doesn't make sense or have the same meaning as the original quote The proof of the pudding is in the eating. Update: Thanks Maya, but that wasn't the question. Follow. 2 answers 2.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":6089400,"ranking":12,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"The full expression of this proverb, dating from about 1600, is The proof of the pudding is in the eating, but it has become so well known that it is often abbreviated. http:\/\/www.answers.com\/Proof%20of%20the%... http:\/\/www.word-detective.com\/081100.htm...","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":6089403,"ranking":13,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"It does not change the meaning of the original phrase either â\u0080\u009cthe proof of pudding is in the eatingâ\u0080\u009d. Either way the word proof means end result, and pudding is the final successful idea, product, etc.as you stated. I ended up here because no other google post had any merit and I wanted to confirm my use.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":7210140,"ranking":14,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"Add to that the concealed nature of pudding ingredients - whether in a blood pudding or one of the traditional sweet puddings full of dried fruit and nuts and enclosed in a dumpling crust - and the logic behind the expression becomes far less mysterious. Whatever its actual origins, we find the expression in print since the 17th century.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":7482843,"ranking":15,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"the proof of the pudding (is in the eating). the way to judge something is by its results Economic growth is the proof of the pudding for the president's tax and budget plans. See also: of, proof, pudding, the. 1  Facebook.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":582913,"ranking":16,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"The proof is in the pudding. INSKEEP: The proof is in the pudding, he said. Tim Lowe wrote us all the way from Santiago de Cali, Colombia, and he writes the following: Frank, the proof is not in the pudding. It would be a messy, if not completely silly place to keep it.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":5426067,"ranking":17,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"This is an old proverb that has been clipped down from the original phrase which was: The proof of the pudding is in the eating. It mean â\u0080¦ s that the true value or quality of something can only be judged when it's put to use or tried and tested (or tasted) and I don't mean instant pudding","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":582910,"ranking":18,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"the proof of the pudding (is in the eating). (Definition of the proof of the pudding (is in the eating) from the Cambridge Advanced Learnerâ\u0080\u0099s Dictionary & Thesaurus Â© Cambridge University Press).","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":6089401,"ranking":19,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"FRANK DEFORD: Maybe it still stings the purists that Richard's contrarian ways worked. The proof is in the pudding. INSKEEP: The proof is in the pudding, he said. Tim Lowe wrote us all the way from Santiago de Cali, Colombia, and he writes the following: Frank, the proof is not in the pudding. It would be a messy, if not completely silly place to keep it.","bm25_label":"high","relevance_label":0.0},{"query_id":1034839,"passage_id":6089402,"ranking":20,"query_text":"what is the origin of the expression the proof is in the pudding","passage_text":"Proverbs: The proof of the pudding is in the eating. The ultimate evidence attesting the true nature of something: The proof of the pudding is in the election results, not the polling. Jt is ywrite that euery thing Hymself sheweth in the tastyng.","bm25_label":"high","relevance_label":0.0}]