[{"query_id":1034409,"passage_id":7210998,"ranking":1,"query_text":"what is the population of coos bay","passage_text":"The unemployment rate in Coos Bay is 6.60 percent(U.S. avg. is 5.20%). Recent job growth is Positive. Coos Bay jobs have Increased by 0.96 percent. Compared to the rest of the country, Coos Bay's cost of living is 1.10% Higher than the U.S. average. population As of 2014, Coos Bay's population is 16,182 people. Since 2000, it has had a population growth of 7.34 percent.","bm25_label":"high","relevance_label":1.0},{"query_id":1034409,"passage_id":7210995,"ranking":2,"query_text":"what is the population of coos bay","passage_text":"Coos Bay, Oregon. Coos Bay (Coos language: Atsixiis) is a city located in Coos County, Oregon, United States, where the Coos River enters Coos Bay on the Pacific Ocean. The city borders the city of North Bend, and together they are often referred to as one entity called either Coos Bay-North Bend or the Bay Area. Coos Bay's population as of the 2010 census was 15,967 residents, making it the largest city on the Oregon Coast.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":218387,"ranking":3,"query_text":"what is the population of coos bay","passage_text":"Coos Bay (Coos language: Atsixiis) is a city located in Coos County, Oregon, United States, where the Coos River enters Coos Bay on the Pacific Ocean. The city borders the city of North Bend, and together they are often referred to as one entity called either Coos Bay-North Bend or the Bay Area. Coos Bay's population as of the 2010 census was 15,967 residents, making it the largest city on the Oregon Coast.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":4771856,"ranking":4,"query_text":"what is the population of coos bay","passage_text":"Coos Bay was established in the 1850â\u0080\u0099s as Marshfield, but changed its name to Coos Bay in 1944. Yearâ\u0080\u0099s later, the citiesâ\u0080\u0099 of Empire and Eastside merged with Coos Bay. Coos Bay is the largest city on the Oregon Coast with a current population of 15,470 and also the birthplace of legendary runner Steve Prefontaine.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":1458265,"ranking":5,"query_text":"what is the population of coos bay","passage_text":"Sponsored Topics. North Bend is a city in Coos County, Oregon, in the United States with an estimated population is 9,855 (as of 2010). North Bend is surrounded on three sides by Coos Bay, an S-shaped water inlet and estuary where the Coos River enters Coos Bay on the Pacific Ocean, and borders the city of Coos Bay, Oregon to the south.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":2917739,"ranking":6,"query_text":"what is the population of coos bay","passage_text":"North Bend is a city in Coos County, Oregon, United States with a population of 9,695 as of the 2010 census. North Bend is surrounded on three sides by Coos Bay, an S-shaped water inlet and estuary where the Coos River enters Coos Bay and borders the city of Coos Bay to the south. North Bend became an incorporated city in 1903.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":7055864,"ranking":7,"query_text":"what is the population of coos bay","passage_text":"North Bend, Oregon. Not to be confused with Bend, Oregon. North Bend is a city in Coos County, Oregon, United States with a population of 9,695 as of the 2010 census. North Bend is surrounded on three sides by Coos Bay, an S-shaped water inlet and estuary where the Coos River enters Coos Bay and borders the city of Coos Bay to the south.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":1458268,"ranking":8,"query_text":"what is the population of coos bay","passage_text":"Not to be confused with Bend, Oregon. North Bend is a city in Coos County, Oregon, United States with a population of 9,695 as of the 2010 census. North Bend is surrounded on three sides by Coos Bay, an S-shaped water inlet and estuary where the Coos River enters Coos Bay and borders the city of Coos Bay to the south. North Bend became an incorporated city in 1903.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":4037885,"ranking":9,"query_text":"what is the population of coos bay","passage_text":"Sponsored Topics. North Bend is a city in Coos County, Oregon, in the United States with an estimated population is 9,855 (as of 2010). North Bend is surrounded on three sides by Coos Bay, an S-shaped water inlet and estuary where the Coos River enters Coos Bay on the Pacific Ocean, and borders the city of Coos Bay, Oregon to the south. North Bend became an incorporated city in 1903.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":7210990,"ranking":10,"query_text":"what is the population of coos bay","passage_text":"QuickFacts selected: Coos Bay city, Oregon. QuickFacts provides statistics for all states and counties, and for cities and towns with a population of 5,000 or more.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":7210993,"ranking":11,"query_text":"what is the population of coos bay","passage_text":"QuickFacts selected: Coos Bay city, Oregon QuickFacts provides statistics for all states and counties, and for cities and towns with a population of 5,000 or more.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":7210997,"ranking":12,"query_text":"what is the population of coos bay","passage_text":"Compare population statistics about Coos Bay, OR from the 2010 and 2000 census by race, age, gender, Latino\/Hispanic origin etc.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":6821552,"ranking":13,"query_text":"what is the population of coos bay","passage_text":"Annual Weather Averages Near Coos Bay. Averages are for North Bend Weather Reporting Station, which is 4 miles from Coos Bay. All Year Climate & Weather Averages in Coos Bay. January Climate & Weather Averages in Coos Bay.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":4771853,"ranking":14,"query_text":"what is the population of coos bay","passage_text":"With hotels.com we help you find the best hotels in Coos Bay, Oregon. You can compare all of our Coos Bay hotel rooms including the major Coos Bay hotel chains using our genuine Hotels.com guest reviews as well as TripAdvisor Coos Bay hotel reviews to help find the perfect hotel room when booking your accommodation in Coos Bay. We also feature Expedia Coos Bay hotels and reviews.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":218392,"ranking":15,"query_text":"what is the population of coos bay","passage_text":"Coos Bay is represented in the United States House by Peter Defazio (D-Springfield) and in the Oregon Legislature by State Senator Arnie Roblan (D-Coos Bay) and State Representative Caddy McKeown (D-Coos Bay).","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":6821550,"ranking":16,"query_text":"what is the population of coos bay","passage_text":"The most monthly precipitation in Coos Bay occurs in December with 10.1 inches. The air quality index in Coos Bay is 79% better than the national average. The pollution index in Coos Bay is 35% better than the national average.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":2208492,"ranking":17,"query_text":"what is the population of coos bay","passage_text":"Get jobs by email for this search. Coos Bay, OR Employment Information. If youâ\u0080\u0099re ready for a new and challenging job, take a look at our wide range of Coos Bay, Oregon jobs. Whatever type of job in Coos Bay youâ\u0080\u0099re seeking, you can find it on Monster. View our listings of Coos Bay job opportunities and find your perfect fit today.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":4771857,"ranking":18,"query_text":"what is the population of coos bay","passage_text":"Welcome To Coos Bay. Coos Bay is a great place to live, work and play surrounded by a beautiful protected bay, lush emerald forests and the mighty Pacific Ocean. Historically known as Marshfield, Coos Bay celebrates a history in shipbuilding and lumber products while serving as the regional hub for Oregon's south coast.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":2208487,"ranking":19,"query_text":"what is the population of coos bay","passage_text":"Coos Bay Sheriff. Find Coos Bay Oregon sheriff's office, department, headquarters, jail and detention center. Sheriffs provide information on records, arrests, inmates, warrants, and mugshots. Name. Coos County Sheriff's Office.","bm25_label":"high","relevance_label":0.0},{"query_id":1034409,"passage_id":6930071,"ranking":20,"query_text":"what is the population of coos bay","passage_text":"Coos Bay, OR 97420. Thank you for your interest in Coos Bay School District. To view job postings and apply for a position, please visit https:\/\/coosbay.schoolrecruiter.net\/Index.aspx.","bm25_label":"high","relevance_label":0.0}]