[{"query_id":1035719,"passage_id":8108954,"ranking":1,"query_text":"airplane definition of drag","passage_text":"This slide gives technical definitions of a wing's geometry, which is one of the chief factors affecting airplane lift and drag. The terminology used here is used throughout the airplane industry today and was mostly known to the Wright brothers in 1900.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":49562,"ranking":2,"query_text":"airplane definition of drag","passage_text":"If you have a light airplane with more drag and a heavy airplane with less drag, the heavy airplane can fly much more easily. This is because the heavier airplane has less drag as well as more momentum to push through the air.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":7741143,"ranking":3,"query_text":"airplane definition of drag","passage_text":"+ Contact Glenn. This slide gives technical definitions of a wing's geometry, which is one of the chief factors affecting airplane lift and drag. The terminology is used throughout the airplane industry and is also found in the FoilSim interactive airfoil simulation program developed here at NASA Glenn.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":6907132,"ranking":4,"query_text":"airplane definition of drag","passage_text":"An aircraft propulsion system must achieve two things. First, the thrust from the propulsion system must balance the drag of the airplane when the airplane is cruising. And second, the thrust from the propulsion system must exceed the drag of the airplane for the airplane to accelerate. In fact, the greater the difference between the thrust and the drag, called the excess thrust, the faster the airplane will accelerate.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":3350736,"ranking":5,"query_text":"airplane definition of drag","passage_text":"+ Contact Glenn. This slide gives technical definitions of a wing's geometry, which is one of the chief factors affecting airplane lift and drag. The terminology is used throughout the airplane industry and is also found in the FoilSim interactive airfoil simulation program developed here at NASA Glenn. Actual aircraft wings are complex three-dimensional objects, but we will start with some simple definitions.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":7704681,"ranking":6,"query_text":"airplane definition of drag","passage_text":"An aircraft propulsion system must achieve two things. First, the thrust from the propulsion system must balance the drag of the airplane when the airplane is cruising. And second, the thrust from the propulsion system must exceed the drag of the airplane for the airplane to accelerate.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":8288523,"ranking":7,"query_text":"airplane definition of drag","passage_text":"Does the wing of a paper airplane affect the speed of a paper airplane? Yes and no.    The speed of an airplane is determined by how hard you throw it.  After you throw it, the plane will slow down because of drag. The  more drag a plane â\u0080¦has, the faster it will slow down.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":4285175,"ranking":8,"query_text":"airplane definition of drag","passage_text":"How Airplanes Fly. Airplanes fly because they are able to generate a force called Lift which normally moves the airplane upward. Lift is generated by the forward motion of the airplane through the air. This motion is produced by the Thrust of the engine(s).The figure below is a simple diagram of the four forces acting on an airplane Thrust, Lift, Drag and Weight.Drag is the force produced by the resistance of the air to the forward motion of the airplane. Swish your hand rapidly side-to-side and you will feel that resistance on your hand.his motion is produced by the Thrust of the engine(s). The figure below is a simple diagram of the four forces acting on an airplane Thrust, Lift, Drag and Weight. Drag is the force produced by the resistance of the air to the forward motion of the airplane.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":7208603,"ranking":9,"query_text":"airplane definition of drag","passage_text":"We can conclude that drag reduction is the single best way to get additional speed from a certain design, and the faster the airplane, the more important each little improvement becomes. Forms of drag. In flight, any airplane produces drag. This total drag is a combination, or the sum of induced drag (as a result of lift produced by the wing) and parasite drag. Note that: when an aircraft increases speed, induced drag becomes less (due to a lower angle of attack) and parasite drag increases. Induced drag","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":3626966,"ranking":10,"query_text":"airplane definition of drag","passage_text":"Vocabulary\/Definitions. 1  Acceleration: A change in direction, or speeding up or slowing down. 2  Aeronautical engineer: A person who studies the forces involved in flight. 3  Drag: The force that slows an airplane or parachute down. 4  Force: Something that acts from the outside to push or pull an object. For example, an adult pulling a child in a wagon exerts a force upon the wagon. Lift: The force that pushes an airplane up into the air. Lift is caused by the shape of an airplane's wings.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":7208597,"ranking":11,"query_text":"airplane definition of drag","passage_text":"Drag is the aerodynamic force that opposes an aircraft's motion through the air. Drag is generated by every part of the airplane (even the engines! How is drag generated?","bm25_label":"high","relevance_label":1.0},{"query_id":1035719,"passage_id":6432033,"ranking":12,"query_text":"airplane definition of drag","passage_text":"This page is intended for college, high school, or middle school students. For younger students, a simpler explanation of the information on this page is available on the Kid's Page. This slide gives technical definitions of a wing's geometry, which is one of the chief factors affecting airplane lift and drag. The terminology is used throughout the airplane industry and is also found in the FoilSim interactive airfoil simulation program developed here at NASA Glenn.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":6136155,"ranking":13,"query_text":"airplane definition of drag","passage_text":"What makes airplanes fly are the four forces of flight, thrust, provided by the engines, propelling the airplane forward, lift pulling the airplane up, drag pulling the airplane back, and weight, or gravity pulling the airplane down. How much an airplane weighs, depends on the plane.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":2866124,"ranking":14,"query_text":"airplane definition of drag","passage_text":"The figure below is a simple diagram of the four forces acting on an airplane  Thrust, Lift , Drag and Weight. Drag is the force produced by the resistance of the air to the forward motion of the airplane. Swish your hand rapidly side-to-side and you will feel that resistance on your hand.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":7744798,"ranking":15,"query_text":"airplane definition of drag","passage_text":"An airplane in flight is always in the middle of a tug-of-war with the four forces. For an airplane to takeoff, thrust must be greater than drag and lift must be greater than weight. To maintain level flight, lift must equal weight and thrust must equal drag. For landing, thrust must be less than drag, and lift must be less than weight.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":6366131,"ranking":16,"query_text":"airplane definition of drag","passage_text":"So for airplanes to fly and stay airborne, the thrust must be greater than the drag and the lift must be greater than the weight (so as you can see, drag opposes thrust and lift opposes weight). This is certainly the case when an airplane takes off or climbs.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":1392370,"ranking":17,"query_text":"airplane definition of drag","passage_text":"Review the four forces that affect flight and discuss how they cause an airplane to fall, rise, slow down, or speed up. Discuss how drag can slow an airplane down. Ask students if the drag on an object will increase if the surface area is increased or the object speeds up.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":1392375,"ranking":18,"query_text":"airplane definition of drag","passage_text":"This lesson explores the drag force on airplanes. The students will be introduced to the concept of conservation of energy and how it relates to drag. Students will explore the relationship between drag and the shape, speed and size of an object.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":2818465,"ranking":19,"query_text":"airplane definition of drag","passage_text":"Modern airliners use winglets on the tips of the wings to reduce drag. The turbine engines, which are located beneath the wings, provide the thrust to overcome drag and push the airplane forward through the air. Smaller, low-speed airplanes use propellers for the propulsion system instead of turbine engines.","bm25_label":"high","relevance_label":0.0},{"query_id":1035719,"passage_id":6883559,"ranking":20,"query_text":"airplane definition of drag","passage_text":"Weight has a definite relationship with lift, and thrust with drag. This relationship is simple, but important in understanding the aerodynamics of flying. Lift is the upward force on the wing acting perpendicular to the relative wind. Lift is required to counteract the airplaneâ\u0080\u0099s weight (which is caused by the force of gravity acting on the mass of the airplane).","bm25_label":"high","relevance_label":0.0}]