[{"query_id":1036656,"passage_id":1250685,"ranking":1,"query_text":"what is the meaning of chicken rice?","passage_text":"Oyako means-mother and child, so goes to say, chicken and egg. Donburi means-rice bowl. So the dish literally means chicken and eggs in a bowl, served over hot rice. The photo is not my own but to give you an idea of what is looks like.It's a bit much as you cannot see the hot rice below.onburi means-rice bowl. So the dish literally means chicken and eggs in a bowl, served over hot rice. The photo is not my own but to give you an idea of what is looks like. It's a bit much as you cannot see the hot rice below.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":5351705,"ranking":2,"query_text":"what is the meaning of chicken rice?","passage_text":"Oyako means-mother and child, so goes to say, chicken and egg. Donburi means-rice bowl. So the dish literally means chicken and eggs in a bowl, served over hot rice. The photo is not my own but to give you an idea of what is looks like.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":7207006,"ranking":3,"query_text":"what is the meaning of chicken rice?","passage_text":"Definitions for chicken and rice. Here are all the possible meanings and translations of the word chicken and rice. Princeton's WordNet (0.00 \/ 0 votes) Rate this definition: chicken and rice (noun)","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":8723709,"ranking":4,"query_text":"what is the meaning of chicken rice?","passage_text":"Best Answer: Actually, just regular white rice and boiled chicken, and the lo-fat yogurt is what you want. The vet has put the dog on a bland diet which means no grease, seasonings, and no red meat. Skin the chicken , and give the white rice plain. Good luck getting her to eat it.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":8723703,"ranking":5,"query_text":"what is the meaning of chicken rice?","passage_text":"Best Answer: Actually, just regular white rice and boiled chicken, and the lo-fat yogurt is what you want. The vet has put the dog on a bland diet which means no ...","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":8723704,"ranking":6,"query_text":"what is the meaning of chicken rice?","passage_text":"What kind of rice should I feed my dog? Okay so I took my pug to the vet because she had diareha and the vet said for me to feed her chicken, rice & low-fat yogurt for 3 days. I was wondering what kind of rice & do i grill the chicken or boil it?","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":1997741,"ranking":7,"query_text":"what is the meaning of chicken rice?","passage_text":"To cook rice in a rice cooker: Pour aromatics and rice (after frying) into your rice cooker, add 2 1\/2 cups of your reserved poaching broth and salt. Follow the instructions for your model (usually this will just mean turn it on!).hile your rice is cooking, remove the chicken from the ice bath and rub the outside of the chicken with the sesame oil. Carve the chicken for serving. 5. To make the chili sauce: Blend your chili sauce ingredients in a blender until smooth and bright red. 6.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":1997743,"ranking":8,"query_text":"what is the meaning of chicken rice?","passage_text":"To cook rice in a rice cooker: Pour aromatics and rice (after frying) into your rice cooker, add 2 1\/2 cups of your reserved poaching broth and salt. Follow the instructions for your model (usually this will just mean turn it on!) 4.hile your rice is cooking, remove the chicken from the ice bath and rub the outside of the chicken with the sesame oil. Carve the chicken for serving. 5. To make the chili sauce: Blend your chili sauce ingredients in a blender until smooth and bright red. 6.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":7207007,"ranking":9,"query_text":"what is the meaning of chicken rice?","passage_text":"It is an Indian dish that includes rice and either lamb, chicken, fish, and vegetables along with spices like saffron. What is biryani? It is an Indian dish that includes rice and either lamb, chicken, fish, and vegetables along with spices like saffron.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":7207005,"ranking":10,"query_text":"what is the meaning of chicken rice?","passage_text":"Hainanese chicken rice is a common dish in Thailand where it is called khao man kai (Thai: à¸\u0082à¹\u0089à¸²à¸§à¸¡à¸±à¸\u0099à¹\u0084à¸\u0081à¹\u0088), literally meaning chicken-oil rice. The chickens used in Thailand for this dish can be free range chickens of local breeds, resulting in a leaner and tastier dish, but increasingly meat chickens from large scale poultry farms are being used.","bm25_label":"high","relevance_label":1.0},{"query_id":1036656,"passage_id":1997742,"ranking":11,"query_text":"what is the meaning of chicken rice?","passage_text":"Remove from heat and let sit (with lid still on) for 5-10 minutes more. To cook rice in a rice cooker: Pour aromatics and rice (after frying) into your rice cooker, add 2 1\/2 cups of your reserved poaching broth and salt. Follow the instructions for your model (usually this will just mean turn it on!). 4.hile your rice is cooking, remove the chicken from the ice bath and rub the outside of the chicken with the sesame oil. Carve the chicken for serving. 5. To make the chili sauce: Blend your chili sauce ingredients in a blender until smooth and bright red. 6.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":122525,"ranking":12,"query_text":"what is the meaning of chicken rice?","passage_text":"Florida-Style Arroz Con Pollo. Arroz con Pollo. This is a classic Spanish-style chicken and rice recipe made with chicken parts, rice, saffron, garlic, and other vegetables and seasonings. The recipe is a classic in many Latin American countries, and it is a popular dish in Florida. What You'll Need.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":1698522,"ranking":13,"query_text":"what is the meaning of chicken rice?","passage_text":"What it is: A thick and creamy rice soup or porridge. Why it's awesome: Comfort food at its finest. Rice is simmered with spices and aromatics (and in this case, chicken), then topped with spring onions and fried garlic for extra crunch.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":7484678,"ranking":14,"query_text":"what is the meaning of chicken rice?","passage_text":"Orange Peel Chicken, without rice; Orange Peel Shrimp, without rice; Pepper Steak, without rice; Philip's Better Lemon Chicken, without rice; Pork Fried Rice; Salt & Pepper Prawns, without rice; Sesame Chicken, without rice; Shanghai Shrimp, with Garlic Sauce, without rice; Shrimp Fried Rice; Shrimp, with Candied Walnuts, without rice","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":1162915,"ranking":15,"query_text":"what is the meaning of chicken rice?","passage_text":"In Liberia, rice is the staple. So, most dinners include rice with a sauce like this palm butter. In much of Africa, dinner usually means rice topped with an elaborate sauce. But sometimes it's just lightly seasoned, and easily prepared, chicken, beef, pork, or seafood on rice with HOT pepper. Liberia is on the Atlantic so FISH is a big thing.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":7484673,"ranking":16,"query_text":"what is the meaning of chicken rice?","passage_text":"Caramel Mango Chicken Lunch, with White Rice; Crispy Honey Chicken Lunch, with White Rice; Crispy Honey Shrimp Lunch, with White Rice; Dali Chicken Lunch, with White Rice; Edamame Steamed Dumplings Dim Sum Lunch, without sauce; Ginger Chicken Lunch, with Broccoli & White Rice; Gluten Free Beef A La Sichuan Combo Lunch, with White Rice","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":8177709,"ranking":17,"query_text":"what is the meaning of chicken rice?","passage_text":"The following is a list of what to feed a sick dog, foods found in your home that are pet-friendly to help your dog recover from feeling unwell. Chicken and Rice. These are mild foods, primary ingredients in lots of dog foods. The combination will soothe an upset stomach. All you need is boneless and skinless chicken with plain rice.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":5351696,"ranking":18,"query_text":"what is the meaning of chicken rice?","passage_text":"Oyakodon. Oyako donburi (è¦ªå­\u0090ä¸¼), which literally means â\u0080\u009cparent child bowlâ\u0080\u009d is a popular chicken and egg rice bowl in Japan. Itâ\u0080\u0099s a simple one bowl meal with flavorful chunks of chicken wrapped in a custardy blanket of eggs, all seasoned with a mild dashi broth that tickles down onto the steamy bed of rice below.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":4048279,"ranking":19,"query_text":"what is the meaning of chicken rice?","passage_text":"Calories From Carbohydrates. MedlinePlus reports that each g of carbohydrates has four calories. Due to the rice and the teriyaki sauce, teriyaki chicken rice bowls are relatively high in carbohydrates with more than 76 g. This means that every rice bowl has more than 305 calories from carbs.","bm25_label":"high","relevance_label":0.0},{"query_id":1036656,"passage_id":8038225,"ranking":20,"query_text":"what is the meaning of chicken rice?","passage_text":"Calories in Chicken Helper - Chicken Fried Rice (made with canned chicken) View the full Chicken Helper - Chicken Fried Rice (made with canned chicken) Recipe & Instructions. Submitted by: CORINA-MOMOF4.","bm25_label":"high","relevance_label":0.0}]