[{"query_id":1039361,"passage_id":7837686,"ranking":1,"query_text":"who is the author of soccerland","passage_text":"Soccerland by Beth Choat tells the story of Flora a young soccer player who gets a change to go to the international sports facility and go to a camp where they pick the girls that have a chance to play on the under fifteen US soccer team.","bm25_label":"high","relevance_label":1.0},{"query_id":1039361,"passage_id":7837685,"ranking":2,"query_text":"who is the author of soccerland","passage_text":"Beth Choat Soccerland is about a teenage girl named Flora who is a starting center forward on her high school soccer team. She is so good that she is asked to tryout for the Girl's National Team, so she goes to a camp where the tryouts are.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":7837681,"ranking":3,"query_text":"who is the author of soccerland","passage_text":"Soccerland , a novel by Beth Choat, is about a girl named Flora Dupre who is invited to play for the Under-15 US National Team at the International Sports Academy. Once she arrives at the International Sports Academy, also known as the ISA, she realizes how much better the players are at the ISA.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":7837677,"ranking":4,"query_text":"who is the author of soccerland","passage_text":"Soccerland is a book all about fitting in and of course, soccer. Flora, the main character, is very passionate about soccer. Especially, because it was her mom's dream.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":2257303,"ranking":5,"query_text":"who is the author of soccerland","passage_text":"The copyright in a work of authorship immediately becomes the property of the author who created it at the moment it is put into fixed form. No one but the author can claim copyright to the work, unless the author grants rights to others in a written agreement (such as to the author's publisher or record company). Usually, you can tell who the author of a work is -- the person who created it.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":2155344,"ranking":6,"query_text":"who is the author of soccerland","passage_text":"Define author. author synonyms, author pronunciation, author translation, English dictionary definition of author. n. 1. a. The writer of a book, article, or other text. b. One who practices writing as a profession. 2. One who writes or constructs an electronic document...","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":3909182,"ranking":7,"query_text":"who is the author of soccerland","passage_text":"No one but the author can claim copyright to the work, unless the author grants rights to others in a written agreement (such as to the author's publisher or record company). Usually, you can tell who the author of a work is -- the person who created it.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":1639234,"ranking":8,"query_text":"who is the author of soccerland","passage_text":"Authorized Signatory is an individual who is authorized to execute a binding document on behalf of a corporation, partnership or other legal entity.lossary: authorized signatory. Authorized Signatory is an individual who is authorized to execute a binding document on behalf of a corporation, partnership or other legal entity. Click here for more authorized signatory \/ Dictionary of Factoring Terms.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":1979823,"ranking":9,"query_text":"who is the author of soccerland","passage_text":"There are those who are cautious about binding territorial spirits but who hold out that sometimes conditions are right and then those in authority can exercise authority over territorial spirits.They state (I believe wrongly) that under certain conditions the Body of Christ is given authority over territorial spirits.here are those who are cautious about binding territorial spirits but who hold out that sometimes conditions are right and then those in authority can exercise authority over territorial spirits.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":1639236,"ranking":10,"query_text":"who is the author of soccerland","passage_text":"Glossary: authorized signatory. Authorized Signatory is an individual who is authorized to execute a binding document on behalf of a corporation, partnership or other legal entity. Click here for more authorized signatory \/ Dictionary of Factoring Terms.lossary: authorized signatory. Authorized Signatory is an individual who is authorized to execute a binding document on behalf of a corporation, partnership or other legal entity. Click here for more authorized signatory \/ Dictionary of Factoring Terms.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":4479941,"ranking":11,"query_text":"who is the author of soccerland","passage_text":"civil authority - a person who exercises authority over civilian affairs. civil officer. authority - (usually plural) persons who exercise (administrative) control over others; the authorities have issued a curfew. city manager, mayor - the head of a city government.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":4506448,"ranking":12,"query_text":"who is the author of soccerland","passage_text":"As the name suggests, employment authorization card (EAD) authorizes the person to work in the United States. It is also known as form I-766. Name: Name of the cardholder who is authorized employment. A#: Alien number. Anyone who is authorized to work in the U.S. will have A number.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":7573212,"ranking":13,"query_text":"who is the author of soccerland","passage_text":"When a large multi-author group has conducted the work, the group ideally should decide who will be an author before the work is started and confirm who is an author before submitting the manuscript for publication.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":5771676,"ranking":14,"query_text":"who is the author of soccerland","passage_text":"1 Contact person. 2  Who can be a contact person, adding or changing the name of a contact person (Form RC1). 3  Authorizing a business representative. 4  Who can be a representative, authorization level, online and written authorization (Form RC59), business taxpayer responsibilities, and managing your account. Contact person. 2  Who can be a contact person, adding or changing the name of a contact person (Form RC1). 3  Authorizing a business representative. 4  Who can be a representative, authorization level, online and written authorization (Form RC59), business taxpayer responsibilities, and managing your account.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":8134622,"ranking":15,"query_text":"who is the author of soccerland","passage_text":"Foreign workers are a prescribed class of persons who may obtain temporary resident status and who have been issued work permits or who are authorized by the Regulations to work. A work permit is a written authorization issued to foreign nationals authorizing them to engage in work in Canada.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":8134628,"ranking":16,"query_text":"who is the author of soccerland","passage_text":"Foreign students are now a prescribed class of persons who may obtain temporary resident status and who have been issued study permits or who are authorized by the Regulations to study. A study permit is a written authorization issued to foreign nationals authorizing them to engage in studies in Canada.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":2030624,"ranking":17,"query_text":"who is the author of soccerland","passage_text":"Author\/Artist Review. I'm the author\/artist and I want to review Who I Am Ain't Who I Was [Music Download].","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":4032510,"ranking":18,"query_text":"who is the author of soccerland","passage_text":"The truth is a lesson, and the author is a teacher who teaches that lesson to his or her pupil, who is the reader. The author is a great educator, who leads the reader through life. The author is the enlightened intellectual whom the society shall follow. The work of literature can make us better men and women.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":1958086,"ranking":19,"query_text":"who is the author of soccerland","passage_text":"The author of a work is responsible for its creation. Normally, the author is the person who actually creates the authorship being claimed. The only exception occurs when authorship is created as a work made for hire.In this case, the employer is considered the author, not the employee who created the authorship.he author of a work is responsible for its creation. Normally, the author is the person who actually creates the authorship being claimed. The only exception occurs when authorship is created as a work made for hire.","bm25_label":"high","relevance_label":0.0},{"query_id":1039361,"passage_id":1639238,"ranking":20,"query_text":"who is the author of soccerland","passage_text":"Contracts can be approved and signed by individuals who are not designated as â\u0080\u009cAuthorized Signatoriesâ\u0080\u009d in the preceding section only if, and to the extent, they have been given written authority to do so by an Authorized Signatory who is also their Division Head or Department Manager or Chair.f the individual who approved and signed the original is other than an Authorized Signatory listed above, the individual can approve and sign the renewals, extensions, amendments and modifications only if and to the extent their written delegation memo clearly gives them such authority.","bm25_label":"high","relevance_label":0.0}]