[{"query_id":1039495,"passage_id":2628915,"ranking":1,"query_text":"who is the boss of google?","passage_text":"On that principle, seven-year-old Chloe Bridgewater, who lives in Hereford, UK, wrote a letter to Google asking for a job. After seeing images of Google offices with their bean bags, go-karts and slides, my 7-year-old daughter decided to write to Google to see if they would give her a job, Andy Bridgewater wrote on LinkedIn. Bridgewater provided CNBC with the original letter, addressed to google boss:","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":7856346,"ranking":2,"query_text":"who is the boss of google?","passage_text":"Sundar Pichai: Google's new boss from humble roots. With Google creating its own parent company, Alphabet, there's a bit of moving about in the Google boardroom. Larry Page is now chief executive of Alphabet. Sergey Brin is its president. And moving up to be in charge of Google is 43-year-old Sundar Pichai.","bm25_label":"high","relevance_label":1.0},{"query_id":1039495,"passage_id":8127092,"ranking":3,"query_text":"who is the boss of google?","passage_text":"â\u0080\u0098James is one of the bosses at a certain media institution; you can google him.â\u0080\u0099 â\u0080\u0098Three or so years ago I googled him, and there it was on the internet.â\u0080\u0099 â\u0080\u0098But I was intrigued by Dan's comment, so I googled him, as you do, and had a look at some of the things he's written.â\u0080\u0099","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":3753418,"ranking":4,"query_text":"who is the boss of google?","passage_text":"Definition of boss. 1  1 : a person who exercises control or authority union bosses a mafia boss; specifically : one who directs or supervises workers asking your boss for a raise. 2  2 politics : one who controls votes in a party organization or dictates appointments or legislative measures standing up to the party bosses.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":5771763,"ranking":5,"query_text":"who is the boss of google?","passage_text":"noun. The definition of a sycophant is a person who tries to gain attention by flattering wealthy or influential people.An example of a sycophant is someone who agrees with everything his boss says and who brings his boss gifts once a month.n example of a sycophant is someone who agrees with everything his boss says and who brings his boss gifts once a month.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":6603456,"ranking":6,"query_text":"who is the boss of google?","passage_text":"Spencer Platt\/Google Google HR boss Laszlo Bock says you should pay employees what they're worth, not for the job they do. In the years following its 2004 IPO, Google needed a way to continue its impressive growth without losing its best people to hot startups like Facebook and Twitter.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":5771764,"ranking":7,"query_text":"who is the boss of google?","passage_text":"LINK \/ CITE ADD TO WORD LIST. noun. The definition of a sycophant is a person who tries to gain attention by flattering wealthy or influential people. An example of a sycophant is someone who agrees with everything his boss says and who brings his boss gifts once a month.n example of a sycophant is someone who agrees with everything his boss says and who brings his boss gifts once a month.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":6603457,"ranking":8,"query_text":"who is the boss of google?","passage_text":"Follow Business Insider: Spencer Platt\/Google Google HR boss Laszlo Bock says you should pay employees what they're worth, not for the job they do. In the years following its 2004 IPO, Google needed a way to continue its impressive growth without losing its best people to hot startups like Facebook and Twitter.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":4120733,"ranking":9,"query_text":"who is the boss of google?","passage_text":"Control. When you work from home your boss can't call you into his office on a whim. And letâ\u0080\u0099s be honest, many bosses, especially ones who have held positions of power for decades, love to do this. When bosses bloviate, employees get reminded who is running the show.Appearance.hen you work from home your boss can't call you into his office on a whim. And letâ\u0080\u0099s be honest, many bosses, especially ones who have held positions of power for decades, love to do this. When bosses bloviate, employees get reminded who is running the show. Appearance.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":3758762,"ranking":10,"query_text":"who is the boss of google?","passage_text":"boss definition, meaning, what is boss: the person who is in charge of an organization and who tells others what to do: . Learn more.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":7161595,"ranking":11,"query_text":"who is the boss of google?","passage_text":"The term straw boss comes from the Industrial. revolution times and refers to someone who was an assistant to the head boss, but ordered workers about as if he was the top person in charge. Another idea is that a straw boss was a mill worker who supervised the workers who took the straw out of the thresher. It can be used in a negative way to refer to a mean, arrogant boss. Vote for this answer. A straw boss vs. a straw stuffed figure -- No real power of his own, but set up to look impressive.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":1961730,"ranking":12,"query_text":"who is the boss of google?","passage_text":"Step 1:Open Internet Explorer. Step2: Visit Google.com\/chrome and install Chrome. Step 3: Do a Google search on chrome for YouTube adblock extension and click on the first organic search result. Step 4: Install the extension. Step 5: Use YouTube on Google Chrome, Like a boss.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":4315698,"ranking":13,"query_text":"who is the boss of google?","passage_text":"The work life balance can be different depending on who your boss is (in 224 reviews) There is no getting around the fact that Google is a big company now (in 193 reviews) Nearly everyone is an over-achiever so there can be pressure to work long hours (in 115 reviews) Same politics as any other large company (in 112 reviews) Very low chance of conversion from contract to full-time (in 95 reviews)","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":7335923,"ranking":14,"query_text":"who is the boss of google?","passage_text":"Google boss breaks Felix Baumgartner's parachute record in secret 135,000 foot jump from the edge of space. One of Google's most senior executive's has broken Felix Baumgartner's record for the highest parachute jump in history. Alan Eustace, 57, a senior vice president of Knowledge at Google, was this morning lifted by a balloon filled with 35,000 cubic feet of helium, from an abandoned runway at an airport in New Mexico.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":6722781,"ranking":15,"query_text":"who is the boss of google?","passage_text":"In a matrix, as well as with many of todayâ\u0080\u0099s teams, there are at least two sets of roles that are important to define: the matrix leader who is reporting to at least two bosses (one is the functional boss â\u0080\u0093 the boss to whom he\/she ordinarily reports to, and the other is the matrix boss), and the two bosses themselves.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":3713806,"ranking":16,"query_text":"who is the boss of google?","passage_text":"If you know your boss is going to be a bad reference, seek out someone else in the company to provide a reference for you. If the boss who fired you was not always your boss, list a previous boss, even if that person is no longer with the company.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":4765591,"ranking":17,"query_text":"who is the boss of google?","passage_text":"'The Boss Baby' star Alec Baldwin on who's boss at home. 'The Boss Baby' star Alec Baldwin says he was the 'boss baby' growing up. Now, one of his kids has taken the title at home. USA TODAY.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":6786148,"ranking":18,"query_text":"who is the boss of google?","passage_text":"Meaning: A person who exercises control and makes decisions. Classified under: Nouns denoting people. Context example: he is his own boss now. Hypernyms (boss is a kind of...): leader (a person who rules or guides or inspires others) Hyponyms (each of the following is a kind of boss):","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":4284258,"ranking":19,"query_text":"who is the boss of google?","passage_text":"The instruments of the orchestra are divided into districts: the strings, woodwind, brass and percussion. Each section (group of instruments) will have a player who is the Boss. If the music says kiss in their part it is the boss who will kiss.","bm25_label":"high","relevance_label":0.0},{"query_id":1039495,"passage_id":8559963,"ranking":20,"query_text":"who is the boss of google?","passage_text":"A boss is a person who exerts power, authority and decision-making over others. Bosses want certain results and expect specific behaviors. People respond to a boss because they feel that they must. A leader is a person who wins your heart through respect, trust and devotion that that naturally comes from them.","bm25_label":"high","relevance_label":0.0}]