[{"query_id":1040461,"passage_id":7864218,"ranking":1,"query_text":"who is the grinning man","passage_text":"The Grinning Man is sometimes described as being an extraterrestrial, Man in Black or a hominid cryptid and was investigated by notable paranormal author John A. Keel and ufologist James Moseley. Arguably the best known Grinning Man was Indrid Cold, who appeared during the 1960s' Mothman sightings.","bm25_label":"high","relevance_label":1.0},{"query_id":1040461,"passage_id":7864217,"ranking":2,"query_text":"who is the grinning man","passage_text":"The Grinning Man is sometimes described as being an extraterrestrial, Men in Black or a hominid cryptid and was investigated by notable paranormal author John A. Keel and ufologist James Moseley. Arguably the best known Grinning Man was Indrid Cold, who appeared during the 1960s' Mothman sightings.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":7864215,"ranking":3,"query_text":"who is the grinning man","passage_text":"Possible Explanations Edit. It is commonly believed that the Grinning Man may be an alien entity, and is supported by its close connection with UFO activity and with Derenberger's sighting. It is also said by Derenberger that the Grinning Man is in fact a species of aliens with multiple grinning men.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":5310382,"ranking":4,"query_text":"who is the grinning man","passage_text":"He may have served billions, but he was always first in line. The Founder is the story of the man who made McDonald's, Ray Kroc, played by Michael Keaton with the ingratiating grin of a perpetual salesman. But Kroc was hawking a lot more than hamburgers.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":8153970,"ranking":5,"query_text":"who is the grinning man","passage_text":"The article said that the smiling man was dancing all the way and dressed up in a tux and hat and grinning all the time. Doesnâ\u0080\u0099t it remind any of you abt a circus clown who performs in front of people in order to get some appreciation.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":4655241,"ranking":6,"query_text":"who is the grinning man","passage_text":"In the opening lines, for exampleâ\u0080\u0094We wear the mask that grins and lies, \/ It hides our cheeks and shades our eyes--Dunbar is careful to show that the mask is grinning, not the black man. Although the poet's use of the word lies is probably simple, it might not be.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":7864220,"ranking":7,"query_text":"who is the grinning man","passage_text":"I will be thoroughly satisfied if they are as good as 'The Grinning Man,' which is an excellent addition to the series and a good episode for people who have somehow managed to miss the lateral vs. paranormal dealings of Jonathan Creek the first time round. 50 of 51 people found this review helpful.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":7864222,"ranking":8,"query_text":"who is the grinning man","passage_text":"The Grinning Man is the name given to one or more mysterious figures that has become associated with various reports of paranormal activity.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":7864223,"ranking":9,"query_text":"who is the grinning man","passage_text":"Perhaps the most famous sighting of a Grinning Man is reported to have taken place on October 11, 1966 in Elizabeth, New Jersey.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":8190293,"ranking":10,"query_text":"who is the grinning man","passage_text":"It was quite plain that he acted the bully, and his friend the peacemaker, for some particular purpose; or rather, it would have been to any one but the weak old man; for they exchanged glances quite openly, both with each other and with the gipsy, who grinned his approval of the jest until his white teeth shone again.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":4221179,"ranking":11,"query_text":"who is the grinning man","passage_text":"I'm talking about the cameo appearance of a certain figure in the Marvel community, writer Stan Lee. With his massive sunglasses and cheeky grin, the 94-year-old is responsible for crafting dozens of well-known superheroes including Spider-Man, Iron Man, and The Hulk.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":7864221,"ranking":12,"query_text":"who is the grinning man","passage_text":"Description Edit. The Grinning Man is reported to be human-like in appearance, though is commonly associated with UFO activity and is sometimes believed to be an alien. It is also believed possible that he is connected with the Men In Black.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":4104821,"ranking":13,"query_text":"who is the grinning man","passage_text":"Nigel Cockerton, a Scottish forensic artist, used his skills to reconstruct a human face based on the shape of the glass skull. His work shows a man with a wide grin. Dan Aykroyd, who helped create Crystal Head Vodka, said he was surprised to see the skull was that of a man.(Danny Moloshok\/Reuters).hen the company saw the photos of Cockerton's work, it shared them with its 95,000 Facebook followers. Wherever Crystal Head Vodka can help science, we're happy to pitch in, Aykroyd said in an interview.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":3280621,"ranking":14,"query_text":"who is the grinning man","passage_text":"Walt Longmire is the dedicated and unflappable sheriff of Absaroka County, Wyoming. Widowed only a year, he is a man in psychic repair but buries his pain behind his brave face, unassuming grin and dry wit.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":1178786,"ranking":15,"query_text":"who is the grinning man","passage_text":"Smileys & People Emoji Meanings Gallery. The Emoticon Category! Smileys, faces, person bowing deeply, man with red face, hearts, hand gestures. Happy. Previous category name: Smileys. View the gallery. Grinning Face.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":8797783,"ranking":16,"query_text":"who is the grinning man","passage_text":"James Corden and Julia were seen sporting huge grins on their faces after becoming man and wife. The pair wed in a lavish Â£250,000 ceremony in Somerset. Just married: James Corden was seen beaming as he and new wife Julia made their way to the wedding reception in Somerset today. Julia, who gave birth to son Max in March last year, looked amazing in an elegant wedding gown covered in lace.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":4224558,"ranking":17,"query_text":"who is the grinning man","passage_text":"Watch Now. Walt Longmire is the dedicated and unflappable sheriff of Absaroka County, Wyoming. Widowed only a year, he is a man in psychic repair but buries his pain behind his brave face, unassuming grin and dry wit.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":4721668,"ranking":18,"query_text":"who is the grinning man","passage_text":"The coin bank in the shape of the grinning black man (Chapter 15) and Tod Cliftonâ\u0080\u0099s dancing Sambo doll (Chapter 20) serve similar purposes in the novel, each representing degrading black stereotypes and the damaging power of prejudice.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":6700713,"ranking":19,"query_text":"who is the grinning man","passage_text":"More results. 1  grin and bear it. 2  broad smile\/grin. 3  toothy smile\/grin.  smile\/grin 1  broadly. smile\/grin etc from ear to 2  ear. wipe the smile\/grin off somebodyâ\u0080\u0099s  face.","bm25_label":"high","relevance_label":0.0},{"query_id":1040461,"passage_id":3514239,"ranking":20,"query_text":"who is the grinning man","passage_text":"About. Jeff The Killer is a popular fictional story usually accompanied by an image of a pale, nose-less man grinning. The image is sometimes captioned with â\u0080\u009cGO TO SLEEP â\u0080\u009d written in red. In addition to the pasta, it is also popular as a pop-up image.","bm25_label":"high","relevance_label":0.0}]