[{"query_id":1044809,"passage_id":7815034,"ranking":1,"query_text":"who offers contactless cards","passage_text":"Currently, both Visa and MasterCard variants for contactless debit cards are offered in India. Contactless technology in Visa is powered by â\u0080\u009cVisa PayWaveâ\u0080\u009d and by â\u0080\u009cMasterCard Contactlessâ\u0080\u009d in MasterCard. ICICI Bank and SBI Bank are some of the popular banks in India offering contactless card. Many banks also offer exclusive deals like access to airport lounges and fuel surcharge waiver.","bm25_label":"high","relevance_label":1.0},{"query_id":1044809,"passage_id":7815036,"ranking":2,"query_text":"who offers contactless cards","passage_text":"Simplify journeys with contactless cards. Contactless cards offer passengers a faster, easier way to pay for travel. Research shows that a contactless transaction is 63% faster than using cash. Passengers just hold their card within two inches of a reader to pay or securely authenticate a traveller's ticket or pass. More than 800 cities around the world have already deployed the technology.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":6568152,"ranking":3,"query_text":"who offers contactless cards","passage_text":"Riders who pay with an unregistered personal contactless credit\/debit card will be charged as if paying cashincluding paying full fare each time they board a vehicle. Riders will soon be able to register a personal contactless bankcard to act as a fare payment card, which is linked to a Ventra account. A registered personal contactless bankcard allows all the same benefits and savings as a Ventra Card.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":7815035,"ranking":4,"query_text":"who offers contactless cards","passage_text":"How to use contactless. Look for the contactless symbol on your credit or debit card to see if your card is contactless enabled. Then, board a bus with the contactless symbol and instead of paying with cash, simply tap your card or contactless-enabled device onto the reader and wait for the beep.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":7815042,"ranking":5,"query_text":"who offers contactless cards","passage_text":"Contactless smart cards. Contactless smart cards communicate via radio wave frequencies to a card reader that is usually within close proximity to the user and the card. Typically the size of a standard credit card, contactless cards have become increasingly popular.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":200129,"ranking":6,"query_text":"who offers contactless cards","passage_text":"Identity Stronghold is the Original Secure SleeveÂ® Company and has been in business for over 10 years! Secure Sleeves offer a RFID credit card protection sleeve for contactless credit and debit cards in YOUR wallet.Simply slide the card into the sleeve and the sleeve back into your wallet.It's just that simple. Protect Passport Booklets and Passport Cards.dentity Stronghold is the Original Secure SleeveÂ® Company and has been in business for over 10 years! Secure Sleeves offer a RFID credit card protection sleeve for contactless credit and debit cards in YOUR wallet. Simply slide the card into the sleeve and the sleeve back into your wallet. It's just that simple.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":7815037,"ranking":7,"query_text":"who offers contactless cards","passage_text":"About contactless debit cards. Contactless cards are designed to make your life that little bit easier. Contactless cards allow you to pay for goods up to Â£30 without needing to enter your PIN. Many shops, restaurants, and businesses have contactless reader devices which make transactions faster and smoother. Millions of people use contactless debit cards, and you get one with most Lloyds Bank current accounts.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":2337821,"ranking":8,"query_text":"who offers contactless cards","passage_text":"What are the differences between contactless smart cards and RFID? Contactless smart cards are a very different technology from RFID tags. Both are wireless, meaning they can communicate using radio like a cell phone, but contactless smart cards are far more advanced and secure. Contactless smart cards have small but sophisticated computers inside them. They deliver the highest levels of computer security to protect your identity, privacy or financial information. Contactless smart card technology is suitable for uses such as identity credentials, passports and payment cards. RFID (Radio Frequency IDentification) tags and labels are used mostly in manufacturing, shipping and object-related tracking.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":6597023,"ranking":9,"query_text":"who offers contactless cards","passage_text":"In fact, contactless cards do offer one security feature traditional cards donâ\u0080\u0099t: Along with the cardâ\u0080\u0099s 16-digit number and expiration date, the cards are set to offer up a one-time CVV code with every scan. Those codes can only be used for one transaction, and have to used in the order theyâ\u0080\u0099re generated.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":7815039,"ranking":10,"query_text":"who offers contactless cards","passage_text":"Size comparison of chip compared to a Canadian penny. A contactless smart card is a contactless 13.56-MHz credential whose dimensions are credit-card size. Its embedded integrated circuits can store and sometimes process data and communicate with a terminal via radio waves. There are two broad categories of contactless smart cards.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":558788,"ranking":11,"query_text":"who offers contactless cards","passage_text":"If you have a contactless card it means, in New Zealand, you can make purchases of up to $80 by simply holding your card close to the card reader on the contactless terminal-there is no need to dip or swipe the card, select an account, sign a receipt or enter your PIN.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":8061945,"ranking":12,"query_text":"who offers contactless cards","passage_text":"Contactless payment. Contactless payment systems are credit cards and debit cards, key fobs, smart cards or other devices, including smartphones and other mobile devices, that use radio-frequency identification (RFID) or near field communication (NFC, e.g.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":558794,"ranking":13,"query_text":"who offers contactless cards","passage_text":"Contactless is a quicker and easier way to make a payment than with Chip & PIN. Instead of inserting your card into a terminal to enter your PIN, with Contactless you hold your card next to the Contactless symbol on the reader and you're done. We'll only occasionally ask you to enter your PIN, just to be sure it's you.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":558796,"ranking":14,"query_text":"who offers contactless cards","passage_text":"HSBC Debit Cards are now contactless and will work at Contactless readers throughout the UK allowing you to pay for low value items with a simple tap. 1  It's Fast There is no need to enter your PIN or sign for everyday purchases under Â£30. 2  Simply touch the reader with your contactless card to pay in seconds.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":6568151,"ranking":15,"query_text":"who offers contactless cards","passage_text":"Ventra, the new fare collection system from CTA and Pace, allows riders to pay by tapping contactless cards or tickets against card readers. Riders will be able to load Ventra cards with value or different daily passes, and the system will also allow riders to use personal contactless credit or debit cards.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":7533309,"ranking":16,"query_text":"who offers contactless cards","passage_text":"1 Contactless-You can pay for items up to â\u0082¬15 using Contactless. 2  You will need to use your Visa Debit Card in an ATM or POS (point of sale) with your PIN after every 3 consecutive Contactless transactions in order to make additional Contactless transactions.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":1399218,"ranking":17,"query_text":"who offers contactless cards","passage_text":"One Day Travelcards: 2015 Prices. The Pay as you go Oyster card or a contactless card are the cheapest ways to pay for travel for a day if youâ\u0080\u0099re in London for 1-5 days. (Â£6.40 per day for zones 1-2).If you really donâ\u0080\u0099t want to use an Oyster card or donâ\u0080\u0099t have a contactless card, the One Day Travelcard is the next best money-saving pass.he Pay as you go Oyster card or a contactless card are the cheapest ways to pay for travel for a day if youâ\u0080\u0099re in London for 1-5 days. (Â£6.40 per day for zones 1-2). If you really donâ\u0080\u0099t want to use an Oyster card or donâ\u0080\u0099t have a contactless card, the One Day Travelcard is the next best money-saving pass.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":2337820,"ranking":18,"query_text":"who offers contactless cards","passage_text":"Contactless smart card technology and applications conform to international standards (ISO\/IEC 14443 and ISO\/IEC 7816). Contactless smart card technology is available in a variety of forms â\u0080\u0093 in plastic cards, watches, key fobs, documents and other handheld devices (e.g., built into mobile phones).","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":558787,"ranking":19,"query_text":"who offers contactless cards","passage_text":"A: MasterCard Contactless is a 'contactless' way to pay for purchases under R200. It's like having exact change wherever you go. A simple tap of your card, key fob or contactless-enabled mobile phone is all it takes to pay at the checkout.","bm25_label":"high","relevance_label":0.0},{"query_id":1044809,"passage_id":5686304,"ranking":20,"query_text":"who offers contactless cards","passage_text":"Check out PayPal Here's supported devices for more information. Both Square and PayPal offer chip-capable mobile card readers. The Square reader is priced at $29 as of 2017 and looks much like the previous reader. The EMV-capable PayPal card reader is a larger device with a built-in PIN pad and contactless technology.","bm25_label":"high","relevance_label":0.0}]