[{"query_id":1045826,"passage_id":7192874,"ranking":1,"query_text":"what is ssc je","passage_text":"Check details of SSC JE 2018 answer key, result, cut off here. SSC JE 2018: SSC had conducted SSC JE Paper 1 from Jan. 22 to 29, 2018. SSC JE result 2018 is likely to be declared in March. The application process for SSC JE 2018 took place from Oct 21 to Nov 17, 2017.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192870,"ranking":2,"query_text":"what is ssc je","passage_text":"The Paper 1 of SSC JE 2018 was conducted by SSC from January 22 to January 29, 2018. SSC had released the SSC JE notification 2018 on October 20, 2017 and the application form of SSC JE 2018 was made available from October 21, 2017. The last date to fill SSC JE application form was November 17, 2018.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192865,"ranking":3,"query_text":"what is ssc je","passage_text":"SSC JE 2018: Staff Selection Commission (SSC) conducted the SSC JE 2018 Paper 1 from January 22 to January 29, 2018. The admit card of SSC JE Paper 1 had been released by the commission on January 9, 2018.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192869,"ranking":4,"query_text":"what is ssc je","passage_text":"SSC JE Application Form 2017 â\u0080\u0093 Apply Online Here. SSC JE Application Form 2017: Application form of SSC JE Exam 2017 will be released soon. SSC Junior Engineer application form will be available online only; direct link to apply online is available below, candidates can apply the same.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192866,"ranking":5,"query_text":"what is ssc je","passage_text":"SSC JE 2017. SSC JE 2017: Staff Selection Commission (SSC) conducted paper 2 of the SSC JE exam on July 30, 2017. Around 8332 candidates appeared for the exam. The exam is conducted for recruitment of Junior Engineers Group B Non-Gazetted posts in Civil, Mechanical, Electrical and Quality and Quantity Assurance in Central Government departments.","bm25_label":"high","relevance_label":1.0},{"query_id":1045826,"passage_id":7192872,"ranking":6,"query_text":"what is ssc je","passage_text":"The SSC JE Paper 1 consisted of General Intelligence and Reasoning, General Awareness, General Engineering (Civil and Structural)\/General Engineering (Electrical)\/General Engineering (Mechanical). The SSC JE is a conventional type test on engineering discipline.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192868,"ranking":7,"query_text":"what is ssc je","passage_text":"SSC JE selection procedure 2017. Candidates will be selected on the basis of Paper 1 and Paper 2 marks. Appointments will be made on the basis of candidates ranks in the merit list and post preferences. Candidates appointed on the basis of SSC JE 2017 examination, shall be on probation for a period of two years.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192871,"ranking":8,"query_text":"what is ssc je","passage_text":"Based on the cutoff score, candidates have been shortlisted for Paper 2. The SSC JE cutoff Paper 1 is provided on this page. The SSC JE cutoff 2017 is applied at each of selection process. Candidates will have to secure the cutoff to become eligible for next stage of selection process.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":960969,"ranking":9,"query_text":"what is ssc je","passage_text":"Application form of SSC JE Exam 2015 is released on 11 July 2015, as per the SSC Calendar 2015. Last Date to fill the SSC Junior Engineer Application form is 10 August 2015. Candidates have to fill the form in online mode, on the official website of Staff Selection Commission.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":960967,"ranking":10,"query_text":"what is ssc je","passage_text":"Here you will find SSC JE Junior Engineer Recruitment Exam 2015 Date, Syllabus, Pattern, Eligibility and Online Application Form.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":960966,"ranking":11,"query_text":"what is ssc je","passage_text":"Only one applications will be entertained for SSC Junior Engineer recruitment. Facility of Online application for SSC JE Exam 2015 will be available from 11.07.2015 to 07.08.2015 (upto 5:00 PM) for part I registration and upto 10.08.2015 (Upto 5:00 PM) for part II registration.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":960965,"ranking":12,"query_text":"what is ssc je","passage_text":"10. Only one applications will be entertained for SSC Junior Engineer recruitment. Facility of Online application for SSC JE Exam 2015 will be available from 11.07.2015 to 07.08.2015 (upto 5:00 PM) for part I registration and upto 10.08.2015 (Upto 5:00 PM) for part II registration.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":960968,"ranking":13,"query_text":"what is ssc je","passage_text":"As per the latest notification issued by the Staff Selection Commission, it is informed hereby that SSC Junior Engineer 2015 Exam has been postponed from 06 December 2015 to 20 December 2015. The SSC JE Exam will be held to recruit suitable candidates for the post of Junior Engineer in various government organizations.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":960970,"ranking":14,"query_text":"what is ssc je","passage_text":"Staff Selection Commission has announced latest notification regarding SSC Junior Engineer Exam. Staff Selection Commission conduct this exam for recruiting eligible job hunters for Junior Engineer (JE) Post in various disciplines that is Mechanical, Civil and Electrical under different organization and departments.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192867,"ranking":15,"query_text":"what is ssc je","passage_text":"SSC-JE Eligibility. 1  Junior Engineer (Civil), CPWD â\u0080\u0093 The student of Diploma holder and B.A \/ B.tech in civil engineering from recognized Institute\/ University. 2  Junior Engineer (Electrical), CPWD â\u0080\u0093 The candidate of Diploma holders\/ B.E \/ B.Tech from recognized Institute\/ University.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7192873,"ranking":16,"query_text":"what is ssc je","passage_text":"Now, application form window will open. SSC JE application form has two parts i.e. â\u0080\u009cRegistration Partâ\u0080\u009d and â\u0080\u009cApply Partâ\u0080\u009d. Firstly, candidates have to fill required details in â\u0080\u009cRegistration Partâ\u0080\u009d. And in â\u0080\u009cApply Partâ\u0080\u009d, candidates need to pay application fee and, upload scanned photograph and signature.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7157161,"ranking":17,"query_text":"what is ssc je","passage_text":"We've got 21 definitions for JES Â» What does JES stand for? What does JES mean? This page is about the various possible meanings of the acronym, abbreviation, shorthand or slang term: JES.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":4567424,"ranking":18,"query_text":"what is ssc je","passage_text":"Scleroderma is a group of conditions affecting approximately 300,000 people in the United States. When scleroderma only affects the skin, it is considered localized.. However, if it affects the skin and internal organs, it is viewed as systemic, also called Systemic Sclerosis (SSc). SSc affects approximately 100,000 people, or about one third of patients with scleroderma in the United States; this article will focus primarily on SSc. What is Systemic Sclerosis (SSc)? There are two main subtypes of SSc â\u0080\u0093 limited and diffuse â\u0080\u0093 which are defined according to the pattern of skin involvement.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7796987,"ranking":19,"query_text":"what is ssc je","passage_text":"What is Japanese encephalitis? Japanese encephalitis (JE) is a potentially severe disease. JE is caused by a virus spread by infected mosquitoes in Asia and the western Pacific. JE virus is one of a group of mosquito-transmitted viruses that can cause inflammation of the brain (encephalitis). Where does Japanese encephalitis occur? JE occurs in Asia and parts of the western Pacific.","bm25_label":"high","relevance_label":0.0},{"query_id":1045826,"passage_id":7570129,"ranking":20,"query_text":"what is ssc je","passage_text":"Here in this post, we will give you details on LATEST SSC SALARY 2015 at 113% DA for the New recruits. Do you want to apply for ssc cgl but also you donâ\u0080\u0099t know what will be the salary when you are selected for the job.","bm25_label":"high","relevance_label":0.0}]