[{"query_id":1045203,"passage_id":5235392,"ranking":1,"query_text":"who owns cnn cable news network","passage_text":"Launched in 1980, Cable News Network (CNN) has become one of the most popular news channels in the United States. Owner of CNN. CNN is technically owned by Turner Broadcasting System, Inc. (TBS). This means that, unsurprisingly, CNN is owned by Ted Turner, who of course founded and owns the collection of cable networks. Today TBS owns many channels domestically and internationally, along with many popular websites (such as SI.com, NBA.com, etc.). Ted Turner. Turner is the man behind TBS and thus CNN.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":1040010,"ranking":2,"query_text":"who owns cnn cable news network","passage_text":"CNN stands for Cable News Network. It stands for Cable News Network. CNN stands for Cable News Network. It stands for Cable News Network.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":2074684,"ranking":3,"query_text":"who owns cnn cable news network","passage_text":"The Cable News Network (CNN) is an American basic cable and satellite television channel that is owned by the Turner Broadcasting System division of Time Warner.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":2012805,"ranking":4,"query_text":"who owns cnn cable news network","passage_text":"For other uses, see CNN (disambiguation). The Cable News Network (CNN) is an American basic cable and satellite television news channel owned by the Turner Broadcasting System division of Time Warner. It was founded in 1980 by American media proprietor Ted Turner as a 24-hour cable news channel.","bm25_label":"high","relevance_label":1.0},{"query_id":1045203,"passage_id":3928272,"ranking":5,"query_text":"who owns cnn cable news network","passage_text":"Owner of CNN. CNN is technically owned by Turner Broadcasting System, Inc. (TBS). This means that, unsurprisingly, CNN is owned by Ted Turner, who of course founded and owns the collection of cable networks. Today TBS owns many channels domestically and internationally, along with many popular websites (such as SI.com, NBA.com, etc.). Ted Turner. Turner is the man behind TBS and thus CNN.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":7816830,"ranking":6,"query_text":"who owns cnn cable news network","passage_text":"Jointly owned by Comcast and General Electric, MSNBC is considered by many to be one of the most liberal cable news channels of all the mainstream media. For years, MSNBC trailed Fox News and CNN in the ratings. However, it began beating CNN after the ratings for that network began to freefall. In 2014 CNN beat MSNBC.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":1040008,"ranking":7,"query_text":"who owns cnn cable news network","passage_text":"CNN stands for the Cable News Network. It was founded by Ted Turner in 1980 and was the first all-news cable TV channel. CNN sees itself as a centrist network, focused o â\u0080¦ n objective and neutral coverage of news all over the world, a network that strives not to take partisan stands on issues. Where is CNN located?","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":5700786,"ranking":8,"query_text":"who owns cnn cable news network","passage_text":"CNN stands for the Cable News Network.. It was founded by Ted  Turner in 1980 and was the first all-news cable TV channel. CNN  sees itself as a centrist network, focused oâ\u0080¦n objective and neutral  coverage of news all over the world, a network that strives not to  take partisan stands on issues.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":2552488,"ranking":9,"query_text":"who owns cnn cable news network","passage_text":"CNN ratings drop below gardening network as Trump supporters boycott over bias. The 2nd week of August has been brutal to CNN. CNN, who has been extremely unfair to Donald Trump since his convention, is now doing worse than the HGN in ratings, an all time low for the first cable news network. RAGE: Trump supporters show CNN what they think of the biased network.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":5365066,"ranking":10,"query_text":"who owns cnn cable news network","passage_text":"By Frank Lake on November 22, 2013. Bill Oâ\u0080\u0099Reilly shocked the cable news world today by announcing he is leaving Fox News and heading to CNN. Bill Oâ\u0080\u0099Reilly is done with the No Spin Zone. CNN has made him the largest offer in the history of cable news. â\u0080\u009cBill Oâ\u0080\u0099Reilly will be a part owner of our network. And Oâ\u0080\u0099Reilly plans on making CNN the number one network in all of cable,â\u0080\u009d said a source close to CNN.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":2552483,"ranking":11,"query_text":"who owns cnn cable news network","passage_text":"The 2nd week of August has been brutal to CNN. Sponsored Link: CNN, who has been extremely unfair to Donald Trump since his convention, is now doing worse than the HGN in ratings, an all time low for the first cable news network. RAGE: Trump supporters show CNN what they think of the biased network.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":3730151,"ranking":12,"query_text":"who owns cnn cable news network","passage_text":"Bob Beckel Returns to Cable News on CNN After Fox Exit. Bob Beckel has changed cable news networks, but not his look. More ways to share... Liberal pundit Bob Beckel, a former co-host of The Five on Fox News, returned to cable television on CNN last week. bob beckel, returns, cable, news, cnn, fox.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":7262900,"ranking":13,"query_text":"who owns cnn cable news network","passage_text":"She moved to Atlanta, Georgia in 1997, joining Cable News Network (CNN), there she changed her professional name to Linda Stouffer. At CNN, she co-anchored the morning news program Ahead of the Curve, which aired simultaneously on CNN\/U.S. and CNNfn, CNN's former financial news network.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":4241967,"ranking":14,"query_text":"who owns cnn cable news network","passage_text":"Â© 2018 Cable News Network. Turner Broadcasting System, Inc. All Rights Reserved. CNN Sans â\u0084¢ & Â© 2016 Cable News Network.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":6359027,"ranking":15,"query_text":"who owns cnn cable news network","passage_text":"Under Saddam, Iraqâ\u0080\u0099s Prime Minister Was Christian. CNN ratings drop below gardening network as Trump supporters boycott over bias. The 2nd week of August has been brutal to CNN. CNN, who has been extremely unfair to Donald Trump since his convention, is now doing worse than the HGN in ratings, an all time low for the first cable news network.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":7421283,"ranking":16,"query_text":"who owns cnn cable news network","passage_text":"eye 3.2M. Cable News Network (CNN) is a U.S. cable news channel founded in 1980 by Ted Turner. Upon its launch, CNN was the first channel to provide 24-hour television news coverage, and the first all-news television channel in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":3355863,"ranking":17,"query_text":"who owns cnn cable news network","passage_text":"United States cable news. Cable news refers to television channels devoted to television news broadcasts, with the name deriving from the proliferation of such networks during the 1980s with the advent of cable television. In the United States, early networks included CNN in 1980, Financial News Network in 1981 and CNN2 (now HLN) in 1982.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":3146957,"ranking":18,"query_text":"who owns cnn cable news network","passage_text":"In the 1980s, cable television became widespread across the country. Cable news outlets, foremost among them the Cable News Network (CNN), which debuted in 1980, offered news around the clock. As more households acquired cable, viewers had a range of options for news and information beyond the established networks.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":3744184,"ranking":19,"query_text":"who owns cnn cable news network","passage_text":"Contacting CNN Customer Service Center. CNN, or Cable News Network, broadcasts multiple news programs and shows. CNN accepts breaking news from the crowd via phone, email or text message. Depending on the current news stories, CNN may provide detailed or specialized coverage.","bm25_label":"high","relevance_label":0.0},{"query_id":1045203,"passage_id":5073753,"ranking":20,"query_text":"who owns cnn cable news network","passage_text":"Cable Network Ranker: July 2016 and Week of July 25. Fox News was the most-watched cable network of the month, in prime time and in total day. CNN was the most-watched cable network of this past week in prime time, and MSNBC finished No. 3.","bm25_label":"high","relevance_label":0.0}]