[{"query_id":1045135,"passage_id":7194534,"ranking":1,"query_text":"what is the acceptance rate at wellesley","passage_text":"When applying to Wellesley College, it's important to note the application deadline is Jan. 15, and the early decision deadline is Nov. 1. The application fee at Wellesley College is $50. Scores for either the ACT or SAT test are due Dec. 30. It is most selective, with an acceptance rate of 29 percent.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":7194540,"ranking":2,"query_text":"what is the acceptance rate at wellesley","passage_text":"When applying to Wellesley College, it's important to note the application deadline is Jan. 15, and the early decision deadline is Nov. 1. The application fee at Wellesley College is $50. Scores for either the ACT or SAT test are due Dec. 30. It is most selective, with an acceptance rate of 30 percent.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":5766752,"ranking":3,"query_text":"what is the acceptance rate at wellesley","passage_text":"The acceptance rate differential has been significant at many colleges and universities including: Bowdoin, Boston College, Brown, Columbia University, Cornell, Dartmouth, Duke, Northwestern, Stanford, Williams College, Wellesley and Yale.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":7194533,"ranking":4,"query_text":"what is the acceptance rate at wellesley","passage_text":"The acceptance rate at Wellesley is 29%. In other words, of 100 students who apply, 29 are admitted. This means the school is quite selective. If you have strong academic scores, you have a great shot at getting in.","bm25_label":"high","relevance_label":1.0},{"query_id":1045135,"passage_id":1791577,"ranking":5,"query_text":"what is the acceptance rate at wellesley","passage_text":"Homefacts City Report. Wellesley is located in Norfolk County, MA. The population is , making Wellesley the 9th largest city in Norfolk County. There are 9 public schools in Wellesley with an average Homefacts rating of A. The total crime rate for Wellesley is very low, and there are 0 registered sex offenders residing in the city.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":7261045,"ranking":6,"query_text":"what is the acceptance rate at wellesley","passage_text":"Wisdom & Inspiration. Admission Statistics: Acceptance Rates â\u0080\u0093 Early vs. Regular. Many colleges and universities continue to offer early action and early decision programs. When considering early vs. regular admission options, applicants should keep in mind recent acceptance rates for those applying early vs. regular admission. The acceptance rate differential has been significant at many colleges and universities including: Bowdoin, Boston College, Brown, Columbia University, Cornell, Dartmouth, Duke, Northwestern, Stanford, Williams College, Wellesley and Yale.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":744146,"ranking":7,"query_text":"what is the acceptance rate at wellesley","passage_text":"Overview. Dr. David Wenzel is an internist in Wellesley, Massachusetts and is affiliated with Newton-Wellesley Hospital. He received his medical degree from Michigan State University College of Human Medicine and has been in practice for 28 years. Dr. Wenzel accepts several types of health insurance, listed below.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":34985,"ranking":8,"query_text":"what is the acceptance rate at wellesley","passage_text":"Hillary Clinton accepts the Democratic Party's nomination for President during the Democratic National Convention on Thursday, July 28. The former first lady, U.S. senator and secretary of state is the first woman to lead the presidential ticket of a major political party. Before she married Bill Clinton, she was Hillary Rodham. Here she is attending Wellesley College in Wellesley, Massachusetts.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":822707,"ranking":9,"query_text":"what is the acceptance rate at wellesley","passage_text":"But thatâ\u0080\u0099s not what they would bill my HMO Blue Cross plan for my MRI: $600 for the MRI without the contrast dye, and $1,200 for the MRI with the dye is its negotiated rate with my health plan. Eventually, I got the test at Newton-Wellesley.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":4866227,"ranking":10,"query_text":"what is the acceptance rate at wellesley","passage_text":"User: What school was founded under Reconstruction? A. Harvard College B. Wellesley College C. the Tuskegee Institute D. Massachusetts Institute of Technology Weegy: B. Wellesley College. It was founded in 1875. Reconstruction era covered 1865-1877.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":4162585,"ranking":11,"query_text":"what is the acceptance rate at wellesley","passage_text":"1 Edith Clarke, class of 1908 - America's first female professor of electrical engineering. 2  Mildred H. McAfee, class of 1920 - President of Wellesley College and first director of WAVES (Women Accepted for Volunteer Emergency Service).","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":4162586,"ranking":12,"query_text":"what is the acceptance rate at wellesley","passage_text":"1 Mildred H. McAfee, class of 1920 - President of Wellesley College and first director of WAVES (Women Accepted for Volunteer Emergency Service). 2  Caroline F. Ware, class of 1920 - Professor of history at American University and a New Deal activist.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":2793769,"ranking":13,"query_text":"what is the acceptance rate at wellesley","passage_text":"Wellesley Island, NY. Wellesley Island is located in north New York. Wellesley Island is part of Jefferson County. On average, the public school district that covers Wellesley Island is close to the state average in quality. The Wellesley Island area code is 315.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":8038104,"ranking":14,"query_text":"what is the acceptance rate at wellesley","passage_text":"Investment through Wellesley involves lending to individuals or companies and therefore your capital is at risk and interest payments are not guaranteed if the borrower defaults. It is important to remember that historic loan default rates are not necessarily indicative of future default rates.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":4495426,"ranking":15,"query_text":"what is the acceptance rate at wellesley","passage_text":"Norfolk County. 1  Town of Wellesley websites: 2  Wellesley online resources: 3  Wellesley information from state agencies:  Regional information from state 1  agencies: Information specific to Wellesley can also be found within the following comprehensive listings:  Other Wellesley community websites:","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":1791578,"ranking":16,"query_text":"what is the acceptance rate at wellesley","passage_text":"The Town of Wellesley Town of Wellesley - Tax Assessors' Office Office is located in the Wellesley Town Hall building in Wellesley, Massachusetts. Town of Wellesley is a locality in Norfolk County, Massachusetts. Unlike many other areas where property taxes are collected on a county level, Town of Wellesley has its own tax assessor's office. If your property is located in a different Norfolk County locality, see that page for tax assessor's information.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":4326490,"ranking":17,"query_text":"what is the acceptance rate at wellesley","passage_text":"Wellesley Average Weather. 1  The highest monthly average temperature in Wellesley for July is 72 degrees. 2  The lowest monthly average temperature in Wellesley for January is 29 degrees.  The most monthly precipitation in Wellesley occurs in October with 5.7 inches.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":2793770,"ranking":18,"query_text":"what is the acceptance rate at wellesley","passage_text":"City of Wellesley Island, NY Zip Codes. City of Wellesley Island, NY Demographic Information. * Demographic data is based on information taken from the 2000 Census. City of Wellesley Island, NY covers 1 Area Code. City of Wellesley Island, NY covers 1 Zip Code. 10 Cities within 15 Miles of the City of Wellesley Island, NY.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":2793766,"ranking":19,"query_text":"what is the acceptance rate at wellesley","passage_text":"Wellesley Island, NY City Data - Population, Homes, Statistics. Wellesley Island, NY City Data. Wellesley Island, NY is a city with great restaurants, attractions, history and people. There are around 326 people who live in Wellesley Island and approximately 111,738 who live in Jefferson County.","bm25_label":"high","relevance_label":0.0},{"query_id":1045135,"passage_id":2793772,"ranking":20,"query_text":"what is the acceptance rate at wellesley","passage_text":"Wellesley Island. For Wellesley Island, Ontario, see Lake Rosseau. Wellesley Island in Jefferson County, New York, United States is partially in the Town of Orleans and partially in the Town of Alexandria.","bm25_label":"high","relevance_label":0.0}]