[{"query_id":1045227,"passage_id":5216485,"ranking":1,"query_text":"what is termis","passage_text":"Montecatini Termi Things to Do The ancient city of Montecatini Termi has been inhabited since paleolithic times. Today, it is a major tourist attraction in Tuscany for many reasons including the warm thermal baths.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194251,"ranking":2,"query_text":"what is termis","passage_text":"Termis is the most advanced software for real-time planning and optimization of district heating and cooling network operations. Termis is the most advanced software for real-time planning and optimization of district heating and cooling network operations.","bm25_label":"high","relevance_label":1.0},{"query_id":1045227,"passage_id":7194258,"ranking":3,"query_text":"what is termis","passage_text":"Awards and Recognition Dr. William Wagner Named a TERMIS Fellow Dr. William Wagner Named a TERMIS Fellow By: The McGowan Institute For Regenerative Medicine | Category: Awards and Recognition, News Archive | September 28, 2015","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194252,"ranking":4,"query_text":"what is termis","passage_text":"Termis District Energy Optimization Software. Termis District Energy Optimization Software reduces the energy costs and amounts of energy used by a utility to provide the appropriate cooling \/ heating service; minimizes heat losses; and streamlines the network operation.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194257,"ranking":5,"query_text":"what is termis","passage_text":"Termis Temperature Optimization Module. The Termis Temperature Optimization Module minimizes heat loss and operational costs in the district heating network. The inlet temperature is adjusted to be as low as possible, taking into account the amount of heat that has to be supplied to the consumers in the net.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194253,"ranking":6,"query_text":"what is termis","passage_text":"This enables Termis to continuously predict future consumption even during periods of quickly changing or extreme weather conditions. Based on these data, Termis runs a simulation for the entire network, allowing the operator to see exactly how his district heating distribution network is operating â\u0080\u0093 right now â\u0080\u0093 AND up to 3 days from now.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7999551,"ranking":7,"query_text":"what is termis","passage_text":"Definition of term 'bilateral' as used in anatomy, kinesiology, and medicine, with example of use of the term. Bilateral is used in medical and anatomy termi...","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":4664646,"ranking":8,"query_text":"what is termis","passage_text":"Termis the value of a property to a typical investor, and is the value of a property to a particular investor. Market value, investment value. The value that real estate appraisers generally estimate is market value, which is synonymous with.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194254,"ranking":9,"query_text":"what is termis","passage_text":"Termis gives the operator a number of immediate benefits in terms of better overview and improved operation of the cooling or heating network. Reduces the energy usage, costs and CO2 emissions while ensuring the required level of service","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194250,"ranking":10,"query_text":"what is termis","passage_text":"Termis gives the operator a number of immediate benefits in terms of better overview and improved operation of the cooling or heating network. 1  Reduces the energy usage, costs and CO2 emissions while ensuring the required level of service.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194255,"ranking":11,"query_text":"what is termis","passage_text":"McGowan Institute for Regenerative Medicine Director William Wagner, PhD, Professor of Surgery, Bioengineering, and Chemical Engineering at the University of Pittsburgh, has been named a Fellow of the Tissue Engineering and Regenerative Medicine International Society (TERMIS).","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":2766954,"ranking":12,"query_text":"what is termis","passage_text":"Copper and aluminum compression termi-. nals and splices for terminating conductors. from #8 AWG through 2000 kcmil. The medium and large HYDENTâ\u0084¢ line is. designed for terminating and splicing medi-. um and large conductors in electrical power. applications.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":5555694,"ranking":13,"query_text":"what is termis","passage_text":"In practice, the measurement error is different for the cable termination types of the instrument.High frequency 4TP instruments, such as the Agilent 4285A and the 4294A, which internally termi-nate cables with their characteristic impedance, differ from low frequency 4TP instruments withoutcable termination.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":7194256,"ranking":14,"query_text":"what is termis","passage_text":"To accomplish its mission, TERMIS brings together the international community of persons engaged or interested in the field of tissue engineering and regenerative medicine and promotes education and research within the field of tissue engineering and regenerative medicine through regular meetings, publications, and other forms of communication.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":155600,"ranking":15,"query_text":"what is termis","passage_text":"These block-shaped proximity switches have a large face. (80 mm x 80 mm) and a correspondingly large sensing range. They consist of two components: the base contains the termi-. nal compartment and the top part the connector pins, sensor. element and vacuum resin-potted electronics. The top part is.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":2001764,"ranking":16,"query_text":"what is termis","passage_text":"As an illustration, the price for perfor-mance-graded PG64-28 asphalt binder on the East Coast market climbed from $180 per ton in April 2004 to $422 per ton in April 2008, according to the As-phalt Weekly Monitor produced by Po-ten Partners Inc. And this was the price at the termi-nal.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":4635886,"ranking":17,"query_text":"what is termis","passage_text":"A notice to quit (15 days notice to vacate) is used when a landlord wishes to termi. rental. The landlord is not required to give a specific reason when this notice is served. Tenants. must be given a 15 day notice AT LEAST â\u0080\u009c15 days prior to when rent is dueâ\u0080\u009d again, excluding. date of service.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":4251211,"ranking":18,"query_text":"what is termis","passage_text":"spoken mostly in New Albany from team cobra. it is a Mexican word but not spanish. meaning I WIN. damnnn steven just merete that gaymaro in his chrome yellow 1998 ford svt mustang cobra with black leather interior and 184k miles and all stock. #sxt #cobra #camaro #termi #nigger. by cobramch1 June 01, 2009.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":2094750,"ranking":19,"query_text":"what is termis","passage_text":"Nearby Terms. 1  voluntary expor... 2  voluntary forec... 3  voluntary leave. 4  voluntary organ... 5  voluntary reduc... 6  voluntary redun... 7  voluntary reser... 8  voluntary secto... 9  voluntary termi... 10  voluntary trade. 11  voluntary windi... 12  volunteer. 13  vortal. 14  vostro account. 15  voting agreemen... 16  voting control. 17  voting right.","bm25_label":"high","relevance_label":0.0},{"query_id":1045227,"passage_id":6229879,"ranking":20,"query_text":"what is termis","passage_text":"The kinase domain of Rho-kinase\/ROK\/ROCK is situated at the N-terminal end and has72% sequence homology with the catalytic domain ofmyotonic dystrophy kinase [3]. Rho-kinase has a puta-tive coiled-coil domain in its middle portion and apleckstrin homology (PH)-like domain at its C-termi-nal end.espite the abundance of Rho-kinase in neurons, analysis of the roles of Rho-kinasein the brain is just getting started. Recently, the in-volvement of Rho-kinase in the initiation of axon out-growth and the control of growth cone dynamics have FIG.","bm25_label":"high","relevance_label":0.0}]