[{"query_id":1045374,"passage_id":7193893,"ranking":1,"query_text":"what is targeted victory","passage_text":"Keep up with Targeted Victory See more information about Targeted Victory, find and apply to jobs that match your skills, and connect with people to advance your career. Join LinkedIn Sign In","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":7193888,"ranking":2,"query_text":"what is targeted victory","passage_text":"Targeted Victory. Built by digital marketers, Targeted Victory is a full service strategy and marketing agency providing optimized outcomes in the digital age. We focus on winning political elections and on solving global corporate challenges.","bm25_label":"high","relevance_label":1.0},{"query_id":1045374,"passage_id":7193894,"ranking":3,"query_text":"what is targeted victory","passage_text":"Now this was great for a good chuckle. Imagine the headlines: â\u0080\u009cTargeted Victory Wins Every Prize Except Electionâ\u0080\u009d Or, â\u0080\u009cTargeted Victory Wins Six Bronze Awards for Romney Campaign â\u0080\u0094 in Two-Party Race.â\u0080\u009d. After weâ\u0080\u0099d tired ourselves out, we got to thinking: This whole thing stinks to high hell.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":7193892,"ranking":4,"query_text":"what is targeted victory","passage_text":"But I am delighted to report that we have just obtained a resounding victory in our legal challenge to the IRSâ\u0080\u0099s political targeting of conservative organizations. It took many years to resolve. But I am delighted to report that we have just obtained a resounding victory in our legal challenge to the IRSâ\u0080\u0099s political targeting of conservative organizations. Fox News u.s.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":7193895,"ranking":5,"query_text":"what is targeted victory","passage_text":"Jay Sekulow: Victory! IRS admits Tea Party, other conservative groups were targets during Obama era","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":7868023,"ranking":6,"query_text":"what is targeted victory","passage_text":"Katniss Everdeen and Peeta Mellark become targets of the Capitol after their victory in the 74th Hunger Games sparks a rebellion in the Districts of Panem.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":3060973,"ranking":7,"query_text":"what is targeted victory","passage_text":"If youâ\u0080\u0099re targeting specific types of consumers, behavioral data can mean the difference between a bungled campaign and a huge victory. Mobile video ads, native advertising, viewable impressions and behavioral targeting are the defining trends in digital advertising.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":1670968,"ranking":8,"query_text":"what is targeted victory","passage_text":"Watch Now. Katniss Everdeen and Peeta Mellark become targets of the Capitol after their victory in the 74th Hunger Games sparks a rebellion in the Districts of Panem.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":4248112,"ranking":9,"query_text":"what is targeted victory","passage_text":"1 2 3 4 5 6 7 8 9 10 7.6\/10 X. Katniss Everdeen and Peeta Mellark become targets of the Capitol after their victory in the 74th Hunger Games sparks a rebellion in the Districts of Panem. 2 3 4 5 6 7 8 9 10 7.6\/10 X. Katniss Everdeen and Peeta Mellark become targets of the Capitol after their victory in the 74th Hunger Games sparks a rebellion in the Districts of Panem.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":361630,"ranking":10,"query_text":"what is targeted victory","passage_text":"Now, it seems, Hamas is being struck from the list of expletive targets. Hamas's Victory Anna Lekas Miller November 26, 2012 In fact, for many conservatives, it seems to be an expletive.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":5959586,"ranking":11,"query_text":"what is targeted victory","passage_text":"Katniss Everdeen and Peeta Mellark become targets of the Capitol after their victory in the 74th Hunger Games sparks a rebellion in the Districts of Panem. Katniss Everdeen is in District 13 after she shatters the games forever.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":2774621,"ranking":12,"query_text":"what is targeted victory","passage_text":"Margin of Victory. What is Margin of Victory? A statistic based on the difference between the number of points scored by the winning team and the number of points scored by the losing team. Margin of victory is used to quickly determine how significant the victory was by a particular team.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":1338444,"ranking":13,"query_text":"what is targeted victory","passage_text":"Admiral Dewey is best known for his victory at the Battle of... George Dewey was Admiral of the Navy, the only person in U.S. history to have attained the rank. Admiral Dewey is best known for his victory at the Battle of... George Dewey was Admiral of the Navy, the only person in U.S. history to have attained the rank. Admiral Dewey is best known for his victory at the Battle of Manila Bay during the Spanishâ\u0080\u0093American War. This video is targeted to blind users. Attribution: Article text available under CC-BY-SA Creative Commons image source in video","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":4863195,"ranking":14,"query_text":"what is targeted victory","passage_text":"Major Gerhard Barkhorn was the second highest scoring fighter ace in history, with 300 victories from 1941-45. He served in the eastern front, where he developed his target leading skills and became greatly feared.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":6161684,"ranking":15,"query_text":"what is targeted victory","passage_text":"The NYCC is unique in that it identifies and targets coaches that deal only with cheerleading. It's not a by-product of, nor included as part of other sports certification courses or organizations. We are dedicated solely to cheerleading! read more...he Raiderettes might not get to cheer for a lot victories on the field this season, but they got to cheer for a victory in court on Thursday. According to the Los Angeles Times, the Raiders have reached a settlement with their cheerleaders that involves the team paying the Raiderettes $1.25 million.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":3234255,"ranking":16,"query_text":"what is targeted victory","passage_text":"About dawn on New Year's Day, 1863, the Confederate Cottonclads entered the west end of Galveston harbor. Their nearest and first target was the Union's Harriet Lane. After a brief encounter and some maneuvering, the tide of battle foretold an almost certain Union victory.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":1489061,"ranking":17,"query_text":"what is targeted victory","passage_text":"When is Victory Day? What is Victory Day? Victory Day, also known as VJ Day, marks the anniversary the Allies` victory over Japan during World War II. It followed the dropping of the devastating atomic bomb on the Japanese cities of Hiroshima on August 6 and Nagasaki on August 9, 1945.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":4231238,"ranking":18,"query_text":"what is targeted victory","passage_text":"Twins win first game at Target Field. The Minnesota Twins are off to a sunny start at Target Field. After nearly three decades inside the Metrodome, the Twins moved outdoors and beat the Boston Red Sox 5-2 Monday behind hometown star Joe Mauer in the first regular-season game at their new ballpark. Jason Kubel hit the first home run and Carl Pavano earned the first victory.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":7601056,"ranking":19,"query_text":"what is targeted victory","passage_text":"1Having won a victory; triumphant. â\u0080\u0098a victorious armyâ\u0080\u0099. â\u0080\u0098the team defied the odds and emerged victoriousâ\u0080\u0099. â\u0080\u0098No victorious so-called army hands over weapons to a commission established by its enemy.â\u0080\u0099. â\u0080\u0098That obsessiveness is what is required in the modern, successful, consistently victorious athlete.â\u0080\u0099. â\u0080\u0098Of course the criminals with victorious armies needn't worry too much yet, but stay tuned.â\u0080\u0099.","bm25_label":"high","relevance_label":0.0},{"query_id":1045374,"passage_id":1535392,"ranking":20,"query_text":"what is targeted victory","passage_text":"What does OPTAR stand for? OPTAR stands for Operating\/Operational Target. Q: A: How to abbreviate Operating\/Operational Target? Operating\/Operational Target can be abbreviated as OPTAR. Q: A: What is the meaning of OPTAR abbreviation? The meaning of OPTAR abbreviation is Operating\/Operational Target. Q: A: What is OPTAR abbreviation? One of the definitions of OPTAR is Operating\/Operational Target. Q: A: What does OPTAR mean? OPTAR as abbreviation means Operating\/Operational Target. Q: A: What is shorthand of Operating\/Operational Target? The most common shorthand of Operating\/Operational Target is OPTAR.","bm25_label":"high","relevance_label":0.0}]