[{"query_id":1046475,"passage_id":7191554,"ranking":1,"query_text":"what is scott baio accused of","passage_text":"Scott Baio is accused of physical assault by former child actor Alexander Polinsky, who also confirms some of Nicole Eggert's allegations. Scott Baio is accused of physical assault by former child actor Alexander Polinsky, who also confirms some of Nicole Eggert's allegations.","bm25_label":"high","relevance_label":1.0},{"query_id":1046475,"passage_id":7191560,"ranking":2,"query_text":"what is scott baio accused of","passage_text":"Former child actress Nicole Eggert has accused Scott Baio of sexual abuse, alleging that he molested her starting at the age of 14 when they both worked on Charles in Charge. One of the people who has backed up her story is former costar Alexander Polinsky. In Polinsky's new statement, he levels some accusations of his own at Scott Baio.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":7191553,"ranking":3,"query_text":"what is scott baio accused of","passage_text":"Actress Nicole Eggert is accusing actor-director Scott Baio of having molested her repeatedly when she was 14 until she was 17. In a series of tweets Saturday morning, the former Charles in Charge and Baywatch star told another Twitter user commenting on Baio's support for President Donald Trump, Ask @scottbaio what happened in his garage at his house when I was a minor.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":4569644,"ranking":4,"query_text":"what is scott baio accused of","passage_text":"Parents from the elementary school where both Scott Baio's and Nancy Mack's children study are outraged over an alleged assault that took place during a school function. Baio filed a police report accusing the wife of Red Hot Chili Peppers drummer, Chad Smith, of battery.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":3758336,"ranking":5,"query_text":"what is scott baio accused of","passage_text":"Scott Baio as Chachi Charles. Scott Baio played Charles, the lead character who was obviously in Charge. Thereâ\u0080\u0099s a good chance youâ\u0080\u0099re familiar with Scott Baio. Heâ\u0080\u0099s been on a few shows youâ\u0080\u0099ve heard of (Arrested Development!","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":5645079,"ranking":6,"query_text":"what is scott baio accused of","passage_text":"Scott Baio's wife diagnosed with brain tumor. 645 CONNECTTWEETCOMMENTEMAILMORE. Scott Baio is asking for your thoughts and prayers. The actor, 54. reveals on Facebook that his wife, Renee Baio, has been diagnosed with a brain tumor.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":5645080,"ranking":7,"query_text":"what is scott baio accused of","passage_text":"Renee Baio and Scott Baio have been married for 9 years since 8th Dec 2007.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":7191559,"ranking":8,"query_text":"what is scott baio accused of","passage_text":"For his part, Scott Baio has vehemently denied Nicole Eggert's accusations. He has claimed that he and Nicole Eggert had sex, but only after she seduced him at his house and only when she was 18. He has also claimed that he never saw Nicole off of the set of Charles in Charge.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":5645076,"ranking":9,"query_text":"what is scott baio accused of","passage_text":"Scott Baio just wants to be normal in 'See Dad Run' clip -- EXCLUSIVE VIDEO. Scott Baio just wants to be a normal guy â\u0080\u0094 or, at least, his TV show character does. See Dad Run stars Baio as David Hobbs, an actor who played the perfect TV dad on a long-running sitcom.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":7191555,"ranking":10,"query_text":"what is scott baio accused of","passage_text":"Actress Nicole Eggert has claims that former Charles in Chargeco-star Scott Baio made inappropriate contact with her when she was still a child â\u0080\u0094 she starred on the series from when she was around 14 to 18 years old. She wrote on Twitter, Ask Scott Baio what happened in his garage when I was a minor. Creep. Ask @scottbaio what happened in his garage at his house when I was a minor.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":4569640,"ranking":11,"query_text":"what is scott baio accused of","passage_text":"Antonio Sabato Jr., left, and Scott Baio will speak at the Republican National Convention. The Republican National Convention has quite the line-up of speakers tonight in Cleveland. Not only is Scott Baio speaking, but so is Antonio Sabato Jr.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":7191561,"ranking":12,"query_text":"what is scott baio accused of","passage_text":"I witnessed Scott Baio acting inappropriately towards Nicole Eggert during my first year of working on the show. As Nicole has mentioned, some of Scott Baio's alleged inappropriate behavior took place on or near the set.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":7489210,"ranking":13,"query_text":"what is scott baio accused of","passage_text":"Scott Baio Marries Longtime Girlfriend. Scott Baio is 46â\u0080¦ and married. The former Happy Days star and legendary bachelor finally tied the knot with longtime girlfriend Renee Sloan in a rooftop ceremony at a luxury high-rise Saturday in Los Angeles.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":2349564,"ranking":14,"query_text":"what is scott baio accused of","passage_text":"An American television personality, musician, composer, actor, comedian, and writer. Though he got his start in radio, Allen is best-known for his television career. Born in New York, NY (1300). Scott Baio (1961 -) Born Scott Vincent James Baio.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":4569643,"ranking":15,"query_text":"what is scott baio accused of","passage_text":"Scott Baio speaks at the Republican National Convention. Not everyone loves Chachi, it seems. Actor and prominent backer of President-elect Donald Trump Scott Baio has filed a police report in California claiming that a woman attacked him at an event for their elementary school kids, TMZ is reporting.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":5645081,"ranking":16,"query_text":"what is scott baio accused of","passage_text":"Scott Baio's wife diagnosed with brain tumor. Scott Baio is asking for your thoughts and prayers. The actor, 54. reveals on Facebook that his wife, Renee Baio, has been diagnosed with a brain tumor. Just a few days ago we learned my wife, Renee has a meningioma brain tumor. Although 90% of these type of tumors are benign they can cause serious problems depending on the size of the tumor and the location.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":4569639,"ranking":17,"query_text":"what is scott baio accused of","passage_text":"Antonio Sabato Jr., left, and Scott Baio will speak at the Republican National Convention. (Chris Pizzello\/Invision\/AP; Amy Sussman\/Invision\/AP) The Republican National Convention has quite the line-up of speakers tonight in Cleveland. Not only is Scott Baio speaking, but so is Antonio Sabato Jr.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":4569635,"ranking":18,"query_text":"what is scott baio accused of","passage_text":"Scott Baio claims Red Hot Chili Peppers drummerâ\u0080\u0099s wife attacked him over Donald Trump support. Scott Baio's support of Donald Trump left one rock star's wife so red-hot, she physically attacked him, the actor claimed in a recent police report.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":4569641,"ranking":19,"query_text":"what is scott baio accused of","passage_text":"Scott Baio claims he was attacked by the wife of Red Hot Chili Pepperâ\u0080\u0099s drummer Chad Smith. (J. Scott Applewhite\/AP) She continued to repeat Trump's lewd remark over and over, Baio reportedly claims, telling him that everyone should hear it since the soon-to-be commander in chief said it.","bm25_label":"high","relevance_label":0.0},{"query_id":1046475,"passage_id":4569637,"ranking":20,"query_text":"what is scott baio accused of","passage_text":"Scott Baio says he was assaulted by the wife of Red Hot Chili Peppers drummer because he supports Trump. Actor Scott Baio contends he was assaulted by the wife of Red Hot Chili Peppers drummer Chad Smith over his support of President-elect Donald Trump. Authorities are now investigating, and Baioâ\u0080\u0099s wife is coming to his defense.","bm25_label":"high","relevance_label":0.0}]