[{"query_id":1046648,"passage_id":7779923,"ranking":1,"query_text":"who played fiddle for boxcar willie","passage_text":"Born Lecil Martin in Sterrett, Texas, in 1931, BoxCar Willie was the son of a railroad man who used to play his fiddle on the porch while his son played guitar. By his teens he was performing in jamborees all over the state, but he gave up show business to enlist in the Air Force, where he spent 22 years.","bm25_label":"high","relevance_label":1.0},{"query_id":1046648,"passage_id":7779922,"ranking":2,"query_text":"who played fiddle for boxcar willie","passage_text":"200 videos Play all Popular Videos - Boxcar Willie Boxcar Willie - Topic Country Road Songs: Bobby Bare, Boxcar Willie, Jimmy Dean - Duration: 40:28. onemediamusic 47,416 views","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":7779920,"ranking":3,"query_text":"who played fiddle for boxcar willie","passage_text":"Boxcar, Willie. Boxcar Willie. Known as the worldâ\u0080\u0099s favorite hobo, Boxcar Willie took a long train ride to his destination as a country music star. When he finally got there, he didnâ\u0080\u0099t waste a moment of his time.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":1808714,"ranking":4,"query_text":"who played fiddle for boxcar willie","passage_text":"Boxcar drummer Aaron Seibert and his wife are awaiting the birth of their first child, so the drums will play second fiddle for a while. John Sheridan & Joan Carroll at Boardwalk Bistro (7:30 Friday, 7 Saturday) Sometimes it's essential to catch some classy, and classic, piano\/vocal jazz.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":7779918,"ranking":5,"query_text":"who played fiddle for boxcar willie","passage_text":"He said he took the BoxCar Willie look and name after seeing a freight train pass him by one day in Lincoln, Neb., as he was stuck in traffic. And there was an old boy sitting on a boxcar, dressed the way I dress today, and he looked just like a buddy of mine named Willie Wilson, he told The Associated Press in 1997.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":7779919,"ranking":6,"query_text":"who played fiddle for boxcar willie","passage_text":"Singer Boxcar Willie Dies Of Leukemia At 67. BRANSON, Mo. - BoxCar Willie, whose gentle country voice and songs of life on the road evoked memories of a time when hobos watched America pass by from the door of a freight car, died yesterday of leukemia. He was 67. The singer died at home, surrounded by his family and close friends, family spokeswoman Chisai Childs said.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":7779915,"ranking":7,"query_text":"who played fiddle for boxcar willie","passage_text":"Eventually he realized that music was what he wanted to do with his life, and in 1976 he took a discharge from the Air Force. He moved to Nashville, Tennessee, and adopted the moniker Boxcar Willie based on a song he'd written in the mid-1960s. As Boxcar Willie, Martin took on the persona of an affable hobo, traveling the railways, singing a song. His costume consisted of scuffed shoes, a worn-out hat, patched overalls, and a scruffy beard. Over the years he had perfected his talent of being able to mimic the sound of a train whistle.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":453744,"ranking":8,"query_text":"who played fiddle for boxcar willie","passage_text":"Usage notes: This phrase comes from a story about the Roman emperor Nero, who fiddled (= played the violin) while the city of Rome was burning. Environmentalists claim that the government is fiddling while Rome burns. See also: burn, fiddle, Rome.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":1878238,"ranking":9,"query_text":"who played fiddle for boxcar willie","passage_text":"The violin is sometimes called a â\u0080\u009c fiddle â\u0080\u009d. Someone who plays it is a â\u0080\u009cfiddlerâ\u0080\u009d. There is even a verb, to â\u0080\u009cfiddle, which means â\u0080\u009cto play the fiddleâ\u0080\u009d. This word can be used as a nickname for the violin.tudents learning to play a violin may put dots or stickers on the fingerboard to help them learn how to play. The violin is the smallest and highest pitched string instrument. A person who plays the violin is called a violinist.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":6307976,"ranking":10,"query_text":"who played fiddle for boxcar willie","passage_text":"Someone recently sent me a political cartoon depicting President Obama playing the fiddle while the United States was burning in the background. It was portraying the Prez as the infamous Roman emperor Nero who â\u0080\u009cfiddled while Rome burned to the ground from a fire that he was rumored to have set himself.omeone recently sent me a political cartoon depicting President Obama playing the fiddle while the United States was burning in the background. It was portraying the Prez as the infamous Roman emperor Nero who â\u0080\u009cfiddled while Rome burned to the ground from a fire that he was rumored to have set himself.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":7779916,"ranking":11,"query_text":"who played fiddle for boxcar willie","passage_text":"Boxcar Willie bio Born Lecil Travis Martin on September 1, 1931, in Sterrat, TX; died on April 12, 1999, in Branson, MO, of leukemia; married second wife Lloene Johnson, c. 1962; children: Tammy (firs...","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":8050180,"ranking":12,"query_text":"who played fiddle for boxcar willie","passage_text":"Tomatoes come in about every color from white to purple, pink, yellow, orange, mottled, or, yes, striped. (No polka-dots.) Commonly grown varieties include Beefsteak, Big Boy, Brandywine and Boxcar Willie, to touch only on the Bs.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":1878239,"ranking":13,"query_text":"who played fiddle for boxcar willie","passage_text":"edit Differences in Playing Style and Technique. When played in a folk style, it is said to be a fiddle and when played in classical tones it's called a violin. In fact, the playing style is the main criteria that differs the fiddle from the violin.The violinist reproduces the composerâ\u0080\u0099s music with exacting accuracy, down to the loudness of individual notes. violin is called a fiddle when playing folk music. A fiddle is also a colloquial term for instruments used by players in all genres, including classical music. Fiddle playing, or fiddling, is a style of music.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":4031542,"ranking":14,"query_text":"who played fiddle for boxcar willie","passage_text":"Suetonius, who was not even born at the time of the fire, and  Cassius Dio, who lived about 100 years after the episode, were the  ones who alleged that Nero set Rome alight. According to one legend  Nero played the fiddle during the fire. However, the fiddle did not  exist in Nero's time.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":7779914,"ranking":15,"query_text":"who played fiddle for boxcar willie","passage_text":"As a symbol of Americana, Boxcar Willie's dedication to traditional country music earned the widespread appreciation of audiences in Europe, where he first established his career. In his lifetime, he wrote over 400 songs, recorded duets with country music icons Willie Nelson and Hank Williams, Jr., and became one of the first performers to establish his own theater in Branson, Missouri.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":1981846,"ranking":16,"query_text":"who played fiddle for boxcar willie","passage_text":"How come on Willy Wonka and the Chocolate Factory the golden tickets skip the hood? WHo played the girl in who wanted goose eggs in the 1970s willy wonka movie??? Willy Wonka and the Chocolate Factory (1971), or Charlie and the Chocolate Factory (2005)?","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":2455392,"ranking":17,"query_text":"who played fiddle for boxcar willie","passage_text":"In a tragic, confounding dose of irony, Keiko, the whale-actor who played Willy, was languising in a marine park in Mexico after filming.n a tragic, confounding dose of irony, Keiko, the whale-actor who played Willy, was languising in a marine park in Mexico after filming.","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":4237387,"ranking":18,"query_text":"who played fiddle for boxcar willie","passage_text":"Related Willy Wonka and the Chocolate Factory Questions. What is the name of the bad guy in the first Willy Wonka Movie? The bad guy in Willy Wonka & the Chocolate Factory (1971) is Mr. Slugworth,... Who was Willy Wonka in the movie Willy Wonka? Gene Wilder played Willy Wonka in the 1971 version of Willy Wonka and The...","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":6721324,"ranking":19,"query_text":"who played fiddle for boxcar willie","passage_text":"The main thing that makes a fiddle a fiddle and a violin a violin is the type of music that is played on it. Generally, fiddles play folk\/traditional genres (e.g. Cajun music, Irish trad, and klezmer), and violins play composition-based genres (e.g. Western classical music, Indian classical music, and jazz).","bm25_label":"high","relevance_label":0.0},{"query_id":1046648,"passage_id":1746805,"ranking":20,"query_text":"who played fiddle for boxcar willie","passage_text":"What is a Violin Made out of. 21 Sep, 2011 what is 1. A violin is a popular string instrument that is played with a bow. The violin is also called a fiddle and someone who plays the instrument is known as a violinist or a fiddler.The instrument is used in a wide variety of musical styles and genres. The modern violin was invented in the early 16th century in Italy.he violin is also called a fiddle and someone who plays the instrument is known as a violinist or a fiddler. The instrument is used in a wide variety of musical styles and genres. The modern violin was invented in the early 16th century in Italy.","bm25_label":"high","relevance_label":0.0}]