[{"query_id":1046463,"passage_id":7191635,"ranking":1,"query_text":"what is sealaska corporation","passage_text":"Private Property signs on Sealaska Corporation lands (photo from the Sealaska Shareholder's Underground) In a recent Letter to the Editor in the Sitka Sentinel, the President and CEO of Sealaska Corporation attempted to waylay our fears that the public would not be allowed on landstransferredto the corporation's private ownership by the Sealaska Bill.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":7191633,"ranking":2,"query_text":"what is sealaska corporation","passage_text":"Definition of Sealaska Corporation â\u0080\u0093 Our online dictionary has Sealaska Corporation information from International Directory of Company Histories dictionary. Encyclopedia.com: English, psychology and medical dictionaries","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":7191630,"ranking":3,"query_text":"what is sealaska corporation","passage_text":"Dear Editor: Recently the Sealaska Corporation's President and Corporate Executive Officer (CEO), Chris McNeil called out the Sitka Conservation Society in a letter to the editor and called us out for causing anxiety, anger, and opposition to Sealaska's actions.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":7191631,"ranking":4,"query_text":"what is sealaska corporation","passage_text":"Sealaska Corporation. 1 Sealaska Plaza, #400 Juneau, Alaska 99801-1276 U.S.A. Telephone: (907) 586-1512 Fax: (907) 586-1826 Web site: http:\/\/www.sealaska.com","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":7191632,"ranking":5,"query_text":"what is sealaska corporation","passage_text":"Sealaska, which had 15,750 shareholders at the time, rejected the offer. Klukwan was the most prosperous Native corporation, with a $30 million fund that paid its 270 shareholders large annual dividends. Sealaska asserted that it was not for sale.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":7191628,"ranking":6,"query_text":"what is sealaska corporation","passage_text":"A Native-owned corporation with more than 16,500 shareholders, Sealaska Corporation is the largest private landholder in southeast Alaska. The company's principal investments include forest products, financial markets, telecommunications, entertainment, plastics, and minerals development.","bm25_label":"high","relevance_label":1.0},{"query_id":1046463,"passage_id":7191626,"ranking":7,"query_text":"what is sealaska corporation","passage_text":"In the same year, Sealaska and another Native corporation participated in an acre-for-acre land exchange with the federal government. The government received 2,400 acres of watershed lands, while the Native corporations received an equal number of acres of national forest land, with rights to log on them.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":2382090,"ranking":8,"query_text":"what is sealaska corporation","passage_text":"Most of these people have relocated to more populous areas of southeast Alaska for more abundant employment opportunities. Sealaska and other ANSCA corporations provide corporate and managerial positions to some Tlingit people. In 1978, tribal courts were introduced in the Sitka area to resolve civil disputes between various peoples and clans.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":7085859,"ranking":9,"query_text":"what is sealaska corporation","passage_text":"S Corporation Types of Businesses; Do Sole Proprietors Have Double Taxation? Terminating vs. Freezing a Pension Plan; What Are the Three Different Types of Corporate Mergers & What Is the Rationale for Each Type? Three Types of Corporate Governance Mechanisms; What Type of Corporation Is a Nonprofit? What Type of Stock for a C Corporation? Types of Corporate Level Strategy","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":8563394,"ranking":10,"query_text":"what is sealaska corporation","passage_text":"1. What is a corporation? 2. Which jurisdiction should I incorporate in? 3. What are the advantages of incorporation? 4. What are the disadvantages of incorporating? 5. What is a named corporation? 6. What is a numbered corporation? 7. What are the advantages and disadvantages of a numbered corporation? 8. Do I need to hire an attorney to incorporate? 9.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":8458993,"ranking":11,"query_text":"what is sealaska corporation","passage_text":"Though it is the first state to pass the Flexible Purpose Corporation type, California is the sixth state to approve the Benefit Corporation classification. Here is a look at exactly what Benefit Corporations and Flexible Purpose Corporations are, and what they could mean for your company. What is a Benefit Corporation? The Benefit Corporation is a new class of corporation that allows companies to pursue profit as well as a strong social and environmental mission. Under current corporate law, a companyâ\u0080\u0099s sole mandate is to maximize shareholder value â\u0080\u0094 make as much profit as possible â\u0080\u0093for its shareholders.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":774150,"ranking":12,"query_text":"what is sealaska corporation","passage_text":"1 [Business Name Stand] | What Does LTD After a Business Name Stand For? 2 [LTD Mean] | What Does LTD Mean After a Business Name? 3 [Incorporation Corporation] | The Differences Between Incorporation, Corporation & Non-Profit 4 [Enterprise Corporation] | What Are the Meanings of Enterprise, Corporation & Incorporated?","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":2163540,"ranking":13,"query_text":"what is sealaska corporation","passage_text":"Frontier Communications story: What do Analysts Say about Frontier Communications Corporation and other headlines for Frontier Communications Corporation Frontier Communications story: What do Analysts Say about Frontier Communications Corporation and other headlines for Frontier Communications Corporation","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":6735752,"ranking":14,"query_text":"what is sealaska corporation","passage_text":"What is DELAWARE CORPORATION? Corporations registered in Delaware. That sate has flexible laws about interest and corporations.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":8424471,"ranking":15,"query_text":"what is sealaska corporation","passage_text":"Since a corporation is said to be a â\u0080\u009cpersonâ\u0080\u009d, the documentary then was assessing the corporation as a â\u0080\u009cpersonalityâ\u0080\u009d and showed viewers everything a corporation was doing wrong in harming a real person. The film showed diagnostic criteria of a human psychopath, and many corporations had what it took to be labeled one.ince a corporation is said to be a â\u0080\u009cpersonâ\u0080\u009d, the documentary then was assessing the corporation as a â\u0080\u009cpersonalityâ\u0080\u009d and showed viewers everything a corporation was doing wrong in harming a real person. The film showed diagnostic criteria of a human psychopath, and many corporations had what it took to be labeled one.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":1847625,"ranking":16,"query_text":"what is sealaska corporation","passage_text":"What is a conglomerate? What is the difference between a corporation and a conglomerate? A conglomerate is refers to a grouping of two or more corporations which are entirely engaged in diverse businesses that fall in one corporate group. It normally involves a main company and several subsidiaries.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":844164,"ranking":17,"query_text":"what is sealaska corporation","passage_text":"Definition of corporate in the AudioEnglish.org Dictionary. Meaning of corporate. What does corporate mean? Proper usage and audio pronunciation (and phonetic transcription) of the word corporate. Information about corporate in the AudioEnglish.org dictionary, synonyms and antonyms.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":2325047,"ranking":18,"query_text":"what is sealaska corporation","passage_text":"embodied - possessing or existing in bodily form; what seemed corporal melted as breath into the wind- Shakespeare; an incarnate spirit; `corporate' is an archaic term. incarnate, bodied, corporal, corporate.","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":2748285,"ranking":19,"query_text":"what is sealaska corporation","passage_text":"Financial Assistant (Corporate) Salaries. View Financial Assistant (Corporate) Hourly Wages. Alternate Job Titles: Corporate Financial Assistant, Financial Assistant (Corporate), Finance Assistant - Corporate. What is the average annual salary for Financial Assistant (Corporate)?","bm25_label":"high","relevance_label":0.0},{"query_id":1046463,"passage_id":1684616,"ranking":20,"query_text":"what is sealaska corporation","passage_text":"S corporations can legally pay what is considered a reasonable salary to shareholders who are officers of the corporation and who work for the corporation.","bm25_label":"high","relevance_label":0.0}]