[{"query_id":1047625,"passage_id":7721285,"ranking":1,"query_text":"who plays ash the porcupine in sing","passage_text":"Scarlett Johansson Plays Ash, the Prickly Porcupine, in SING. Superstar Scarlett Johansson breathes life to Ash, a prickly teenage porcupine with a punk-rock attitude, in Universal Pictures and Illuminationâ\u0080\u0099s Sing, a musical comedy about finding the shining star that lives inside all of us.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":7721281,"ranking":2,"query_text":"who plays ash the porcupine in sing","passage_text":"Scarlett Johansson Plays Ash, the Prickly Porcupine, in SING. by Â· December 24, 2016. Superstar Scarlett Johansson breathes life to Ash, a prickly teenage porcupine with a punk-rock attitude, in Universal Pictures and Illuminationâ\u0080\u0099s Sing, a musical comedy about finding the shining star that lives inside all of us.","bm25_label":"high","relevance_label":1.0},{"query_id":1047625,"passage_id":2274112,"ranking":3,"query_text":"who plays ash the porcupine in sing","passage_text":"mike sing buster moon sing meena sing ash sing rosita sing johnny sing sing sing 2016 sing movie johnny the gorilla mike the mouse buster sing buster moon rosita the pig ash the porcupine.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":2274111,"ranking":4,"query_text":"who plays ash the porcupine in sing","passage_text":"mike sing rosita sing buster moon buster moon sing johnny sing ash sing gunter sing mike's girlfriend sing sing 2016 sing movie johnny the gorilla ash the porcupine gunter the pig rosita the pig mike the mouse.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":5506355,"ranking":5,"query_text":"who plays ash the porcupine in sing","passage_text":"Scarlett Johansson Goes Rock in New Song from the Sing Soundtrack - Listen Here! Scarlett Johansson has one of the most easily recognizable voices in Hollywood, and sheâ\u0080\u0099s once again setting it to music. The 32-year-old actress lends her voice to the upcoming animated feature Sing, in which she plays a porcupine named Ash.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":2524216,"ranking":6,"query_text":"who plays ash the porcupine in sing","passage_text":"Then we see porcupines Ash (Scarlett Johansson) and her boyfriend Lance (Beck Bennett), a punk rock duo with Lance singing lead. He doesn't like it when Ash steps in to sing on her own. Somewhere else across town we meet Meena the elephant (Tori Kelly), singing to her grandfather (Jay Pharaoh) for his birthday.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":5506354,"ranking":7,"query_text":"who plays ash the porcupine in sing","passage_text":"Scarlett Johansson, a prickly porcupine in â\u0080\u009cSingâ\u0080\u009d. InqPOP! | December 22nd, 2016. Superstar Scarlett Johansson breathes life to Ash, a prickly teenage porcupine with a punk-rock attitude, in Universal Pictures and Illuminationâ\u0080\u0099s Sing, a musical comedy about finding the shining star that lives inside all of us.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":7623836,"ranking":8,"query_text":"who plays ash the porcupine in sing","passage_text":"Scarlett Johansson on Punk Rock Porcupine Role for Sing. And just like Idol, you find yourself rooting for the competitors like stay-at-home pig mom Rosita (Reese Witherspoon), street musician mouse Mike (Seth MacFarlane), punk rock porcupine Ash (Scarlett Johansson), and shy elephant Meena (Tori Kelly).","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":7721284,"ranking":9,"query_text":"who plays ash the porcupine in sing","passage_text":"Scarlett Johansson Goes Rock in New Song from the Sing Soundtrack - Listen Here! Scarlett Johansson has one of the most easily recognizable voices in Hollywood, and sheâ\u0080\u0099s once again setting it to music. The 32-year-old actress lends her voice to the upcoming animated feature Sing, in which she plays a porcupine named Ash. Although the movie doesnâ\u0080\u0099t hit theaters until Dec. 21, fans can hear Johansson rock out to a song from the soundtrack called â\u0080\u009cSet It All Free,â\u0080\u009d which was released Friday.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":4056088,"ranking":10,"query_text":"who plays ash the porcupine in sing","passage_text":"Scarlett Johansson To Play Singing Porcupine in New Animated Film. Scarlett Johansson has joined the cast of an upcoming animated film in which Matthew McConaughey, as a koala, produces the world's greatest sining competition. The movie is called Sing, and it's slated for a December 2016 release. Johansson will play a punk rock porcupine. The movie reportedly features over 85 songs â\u0080\u0093 from the 1940s to the present. It's already booked John C. Reilly, Seth MacFarlane, Reese Witherspoon, Taron Egerton, and Tori Kelly.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":4023583,"ranking":11,"query_text":"who plays ash the porcupine in sing","passage_text":"Formed out of the ashes of his seven-piece The Joneses last summer, they are Edgar - who writes, sings and plays bass - Edgar's nephew Nick Miniski on drums and his mate Stuart Gimblett on guitar, who had previously played together in a Liverpool band The Pedantics.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":4023586,"ranking":12,"query_text":"who plays ash the porcupine in sing","passage_text":"Formed out of the ashes of seven-piece The Joneses, they are Edgar Jones - who writes, sings and plays bass - Edgar's nephew Nick Miniski on drums and his mate Stuart Gimblett on guitar.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":7721282,"ranking":13,"query_text":"who plays ash the porcupine in sing","passage_text":"Universal Pictures. It doesn't hit theaters until Dec. 21, but Sing will have you tapping your feet and belting out your favorite pop songs in no time. The animated film follows a Koala (Matthew McConaughey) trying to keep his old theater in business by holding a live American Idol-like singing competition show. And E! News gave the first look at the new Sing poster featuring Scarlett Johansson and Ash, the brokenhearted teen porcupine rocker she voices in the movie.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":4689998,"ranking":14,"query_text":"who plays ash the porcupine in sing","passage_text":"We then see a homemaker pig named Rosita (Reese Witherspoon), a gorilla named Johnny (Taron Egerton) whoâ\u0080\u0099s father is a gangster, a porcupine named Ash (Scarlett Johannson) and others who all want to win the contest.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":1336858,"ranking":15,"query_text":"who plays ash the porcupine in sing","passage_text":"High resolution official theatrical movie poster ( of for Sing Image dimensions: 1293 x Directed by Garth Jennings. Starring Scarlett Johansson, Matthew McConaughey, Nick Offerman, Reese Witherspoon. SING character poster for Ash played by Scarlett Johansson's.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":5506359,"ranking":16,"query_text":"who plays ash the porcupine in sing","passage_text":"SCARLETT JOHANSSON AND ASH. For the first time ever, SCARLETT JOHANSSON appears with her character, Ash, from Illumination Entertainmentâ\u0080\u0099s Sing. Ash is a betrayed teenager who will mend her broken heart through the power of rock-and-roll.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":2489957,"ranking":17,"query_text":"who plays ash the porcupine in sing","passage_text":"Do porcupines do anything good? Although porcupines are most known for their quills, quills are only one of the... Who is the porcupine A porcupine is one of several rodents covered with stiff, sharp, spines or quills,...","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":8221787,"ranking":18,"query_text":"who plays ash the porcupine in sing","passage_text":"A Tree Song - Rudyard Kipling     Of all the trees that grow so fair,   Old England to adorn,   Greater are none beneath thâ\u0080¦e Sun,   Than Oak and Ash and Thorn.   Sing Oak and Ash and Thorn, good Sirs   (All of a Midsummer morn)!   Surely we sing no little thing,   In Oak and Ash and Thorn!","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":3386642,"ranking":19,"query_text":"who plays ash the porcupine in sing","passage_text":"Successful Singingâ\u0080\u0099s Glossary Of Singing Terms: A Cappella: Singing without any form of instrumental accompaniment. Accompaniment: The instrumentation that plays beneath the singing. Accompanist: A pianist who plays music beneath the singing. Adducted: The term for vocal cords getting pulled together when you sing high up in your vocal range.","bm25_label":"high","relevance_label":0.0},{"query_id":1047625,"passage_id":4302634,"ranking":20,"query_text":"who plays ash the porcupine in sing","passage_text":"Sing â\u0080\u0093 2016 Animation Movie â\u0080\u0093 Trailer Songs. Sing is an upcoming American animated comedy, scheduled to be released on December 21, 2016. Cast: Matthew McConaughey (koala), Seth MacFarlane (mouse), John C. Reilly as Eddie (Sheep), Reese Witherspoon (pig), Scarlett Johansson (porcupine) & Taron Egerton (gorilla).","bm25_label":"high","relevance_label":0.0}]