[{"query_id":1047629,"passage_id":7189286,"ranking":1,"query_text":"what is pummelo","passage_text":"Health Benefits The Pummelo is the largest member of the citrus Nutrition information for pummelos and tips on how toselect, store and prepare them. Health Benefits The Pummelo is the largest member of the citrus family and tastes like a sweet, mild grapefruit. It is also known as a shaddock.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":7189295,"ranking":2,"query_text":"what is pummelo","passage_text":"Additionally, the pummelo tree produces very attractive, fragrant and large white colored flowers. These flowers are often used in Asia to make perfumes. Because the pummelo fruit is related to the grapefruit, it has a taste that is tangy. However, pummelo fruit is sweeter in taste than the grapefruit. You can purchase fresh pummelos through the winter months at some larger supermarket chains and at specialty fruit and vegetable markets.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":808406,"ranking":3,"query_text":"what is pummelo","passage_text":"The grapefruit's cousins include: 1  Common sweet orange: pummelo Ã\u0097 mandarin hybrid. 2  Bitter orange: a different pummelo Ã\u0097 mandarin hybrid. 3  Mandelos: pummelo Ã\u0097 mandarine (Citrus maxima). 4  Hyuganatsu may also be a pumelo hybrid.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":6086029,"ranking":4,"query_text":"what is pummelo","passage_text":"However, pummelo fruit is sweeter in taste than the grapefruit. You can purchase fresh pummelos through the winter months at some larger supermarket chains and at specialty fruit and vegetable markets. When purchasing a pummelo, select only those that have a fragrant scent and that are firm to the touch.his is because the pummelo has a sweet citrus flavor that makes it appealing as a delicious, quick snack food or as an addition to more elaborate entrees and salads. PayPal Donate link: https:\/\/www.paypal.com\/cgi-bin\/webscr...","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":6086030,"ranking":5,"query_text":"what is pummelo","passage_text":"How to peel a pummelo. If you found this helpful, why not donate 50 cents at PayPal: https:\/\/www.paypal.com\/cgi-bin\/webscr... The pummelo is an exotic large citrus fruit that is an ancestor of the common grapefruit.his is because the pummelo has a sweet citrus flavor that makes it appealing as a delicious, quick snack food or as an addition to more elaborate entrees and salads. PayPal Donate link: https:\/\/www.paypal.com\/cgi-bin\/webscr...","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":2371498,"ranking":6,"query_text":"what is pummelo","passage_text":"Citrus paradisi. A relative newcomer to the citrus clan, the grapefruit was originally believed to be a spontaneous sport of the pummelo (q.v.). James MacFayden, in his Flora of Jamaica, in 1837, separated the grapefruit from the pummelo, giving it the botanical name, Citrus paradisi Macf.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":2316188,"ranking":7,"query_text":"what is pummelo","passage_text":"The pummelo is also known as the pomelo, the shaddock, the country of French as chadec, the Malayan limau besar, the Bali lemon, and the Chinese grapefruit have they characteristic of being the largest citrus fruit. The pummelo is, essentially, a kindler, gentler, giant cousin of the grapefruit with great sweet taste.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":4946244,"ranking":8,"query_text":"what is pummelo","passage_text":"Propagation Though the seeds of the pummelo are monoembryonic, seedlings usually differ little from their parents and therefore most pummelos in the Orient are grown from seed. The seeds can be stored for 80 days at 41Âº F(5Âº C) and 56-58% relative humidity.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":4946247,"ranking":9,"query_text":"what is pummelo","passage_text":"Coconut and betel nut palms are planted for shade for the young citrus trees but are removed at the end of 3-5 years, or sometimes not until the pummelos are 10 to 15 years old. Rice may be grown in the ditches. The pummelo trees are spaced 10 to 15 ft (3-4.5 m) apart.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":7189291,"ranking":10,"query_text":"what is pummelo","passage_text":"How to peel a pummelo. If you found this helpful, why not donate 50 cents at PayPal: https:\/\/www.paypal.com\/cgi-bin\/webscr... The pummelo is an exotic large citrus fruit that is an ancestor of the common grapefruit. It originated in Asia and is grown in many eastern countries including China, Japan, India, Fiji, Malaysia, and Thailand.","bm25_label":"high","relevance_label":1.0},{"query_id":1047629,"passage_id":8673057,"ranking":11,"query_text":"what is pummelo","passage_text":"The pummelo, also known as Chinese grapefruit, is considered the ancestor of the white, pink and ruby grapefruit. It's the largest of all citrus fruits, typically weighing 2 to 4 pounds. These ball-size fruits are used in rituals during Chinese New Year and are said to resemble a full moon. When ripe, the pummelo is pale green or yellow.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":433368,"ranking":12,"query_text":"what is pummelo","passage_text":"Minneolas are hybrids of a tangerine and a grapefruit. They are so distinctive that they earned their own classification in scientific terms, called tangelo, derived from tangerine x pomelo hybrid.(Aside Pomelo = Grapefruit; Pummelo = Shaddock or pample mousse).inneolas are hybrids of a tangerine and a grapefruit. They are so distinctive that they earned their own classification in scientific terms, called tangelo, derived from tangerine x pomelo hybrid. (Aside Pomelo = Grapefruit; Pummelo = Shaddock or pample mousse).","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":3159734,"ranking":13,"query_text":"what is pummelo","passage_text":"Citrus maxima (or Citrus grandis), (Common names: shaddock, pomelo, pummelo, pommelo, pamplemousse or shaddok) is an original citrus fruit, with the look of a big grapefruit, native to South and Southeast Asia.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":7189288,"ranking":14,"query_text":"what is pummelo","passage_text":"HOME > Fruit & Veggie Info > Fruit & Vegetable Nutrition > Fruit & Vegetable Nutrition Database > Fruit Nutrition Database > Pummelo: Nutrition . Selection . Storage - Fruits & Veggies More Matters","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":1434994,"ranking":15,"query_text":"what is pummelo","passage_text":"Pomelos Described. The pomelo is the patriarch of the citrus family â\u0080\u0093 albeit underappreciated. Sometimes called pummelo, pommelo, shaddock or jabong, pomelos resemble overgrown grapefruits, but are in fact an ancestor to the grapefruit.And while hefty in size, donâ\u0080\u0099t be fooled into thinking youâ\u0080\u0099ll get pomelo juice for days. Much of a pomeloâ\u0080\u0099s bulk is in its foam-like pith, which makes it awesome for candying.omelos Described. The pomelo is the patriarch of the citrus family â\u0080\u0093 albeit underappreciated. Sometimes called pummelo, pommelo, shaddock or jabong, pomelos resemble overgrown grapefruits, but are in fact an ancestor to the grapefruit.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":7189294,"ranking":16,"query_text":"what is pummelo","passage_text":"Health benefits Strengthen immune system, Supports digestive health, Normalize blood pressure, Lower cramps, Slows down aging Pummelo scientifically known as Citrus maxima, is native to Southeast Asia (Thailand and Malaysia).","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":3159732,"ranking":17,"query_text":"what is pummelo","passage_text":"Brief Summary. Learn more about this article. Citrus maxima, the pomelo (also called pummelo or shaddock) in the Rutaceae (citrus family). It is a medium-sized tree but the largest of all Citrus species, with large leaves, flowers, and fruits.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":3859879,"ranking":18,"query_text":"what is pummelo","passage_text":"1 Citrus can be defined as a family of trees that are grown in warm regions for their edible fruit, thick rind and pulpy flesh.  Citrus fruit includes oranges, grapefruits, mandarins, tangerines, tangelos, lemons, limes, citron and pummelos.","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":85488,"ranking":19,"query_text":"what is pummelo","passage_text":"Calorie Counts and Nutrition Facts. By Barbie Cervoni, RD, CDE - Reviewed by a board-certified physician. Grapefruits are an 18th-century hybrid of the orange and pummelo (a large, coarse fruit used mostly found in Middle and Far Eastern cuisines).","bm25_label":"high","relevance_label":0.0},{"query_id":1047629,"passage_id":3859872,"ranking":20,"query_text":"what is pummelo","passage_text":"Texas Citrus Learning Center. Description of Citrus Fruits. Fruits that grow on evergreen trees in subtropical regions around the world. Citrus fruits include grapefruit, oranges, lemons, limes, mandarins, tangerines, tangelos, pummelos, kumquats, citron and calamondin.","bm25_label":"high","relevance_label":0.0}]