[{"query_id":1048565,"passage_id":2602415,"ranking":1,"query_text":"who plays sebastian michaelis","passage_text":"In the popular manga and anime series Black Butler, one of the primary characters is named Sebastian Michaelis. Sebastian is a demon playing the role of a butler, bound to his young master Ciel Phantomhive by way of an unbreakable contract.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":2014746,"ranking":2,"query_text":"who plays sebastian michaelis","passage_text":"sebaciel kuroshitsuji black butler ciel phantomhive sebastian michaelis demon ciel demon sebastian sebastian michaelis cosplay ciel phantomhive cosplay cosplay kuroshitsuji cosplay blackbutler cosplay halloween irllaxcosplay.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":4231768,"ranking":3,"query_text":"who plays sebastian michaelis","passage_text":"1 Sebastian is the first demon to appear in Kuroshitsuji and the only one in the manga. 2  On Sebastian's grave, his epitaph included the following inscriptions: 'To The Memory of Sebastian Michaelis.3  Died March 1889. So Sebastian should technically be called Michaelis by Ciel and Mr. Michaelis by the other servants. 2  When Sebastian was summoned in the manga, he appeared in his true demon form; in the anime, he appeared as a crow or raven accompanied by a rain of feathers.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":4231772,"ranking":4,"query_text":"who plays sebastian michaelis","passage_text":"1 He is ranked among the Demon Six.. 2  Sebastian is the first demon to appear in Kuroshitsuji and the only one in the manga. 3  On Sebastian's grave, his epitaph included the following inscriptions: 'To The Memory of Sebastian Michaelis.4  Died March 1889. So Sebastian should technically be called Michaelis by Ciel and Mr. Michaelis by the other servants. 2  When Sebastian was summoned in the manga, he appeared in his true demon form; in the anime, he appeared as a crow or raven accompanied by a rain of feathers.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7772422,"ranking":5,"query_text":"who plays sebastian michaelis","passage_text":"Anime Sebastian Michaelis Cosplay Costume any size. Anime Black Butler Sebastian Michaelis Cosplay Costume ANY SIZE. Noticeï¼\u009awe own a cosplay factory and provide wholesale price of commerce,We have six years of experience in fashion cosplay design.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7772426,"ranking":6,"query_text":"who plays sebastian michaelis","passage_text":"Kuroshitsuji(Black Butler)Cosplay Costume - Sebastian Michaelis Butler 2nd versi. Product name: Kuroshitsuji(Black Butler)Cosplay Costume - Sebastian Michaelis Butler 2nd version. 1.Please well note there might be exist minor difference between the costume you will get and the one ...","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":4231767,"ranking":7,"query_text":"who plays sebastian michaelis","passage_text":"RE: Does Sebastian Michaelis from Kuroshitsuji have a birthday? I know that he&#39;s a demon and junk, but it seems that every anime character has a birthday whether it&#39;s relevant or not.Just wondering. :3.Source(s): sebastian michaelis kuroshitsuji birthday: https:\/\/shortly.im\/AEio5.est Answer: Not every anime character has a birthday (that was revealed, that is.) & I don't think it was ever said what Sebastian's birthday is...","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":4231769,"ranking":8,"query_text":"who plays sebastian michaelis","passage_text":"The series takes place in England during the reign of Queen Victoria. It follows Sebastian Michaelis, a demonic butler obliged to serve twelve-year-old (later thirteen-year-old) Earl Ciel Phantomhive due to a contract he made with Ciel. In exchange for binding Sebastian to his will, Ciel offers his soul to him.t follows Sebastian Michaelis, a demonic butler obliged to serve twelve-year-old (later thirteen-year-old) Earl Ciel Phantomhive due to a contract he made with Ciel. In exchange for binding Sebastian to his will, Ciel offers his soul to him.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7772425,"ranking":9,"query_text":"who plays sebastian michaelis","passage_text":"Clockwise from center: Ciel Phantomhive, Finnian, Mey-Rin, Baldroy, Sebastian Michaelis, and Tanaka. The manga and anime series Black Butler features an extensive cast of characters created by Yana Toboso. The series takes place in England during the reign of Queen Victoria. It follows Sebastian Michaelis, a demonic butler obliged to serve twelve-year-old (later thirteen-year-old) Earl Ciel Phantomhive due to a contract he made with Ciel. In exchange for binding Sebastian to his will, Ciel offers his soul to him.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":4231771,"ranking":10,"query_text":"who plays sebastian michaelis","passage_text":"Sebastian Michaelis (ã\u0082»ã\u0083\u0090ã\u0082¹ã\u0083\u0081ã\u0083£ã\u0083³ã\u0083»ã\u0083\u009fã\u0082«ã\u0082¨ã\u0083ªã\u0082¹, Sebasuchan Mikaerisu) , the title character, is the demon butler of the Phantomhive household and acts as Ciel's bodyguard. Being a butler is a job he is completely devoted to, following Ciel's orders with great loyalty and swiftness.t follows Sebastian Michaelis, a demonic butler obliged to serve twelve-year-old (later thirteen-year-old) Earl Ciel Phantomhive due to a contract he made with Ciel. In exchange for binding Sebastian to his will, Ciel offers his soul to him.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":6803165,"ranking":11,"query_text":"who plays sebastian michaelis","passage_text":"The original residents of the Phantomhive manor as they appear in the first volume of the manga. Clockwise from center: Ciel Phantomhive, Finnian, Mey-Rin, Baldroy, Sebastian Michaelis, and Tanaka. The manga and anime series Black Butler features an extensive cast of characters created by Yana Toboso. The series takes place in England during the reign of Queen Victoria. It follows Sebastian Michaelis, a demonic butler obliged to serve twelve-year-old (later thirteen-year-old) Earl Ciel Phantomhive due to a contract he made with Ciel. In exchange for binding Sebastian to his will, Ciel offers his soul to him.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7772421,"ranking":12,"query_text":"who plays sebastian michaelis","passage_text":"That Butler, Friendship (ã\u0081\u009dã\u0081®å\u009f·äº\u008bã\u0080\u0081å\u008f\u008bå¥½, Sono Shitsuji, YÅ«kÅ\u008d), a musical adaptation of the manga, had run at the Sunshine Theater in Ikebukuro between May 28, 2009 and June 7, 2009. Yuya Matsushita portrayed Sebastian Michaelis, Shougo Sakamoto played Ciel Phantomhive and Uehara Takuya as Grell Sutcliff.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7283073,"ranking":13,"query_text":"who plays sebastian michaelis","passage_text":"Directed by Toshiya Shinohara and produced by A-1 Pictures , Black Butler follows the adventures of Sebastian Michaelis , a demon butler who is obligated to serve Ciel Phantomhive , the thirteen-year-old (13 years old as of chapter 14) head of the Phantomhive noble family, due to a contract he made with Ciel.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":3230501,"ranking":14,"query_text":"who plays sebastian michaelis","passage_text":"1-16 of 23 results for Black Butler: Book of the Atlantic. 1  Black Butler Book of the Atlantic Mega Jumbo Plush Doll Sebastian. 2  Kotobukiya Black Butler Book of the Atlantic Sebastian Michaelis Cu-Poche Figure. 3  Theatrical Edition Black Butler Book of the Atlantic Mega Jumbo Lounge Stuffed Plush Toy Sebastian.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7283078,"ranking":15,"query_text":"who plays sebastian michaelis","passage_text":"I've watched and read the entire series. If you were to ask many manga readers you will find out very quickly that Black Butler is pretty good. Its mainly about a 13 year old boy named Ciel Phantomhive who is a detective running errands for the Queen of England. He had lost his parents in a fire and Sebastian Michaelis cuts him a deal. If Sebastian helps him get revenge on all those who hurt him then he can have Ciel's soul.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":2014751,"ranking":16,"query_text":"who plays sebastian michaelis","passage_text":"Summary Alois Trancy's fate was sealed the day he entered into Claude Faustus' contract. Although his death came prematurely, at the collective hads of Claude, Sebastian Michaelis, and Ciel Phantomhive.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":6803171,"ranking":17,"query_text":"who plays sebastian michaelis","passage_text":"Earl Ciel Phantomhive is: The Head of the Phantomhive noble family and the owner of the Funtom Company. Also known as the Queen's Watch Dog, and the son of Vincent and Rachel Phantomhive. Sebastian Michaelis' human lover.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":5343510,"ranking":18,"query_text":"who plays sebastian michaelis","passage_text":"Watch Black Butler. Sebastian Michaelis is a demon of the highest order with almost unlimited power and style. Ciel is the remaining heir to the Phantomhive manor, determined to uncover the truth behind the death of his parents.","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7772429,"ranking":19,"query_text":"who plays sebastian michaelis","passage_text":"Product name:Black Buter Sebastian Michaelis Halloween Black Uniform Suit Cosplay Costume J001. 2 .A costume will take about 15-18 days from our plant to your destination .","bm25_label":"medium","relevance_label":0.0},{"query_id":1048565,"passage_id":7283072,"ranking":20,"query_text":"who plays sebastian michaelis","passage_text":"The manga and anime series Black Butler features an extensive cast of characters created by Yana Toboso. The series takes place in England during the reign of Queen Victoria. It follows Sebastian Michaelis, a demonic butler obliged to serve twelve-year-old Earl Ciel Phantomhive due to a contract he made with Ciel. In exchange for binding Sebastian to his will, Ciel offers his soul to him. The series' storyline follows Ciel and Sebastian solving the problems plaguing England while waiting for the","bm25_label":"medium","relevance_label":0.0}]