[{"query_id":1048282,"passage_id":7187827,"ranking":1,"query_text":"what is pivx","passage_text":"pivx introduction PIVX is a multifaceted community-centric endeavor in the blockchain tech and cryptocurrency realms. What we mean by that is this: There are many components of what and who PIVX is and why PIVX was manifested.","bm25_label":"high","relevance_label":1.0},{"query_id":1048282,"passage_id":7187830,"ranking":2,"query_text":"what is pivx","passage_text":"PIVX INTRODUCTION. PIVX is a multifaceted community-centric endeavor in the blockchain tech and cryptocurrency realms. What we mean by that is this: There are many components of what and who PIVX is and why PIVX was manifested.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187832,"ranking":3,"query_text":"what is pivx","passage_text":"WHAT IS PIVX? PIVX is an acronym for P rivate I nstant V erified Transaction(X). Ok, so thatâ\u0080\u0099s the name. What â\u0080\u009cisâ\u0080\u009d PIVX? PIVX is a transactional security and privacy-focused decentralized open source cryptocurrency. What does that mean? It means that at its core, PIVX is designed, engineered, and evolving with the best practices and developments to ensure your transactional security and privacy. Ok, so what does that mean?","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187828,"ranking":4,"query_text":"what is pivx","passage_text":"At the point of writing this article, the total available circulating supply of PIVX is approximately 55,169,505 PIVX units, and the price of each unit of PIVX is worth $3.56. Hence, the market capitalization of PIVX is $196 million.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":5520064,"ranking":5,"query_text":"what is pivx","passage_text":"PIVX price equal to 9.242 USD at 2018-01-17. If you buy PIVX for 100 dollars today, you will get a total of 10.820 PIVX. Based on our forecasts, a long-term increase is expected, the price prognosis for 2022-12-30 is 51.779 US Dollars.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187823,"ranking":6,"query_text":"what is pivx","passage_text":"PIVX Coin Supply. PIVX doesnâ\u0080\u0099t have a finite coin supply cap like Bitcoin or DASH. But PIVXâ\u0080\u0099s supply increases every year by approx 2.6 million. At present, the circulating supply of PIVX is 55,169,505 units, and it will reach 312 million after 100 years from now (when none of us will be alive). Also, PIVXâ\u0080\u0099s average block mining time is 1 minute, which makes it a lot faster than both Bitcoin and DASH. PIVX Market Cap","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187826,"ranking":7,"query_text":"what is pivx","passage_text":"PIVX Website Whitepaper Private Instant Verified Transaction, PIVX is a privacy-focused, open source cryptocurrency that is also decentralized. The cryptocurrency is run by a global community that includes technology enthusiasts, innovators, and investors.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187825,"ranking":8,"query_text":"what is pivx","passage_text":"PIVX also has an upper-hand over DASH in providing a better anonymity feature as PIVX has now become the only POS currency out there to implement the Zerocoin protocol. I think this is a lot better alternative to conjoin or mixing services.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187829,"ranking":9,"query_text":"what is pivx","passage_text":"PIVX has unique features that make it different and promising in the diverse cryptosphere. Some of these features are: 1. PIVX is the first proof of stake cryptocurrency with a Zerocoin protocol level anonymity, thus making it truly fungible. Read this, this, and this for more details on the Zerocoin protocol.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":5520062,"ranking":10,"query_text":"what is pivx","passage_text":"PIVX Price Prediction, Analysis and Forecast 2017 2022 News, information, and discussions about cryptocurrencies, blockchains, technology, and events. Formed in May of 2013, Cryptocurrencytalk.com is your source for advice on what to mine, technical details, new launch announcements, and advice from trusted members of the community.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":5520061,"ranking":11,"query_text":"what is pivx","passage_text":"Your price predictions seem fairly modest to me. I think PIVX is likely to surpass the numbers on your projected time scale. Additionally, other privacy projects will likely grow significantly, thus resulting in higher possible price targets for PIVX. I enjoyed your video. I hope you continue making more. Best to you in the meantime.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187824,"ranking":12,"query_text":"what is pivx","passage_text":"Obfuscation is a mixing mechanism that is used in wallet coin mixing, but done is a decentralized fashion. This fashion is facilitated by the networks of masternodes on the PIVX platform. Obfuscation provides for an additional privacy on transaction layer.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":5520063,"ranking":13,"query_text":"what is pivx","passage_text":"PIVX is one of the future coins- through all ups and downs it moved relatively stable and the community are great. There are also a lot of new things coming up the next few weeks and month. IMO we see the slow rise of this coin into the top 10.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":7187831,"ranking":14,"query_text":"what is pivx","passage_text":"PIVX is a proof of stake cryptocurrency that is based on the 0.10 codebase version or higher bitcoin codebase. The PoS structure on the network does away with coinage, meaning you need to keep your wallet open every time to get the most out of your staking. The results will be more constant available nodes and strengthen the network.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":3058085,"ranking":15,"query_text":"what is pivx","passage_text":"What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your favorite. What's your, what's your, what's your, what's your, what's your.","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":2737045,"ranking":16,"query_text":"what is pivx","passage_text":"whats good; whats gooday [whats good] B; What's good boys? whats good family? what's good for the geese? whats good in the hood; What's good mo; What's good nigga; What's good wit chu; what's good with the butt? Whats good wit it; whats goody; What's goodybags? What's Goy? What's Grapes? What's Gravity; What's gravy; whats gravy in the navy; what's growin' long; whats guanin","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":6809641,"ranking":17,"query_text":"what is pivx","passage_text":"20 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it0 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":1147809,"ranking":18,"query_text":"what is pivx","passage_text":"what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":1147811,"ranking":19,"query_text":"what is pivx","passage_text":"what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ... 62. what is: humulin, used for; and what is ...","bm25_label":"high","relevance_label":0.0},{"query_id":1048282,"passage_id":1606419,"ranking":20,"query_text":"what is pivx","passage_text":"What is the opposite of obtuse? What is the opposite of obtunding? What is the opposite of obtunded? What is the opposite of obtund? What is the opposite of obtrusively? What is the opposite of obtrusive? What is the opposite of obtuse-angled? What is the opposite of obtusely? What is the opposite of obtuseness? What is the opposite of obtusenesses? What is the opposite of obtuser? What is the opposite of obtusest?","bm25_label":"high","relevance_label":0.0}]