[{"query_id":1049791,"passage_id":7185649,"ranking":1,"query_text":"what is njstart","passage_text":"are being administered through NJSTART and are posted at www.njstart.gov. A link to these is still available on the Divisionâ\u0080\u0099s homepage under â\u0080\u009cView Bidding Opportunities at www.njstart.gov\/bso\/external\/publicBids.sdo .â\u0080\u009d The Division is making Blanket P.O.s {Contracts} active in NJSTART. Contract awardees will receive their Blanket P.O. via email once it is converted, and details regarding that process will also be sent via email. Once a Contract is active in NJSTART, all future Change Orders {Amendments} will be done within NJSTART, and all historical documentation (i.e., Bid Solicitation {RFP} Documents and Change Orders) will also be in NJSTART. All issues of Smart Supplier are intended to inform and help put you in the","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":7185642,"ranking":2,"query_text":"what is njstart","passage_text":"NJSTART will put the power to do business with the State into your hands. The Division of Purchase and Property is pleased to announce that all new bidding opportunities are now administered through NJSTART. Please click on the â\u0080\u009cOpen Bidsâ\u0080\u009d link below to view all new Bidding Opportunities.","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":7185650,"ranking":3,"query_text":"what is njstart","passage_text":"Thank you for your interest in bidding opportunities with the NJEDA. The Authority is excited to announce that we are now partnering with the State of New Jersey and will be using their vendor eProcurement Portal Database (NJSTART) to help identify potential vendors. NJSTART is designed to streamline the procurement process and make it more efficient for companies looking to do business with the State.","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":7185644,"ranking":4,"query_text":"what is njstart","passage_text":"NJSTART is as self-service online platform that allows vendors to manage forms, certifications, submit proposals, access training manuals, reference guides and receive email alerts on upcoming procurement opportunities. There are several key advantages to the new system, but increased visibility is certainly a big one.","bm25_label":"high","relevance_label":1.0},{"query_id":1049791,"passage_id":7185645,"ranking":5,"query_text":"what is njstart","passage_text":"Welcome to NJSTART, the State of New Jerseyâ\u0080\u0099s new eProcurement portal! This solution is designed to streamline the procurement process and make it more efficient for companies looking to do business with the State. If you havenâ\u0080\u0099t registered yet, ENROLL NOW. Registration is easy and takes only a few minutes. Suppliers can also create their own vendor profiles through the portal, eliminating the need to file duplicate forms every time they submit a proposal for a new contract.","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":3058085,"ranking":6,"query_text":"what is njstart","passage_text":"What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your favorite. What's your, what's your, what's your, what's your, what's your.","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":2737045,"ranking":7,"query_text":"what is njstart","passage_text":"whats good; whats gooday [whats good] B; What's good boys? whats good family? what's good for the geese? whats good in the hood; What's good mo; What's good nigga; What's good wit chu; what's good with the butt? Whats good wit it; whats goody; What's goodybags? What's Goy? What's Grapes? What's Gravity; What's gravy; whats gravy in the navy; what's growin' long; whats guanin","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":6809641,"ranking":8,"query_text":"what is njstart","passage_text":"20 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it0 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":1147809,"ranking":9,"query_text":"what is njstart","passage_text":"what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":1147811,"ranking":10,"query_text":"what is njstart","passage_text":"what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ... 62. what is: humulin, used for; and what is ...","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":1606419,"ranking":11,"query_text":"what is njstart","passage_text":"What is the opposite of obtuse? What is the opposite of obtunding? What is the opposite of obtunded? What is the opposite of obtund? What is the opposite of obtrusively? What is the opposite of obtrusive? What is the opposite of obtuse-angled? What is the opposite of obtusely? What is the opposite of obtuseness? What is the opposite of obtusenesses? What is the opposite of obtuser? What is the opposite of obtusest?","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":1338568,"ranking":12,"query_text":"what is njstart","passage_text":"What is the singular of of cyclopropaphanes? What is the singular of of cyclopropenes? What is the singular of of cyclopropeniums? What is the singular of of cyclopropenone? What is the singular of of cyclopropyls? What is the singular of of cyclopropylamine? What is the singular of of cyclopsams? What is the singular of of cyclopterids? What is the singular of of cyclopyrrolones? What is the singular of of cycloramas? What is the singular of of cyclorelease?","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":8154817,"ranking":13,"query_text":"what is njstart","passage_text":"What is the opposite of modification? What is the opposite of modifiably? What is the opposite of modifiable? What is the opposite of modicum? What is the opposite of modica? What is the opposite of modesty? What is the opposite of modifies? What is the opposite of modify? What is the opposite of modifying? What is the opposite of modish? What is the opposite of modishly?","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":1605952,"ranking":14,"query_text":"what is njstart","passage_text":"What is the opposite of biasedly? What is the opposite of biased? What is the opposite of bias crime? What is the opposite of bias? What is the opposite of biandry? What is the opposite of bi? What is the opposite of biases? What is the opposite of biasing? What is the opposite of biassed? What is the opposite of biasses? What is the opposite of biassing? What is the opposite of bib and tucker?","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":7211423,"ranking":15,"query_text":"what is njstart","passage_text":"What is the opposite of aisle? What is the opposite of airy hope? What is the opposite of airy-fairy? What is the opposite of airy? What is the opposite of airworthy? What is the opposite of airworthiness? What is the opposite of ajar? What is the opposite of AJAX? What is the opposite of AKA? What is the opposite of aken? What is the opposite of akimbo? What is the opposite of akin?","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":8114700,"ranking":16,"query_text":"what is njstart","passage_text":"What is the plural of of decorum? What is the plural of of decose? What is the plural of of decoside? What is the plural of of decoupage? What is the plural of of decoupler? What is the plural of of decoupling? What is the plural of of decoy duck? What is the plural of of decoy-duck? What is the plural of of decoyer? What is the plural of of decoyinine? What is the plural of of decoyman? What is the plural of of decrease?","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":665982,"ranking":17,"query_text":"what is njstart","passage_text":"What is Hosting? What do these terms mean? What is a Web Server? What does HTTP stand for? What is a Domain Name? What is an IP Address? What is a URL? What does DNS do? What is FTP? What does...","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":1147810,"ranking":18,"query_text":"what is njstart","passage_text":"what is: acetic acid, used for; and ... 57. what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":7074335,"ranking":19,"query_text":"what is njstart","passage_text":"What is the opposite of surpassingly? What is the opposite of surpassing? What is the opposite of surpasses? What is the opposite of surpassed? What is the opposite of surpassable? What is the opposite of surplusage? What is the opposite of surplusages? What is the opposite of surplusage. superabundance? What is the opposite of surplus cash? What is the opposite of surpluses? What is the opposite of surplusses?","bm25_label":"high","relevance_label":0.0},{"query_id":1049791,"passage_id":37604,"ranking":20,"query_text":"what is njstart","passage_text":"What is the opposite of devotional? What is the opposite of devotion? What is the opposite of devoting? What is the opposite of devote yourself? What is the opposite of devoured? What is the opposite of devourer? What is the opposite of devourers? What is the opposite of devouring? What is the opposite of devours? What is the opposite of devout?","bm25_label":"high","relevance_label":0.0}]