[{"query_id":1049368,"passage_id":29363,"ranking":1,"query_text":"who s sherlock holmes","passage_text":"Who is detective Sherlock Holmes partner? Question: Who is detective Sherlock Holmes partner? Answer: John H.Watson. We all know that Sherlock Holmes partner is Dr. Watson. His full name is John H.Watson. Tags: detective, Holmes, partner, Sherlock.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4548569,"ranking":2,"query_text":"who s sherlock holmes","passage_text":"Who is Sherlock Holmes, you ask? Who is Sherlock Holmes?!? Better to ask Who was Sherlock Holmes?. At this point, history has claimed him as its own. Although his death was never recorded and his obituary never appeared in any newspaper, one can safely say that Sherlock Holmes walks among us no more.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4821772,"ranking":3,"query_text":"who s sherlock holmes","passage_text":"1 Boris Klyuyev played Mycroft Holmes in The Adventures of Sherlock Holmes and Dr. Watson, a Soviet TV series. 2  Klyuyev was nine years younger than Vasily Livanov, who played Sherlock Holmes. 3  According to Sherlock, Mycroft is married and has a son.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":1389095,"ranking":4,"query_text":"who s sherlock holmes","passage_text":"When Arthur Conan Doyle first introduced Sherlock Holmes to the reading public in 1887, nothing could have prepared him for the fact he had created a character who was destined to become the most famous detective in the world. The Sherlock Holmes company manages the primary Sherlock Holmes Brand.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4682076,"ranking":5,"query_text":"who s sherlock holmes","passage_text":"Many actors have played Sherlock Holmes, but who is the best? Tim Martin assesses the many versions of Sherlock we have known. Wonderfully unearthly: Benedict Cumberbatch as Holmes in the BBC drama Sherlock Photo: BBC\/Hartswood.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4821769,"ranking":6,"query_text":"who s sherlock holmes","passage_text":"1 In the Billy Wilder-directed film The Private Life of Sherlock Holmes (1970), which starred Robert Stephens as Sherlock, Mycroft was played by Christopher Lee (who also played Sherlock Holmes in other productions before and since).","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4548568,"ranking":7,"query_text":"who s sherlock holmes","passage_text":"Sherlock Holmes Biography. Sherlock Holmes is the fictional creation of Sir Arthur Conan Doyle, who wrote about the amazing detective in a series of 60 stories published between 1887 and 1927. Sherlock Holmes was famous for his extra-keen powers of observation and deduction, which he used to solve perplexing crimes and mysteries.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":5444100,"ranking":8,"query_text":"who s sherlock holmes","passage_text":"He played the faithful Dr. Watson opposite Jeremy Brettâ\u0080\u0099s Sherlock Holmes in the famed Granada Television series of the 1980s and â\u0080\u009990s. Edward Hardwicke, who played the faithful Dr. Watson opposite Jeremy Brettâ\u0080\u0099s Sherlock Holmes in the famed Granada Television series of the 1980s and â\u0080\u009990s, died Monday, the Telegraph in London reported. He was 78.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":97397,"ranking":9,"query_text":"who s sherlock holmes","passage_text":"Episode 7x05 Murdoch of the Living Dead Murdochâ\u0080\u0099s prime suspect in a womanâ\u0080\u0099s murder is her husband, who appears to have returned from the dead. Episode 7x04 The Return of Sherlock Murdoch finds his investigation into a nannyâ\u0080\u0099s disappearance assisted by the man who considers himself the real Sherlock Holmes.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":29360,"ranking":10,"query_text":"who s sherlock holmes","passage_text":"Sherlock Holmes didn't take a fancy to women unless in a case to help. He criticizes women's intellect until he has an encounter with Irene Adler who he referred to as The Woâ\u0080¦man. Dr. Watson says this about Sherlock Holmes but it is never to be said by himself for your own account of the matter. Dr. Watson had hoped that Sherlock Holmes would take a liking to her, but he did not. Sherlock Holmes never married. But he was certainly respectful of Irene Adler's abilities and admired her.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":7839891,"ranking":11,"query_text":"who s sherlock holmes","passage_text":"Helen Stoner consults Sherlock Holmes about the death of her twin sister, Julia, who died before her wedding, crying that: it was the Speckled Band! The Adventure of the Speckled Band is one of 56 short stories & 4 novels written by Arthur Conan Doyle featuring his fictional detective Sherlock Holmes. The Speckled Band is included in The Adventures of Sherlock Holmes.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4145226,"ranking":12,"query_text":"who s sherlock holmes","passage_text":"Top of the page: Sherlock Holmes actors CHRISTOPHER PLUMMER He was Sherlock Holmes in Murder by Decree (1979). His detective is a smart, sentimental and charitable man who is deeply aghast by the brutality and cruelty he has to face.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":7289992,"ranking":13,"query_text":"who s sherlock holmes","passage_text":"â\u0080\u0095Magnussen to John Watson and Sherlock Holmes. Charles Augustus Magnussen was a powerful and wealthy businessman who owned several newspapers. He was a known blackmailer, referred to by Sherlock Holmes as the Napoleon of blackmail. Charles Augustus Magnussen is a media mogul who owns several newspapers.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":7911796,"ranking":14,"query_text":"who s sherlock holmes","passage_text":"Sherlock Holmes was an immediate hit in Doyleâ\u0080\u0099s day and remains so popular that he is sometimes mistaken for a real historical figure. Among the most famous Holmes stories are A Study in Scarlet (the first Sherlock Holmes story, 1887) and The Hound of the Baskervilles (1902).","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4789709,"ranking":15,"query_text":"who s sherlock holmes","passage_text":"At one point, Sherlock sits in a cinema and tuts at the inaccuracies in a film based on his adventures: in a neat postmodern touch, the star of this film-within-a-film is Nicholas Rowe, who played the character as a teenager in Barry Levinsonâ\u0080\u0099s Young Sherlock Holmes.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":4682077,"ranking":16,"query_text":"who s sherlock holmes","passage_text":"Edward Hardwicke, right, played Dr. Watson to Jeremy Brett's Sherlock in several television series, including The Return of Sherlock Holmes, The Casebook of Sherlock Holmes and The Memoirs of Sherlock Holmes in the 1980s and '90s.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":3682551,"ranking":17,"query_text":"who s sherlock holmes","passage_text":"Basil Rathbone and Nigel Bruce in Sherlock Holmes and the Secret Weapon. A series of fourteen films based on Sir Arthur Conan Doyle 's Sherlock Holmes stories were released between 1939 and 1946; the British actors Basil Rathbone and Nigel Bruce played Holmes and Dr. John Watson, respectively. series of fourteen films based on Sir Arthur Conan Doyle 's Sherlock Holmes stories were released between 1939 and 1946; the British actors Basil Rathbone and Nigel Bruce played Holmes and Dr. John Watson, respectively.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":1985883,"ranking":18,"query_text":"who s sherlock holmes","passage_text":"With the right tools and the right knowledge Sherlock Holmes, in any era, is a frightfully modern man. This is the fourth post in our series on Design and Sherlock Holmes. Our previous investigations looked into Sherlock Holmesâ\u0080\u0099s original tools of deduction, Holmesâ\u0080\u0099s iconic deerstalker hat, and the mysteriously replicating flat at 221b Baker Street.","bm25_label":"high","relevance_label":0.0},{"query_id":1049368,"passage_id":7911799,"ranking":19,"query_text":"who s sherlock holmes","passage_text":"Sherlock Holmes Biography. Sherlock Holmes is the fictional creation of Sir Arthur Conan Doyle, who wrote about the detective in a series of 60 stories published between 1887 and 1927. Holmes was famous for his extra-keen powers of observation and deduction, which he used to solve perplexing crimes and mysteries.","bm25_label":"high","relevance_label":1.0},{"query_id":1049368,"passage_id":556629,"ranking":20,"query_text":"who s sherlock holmes","passage_text":"Sherlock Holmes (born William Sherlock Scott Holmes) is the world's only consulting detective, a... Sherlock Holmes (born William Sherlock Scott Holmes) is the world's only consulting detective, a profession he created for himself. He is based in London and often consulted by Greg Lestrade of...","bm25_label":"high","relevance_label":0.0}]