[{"query_id":1051530,"passage_id":7183058,"ranking":1,"query_text":"what is mastoidectomy","passage_text":"MASTOIDECTOMY Dictionary entry overview: What does mastoidectomy mean? â\u0080¢ MASTOIDECTOMY (noun) The noun MASTOIDECTOMY has 1 sense: 1. surgical removal of some or all of the mastoid process Familiarity information: MASTOIDECTOMY used as a noun is very rare.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":7183057,"ranking":2,"query_text":"what is mastoidectomy","passage_text":"Tympanoplasty and Mastoidectomy Surgery Mastoidectomy Mastoidectomy is the portion of the operation in which the surgeon removes diseased air cells (cholesteatoma matrix) from the mastoid bone.","bm25_label":"high","relevance_label":1.0},{"query_id":1051530,"passage_id":213483,"ranking":3,"query_text":"what is mastoidectomy","passage_text":"A mastoidectomy is performed to remove diseased mastoid air cells. These cells sit in a hollow space in the skull, behind the ear. The diseased cells are often the result of an ear infection that has spread into the skull.Sometimes the infection spreads onto the temporal bone.If this occurs, parts of the bone may need to be removed. This results in hearing loss. There are several types of mastoidectomy. These include: 1  simple mastoidectomy: the surgeon opens the mastoid bone, removes the infected air cells, and drains the middle ear.f this occurs, parts of the bone may need to be removed. This results in hearing loss. There are several types of mastoidectomy. These include: 1  simple mastoidectomy: the surgeon opens the mastoid bone, removes the infected air cells, and drains the middle ear.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":7739292,"ranking":4,"query_text":"what is mastoidectomy","passage_text":"Q. Pain and popping in ear months after a mastoidectomy. A. Complications of a mastoidectomy include: facial nerve paralysis or weakness (a rare complication caused by facial nerve injury)sensorineural...","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":3105734,"ranking":5,"query_text":"what is mastoidectomy","passage_text":"Removal of Cholesteatoma via Modified Radical Mastoidectomy. Modified radical mastoidectomy, also known as canal wall down (CWD) mastoidectomy, is a surgical procedure which involves removal of the posterior (back) wall of the ear canal to create a common cavity for the mastoid and ear canal. This single cavity also known as mastoid bowl opens up to the outside of the ear canal.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":213481,"ranking":6,"query_text":"what is mastoidectomy","passage_text":"What is mastoid surgery? The mastoid bone, part of the skull, lies right behind the ear lobe. Sometimes the cells of the mastoid bone, and\/or the small bones (ossicles) inside the ear, are destroyed by chronic infection or a growth (cholesteatoma).When this happens, the affected mastoid cells may need to be removed (mastoidectomy).ometimes the cells of the mastoid bone, and\/or the small bones (ossicles) inside the ear, are destroyed by chronic infection or a growth (cholesteatoma). When this happens, the affected mastoid cells may need to be removed (mastoidectomy).","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":5331621,"ranking":7,"query_text":"what is mastoidectomy","passage_text":"A mastoidectomy is performed to remove diseased mastoid air cells. These cells sit in a hollow space in the skull, behind the ear. The diseased cells are often the result of an ear infection that has spread into the skull. Sometimes the infection spreads onto the temporal bone. If this occurs, parts of the bone may need to be removed. This results in hearing loss. There are several types of mastoidectomy. These include: 1  simple mastoidectomy: the surgeon opens the mastoid bone, removes the infected air cells, and drains the middle ear. 2  radical mastoidectomy: the surgeon may remove the eardrum and middle ear structures. 3  Sometimes a skin graft is placed in the middle ear.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":7371894,"ranking":8,"query_text":"what is mastoidectomy","passage_text":"If the otolaryngologist performs a more complete surgical procedure, for instance, tympanoplasty with mastoidectomy, you should report the combination code (69641, Tympanoplasty with mastoidectomy [including canalplasty, middle ear surgery, tympanic membrane repair]; without ossicular chain reconstruction).","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":7371897,"ranking":9,"query_text":"what is mastoidectomy","passage_text":"He did not perform a mastoidectomy or ossicular chain reconstruction. He inserted a canal tube. How should I bill this?Nebraska Subscriber Answer: Because your otolaryngologist performs tympanoplasty alone, you should report 69631 (Tympanoplasty without mastoidectomy [including canalplasty, atticotomy and\/or middle [...]","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":1218855,"ranking":10,"query_text":"what is mastoidectomy","passage_text":"The procedure may take up to three hours, depending on how severe the infection is. There are multiple types of mastoidectomy. The simplest form of the surgery involves the removal of mastoid cells only; no bone is removed, and the risk of hearing loss and other side effects is low. In a radical mastoidectomy, some of the mastoid bone must be removed from the inner ear.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":7183059,"ranking":11,"query_text":"what is mastoidectomy","passage_text":"Tympanoplasty and Mastoidectomy or tympanomastoidectomy is surgery on the mastoid bone for infection and tympanic membrane (eardrum) to restore hearing.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":213488,"ranking":12,"query_text":"what is mastoidectomy","passage_text":"Mastoid operation. A mastoidectomy is a surgical procedure designed to remove infection in the bone behind the ear (mastoid bone). Its purpose is to create a â\u0080\u009csafeâ\u0080\u009d ear and prevent further damage to the hearing apparatus.Mastoidectomy is often indicated for other diseases that spread to the mastoid bone, such as cholesteatoma.Cholesteatoma is an abnormal skin growth in the middle ear behind the eardrum. Repeated infections and\/or and a tear or retraction of the eardrum can cause the skin to form an expanding sac. mastoidectomy is a surgical procedure designed to remove infection in the bone behind the ear (mastoid bone). Its purpose is to create a â\u0080\u009csafeâ\u0080\u009d ear and prevent further damage to the hearing apparatus. Mastoidectomy is often indicated for other diseases that spread to the mastoid bone, such as cholesteatoma.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":7371891,"ranking":13,"query_text":"what is mastoidectomy","passage_text":"Tympanoplasty without mastoidectomy (including canalplasty, at ticotomy and\/or m iddle ear surgery), initial or revision; without ossicular chain reconstruction Tympanoplasty without mastoidectomy (including canalplasty, atticotomy and\/or middle ear surgery), initial or revision; with ossicular chain reconstruction (eg, postfenestration) Tympanoplasty without mastoidectomy (including canalplasty, atticotomy an d\/or middle ear surgery), initial or revision; with ossicular chain reconstruction and synthetic prosthesis (eg, partial ossicular replacement p rosthesis [PORP], total ossicular replacement p rosthesis [TORP]) Tympanoplasty with a ntrotomy or mastoidotomy (including canalplasty,atticotomy, middle ear surgery, and\/or tympanic membrane repair); without ossicular chain reconstruction Tympanoplasty with antrotomy or mastoi dotomy (including canalplasty, atticotomy, middle ear","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":7183060,"ranking":14,"query_text":"what is mastoidectomy","passage_text":"In Carol's case, she went to Mr Madkour, aged 23, for a mastoidectomy operation to remove diseased bone from the ear in 1994.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":8370752,"ranking":15,"query_text":"what is mastoidectomy","passage_text":"A mastoidectomy is a surgical procedure that removes diseased mastoid air cells. These cells sit behind your ear in a hollow space in your skull. A mastoidectomy is a surgical procedure that removes diseased mastoid air cells. The mastoid is the part of your skull located behind your ear. Itâ\u0080\u0099s filled with air cells made of bone and looks like a honey comb. The diseased cells are often the result of an ear infection that has spread into your skull.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":842762,"ranking":16,"query_text":"what is mastoidectomy","passage_text":"Mastoidectomy is performed to remove infected air cells within the mastoid bone caused by mastoiditis, ear infection, or an inflammatory disease of the middle ear (cholesteatoma).","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":3292309,"ranking":17,"query_text":"what is mastoidectomy","passage_text":"A mastoidectomy is performed to remove infected mastoid air cells resulting from ear infections, such as mastoiditis or chronic otitis, or by inflammatory disease of the middle ear (cholesteatoma).","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":1451096,"ranking":18,"query_text":"what is mastoidectomy","passage_text":"What is an Otologist? An Otologist is a doctor who specializes in disorders of the ear and hearing, with special focus on surgery of the mastoid, ear drum and middle ear bones. These surgeries commonly include tympanoplasty, mastoidectomy for the treatment of infections and\/or for hearing restoration. An Otologist is a surgeon who commonly performs stapedectomy for the treatment of otosclerosis. Some Otologists also have advanced training in Neurotology and Cranial Base Surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":5257960,"ranking":19,"query_text":"what is mastoidectomy","passage_text":"The role of practice is especially significant in mastoidectomy as the surgeon is working in the immediate vicinity of minute, multifaceted and delicate structures such as auditory ossicles, lamellar bone, blood vessels and nerves.","bm25_label":"high","relevance_label":0.0},{"query_id":1051530,"passage_id":2561268,"ranking":20,"query_text":"what is mastoidectomy","passage_text":"Otologic surgery generally refers to surgery of the middle ear and mastoid related to chronic otitis media, such as tympanoplasty, or ear drum surgery, ossiculoplasty, or surgery of the hearing bones, and mastoidectomy.","bm25_label":"high","relevance_label":0.0}]