[{"query_id":1052563,"passage_id":4030923,"ranking":1,"query_text":"who stars in the tv show taken","passage_text":"Pam Dawber who played Mindy McConnell in the TV show Mork & Mindy. Pam Dawber (Mindy McConnell) and Robin Williams (Mork) stars of the TV show Mork & Mindy. Pam Dawber who played Mindy McConnell in the TV show Mork & Mindy.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":3762224,"ranking":2,"query_text":"who stars in the tv show taken","passage_text":"Matthew Perry TV Show\/Series Credits. TV Shows featuring Matthew Perry, listed alphabetically with photos when available. All of the TV programs that had Matthew Perry in the cast are featured here. Matthew Perry may have had a prominent role in these shows, but this list also includes shows where Matthew Perry had a guest starring role or cameo appearance. You can find additional information about these Matthew Perry shows as well, such as who else starred on the show and who created it.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":2882149,"ranking":3,"query_text":"who stars in the tv show taken","passage_text":"Elizabeth Wagmeister. â\u0080\u009c Taken â\u0080\u009d is heading to the small screen, as NBC has handed a straight-to-series order on a prequel adaptation of the popular action movies, which starred Liam Neeson, Variety has confirmed. The TV show hails from Luc Besson, who wrote the original feature franchise, and search for a writer and showrunner is underway.","bm25_label":"high","relevance_label":1.0},{"query_id":1052563,"passage_id":7917939,"ranking":4,"query_text":"who stars in the tv show taken","passage_text":"Having taken up dancing and acrobatics from the age of 6, Tamblyn marked his abilities with his very first TV appearance on the The Ed Sullivan Show.. Eventually handed a starring role in the B film The Kid from Cleveland (1949), he was signed by an eager MGM who saw his potential as a juvenile actor.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":2601894,"ranking":5,"query_text":"who stars in the tv show taken","passage_text":"Answers.comÂ® WikiAnswersÂ® Categories Entertainment & Arts TV Programming and Commercials TV Shows and Series Talk Shows Who made the most guest appearances on The Tonight Show Starring Johnny Carson?","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":7997196,"ranking":6,"query_text":"who stars in the tv show taken","passage_text":"celebrity A star is somebody who is famous for doing something, for example acting or singing. He's one of the stars of a TV show. American English: star person","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":223668,"ranking":7,"query_text":"who stars in the tv show taken","passage_text":"Leonard Nimoy is an actor who played Spock in both the 1960s TV series 'Star Trek' and several movies based on the show.eonard Nimoy is an actor who played Spock in both the 1960s TV series 'Star Trek' and several movies based on the show.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":7232716,"ranking":8,"query_text":"who stars in the tv show taken","passage_text":"TV Shows featuring Jeffrey Tambor, listed alphabetically with photos when available. All of the TV programs that had Jeffrey Tambor in the cast are featured here. Jeffrey Tambor may have had a prominent role in these shows, but this list also includes shows where Jeffrey Tambor had a guest starring role or cameo appearance. You can find additional information about these Jeffrey Tambor shows as well, such as who else starred on the show and who created it.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":408277,"ranking":9,"query_text":"who stars in the tv show taken","passage_text":"On Monday Jennifer was interviewed on Frenchâ\u0080\u0099s tv show Quotidien and on Tuesday Jennifer attended Takenâ\u0080\u0099s premiere at the Cinema Elysees Biarritz in Paris, alongside her co-stars Clive Standen and Brooklyn Sudano .. Read more... Jennifer Beals in New York promoting Taken and Before I Fall. March 05, 2017. Jennifer had a busy week in New York attending different tv shows and interviews. to promote her new NBC tv series Taken and the film Before I Fall, in theatres now.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":4658792,"ranking":10,"query_text":"who stars in the tv show taken","passage_text":"John Schneider, who played Bo Duke on the show Dukes of Hazzard, was not happy when TV Land decided to drop the 80s series from its lineup on Wednesday. The actor who played Bo Duke on the Dukes of Hazzard is not happy to see the beloved 80s TV show taken off the air.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":3048060,"ranking":11,"query_text":"who stars in the tv show taken","passage_text":"Biography. Cardiff born actor Tom Ellis made his television debut in the UK tv series Nice Guy Eddie in 2001, and ever since he's taken part in several movies and multiple tv shows like No Angels, Pulling, The Catherine Tate Show, Doctor Who, Monday, Monday, Miranda and Merlin.Heâ\u0080¦ more.iography. Cardiff born actor Tom Ellis made his television debut in the UK tv series Nice Guy Eddie in 2001, and ever since he's taken part in several movies and multiple tv shows like No Angels, Pulling, The Catherine Tate Show, Doctor Who, Monday, Monday, Miranda and Merlin. Heâ\u0080¦ more.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":2755138,"ranking":12,"query_text":"who stars in the tv show taken","passage_text":"iCarly is the fourth series created by Dan Schneider for Nickelodeon. Schneider originally wanted to make a new TV series starring Miranda Cosgrove; the original idea was that she play a normal girl who, in a twist of fate, gets cast to star in her favorite TV show, Starstruck.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":4658791,"ranking":13,"query_text":"who stars in the tv show taken","passage_text":"No more royalty checks! John Schneider, who played Bo Duke on the show Dukes of Hazzard, was not happy when TV Land decided to drop the 80s series from its lineup on Wednesday. Pictured above in April. The actor who played Bo Duke on the Dukes of Hazzard is not happy to see the beloved 80s TV show taken off the air.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":3579536,"ranking":14,"query_text":"who stars in the tv show taken","passage_text":"THR reports that Grant Gustin has been cast in the role of Barry Allen, who will appear in a guest star role on season 2 of Arrow and may later star in his own TV show.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":3669188,"ranking":15,"query_text":"who stars in the tv show taken","passage_text":"Trek alumni from TV shows and movies will schmooze with passengers on the Norwegian Pearl cruise, including: -- Jonathan Frakes, who played Commander William T. Riker on the TV's Star Trek: The Next Generation and in motion pictures; -- Marina Sirtis, who played counselor Deanna Troi on Star Trek: The Next Generation; -- singer and actor James Darren (yes, Moondoggie in the 1959 Gidget film) who appeared in Star Trek: Deep Space Nine for a few seasons.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":4942751,"ranking":16,"query_text":"who stars in the tv show taken","passage_text":"'Addams Family' Star. Ken Weatherwax -- who played Pugsley on . The Addams Family  TV show -- died at his home Sunday in California after having a heart attack.Weatherwax's family tells TMZ there will be 2 funerals -- one for the family, and one for his fans.The actor stuck with the Pugsley role over the years ...Addams Family' Star. Ken Weatherwax -- who played Pugsley on . The Addams Family  TV show -- died at his home Sunday in California after having a heart attack.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":2291852,"ranking":17,"query_text":"who stars in the tv show taken","passage_text":"She is sometimes referred to as Vanessa L. Williams and is no relation to Vanessa Williams, the actress with the same name who appeared on the TV show Melrose Place. By coincidence, the former Miss America starred in the movie Soul Food (1997) while the second Ms. Williams starred in the cable TV series of the same nameâ\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":4611027,"ranking":18,"query_text":"who stars in the tv show taken","passage_text":"(AP) LOS ANGELES-Chad Everett, the blue-eyed star of the 1970s TV series Medical Center who went on to appear in such films and TV shows as Mulholland Drive and Melrose Place, has died. He was 75.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":7785933,"ranking":19,"query_text":"who stars in the tv show taken","passage_text":"Mama June rushed to hospital after stunning fans with weight-loss April 08, 2017 - 17:40 BST Sophie Hamilton Reality TV star Mama June Shannon is rushed to hospital suffering from stomach pains in the latest episode of her WE TV show From Not to Hot Leave a comment From Not to Hot star Mama June was dramatically rushed to hospital in the latest episode of her reality TV show. On Fridayâ\u0080\u0099s show, viewers saw the 37-year-old star, who recently slimmed down from 460 pounds to a size four, in severe pain at the end of the episode.","bm25_label":"high","relevance_label":0.0},{"query_id":1052563,"passage_id":1578101,"ranking":20,"query_text":"who stars in the tv show taken","passage_text":"Mountain Monsters is a 60 minutes an episode reality tv show produced by American Chainsaws Entertainment Company.The show stars a six man crew of hardcore hunters and trappers who grew up in the mountains of West Virginia.ountain Monsters is a 60 minutes an episode reality tv show produced by American Chainsaws Entertainment Company.","bm25_label":"high","relevance_label":0.0}]