[{"query_id":1054071,"passage_id":7909418,"ranking":1,"query_text":"who was general sterling price","passage_text":"general sterling price. Follow general sterling price to get e-mail alerts and updates on your eBay Feed. Unfollow general sterling price to stop getting updates on your eBay Feed. Yay! You're now following general sterling price in your eBay Feed.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":2472992,"ranking":2,"query_text":"who was general sterling price","passage_text":"Prelude to the Battle of Wilsonâ\u0080\u0099s Creek. Union General Nathaniel Lyon, who commanded a force of some 5,400 soldiers at Springfield, Missouri, was up against two Rebel forces commanded by generals Sterling Price and Ben McCulloch.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":7909416,"ranking":3,"query_text":"who was general sterling price","passage_text":"The General Price was sunk during the Battle of Memphis, raised, repaired, and served in the Union Navy under the name USS General Price although she was still referred to as the General Sterling Price in Federal dispatches. As a Union ship, she served in the Vicksburg and Red River campaigns.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":4768231,"ranking":4,"query_text":"who was general sterling price","passage_text":"Check marks carefully on silver. If it does not say sterling or bear a hallmark, it is either of foreign manufacture or it is probably not sterling. Prices of sterling silver items generally run higher than other types of silver, at least about twice that of silver plate.ere are a few you're most likely to encounter: Sterling is the American and British standard for silver, used to produce most elaborate and costly pieces. The sterling standard is 925 parts of silver to 75 parts copper in every 1000 parts sterling silver.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":6952311,"ranking":5,"query_text":"who was general sterling price","passage_text":"Price family history starts with Robert Price, enrolled in the Minister's Accounts of the Earldom of Cornwall in 1297. Price genealogy boasts such illustrious individuals as British Admiral David Price, Confederate General Sterling Price, and actor Vincent Price. Price Birth Records","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":7909421,"ranking":6,"query_text":"who was general sterling price","passage_text":"During the Civil War, a wooden river steamer built at Cincinnati, Ohio, in 1856 as the Laurent Millaudon was taken into Confederate service and renamed the CSS General Sterling Price.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":1828540,"ranking":7,"query_text":"who was general sterling price","passage_text":"sterling silver price per gram 925 silver price per gram sterling silver flower of life pendant dice 925 sterling silver charm bead eclipse 925 sterling silver jewelry 925 sterling silver jewelry malaysia 925 sterling gemstone silver jewellery tea pot 925 sterling silver charm bead green jade ring in 925 sterling silver tcc 925 sterling silver ...","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":1828539,"ranking":8,"query_text":"who was general sterling price","passage_text":"925 sterling silver price per gram. 1  LWR0330 925 Sterling Silver Price Per Gram Men Model Fake Diamonds Rings Unique Jewelry Ad. 2  wholesale 925 Sterling Silver horse necklase price per gram jewellery P6518 Ad. 3  fashion sterling silver gram price for opal price silver 925 pendant starfish Ad.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":8469531,"ranking":9,"query_text":"who was general sterling price","passage_text":"This page lists the user documentation for 9.2 versions of Sterling Order Management and Sterling Configure, Price, Quote. For complete product documentation, see the Sterling Order Management version 9.2 and Sterling Configure, Price, Quote version 9.2. Sterling Order Management. Click an icon to open or download a file.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":7909424,"ranking":10,"query_text":"who was general sterling price","passage_text":"Sterling Price-Early Life & Career: Born September 20, 1809 in Farmville, VA, Sterling Price was the son of wealthy planters Pugh and Elizabeth Price.","bm25_label":"high","relevance_label":1.0},{"query_id":1054071,"passage_id":6812745,"ranking":11,"query_text":"who was general sterling price","passage_text":"$2.46update. There are 7 Regular gas price reports in the past 5 days in Sterling, IL. The average Regular gas price in Sterling, IL is $2.36, which is $0.45 lower than U.S. national average Regular gas price $2.81.The lowest Regular gas price is $2.28 of County Market Gas Station located at 210 W 3rd St, Sterling, IL 61081.here are 7 Regular gas price reports in the past 5 days in Sterling, IL.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":6812746,"ranking":12,"query_text":"who was general sterling price","passage_text":"There are 7 Regular gas price reports in the past 5 days in Sterling, IL.The average Regular gas price in Sterling, IL is $2.36, which is $0.45 lower than U.S. national average Regular gas price $2.81. The lowest Regular gas price is $2.28 of County Market Gas Station located at 210 W 3rd St, Sterling, IL 61081.here are 7 Regular gas price reports in the past 5 days in Sterling, IL.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":4352522,"ranking":13,"query_text":"who was general sterling price","passage_text":"Sterling Silver Price. The current price of Sterling Silver (anything) is $13.33 per Ounce (oz), or $0.47 Per Gram (g). Sterling silver is defined as 92.5% pure silver and is widely used in high end cutlery, jewelry, and pitchers.The other 7.5% is usually made of some other metal like copper.terling Silver Price. The current price of Sterling Silver (anything) is $13.33 per Ounce (oz), or $0.47 Per Gram (g). Sterling silver is defined as 92.5% pure silver and is widely used in high end cutlery, jewelry, and pitchers.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":7909417,"ranking":14,"query_text":"who was general sterling price","passage_text":"He was at the time an ardent Union man, and at the first there was not a secessionist in that body. But when it was evident that President Lincoln intended to pursue a coercive policy, the Missouri State Guard was formed, with Sterling Price as major-general.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":1828535,"ranking":15,"query_text":"who was general sterling price","passage_text":"sterling silver price per gram925 silver price per gramsterling silver flower of life pendantdice 925 sterling silver charm bead.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":2885617,"ranking":16,"query_text":"who was general sterling price","passage_text":"Sterling Silver Price. The current price of Sterling Silver (anything) is $13.33 per Ounce (oz), or $0.47 Per Gram (g). Sterling silver is defined as 92.5% pure silver and is widely used in high end cutlery, jewelry, and pitchers.The other 7.5% is usually made of some other metal like copper.he current price of Sterling Silver (anything) is $13.33 per Ounce (oz), or $0.47 Per Gram (g).","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":6543809,"ranking":17,"query_text":"who was general sterling price","passage_text":"The sterling silver charm, which is accented with a 14K gold design, is available at most retailers who sell the bracelets and cost $80. For each charm sold, $20 of the price is donated to the charity.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":1828536,"ranking":18,"query_text":"who was general sterling price","passage_text":"Sterling Silver Price The current price of Sterling Silver (anything) is $14.48 per Ounce (oz), or $0.51 Per Gram (g) Sterling silver is defined as 92.5% pure silver and is widely used in high end cutlery, jewelry, and pitchers. The other 7.5% is usually made of some other metal like copper. Most sterling silver pieces will have the word sterling somewhere on the bottom or back, as an example look at the photo adjacent of the back of a large sterling silver spoon.","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":8390414,"ranking":19,"query_text":"who was general sterling price","passage_text":"sterling silver price the current price of sterling silver anything is $ 13 33 per ounce oz or $ 0 47 per gram g sterling silver is defined as 92 5 % pure silver and is widely used in high end cutlery jewelry and pitchers","bm25_label":"high","relevance_label":0.0},{"query_id":1054071,"passage_id":7909420,"ranking":20,"query_text":"who was general sterling price","passage_text":"Back Home. Been too long since I posted an update. We're still in Texas, but have since moved back to the town where General Sterling Price showed up on my doorstep in fall of 1987. I drive by the place now and then. Lots of new homes are in the area, but the duplex is still there. How strange to have come to Texas by way of North Carolina to find Sterling.","bm25_label":"high","relevance_label":0.0}]