[{"query_id":1056644,"passage_id":7174190,"ranking":1,"query_text":"what is diflorasone diacetate cream used for","passage_text":"1 SPL UNCLASSIFIED SECTION Rx only For External Use Only - Not for Ophthalmic Use. Rx only. 2  DESCRIPTION Diflorasone diacetate cream USP, 0.05% contains the active compound diflorasone diacetate, a synthetic corticosteroid for topical dermatological use. Chemically, diflorasone diacetate is ...","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174192,"ranking":2,"query_text":"what is diflorasone diacetate cream used for","passage_text":"1 SPL UNCLASSIFIED SECTION Rx only NOT FOR OPHTHALMIC USE. Rx only. 2  DESCRIPTION Each gram of ApexiConÂ® E Cream (diflorasone diacetate cream USP, 0.05% [emollient]) contains 0.5 mg diflorasone diacetate in a cream base for topical dermatological use. Chemically ...","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174187,"ranking":3,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Each gram of FLORONE Cream contains 0.5 mg diflorasone diacetate in a cream base. Chemically, diflorasone diacetate is: 6 Î±,9-Difluoro-11Î², 17, 21-trihydroxy-16Î²-methylpregna-1,4-. diene-3,20-dione 17,21-diacetate. The structural formula is represented below: FLORONE Cream contains diflorasone diacetate in an emulsified and hydrophilic cream base of. propylene glycol, stearic acid, polysorbate 60, sorbitan monostearate and monooleate, sorbic acid, citric acid and water.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174186,"ranking":4,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Diflorasone diacetate. Diflorasone diacetate is a topical steroid that comes in the form of a cream. It is manufactured by E. Fougera & Co. and is used as an anti-inflammatory and anti-itching agent, like other topical corticosteroids. It is prescribed for psoriasis[1] and atopic dermatitis, among other conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174185,"ranking":5,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Diflorasone diacetate has been shown to be teratogenic (cleft palate) in rats when applied topically at a dose of approximately 0.001 mg\/kg\/day to the shaven thorax of pregnant animals. This is approximately 0.3 times the human topical dose of diflorasone diacetate cream USP, 0.05%.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174191,"ranking":6,"query_text":"what is diflorasone diacetate cream used for","passage_text":"What Is Diflorasone Diacetate Used For? Diflorasone diacetate is a prescription skin medication used to treat inflammation and itching due to a wide variety of different conditions. Such conditions include but are not limited to: Atopic dermatitis. Contact dermatitis. Eczema. Psoriasis. Poison ivy. Seborrhea.","bm25_label":"high","relevance_label":1.0},{"query_id":1056644,"passage_id":7174194,"ranking":7,"query_text":"what is diflorasone diacetate cream used for","passage_text":"How to use Diflorasone DIACETATE Cream Use this medication only on the skin. However, do not use it on the face, groin or underarms unless directed to do so by your doctor.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174189,"ranking":8,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Use of topical corticosteroids, including Florone Cream may increase the risk of posterior subcapsular cataracts and glaucoma. Cataracts have been reported in postmarketing experience with the use of topical diflorasone diacetate products. Glaucoma, with possible damage to the optic nerve, and increased intraocular pressure have been reported in postmarketing experience with the use of topical dermal corticosteroids. Avoid contact of Florone Cream with eyes.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174193,"ranking":9,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Rosacea (skin problem)â\u0080\u0094Diflorasone topical cream should not be used in patients with these conditions. PrecautionsTOP It is very important that your doctor check the progress of you or your child at regular visits for any unwanted effects that may be caused by this medicine.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":4432762,"ranking":10,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Flammability of the Product: Sodium diacetate or di acetate may be combustible at high temperature. Auto-Ignition Temperature: Not available for Sodium diacetate. Flash Points: Not available for Sodium diacetate. Flammable Limits: Not available for Sodium di acetate.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":4432764,"ranking":11,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Stability: Sodium diacetate or di acetate is stable under good condition of storage. Conditions of Instability: Not available for Sodium diacetate. Incompatibility with various substances: Not available for Sodium di acetate. Corrosivity: Sodium diacetate or di acetate is non-corrosive in presence of glass.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":2596613,"ranking":12,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Extract of belladonna, 1â\u0081\u00842 dr.; dilute solution of diacetate of lead, 1â\u0081\u00842 pint. From solution of diacetate of lead, 16 drops; distilled water, 1â\u0081\u00842 pint; mix. The derivative is approximately a diacetate, and on the assumption of a simple ester reaction the yield should be 127 p.ct.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":1433565,"ranking":13,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Chlorhexidine is an antibacterial used as an antiseptic and for other applications. It is a cationic polybiguanide (bisbiguanide). It is used primarily as its salts (e.g., the dihydrochloride, diacetate, and digluconate).","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7297092,"ranking":14,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Morphine is the principle alkaloid in opium (derived from poppy  plants). It is the active substance released by the metabolism of  heroin (morphine diacetate) in the human â\u0080¦ body.   Morphine is an opiate-narcotic pain reliever used to treat  moderate to severe pain.orphine is the principle alkaloid in opium (derived from poppy  plants). It is the active substance released by the metabolism of  heroin (morphine diacetate) in the human â\u0080¦ body.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":811166,"ranking":15,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Ganirelix acetate (or diacetate) is an injectable competitive gonadotropin-releasing hormone antagonist (GnRH antagonist). It is primarily used in assisted reproduction to control ovulation.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":1127106,"ranking":16,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Ethynodiol diacetate is a first-generation progestin of medium progestational activity. It has minor estrogenic effects and little androgenic activity. Ethynodiol diacetate is a derivative of norethindrone, so it is easily converted to norethindrone within the body.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7174188,"ranking":17,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Tell all of your health care providers that you take diflorasone. Do not use this medicine to treat acne, rosacea, or a rash around the mouth. Do not use tight-fitting diapers or plastic pants if treated part is in the diaper area. Talk with your doctor before you use other drugs or products on your skin.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":6321406,"ranking":18,"query_text":"what is diflorasone diacetate cream used for","passage_text":"2. Diacetic Acid \/ Acetoacetic Acid-Diacetic acid, also frequently called Acetoacetic acid is the first of the three ketone bodies to be formed makes up 20% of the total ketone bodies and is the form most detectable by dipstick or Acetest tablet.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7827324,"ranking":19,"query_text":"what is diflorasone diacetate cream used for","passage_text":"DOWANOLâ\u0084¢ PGDA Propylen glycol diacetate Description DOWANOL PGDA, propylene glycol diacet ate, is a highly pure chemical product (more than 99.5% pure). It is a clear, colorless, practically odorless liquid with a comparatively high boiling point.","bm25_label":"high","relevance_label":0.0},{"query_id":1056644,"passage_id":7136986,"ranking":20,"query_text":"what is diflorasone diacetate cream used for","passage_text":"Gonadotropin-releasing hormone - Medical uses. 1  Natural GnRH was previously prescribed as gonadorelin hydrochloride (Factrel) [16] and gonadorelin diacetate tetrahydrate (Cystorelin) [17] for use in treating human diseases.","bm25_label":"high","relevance_label":0.0}]