[{"query_id":1056446,"passage_id":7174386,"ranking":1,"query_text":"what is dockpanel used for","passage_text":"The main point of the DockPanel is the Dock, all controls in the DockPanel could dock to one side, and the last control will fill the remaining space.","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":7174393,"ranking":2,"query_text":"what is dockpanel used for","passage_text":"<DockPanel> <Button DockPanel.Dock=Top>dock 2.1<\/Button> <Button DockPanel.Dock=Top>dock 2.2<\/Button> <Button DockPanel.Dock=Left>dock 2.3<\/Button> <Button DockPanel.Dock=Right>dock 2.4<\/Button> <Button DockPanel.Dock=Bottom>dock 2.5<\/Button> <Button DockPanel.Dock=Bottom>dock 2.6<\/Button> <\/DockPanel>","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":7174389,"ranking":3,"query_text":"what is dockpanel used for","passage_text":"A DockPanel can be used for docking your controls to the top, bottom, left or right from the panel. Puil Marked as answer by LINK_me_with_LINQ Friday, March 11, 2011 1:17 PM","bm25_label":"high","relevance_label":1.0},{"query_id":1056446,"passage_id":7174391,"ranking":4,"query_text":"what is dockpanel used for","passage_text":"As already mentioned, the default behavior is that the last child of the DockPanel takes up the rest of the space, but this can be disabled using the LastChildFill. Here's an example where we disable it, and at the same time we'll show the ability to dock more than one control to the same side:","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":7174388,"ranking":5,"query_text":"what is dockpanel used for","passage_text":"This makes it a great choice in many situations, where you want to divide the window into specific areas, especially because by default, the last element inside the DockPanel, unless this feature is specifically disabled, will automatically fill the rest of the space (center).","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":7174390,"ranking":6,"query_text":"what is dockpanel used for","passage_text":"The last thing that you will likely notice, is how the space is divided. For instance, the Top button doesn't get all of the top space, because the Left button takes a part of it. The DockPanel decides which control to favor by looking at their position in the markup.","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":1147809,"ranking":7,"query_text":"what is dockpanel used for","passage_text":"what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":1147811,"ranking":8,"query_text":"what is dockpanel used for","passage_text":"what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ... 62. what is: humulin, used for; and what is ...","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":1147810,"ranking":9,"query_text":"what is dockpanel used for","passage_text":"what is: acetic acid, used for; and ... 57. what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":5095702,"ranking":10,"query_text":"what is dockpanel used for","passage_text":"Incoming search phrases: what do celebrities use to bleach their skin, what do celebrities use to whiten their skin, what do celebrities use to lighten their skin, what are celebrities using to bleach their skin, what are celebrities using to whiten their skin, what are celebrities using to lighten their skin, do celebrities use whitening creams, do ...","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":5095701,"ranking":11,"query_text":"what is dockpanel used for","passage_text":"Incoming search phrases: what do celebrities use to bleach their skin, what do celebrities use to whiten their skin, what do celebrities use to lighten their skin, what are celebrities using to bleach their skin, what are celebrities using to whiten their skin, what are celebrities using to lighten their skin, do celebrities use whitening creams, do celebrities use bleaching creams, do celebrities use lightening creams","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":7099015,"ranking":12,"query_text":"what is dockpanel used for","passage_text":"What is fentanyl used for and what is fentanyl used to treat? These are two common questions regarding fentanyl, which is a highly powerful prescription synthetic opioid. The following will look what fentanyl is used for and what itâ\u0080\u0099s used to treat.","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":1041939,"ranking":13,"query_text":"what is dockpanel used for","passage_text":"And if our God is for us, then who could ever stop us. And if our God is with us, then what could stand against. And if our God is for us, then who could ever stop us. And if our God is with us, then what could stand against.What could stand against.nd if our God is for us, then who could ever stop us. And if our God is with us, then what could stand against. And if our God is for us, then who could ever stop us. And if our God is with us, then what could stand against. Then what could stand against.","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":8145658,"ranking":14,"query_text":"what is dockpanel used for","passage_text":"How does a rocket work? What are the three types of fuel that are used to power modern rockets? What is orbital velocity? What is escape velocity? What is the main advantage of a multistage rocket? How were multistage rockets used in the 60s and how are they used today? What was the Space Race? What is a satellite?","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":8144663,"ranking":15,"query_text":"what is dockpanel used for","passage_text":"Chapman, Stephen. (2017, July 24). This Is What JavaScript Is Used For. Retrieved from https:\/\/www.thoughtco.com\/what-is-javascript-used-for-2037679 Chapman, Stephen. This Is What JavaScript Is Used For. ThoughtCo. https:\/\/www.thoughtco.com\/what-is-javascript-used-for-2037679 (accessed February 21, 2018).","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":6796749,"ranking":16,"query_text":"what is dockpanel used for","passage_text":"Show us what you got when the motherfu*kin' beat drops! Show us what you got when the motherfu*kin' beat drops! Show us what you got when the motherfu*kin' beat drops!how us what you got when the motherfu*kin' beat drops! Show us what you got when the motherfu*kin' beat drops! Show us what you got when the motherfu*kin' beat drops!","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":7747483,"ranking":17,"query_text":"what is dockpanel used for","passage_text":"What are the uses of Librium Tablet? What are the side-effects of Librium Tablet? What is the composition of Librium Tablet? What other medicines does Librium Tablet interact with? When should you not use Librium Tablet? What precautions should you take while using Librium Tablet?","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":6759238,"ranking":18,"query_text":"what is dockpanel used for","passage_text":"Can you please tell me what n! or n factorial is used for. I know what it is (5! is 120, because 1*2*3*4*5 = 120), but not what it is used for. I have heard that it is used in probability, but what for, and how? How does it work, and what are its uses? Date: 08\/30\/2001 at 10:49:46 From: Doctor Ian Subject: Re: What is n factorial used for? Hi Stuart, The factorial function is useful in computing the number of combinations or permutations that can be constructed from a set of objects.","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":3527605,"ranking":19,"query_text":"what is dockpanel used for","passage_text":"The prologue to the US Constitution is the preamble. It states what the intent of the Constitution is, what it hopes to accomplish.he prologue to the US Constitution is the preamble. It states what the intent of the Constitution is, what it hopes to accomplish.","bm25_label":"high","relevance_label":0.0},{"query_id":1056446,"passage_id":576583,"ranking":20,"query_text":"what is dockpanel used for","passage_text":"Discover the basics of polymers and what makes them so useful See examples of polymers and their common uses. What is a polymer? Discover the basics of polymers and what makes them so useful See examples of polymers and their common uses.","bm25_label":"high","relevance_label":0.0}]