[{"query_id":1060496,"passage_id":7168472,"ranking":1,"query_text":"what is badger inc in penn yan ny","passage_text":"A: (315) 536-3827 is the phone number for Empire Badger Inc in Penn Yan, NY. Q: How many people work at Empire Badger Inc in Penn Yan, NY? A: Empire Badger Inc employs approximately 1 person at this location.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":7168473,"ranking":2,"query_text":"what is badger inc in penn yan ny","passage_text":"Penn Yan, NY; Construction; Special Trade Contractors, NEC; Fiberglass Work; Empire Badger Inc","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":7168475,"ranking":3,"query_text":"what is badger inc in penn yan ny","passage_text":"There are 3 parties that go by the name of Badger Technologies Inc. These parties collectively are associated with 6 UCC filings in Farmington NY and Penn Yan NY. New York UCC Filings","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":7168469,"ranking":4,"query_text":"what is badger inc in penn yan ny","passage_text":"Badger Technologies, Inc. Address: 1 Keuka Business Park Penn Yan, NY 14527-0000: Entity Type: Corporation: Party Type: Debtor: Filing Number: 143942: Filing Date: 07\/19\/1999: Filing Status: Filed in 1999: Filing State: New York (NY)","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":7168468,"ranking":5,"query_text":"what is badger inc in penn yan ny","passage_text":"Badger Technologies Inc is located at the address 1 Keuka Business Park in Penn Yan, New York 14527. They can be contacted via phone at (315) 536-2124 for pricing, hours and directions. Badger Technologies Inc has an annual sales volume of 10M â\u0080\u0093 19,999,999. .For more information contact Gary Gray, Manager or go to www.badgertech.com","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":7168474,"ranking":6,"query_text":"what is badger inc in penn yan ny","passage_text":"Badger Technologies in Penn Yan, reviews by real people. Yelp is a fun and easy way to find, recommend and talk about whatâ\u0080\u0099s great and not so great in Penn Yan and beyond.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":222775,"ranking":7,"query_text":"what is badger inc in penn yan ny","passage_text":"Penn Yan, NY 1913-1930 City Directories Allen County Public Library Penn Yan, NY, City Directory, 1906-1907, 1913, 1920-1921, 1930 New York State Library U.S. City Directories (includes Penn Yan 1913, 1927, 1930, 1941, 1948, 1951 ) Ancestry Penn Yan Histories and Genealogies. Penn Yan, New York (printed 1915) Ancestry","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":222773,"ranking":8,"query_text":"what is badger inc in penn yan ny","passage_text":"Penn Yan is located in Yates County, NY. The population is 5,295, making Penn Yan the largest city in Yates County. There are 3 public schools in Penn Yan with an average Homefacts rating of B-. The total crime rate for Penn Yan is very low, and there are 30 registered sex offenders residing in the city.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":3980494,"ranking":9,"query_text":"what is badger inc in penn yan ny","passage_text":"Penn Yan, NY Weather. The average temperature of Penn Yan is 47.39Â°F, which is about the same as the New York average temperature of 48.17Â°F and is much lower than the national average temperature of 54.45Â°F. Historical Weather. Heating Cost Index, #842.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":7168467,"ranking":10,"query_text":"what is badger inc in penn yan ny","passage_text":"Badger Technologies is a business providing services in the field of Electricians. The business is located in Penn Yan, New York, United States. Their telephone number is (315) 536-2124. YellowPagesGoesGreen.org provides an environmentally friendly search engine and directory vigorously supporting the green movement.","bm25_label":"high","relevance_label":1.0},{"query_id":1060496,"passage_id":3980493,"ranking":11,"query_text":"what is badger inc in penn yan ny","passage_text":"The highest monthly average temperature in Penn Yan for July is 70 degrees. The lowest monthly average temperature in Penn Yan for February is 26 degrees. The most monthly precipitation in Penn Yan occurs in August with 2.7 inches. The air quality index in Penn Yan is 35% better than the national average. The pollution index in Penn Yan is 43% better than the national average.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":222769,"ranking":12,"query_text":"what is badger inc in penn yan ny","passage_text":"Eastview Veterinary Clinic, PC added a new photo â\u0080\u0094 at Yates County, New York. Â· October 16, 2017 Â· Penn Yan, NY Â· Eastview Veterinary Clinic, PC added a new photo â\u0080\u0094 at Yates County, New York. Â· October 16, 2017 Â· Penn Yan, NY Â· Eastview Veterinary Clinic, PC is at Yates County, New York. 1  Adam Benson is with at Yates County, New York. 2  Jon Gardner  3  Jon Gardner  4  Jon Gardner was feeling Unsafe at Yates County, New York. 5  Jon Gardner  6  Jon Gardner is feeling exhausted at Yates County, New York.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":4762906,"ranking":13,"query_text":"what is badger inc in penn yan ny","passage_text":"Cylinders for Lycoming & Continental Engines. Penn Yan Aero pioneered the overhauled cylinder process in the 1960s and has since supplied the aviation industry with thousands of top-quality cylinders. Core cylinders are disassembled, bare-metal cleaned, and evaluated for suitability for re-use. Selected cylinders are overhauled to Penn Yan Aero s stringent standards and include new pistons, piston rings, exhaust valves, exhaust and intake guides, keepers, rocker shaft. rocker shaft bushings, and gaskets. Many aviation professionals prefer Penn Yan Aero overhauled cylinders to new. They are really that good. Finished cylinders are fully assembled, tested to ensure Penn Yan Aero s quality standards, and backed by Penn Yan Aero s industry-leading warranty.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":6556018,"ranking":14,"query_text":"what is badger inc in penn yan ny","passage_text":"The panoramic view of vineyards surrounding the lake make for what many describe as the most picturesque of all the Finger Lakes. The largest town on Keuka Lake is Penn Yan (population 5,219), at the end of the northeastern branch of the lake. Penn Yan is the county seat of Yates County. The town of Branchport is at the end of the northwestern branch, and Hammondsportâ\u0080\u0094where winemaking in the Finger Lakes beganâ\u0080\u0094anchors the southern end of the lake.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":1337812,"ranking":15,"query_text":"what is badger inc in penn yan ny","passage_text":"Yates County Board of Elections 417 Liberty Street Penn Yan NY 14527 39.6 miles from Addison 315-536-5135. Allegany County Board of Elections 6 Schuyler Street Belmont NY 14813 41.9 miles from Addison 585-268-9294. Tompkins County Board of Elections 128 East Buffalo Street Ithaca NY 14850 44.1 miles from Addison 607-274-5522","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":8632247,"ranking":16,"query_text":"what is badger inc in penn yan ny","passage_text":"Is Badger Meter, Inc. engaged in manufacturing or production? Badger Meter, Inc. is engaged in the manufacture of products and\/or product components at this facility. Is Richard A Meeusen the only contact you have for Badger Meter, Inc.? On Buzzfile's Professional (subscription) Service we have 59 contacts for Badger Meter, Inc., including 3 contacts with email addresses. What is the phone number for Badger Meter? The phone number for Badger Meter is (414) 355-0400","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":317787,"ranking":17,"query_text":"what is badger inc in penn yan ny","passage_text":"Welcome to The Windmill Farm & Craft Market. The Windmill is the first and friendliest farm and craft market in upstateNew York, located right in the heart of the Finger Lakes Wine Region. Midway between Penn Yan and Dundee on NY Route 14A, The Windmill has become a premier tourist attraction, with a weekly attendance exceeding 8,000 - 10,000 people.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":6770117,"ranking":18,"query_text":"what is badger inc in penn yan ny","passage_text":"Â©2017 Arts Center of Yates County â\u0080¢ 127 Main Street, Penn Yan, NY 14527 â\u0080¢ info@artscenteryatescounty.org â\u0080¢ Ph: 315.536.8226g â\u0080¢ Programs at the. Arts Center of Yates County are supported in part with public funds from the New York State Council on the Arts State & Local Partnership Program.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":6770124,"ranking":19,"query_text":"what is badger inc in penn yan ny","passage_text":"Penn Yan, New York. Penn Yan is an incorporated village in Yates County, New York, USA. The population was 5,159 at the 2010 census. It is the county seat of Yates County and lies at the north end of the east branch of Keuka Lake, one of the Finger Lakes.","bm25_label":"high","relevance_label":0.0},{"query_id":1060496,"passage_id":3876039,"ranking":20,"query_text":"what is badger inc in penn yan ny","passage_text":"by Joe Hoffman. (Penn Yan, NY) Q. I have some pests eating my cherry tomatoes. They completely consume orange and red cherries, and chew a little out of green ones. I think it might be rabbits or chipmunks. My fence keeps larger animals out, but I have seen small rabbits and chipmunks in my garden.","bm25_label":"high","relevance_label":0.0}]