[{"query_id":1062603,"passage_id":7890190,"ranking":1,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Report Abuse. Italy did not attack Libya or Somalia because, at the start of WWII, they were Italian colonies. The invasion of Ethiopia was done in the 30's to expand the territories already held, such as Eritrea and Italian Somalia and to avenge a shameful defeat suffered by the Italian Army at Adowa in 1896.he expansion from Eritrea into neighbouring lands made it a force to be reckoned with. Italy conquered and occupied Ethiopia in 1935 and eventually created Italian East Africa out of newly-occupied Ethiopia and the Italian colonies of Eritrea and Italian Somaliland.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":6672857,"ranking":2,"query_text":"why did italy attack ethiopia in 1935","passage_text":"On October 3, 1935, Italy attacked Ethiopia from Eritrea and Italian Somaliland without a declaration of war. On October 7, the League of Nations unanimously declared Italy an aggressor but took no effective action.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7890184,"ranking":3,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Italy attacked and invaded Ethiopia in 1935 from their neighboring territories then known as Italian Somaliland. Their motivation was purely imperial in nature: Benito Mussolini wanted to expand his territory in a manner reminiscent of the Roman Empire from 2000 years earlier.ource(s): This link provides a detailed analysis of the italian invasion of Ethiopia in 1935: http:\/\/en.wikipedia.org\/wiki\/Second_Ital... An this one provides an analysis of the East African campaign of WWII: http:\/\/en.wikipedia.org\/wiki\/East_Africa...","bm25_label":"high","relevance_label":1.0},{"query_id":1062603,"passage_id":7890188,"ranking":4,"query_text":"why did italy attack ethiopia in 1935","passage_text":"At the time of the invasion of Ethiopia in 1935, Italy had already made a colony out of the neighboring country of Eritrea. It served as the perfect base to launch an invasion of Ethiopia. Italy had some other colonies in Africa at that time.Perhaps, the most significant one was Libya.t the time of the invasion of Ethiopia in 1935, Italy had already made a colony out of the neighboring country of Eritrea. It served as the perfect base to launch an invasion of Ethiopia. Italy had some other colonies in Africa at that time. Perhaps, the most significant one was Libya.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7890192,"ranking":5,"query_text":"why did italy attack ethiopia in 1935","passage_text":"At precisely 5:00 am on 3 October 1935, De Bono crossed the Mareb River and advanced into Ethiopia from Eritrea without a declaration of war. In response to the Italian invasion, Ethiopia declared war on Italy.exico was the only country to strongly condemn Italy's sovereignty over Ethiopia, respecting Ethiopian independence throughout. Mexico was amongst only six nations in 1937 which did not recognize Italy's occupation, along with China, New Zealand, the Soviet Union, the Republic of Spain, and the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":3366175,"ranking":6,"query_text":"why did italy attack ethiopia in 1935","passage_text":"The League of Nations failed for a couple of reasons: 1  The United States was not part of it. 2  More importantly, the countries in the League did not take the idea of collective security seriously.3  When countries attacked others, nothing was done. 4  For example, Italy attacked Ethiopia and Japan attacked China. The United States was not part of it. 2  More importantly, the countries in the League did not take the idea of collective security seriously. 3  When countries attacked others, nothing was done. 4  For example, Italy attacked Ethiopia and Japan attacked China. 5  In both cases, nothing serious was done.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":6426269,"ranking":7,"query_text":"why did italy attack ethiopia in 1935","passage_text":"1 The United States was not part of it. 2  More importantly, the countries in the League did not take the idea of collective security seriously. 3  When countries attacked others, nothing was done. 4  For example, Italy attacked Ethiopia and Japan attacked China.5  In both cases, nothing serious was done. The United States was not part of it. 2  More importantly, the countries in the League did not take the idea of collective security seriously. 3  When countries attacked others, nothing was done. 4  For example, Italy attacked Ethiopia and Japan attacked China. 5  In both cases, nothing serious was done.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7890193,"ranking":8,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Reputation: 15273. At the time of the invasion of Ethiopia in 1935, Italy had already made a colony out of the neighboring country of Eritrea. It served as the perfect base to launch an invasion of Ethiopia. Italy had some other colonies in Africa at that time.Perhaps, the most significant one was Libya.eputation: 15273. At the time of the invasion of Ethiopia in 1935, Italy had already made a colony out of the neighboring country of Eritrea. It served as the perfect base to launch an invasion of Ethiopia. Italy had some other colonies in Africa at that time. Perhaps, the most significant one was Libya.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":3092893,"ranking":9,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Middle. For example, when Italy attacked Abyssinia in 1935, the League of Nations did not use those sanctions to force Italy to back down as B retain and France were afraid of provoking Italy into allying with Germany.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":3317588,"ranking":10,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Benito Mussolini. Fascist dictator of Italy. He led Italy to conquer Ethiopia (1935), joined Germany in the Axis pact (1936), and allied Italy with Germany in World War two.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7890191,"ranking":11,"query_text":"why did italy attack ethiopia in 1935","passage_text":"The Italian invasion of Ethiopia was initiated in the month of October 1935. It was a brief colonial war that is also remembered in history as the second Italo-Abyssinian war. Mussolini, who was the leader of Italy, had his eye set on annexing Ethiopia into Italyâ\u0080\u0099s newly created colony of East Africa.he Italian invasion of Ethiopia was initiated in the month of October 1935. It was a brief colonial war that is also remembered in history as the second Italo-Abyssinian war. Mussolini, who was the leader of Italy, had his eye set on annexing Ethiopia into Italyâ\u0080\u0099s newly created colony of East Africa.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":3146113,"ranking":12,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Fascist dictator of Italy (1922-1943). He led Italy to conquer Ethiopia (1935), joined Germany in the Axis pact (1936), and allied Italy with Germany in World War II. He was overthrown in 1943 when the Allies invaded Italy.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":3437251,"ranking":13,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Fascist dictator of Italy (1922-1943). He led Italy to conquer Ethiopia (1935), joined Germany in the Axis pact (1936), and allied Italy with Germany in World War II. He was overthrown in 1943 when the Allies invaded Italy. (p.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7631631,"ranking":14,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Haile Selassie. Sunday, 29 September 1935. Ethiopia had been one of the few states to survive the scramble for Africa by the major European powers in the late 19th century. Both Italy and Ethiopia were members of the League of Nations, founded in 1920.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7890186,"ranking":15,"query_text":"why did italy attack ethiopia in 1935","passage_text":"  Answer   Mussolini addressed a crowd in Rome on 2 Ocoter 1935 in a firey speech declaring war on Ethiopia(Abyssinia) after creating a border incident that gave him an â\u0080¦ excuse to attack. The next day, 3 October, Italy invaded Abyssinia with their 100,000 infantry supported by armor, aircraft and gas attacks.taly also held territory adjoining Ethiopia, (Italian Somaliland), and was able to build up her troops there. It was probably seen as an easy conquest at the time. This is all bull crap by the way, im just trying to gain attention....","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7890189,"ranking":16,"query_text":"why did italy attack ethiopia in 1935","passage_text":"The Second Italo-Ethiopian War, also referred to as the Second Italo-Abyssinian War, was a colonial war that started in October 1935 and ended in May 1936. The war was fought between the armed forces of the Kingdom of Italy and the armed forces of the Ethiopian Empire (also known at the time as Abyssinia).exico was the only country to strongly condemn Italy's sovereignty over Ethiopia, respecting Ethiopian independence throughout. Mexico was amongst only six nations in 1937 which did not recognize Italy's occupation, along with China, New Zealand, the Soviet Union, the Republic of Spain, and the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":6426273,"ranking":17,"query_text":"why did italy attack ethiopia in 1935","passage_text":"The League of Nations, which was known for its inaction, did nothing to prevent Italy from attacking Ethiopia. One of the major problems for the League of Nations prior to World War II was its inaction to prevent aggression of any kind.This problem existed because many members of the League of Nations were the warring nations themselves. Both Ethiopia and Italy were League members at the time of the war.n June 30, 1936, Selassie made one last plea to the League of Nations in Geneva, Switzerland, warning the League that Italy was not going to stop with Ethiopia and had its eyes set on the world. Throughout the speech, Selassie had to speak over the scoffing of Italian officials in the audience.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":2155879,"ranking":18,"query_text":"why did italy attack ethiopia in 1935","passage_text":"Abyssinia Crisis. The Abyssinia Crisis was a crisis in 1935 originating in the so-called Walwal incident in the then ongoing conflict between the Kingdom of Italy and the Empire of Ethiopia (then commonly known as Abyssinia in Europe). The League of Nations ruled against Italy and voted for economic sanctions, but they were not fully applied.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":6672855,"ranking":19,"query_text":"why did italy attack ethiopia in 1935","passage_text":"In 1896, neighbors Britain and France assisted Ethiopia in resisting an Italian attack, but they did not want to interfere with Italy in 1936. Ethiopian army was poorly equipped, and any resistance against it would end quickly. Haile Selassie (middle with hat) exits from a meeting room in Geneva on June 30, 1936.","bm25_label":"high","relevance_label":0.0},{"query_id":1062603,"passage_id":7479244,"ranking":20,"query_text":"why did italy attack ethiopia in 1935","passage_text":"In some sense, World War II was a continuation of the first war. Japan, seeking to create its own empire in East Asia, invaded Chinese Manchuria in 1931 and mainland China in 1937. Fascist Italy invaded Ethiopia in 1935.","bm25_label":"high","relevance_label":0.0}]