[{"query_id":1064195,"passage_id":7164234,"ranking":1,"query_text":"what is aircraft ram air","passage_text":"Definition of ram air - air which is forced to enter a moving aperture, such as the air intake of an aircraft. Definition of ram air - air which is forced to enter a moving aperture, such as the air intake of an aircraft.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":3352751,"ranking":2,"query_text":"what is aircraft ram air","passage_text":"Definition of 'ram-air turbine'. ram-air turbine. noun. a small air-driven turbine fitted to an aircraft to provide power in the event of a failure of the normal systems.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":7164228,"ranking":3,"query_text":"what is aircraft ram air","passage_text":"Air which is forced to enter a moving aperture, such as the air intake of an aircraft. Example sentences â\u0080\u0098A modified cowling was needed along with a large intake under the fuselage to supply ram air but the project was not completely successful due to developmental problems and both companies dropped the experiment.â\u0080\u0099 â\u0080\u0098The aircraft still was getting ram air over the cooling fins, but most of the efficiency of the exchanger had been lost.â\u0080\u0099 â\u0080\u0098A stock 5.3 litre Jaguar V12 was used, with the only changes being ram air intakes.â\u0080\u0099","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":7164229,"ranking":4,"query_text":"what is aircraft ram air","passage_text":"A ram air turbine is a small airflow driven engine that supplies supplies emergency electrical or hydraulic power to aircraft or...","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":7164230,"ranking":5,"query_text":"what is aircraft ram air","passage_text":"Pitot sensors are used to measure ram pressure, which is added to static pressure to derive the airspeed of an aircraft. 1  TA-4SU Super Skyhawk, note the ram-air intake mounted on the portside air intake for cooling the jet engine. 2  Mikoyan-Gurevich MiG-15.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":7164232,"ranking":6,"query_text":"what is aircraft ram air","passage_text":"In some cases, such as aircraft used in crop dusting operations a ram air turbine is used during normal operation to power chemical spray pumps.","bm25_label":"high","relevance_label":1.0},{"query_id":1064195,"passage_id":4096709,"ranking":7,"query_text":"what is aircraft ram air","passage_text":"The fastest aircraft (with wings) made by far is the space shuttle. . . . It travels at speeds in excess of mach 12. . . But the aircraft made with air breathing engines is the Bell X 41 based on SCRAM jet propulsion. , . It reached speeds of mach 7, . The fastest aircraft which used a Jet engine coupled with a RAM jet is the SR 71 Black Bird. . . .","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":7164231,"ranking":8,"query_text":"what is aircraft ram air","passage_text":"The RATs on commercial aircraft are obviously far larger with the Airbus A380 ram air turbine measuring five and a quarter feet (1.63 m) across. The average RAT is a little smaller, at approximately 2.6 feet (80 cm) in diameter.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":3976906,"ranking":9,"query_text":"what is aircraft ram air","passage_text":"what indication should a pilot observe if an airspeed indicator ram air input and drain hole are blocked %%%%%. (Athe airspeed indicator will react as an altimeter. if both the ram air input and drain hole of the pitot system are blocked, what airspeed indication can be expected %%%%%.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":861988,"ranking":10,"query_text":"what is aircraft ram air","passage_text":"What is the difference between Ram Air and Cold Air Intake systems? A Ram Air Intake technically is a cold air intake system, since it draws cooler air down into the engine than does a stock intake. The main difference comes from where it draws that cooler air, and how it faciilitates combustion.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":7023100,"ranking":11,"query_text":"what is aircraft ram air","passage_text":"Some aircraft have more than one static port and some aircraft have an alternate static port in case one or more of the ports becomes blocked. Instruments: The pitot-static system involves three instruments: The airspeed indicator, altimeter, and vertical speed indicator. Static lines connect to all three instruments and ram air pressure from the pitot tube connects to only the airspeed indicator.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":4882980,"ranking":12,"query_text":"what is aircraft ram air","passage_text":"The United States Air Force introduced a radar-absorbent paint made from both ferrofluidic and nonmagnetic substances. By reducing the reflection of electromagnetic waves, this material helps to reduce the visibility of RAM-painted aircraft on radar. The Israeli firm Nanoflight has also made a radar-absorbing paint that uses nanoparticles. [7]","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":3060027,"ranking":13,"query_text":"what is aircraft ram air","passage_text":"What's the difference between a cold air intake and a short ram air intake? What are the benefits of one over the other? Cold air intakes attempt to relocate the engine air filter outside of the engine compartment, thus pulling in cooler air and allowing for more power.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":3327092,"ranking":14,"query_text":"what is aircraft ram air","passage_text":"If you want to upgrade your Dodge Ram 1500 suspension or your Dodge Ram 2500 suspension, we have what you're looking for. You'll definitely appreciate the depth of our offerings as well as our competitive prices and free shipping offer.hether it's a Ram air suspension, Ram suspension lift kits, a suspension kit for Ram 1500 or the Ram 2500 suspension-we have got you covered.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":4150204,"ranking":15,"query_text":"what is aircraft ram air","passage_text":"This temperature is what the air temperature is like just outside the aircraft, not -55C. This phenomenon is famously why Concorde had significantly higher temperatures: as a supersonic aircraft, the resulting total air temperature was much higher, i.e. +100C instead of -55C.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":8769954,"ranking":16,"query_text":"what is aircraft ram air","passage_text":"Results in Brief: Deferred Maintenance on the Air Force C-130 Aircraft What We Did We determined the extent and causes of deferred maintenance on the U.S. Air Force C-130 aircraft used in support of operations in Southwest Asia.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":861986,"ranking":17,"query_text":"what is aircraft ram air","passage_text":"Short Ram Intake - Acura Integra GS. Before getting into testing out these common aftermarket upgrades, itâ\u0080\u0099s best to understand what each of these performance upgrades is attempting to achieve. Cold air intakes and short ram intakes both have the same goal, which is to increase horsepower. But they go about it in different ways. Short ram intakes (SRI) look to increase power by reducing the amount of restriction on the intake air. In many vehicles, the intake air passes through a resonator and silencer box to help reduce induction noise. This restriction can limit airflow. A short ram eliminates the resonator and filter box, giving the air a short travel distance and hopefully increasing power. That said, itâ\u0080\u0099s pulling air from the engine bay, thus the intake air will be warmer than by using a cold air intake.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":4535876,"ranking":18,"query_text":"what is aircraft ram air","passage_text":"The Air Force provided Wheeler with cost-per-flight-hour for dozens of aircraft. Hereâ\u0080\u0099s a sample of what it costs to keep these Air Force aircraft airborne for one hour last year (the so-called â\u0080\u009cownershipâ\u0080\u009d cost-per-flight-hour, which includes modifications): A-10C Warthog Attack Plane â\u0080\u0094 $17,716.he Air Force provided Wheeler with cost-per-flight-hour for dozens of aircraft. Hereâ\u0080\u0099s a sample of what it costs to keep these Air Force aircraft airborne for one hour last year (the so-called â\u0080\u009cownershipâ\u0080\u009d cost-per-flight-hour, which includes modifications): A-10C Warthog Attack Plane â\u0080\u0094 $17,716.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":71667,"ranking":19,"query_text":"what is aircraft ram air","passage_text":"What Is the Altitude of a Plane in Flight? The altitude of aircraft in flight can vary by the type of aircraft. Generally, commercial aircraft fly at higher cruising altitudes than smaller general aviation aircraft. The flight level of an aircraft can also vary based on weather, air traffic control instruction and the purpose of the flight.","bm25_label":"high","relevance_label":0.0},{"query_id":1064195,"passage_id":4316679,"ranking":20,"query_text":"what is aircraft ram air","passage_text":"What kind of FAA aviation safety inspectors (airworthiness) are there? There are two kinds: general aviation and air carrier. This separation between the two is based on the industry standard of assigning aircraft of less than 12,500 pounds to GA and aircraft 12,500 pounds and heavier to air carrier.","bm25_label":"high","relevance_label":0.0}]