[{"query_id":1068726,"passage_id":7189813,"ranking":1,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Frequently Asked Questions: Contamination. Q: What items are considered contaminants in recycling? A: Many items can be considered contaminants. Contamination happens when non-recyclable items are mixed in with recyclables items or when recyclable items are placed in the wrong recycling bins. Innocent looking paper smeared with food or grease cannot be processed with clean paper and can ruin a newly made product if it is not caught before it goes to the factory.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":7189809,"ranking":2,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Contamination occurs in recycling when non-recycables are placed in recycling. Contamination can include anything from food waste to plastic bags. Different recycling systems allow for different materials to be recycled and consider different materials as contaminants. This makes proper recycling difficult.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":5150588,"ranking":3,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Since a lot of flexible packaging is used for food products, another hurdle for recycling is food contamination. Due to food contamination in most flexible packaging going through the current recycling system, a very small percentage is actually reusable.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":534555,"ranking":4,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"What Not To Recycle. Not all glass can be recycled. The following items should not be placed into your recycling bin: 1  Any glass contaminated with stones, dirt, and food waste. 2  Ceramics, such as dishware, ovenware, and decorative items. 3  Heat-resistant glass, such as Pyrex. 4  Mixed colors of broken glass.hat Not To Recycle. Not all glass can be recycled. The following items should not be placed into your recycling bin: 1  Any glass contaminated with stones, dirt, and food waste. 2  Ceramics, such as dishware, ovenware, and decorative items. 3  Heat-resistant glass, such as Pyrex. 4  Mixed colors of broken glass.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":6925210,"ranking":5,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"To be properly recycled, recyclables must be appropriately sorted by consumers, and properly collected. During sorting, the recyclables are checked for food and other contaminants, which could potentially cause the item to go straight to waste disposal. Recycling is a commodity business with supply and demand.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":8160049,"ranking":6,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"What Not To Recycle. Not all glass can be recycled. The following items should not be placed into your recycling bin: Any glass contaminated with stones, dirt, and food waste. Ceramics, such as dishware, ovenware, and decorative items. Heat-resistant glass, such as Pyrex. Mixed colors of broken glass. Mirror or window glass.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":5845637,"ranking":7,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"You now know that food can be contaminated from sources in the natural environment, people, food preparation surfaces and utensils, raw and uncooked food, animals, pests, and waste material. To prevent contamination, food production and preparation operations need to be carefully controlled.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":2903272,"ranking":8,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Why Food Waste is Important. Food waste disposal and treatment has become a big issue in most industrialized countries. Relative to other recycling methods using AD for this purpose is relatively new, but many areas are now sending it to anaerobic digestion.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":2380272,"ranking":9,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"What Not To Recycle. Not all glass can be recycled. The following items should not be placed into your recycling bin: 1  Any glass contaminated with stones, dirt, and food waste. 2  Ceramics, such as dishware, ovenware, and decorative items. 3  Heat-resistant glass, such as Pyrex. 4  Mixed colors of broken glass.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":2381482,"ranking":10,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Packaging. Between a quarter and a third of all domestic waste is packaging: much of this is food packaging. Itâ\u0080\u0099s difficult to recycle, too. Plastic which is contaminated with food is hard to reuse. Glass bottle banks for recycling are now ubiquitous in the UK â\u0080\u0093 and the material collected really is reused. 2  The average glass bottle contains over 25% recycled glass. 3  Green glass bottles manufactured in this country contain at least 60%, and sometimes as much as 90%, recycled glass.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":4810914,"ranking":11,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"What Not To Recycle. Not all glass can be recycled. The following items should not be placed into your recycling bin: 1  Any glass contaminated with stones, dirt, and food waste. 2  Ceramics, such as dishware, ovenware, and decorative items. 3  Heat-resistant glass, such as Pyrex. 4  Mixed colors of broken glass.ou may think of it as junk mail, or you may welcome the flyers, catalogs, and coupons that appear in your mailbox. Either way, it's important to recycle them. Mixed paper is the term used to define the many kinds of paper products that can be collected and recycled from our daily mail.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":434516,"ranking":12,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Compostable food ware. Compostable food ware cannot go in your recycling cart. Plain uncoated (non-shiny) paper plates and approved Cedar Grove compostable food ware (pdf) is accepted in your food and yard waste cart. All other food ware labeled compostable or biodegradable goes in your garbage.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":4959990,"ranking":13,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Recycling helps to save our future! Recycling reduces Air pollution Recycling reduces Water contamination Recycling reduces Land pollution Recycle and save money + have a better life! Recycling secures the future of our children and grandchildren.ecycling reduces the need for more landfills! Recycling gives our children a chance to use natural resources. Recycling has many faces. Using food scraps and green waste and turning it into compost is a very successful recycling method.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":1575513,"ranking":14,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Biogas is produced by processing residual waste from livestock (dung, manure and uneaten food), food production (fruit and vegetable waste, residues from meat, fish and dairy processing, brewery waste, food waste and much more) and effluents from industrial as well as municipal wastewater treatment plants.igestates are produced as a by-product of biogas manufacturing, which can in turn be used as high-quality digestate. The implementation of the Recycling and Waste Management Act is perfetctly implemented with the construction of rural biogas power plants from an economic and environmental perspective.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":251088,"ranking":15,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Cholera is an infection in the small intestine caused by the bacteria â\u0080\u0098vibrio chloraeâ\u0080\u0099. Its symptoms are diarrhea and vomiting. It is caused by drinking water or eating food that has been contaminated by feces, i.e waste products of an infected person.holera is an infection in the small intestine caused by the bacteria â\u0080\u0098vibrio chloraeâ\u0080\u0099. Its symptoms are diarrhea and vomiting. It is caused by drinking water or eating food that has been contaminated by feces, i.e waste products of an infected person.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":4959989,"ranking":16,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"The composting or other reuse of biodegradable waste â\u0080\u0094such as food or garden waste â\u0080\u0094is also considered recycling. Materials to be recycled are either brought to a collection center or picked up from the curbside, then sorted, cleaned and reprocessed into new materials destined for manufacturing.lastic recycling is the process of recovering scrap or waste plastic and reprocessing the material into useful products, sometimes completely different in form from their original state.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":1776171,"ranking":17,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Recycling your food waste could help grow more food for your next meal Much of our food waste ends up in landfill where it rots releasing methane, a harmful greenhouse gas. Food waste recycled by in-vessel composting creates soil improver and fertiliser which can be used to grow more food or feed plants in your local parks.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":8706092,"ranking":18,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Eugene Pilots Residential Food Waste Collection The City of Eugene is launching a two-year residential food waste collection pilot to make it easier for people to recycle their food waste, instead of throwing it away.","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":8207477,"ranking":19,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"Food Contamination and Foodborne Illness Prevention . Food becomes contaminated through a variety of mechanisms. Some things that can contribute to foodborne illness are: inadequate handwashing; cross-contamination; storage and cooking temperatures; contamination of food by animal waste ; Hand Washing","bm25_label":"medium","relevance_label":0.0},{"query_id":1068726,"passage_id":5179386,"ranking":20,"query_text":"why food products or food contaminated wastes cannot be recycled?","passage_text":"City Spotlight. Eugene Pilots Residential Food Waste Collection The City of Eugene is launching a two-year residential food waste collection pilot to make it easier for people to recycle their food waste, instead of throwing it away.","bm25_label":"medium","relevance_label":0.0}]