[{"query_id":1069128,"passage_id":7159635,"ranking":1,"query_text":"what is a portable engine","passage_text":"A Ransomes portable engine No. 20539 at the Bromyard Show 2008. A portable engine is a small steam engine, mounted on wheels or skids, which is used for driving machinery using a belt from its flywheel. It is not self-propelled and is towed to the work site by horses or bullocks, or even a traction engine. Portable engines were used mainly for driving agricultural machinery, such as threshing machines.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":7159633,"ranking":2,"query_text":"what is a portable engine","passage_text":"A portable engine is  an engine, either a steam engine or an internal combustion engine, that sits in one place while operating (providing power to machinery), but (unlike a stationary engine) is portable and thus can be easily moved from one work site to another.","bm25_label":"high","relevance_label":1.0},{"query_id":1069128,"passage_id":7159636,"ranking":3,"query_text":"what is a portable engine","passage_text":"(22) â\u0080\u009cLow-Use Enginesâ\u0080\u009d refers to portable diesel-fueled engines that operate 80 hours or less in a calendar year. (23) â\u0080\u009cMaximum Rated Horsepower (brake horsepower (bhp))â\u0080\u009d is the maximum brake horsepower rating specified by the portable engine manufacturer and listed on the nameplate of the portable engine.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":4606551,"ranking":4,"query_text":"what is a portable engine","passage_text":"Distinguishing Features Of Generac Portable Generators. 1  From the smallest to the largest portable generators, Generac has it all! 2  X-Torque Governer increases engine efficiency, prevents stalling and improves customer satisfaction. 3  Fully pressurized lubricated OHVI engines on all portable generator models.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":7159638,"ranking":5,"query_text":"what is a portable engine","passage_text":"The District response to the 2017 ALA State Of The Air Report. Portable Diesel Engine. The District is suspending enforcement of the 2017 portable engine fleet standards and related reporting requirements until ongoing CARB regulatory amendments are effective.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":3803767,"ranking":6,"query_text":"what is a portable engine","passage_text":"TECH VIDEO: Yeti 400 & 1400 Lithium. Hear what makes the new Goal Zero Yeti Lithium Portable Power Stations some of the most innovative products our engineering team has ever developed. See More >.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":7945817,"ranking":7,"query_text":"what is a portable engine","passage_text":"a motorboat speedboat or powerboat is a boat which is powered by an engine some motorboats are fitted with inboard engines others have an outboard motor installed on the rear containing the internal combustion engine the gearbox and the propeller in one portable unit motorboat speedboat or powerboat is a boat which is powered by an engine some motorboats are fitted with inboard engines others have an outboard motor installed on the rear containing the internal combustion engine the gearbox and the propeller in one portable unit","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":3321976,"ranking":8,"query_text":"what is a portable engine","passage_text":"The engines used on the Generac XP and XG Series of portables are manufactured at our Generac Power Systems, Inc. factory in Whitewater, WI. Generac engines are industrial grade engines designed to provide the ultra-quiet, longer-lasting performance required of portable generators. They also run 30-50 degrees cooler, are 5% more fuel-efficient and reduce oil consumption by 25%.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":1800754,"ranking":9,"query_text":"what is a portable engine","passage_text":"Portable Hydraulic Power Supply Units. The Hydratight line of portable hydraulic power supplies incorporate robust engineering in a compact footprint. The range includes both electric and diesel drive options. Each unit is equipped with performance minded features, designed for safety and engineered to perform even in the harshest conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":3879931,"ranking":10,"query_text":"what is a portable engine","passage_text":"If your engine is designed to use low-octane fuel, the use of a higher-octane gasoline will not improve performance. Engine dynamics, timing and compression ratio are what determine which gasoline octane the engine manufacturer recommends.eltex' Inc.'s portable octane analyzer, is battery-operated and uses near-infrared technology to provide an accurate fuel octane analysis in less than 45 seconds. More and more pilots are obtaining STCs for their aircraft to use autogas.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":2871289,"ranking":11,"query_text":"what is a portable engine","passage_text":"Outboard and Inboard Engines; Stern and Jet Drives. An outboard is a portable, self-contained package of an engine, gear case, and propeller that is attached to the transom of a boat.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":6912090,"ranking":12,"query_text":"what is a portable engine","passage_text":"Related resources. 1  laptop for mechanical engineering student solution. 2  Portable laptop for freshman biomedical engineering student solution. 3  mechanical engineering student Forum.  SolvedLooking for a laptop for a Software Engineering student. solution.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":1450130,"ranking":13,"query_text":"what is a portable engine","passage_text":"An engine-generator or portable generator is the combination of an electrical generator and an engine (prime mover) mounted together to form a single piece of equipment. This combination is also called an engine-generator set or a gen-set.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":5333771,"ranking":14,"query_text":"what is a portable engine","passage_text":"Loading... TruFuel is the first-ever premixed, ready-to-use fuel engineered specifically for portable 2-cycle gas powered equipment, providing time-saving convenience and superior performance.oading... TruFuel is the first-ever premixed, ready-to-use fuel engineered specifically for portable 2-cycle gas powered equipment, providing time-saving convenience and superior performance.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":6621637,"ranking":15,"query_text":"what is a portable engine","passage_text":"So how does a portable generator work? Well itâ\u0080\u0099s best to start at the beginning. A Portable Generator basically consists of a power generator head, an engine, a fuel source and . For this reason, they are sometimes known as an engine-generator set, or a gen-set by some people. That description is its simplest form and an explanation of how they work separately and together follows.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":862828,"ranking":16,"query_text":"what is a portable engine","passage_text":"Imaging Scientists are experts in understanding and developing cutting edge imaging systems: from satellite systems, to portable eye trackers, to medical imagers, to multispectral detectors-anything that involves recording, processing, displaying, or analyzing image data.mSci students typically have interests in science, engineering, computing, or math, but are not sure what they want to do. They may also have interests in photography or video, but are looking to apply science and engineering concepts.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":5186991,"ranking":17,"query_text":"what is a portable engine","passage_text":"A motorboat, speedboat, or powerboat is a boat which is powered by an engine. Some motorboats are fitted with inboard engines, others have an outboard motor installed on the rear, containing the internal combustion engine, the gearbox and the propeller in one portable unit.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":5333770,"ranking":18,"query_text":"what is a portable engine","passage_text":"PRODUCT OVERVIEW. TruFuel is the first-ever premixed, ready-to-use fuel engineered specifically for portable 2-cycle gas powered equipment, providing time-saving convenience and superior performance.oading... TruFuel is the first-ever premixed, ready-to-use fuel engineered specifically for portable 2-cycle gas powered equipment, providing time-saving convenience and superior performance.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":6912089,"ranking":19,"query_text":"what is a portable engine","passage_text":"Portable Laptop For Mechanical Engineering Student. This next semester, I am going to be a junior in college seeking a mechanical engineering degree, but I am now in need of a new laptop. I have been searching for an ultrabook\/portable solution (3 1\/2 pounds or less) with an i5 or better, 256gb SSD, Full HD screen, with ~8 hours of battery life.","bm25_label":"high","relevance_label":0.0},{"query_id":1069128,"passage_id":690134,"ranking":20,"query_text":"what is a portable engine","passage_text":"what should be included generator output is measured by watts or kilowatts kw and 1000 watts equals 1 kw an average refrigerator uses 700 watts when it s running but requires 2800 watts to start up a portable generator is basically an engine within a frame and usually weighs around 100 250 pounds","bm25_label":"high","relevance_label":0.0}]