[{"query_id":1070412,"passage_id":4246213,"ranking":1,"query_text":"why is health communications","passage_text":"WellSpan Health is committed to endeavors that improve the health status of the communities and people we serve. That's why we have a Community Partnership Grant Program that supports health-related community activities through cash contributions.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":7277455,"ranking":2,"query_text":"why is health communications","passage_text":"Why Practice Community Engagement? Advocates of community engagement assert that it improves health promotion and health research. However, the processes, costs, and benefits of community engagement are still a relatively new field of study.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":3685410,"ranking":3,"query_text":"why is health communications","passage_text":"About Midland Health. We believe the health of a community extends far beyond hospital walls. And we are committed to leading our community to be the healthiest in Texas. That's why we've teamed up with area healthcare partners to create Midland Health.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":3328364,"ranking":4,"query_text":"why is health communications","passage_text":"Commitment to community. At St. John Providence, we recognize that every community-and every person-is different. That's why St. John Providence Community Health offers a wide variety of health and wellness programs that meet diverse needs, regardless of economic status and physical condition.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":4028049,"ranking":5,"query_text":"why is health communications","passage_text":"FAMILY FIRST HEALTH, a community health center, understands that not every individual or community shares the same needs. Thatâ\u0080\u0099s why at Family First Health, we have five convenient locations in diverse geographic regions across York and Adams Counties to serve you.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":3328362,"ranking":6,"query_text":"why is health communications","passage_text":"At St. John Providence, we recognize that every community-and every person-is different. That's why St. John Providence Community Health offers a wide variety of health and wellness programs that meet diverse needs, regardless of economic status and physical condition.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":2947137,"ranking":7,"query_text":"why is health communications","passage_text":"This issue brief describes why plain language is a promising strategy for clearly communicating health information and improving health literacy. The brief shows how plain language helps adults understand health information by.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":6339698,"ranking":8,"query_text":"why is health communications","passage_text":"Why health communication is important in public health. Rajiv N Rimal a & Maria K Lapinski b. a. Department of Health, Behavior and Society, Johns Hopkins University, Baltimore, MD, United States of America (USA).","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":6209497,"ranking":9,"query_text":"why is health communications","passage_text":"Estuaries, in short, are national treasures -- vital ecological and community resources whose health affects our health and the vibrancy of our communities and economy. 1. Summarize the characteristics that distinguish an estuary from other bodies of water.. List a few reasons why estuaries are important and why we should know how they work. Other web sites with helpful information about estuaries include: 1  Restore America's Estuaries.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":6980160,"ranking":10,"query_text":"why is health communications","passage_text":"Why We Say Health & Medicine Instead of Just Medicine. The AIHM community believes that integrative health care is inherently interprofessional. Medicine is but a section of the total picture of health care, highlighting the diagnosis, treatment, and prevention of disease.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":6339699,"ranking":11,"query_text":"why is health communications","passage_text":"Why health communication is important in public health Rajiv N Rimal a & Maria K Lapinski b. a. Department of Health, Behavior and Society, Johns Hopkins University, Baltimore, MD, United States of America (USA). b. Department of Communication, Michigan State University, East Lansing, MI, USA . Correspondence to Rajiv N Rimal (e-mail: rrimal@jhsph.edu).","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":3717904,"ranking":12,"query_text":"why is health communications","passage_text":"The chronic problem of communication: Why it's a patient safety issue, and how hospitals can address it. Effective communication at hospitals and health systems contributes to the development and sustainability of a culture of safety. Yet, miscommunication remains a consistent and pervasive problem.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":3531132,"ranking":13,"query_text":"why is health communications","passage_text":"We are looking for talented people who are dedicated to fulfilling our Mission to improve the health and lives of the communities we serve. Find out why Mercy Health â\u0080\u0094 Youngstown Heart and Vascular Institute is at the forefront of heart care.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":3066511,"ranking":14,"query_text":"why is health communications","passage_text":"Health Insurance Companies. At Heart and Health Medical, we understand that health insurance coverage is an important part of choosing a doctor. As part of our commitment to our community's health, we want to make quality healthcare as accessible and affordable as possible. That's why we accept most major insurance plans.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":5907054,"ranking":15,"query_text":"why is health communications","passage_text":"WellStar West Georgia Medical Center is connected with our community for one very good reason... your health. See why we are so healthy together.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":2333804,"ranking":16,"query_text":"why is health communications","passage_text":"1 Help educate other AGA members within your community and practice on how health-care reform will affect gastroenterology and why it is important to become involved in the political process.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":879849,"ranking":17,"query_text":"why is health communications","passage_text":"Isagenix products are revolutionizing the health & wellness industry. With products that are backed by clinical scientific research & delicious flavours, it's easy to see why our amazing community is growing by thousands daily.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":3066509,"ranking":18,"query_text":"why is health communications","passage_text":"Health Insurance Companies At Heart and Health Medical, we understand that health insurance coverage is an important part of choosing a doctor. As part of our commitment to our community's health, we want to make quality healthcare as accessible and affordable as possible. That's why we accept most major insurance plans. Take a look at the complete list below.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":2846432,"ranking":19,"query_text":"why is health communications","passage_text":"GMOs are bad for your body, bad for the community, bad for farmers and bad for the environment. This is why: 1  The health consequences of eating genetically modified organisms are largely unknown. 2  Genetically engineered foods have not been shown to be safe to eat and may have unpredictable consequences.MOs are bad for your body, bad for the community, bad for farmers and bad for the environment. This is why: 1  The health consequences of eating genetically modified organisms are largely unknown. 2  Genetically engineered foods have not been shown to be safe to eat and may have unpredictable consequences.","bm25_label":"medium","relevance_label":0.0},{"query_id":1070412,"passage_id":7299819,"ranking":20,"query_text":"why is health communications","passage_text":"Why Earn Your ACSM Exercise is MedicineÂ® Credential? ACSM Exercise is MedicineÂ® Credentials are held by certified or degreed exercise professionals who work closely with the health care community to promote collaboration between health care providers and exercise professionals.","bm25_label":"medium","relevance_label":0.0}]