[{"query_id":1071270,"passage_id":2520192,"ranking":1,"query_text":"why is metric system also called decimal systems of units","passage_text":"What are the standard units of length, mass, volume, and temperature in the metric (SI) system? Meter, gram, liter, degrees Celsius\/ Kelvins, second 2. Why is the metric system called a decimal system of measurement? The metric system is a decimal system in which measurements of each type are related by factors of 10.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":7858592,"ranking":2,"query_text":"why is metric system also called decimal systems of units","passage_text":"Why is the metric system called a decimal system of measurement? The metric system is called a decimal system because measurements of each type are related by factors of 10 What is the purpose of using prefixes in the metric system? Prefixes are used in the metric system to indicate smaller or larger measurements","bm25_label":"high","relevance_label":1.0},{"query_id":1071270,"passage_id":2896465,"ranking":3,"query_text":"why is metric system also called decimal systems of units","passage_text":"The metric system is a called a decimal-based system because it is based on multiples of ten. Any measurement given in one metric unit (e.g., kilogram) can be converted to another metric unit (e.g., gram) simply by moving the decimal place.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":7858597,"ranking":4,"query_text":"why is metric system also called decimal systems of units","passage_text":"To measure something is to calculate how large it is, or how much of it there is, by comparing it with a fixed unit or with an object of a fixed size. The Decimal System The decimal system is the most widely used system of calculation and measurement. Decimus is Latin for tenth, and the decimal system is based on the number ten. The Metric System Metric is a French word related to the French word for measure. The metric system is a decimal measuring system that was made law in France during the French Revolution (adopted 1795) and is now used throughout the world. The metric system uses the metre (a unit of length) as its basic unit.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":7858594,"ranking":5,"query_text":"why is metric system also called decimal systems of units","passage_text":"Decimus is Latin for tenth, and the decimal system is based on the number ten. The Metric System. Metric is a French word related to the French word for measure. The metric system is a decimal measuring system that was made law in France during the French Revolution (adopted 1795) and is now used throughout the world. The metric system uses the metre (a unit of length) as its basic unit. The litre is its basic unit of capacity, and the gram its basic unit of weight or mass.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":5348186,"ranking":6,"query_text":"why is metric system also called decimal systems of units","passage_text":"It is worth noticing that the metric system also contains a base unit for angles called gon or grad based on decimal fractions where a right angle is divided in 100 gons, each gon containing 100 minutes, each decimal minute containing 100 seconds.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":2041429,"ranking":7,"query_text":"why is metric system also called decimal systems of units","passage_text":"Metric System - SI is a specific metric system, which is a decimal system of measurement. Examples of two common forms of the metric system are the MKS system (meter, kilogram, second as base units) and CGS system (centimeter, gram, and second as base units).","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":5329911,"ranking":8,"query_text":"why is metric system also called decimal systems of units","passage_text":"It is the most commonly used metric system. Metric System - SI is a specific metric system, which is a decimal system of measurement. Examples of two common forms of the metric system are the MKS system (meter, kilogram, second as base units) and CGS system (centimeter, gram, and second as base units).","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":8293892,"ranking":9,"query_text":"why is metric system also called decimal systems of units","passage_text":"The centimetre is a unit of length in the metric system, equal to one-hundredth of a metre. 1cm is equivalent to 0.39370 inches. Origin: The metric, or decimal, system of weights and measures was defined and adopted in France in 1795.he centimetre is a unit of length in the metric system, equal to one-hundredth of a metre. 1cm is equivalent to 0.39370 inches. Origin: The metric, or decimal, system of weights and measures was defined and adopted in France in 1795.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":8023619,"ranking":10,"query_text":"why is metric system also called decimal systems of units","passage_text":"The metric system is the preferred system of scientific units for several reasons: 1  The majority of countries in the world employ the metric system of measurement. 2  The prefixes attached to metric units carry the same meaning for all base units. The metric system is based upon powers of ten, which is convenient because: A measurement in the metric system that is represented by a rational number remains a rational number after metric unit conversion. (For example, 250 mm = 25 cm = .25 m). In contrast irrational unit systems , such as the English system, do not have the same property (For example, 250 inches = 20.8333... ft = 0.0039457... mile) Because metric units are decimal-based, they are easily converted by moving the decimal point.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":2535103,"ranking":11,"query_text":"why is metric system also called decimal systems of units","passage_text":"Metric System: The metric system is an internationally agreed decimal system of measurement created in France in 1799. The International System of Units (SI), the official system of measurement in almost every country in the world, is based upon the metric system.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":5367087,"ranking":12,"query_text":"why is metric system also called decimal systems of units","passage_text":"Metric System: The metric system is an internationally agreed decimal system of measurement created in France in 1799. The International System of Units (SI), the official system of measurement in almost every country in the world, is based upon the metric system. In the metric system, each basic type of measurement (length, weight, capacity) has one basic unit of measure (meter, gram, liter). Conversions are quickly made by multiplying or dividing by factors of 10. It is as simple as moving the decimal point to the right (for smaller prefixes) or to the left (for larger prefixes).","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":2872713,"ranking":13,"query_text":"why is metric system also called decimal systems of units","passage_text":"2. metric-a decimal unit of measurement of the metric system (based on meters and kilograms and seconds); convert all the measurements to metric units; it is easier to work in metric. metric unit.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":6671814,"ranking":14,"query_text":"why is metric system also called decimal systems of units","passage_text":"metric system. A decimal system of weights and measures based on the meter as a unit of length, the kilogram as a unit of mass, and the liter as a unit of volume.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":1299037,"ranking":15,"query_text":"why is metric system also called decimal systems of units","passage_text":"Metric System: The metric system is an internationally agreed decimal system of measurement created in France in 1799. The International System of Units (SI), the official system of measurement in almost every country in the world, is based upon the metric system. In the metric system, each basic type of measurement (length, weight, capacity) has one basic unit of measure (meter, gram, liter).","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":1940433,"ranking":16,"query_text":"why is metric system also called decimal systems of units","passage_text":"The metric system is an internationally agreed decimal system of measurement created in France in 1799. The International System of Units (SI), the official system of measurement in almost every country in the world, is based upon the metric system. In the metric system, each basic type of measurement (length, weight, capacity) has one basic unit of measure (meter, gram, liter). Conversions are quickly made by multiplying or dividing by factors of 10. It is as simple as moving the decimal point to the right (for smaller prefixes) or to the left (for larger prefixes).","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":8669785,"ranking":17,"query_text":"why is metric system also called decimal systems of units","passage_text":"The is a decimal system of measurement. The metric. system has units for length, mass, and capacity. Length The is the basic unit of length in the metric system. Three other metric units of length are the , , and . You can use the following benchmarks to estimate length. 1 millimeter 1 centimeter 1 meter.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":5346867,"ranking":18,"query_text":"why is metric system also called decimal systems of units","passage_text":"n a decimal unit of measurement of the metric system (based on meters and kilograms and seconds) a capacity unit defined in metric terms. a linear unit of distance in metric terms. a decimal unit of weight based on the gram. a metric measure of volume or capacity equal to a cube 1 millimeter on each edge.","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":1711838,"ranking":19,"query_text":"why is metric system also called decimal systems of units","passage_text":"The metric system is an international system of measurement that is based on powers of 10. To express a certain metric unit as a larger or smaller metric unit all that is required is to move the decimal point a proper number of places to the left or right. Metric Units of Linear Measure. 1 millimeter (mm)","bm25_label":"high","relevance_label":0.0},{"query_id":1071270,"passage_id":1867179,"ranking":20,"query_text":"why is metric system also called decimal systems of units","passage_text":"International System, International System of Units, SI system, SI unit, Systeme International, Systeme International d'Unites. metric system - a decimal system of weights and measures based on the meter and the kilogram and the second.","bm25_label":"high","relevance_label":0.0}]