[{"query_id":1072603,"passage_id":7156381,"ranking":1,"query_text":"what is a great dane and mastiff","passage_text":"What is it like to have a great dane\/bull mastiff mix? What are some great pictures of Great Dane and Pitbulls? Are the dogs we call Bhote Kukur in Nepal Tibetan mastiffs or in anyway mix of Tibetan Mastiff?","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":7156384,"ranking":2,"query_text":"what is a great dane and mastiff","passage_text":"Great danes and English Mastiffs. This is a discussion on Great danes and English Mastiffs within the Dog Breeds forums, part of the Other Dogforum Interests category; I am down to choosing either a great dane or english mastiff (well 95% sure), and I know they are very similar but what are ... ccllud.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":90007,"ranking":3,"query_text":"what is a great dane and mastiff","passage_text":"giant breed growth --------------------------------------... great dane\/mastiff health cost of raising a great dane or mastiff puppy These are our estimated costs (based on our experiences) associated with raising a great dane or mastiff puppy for the first year.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":7156379,"ranking":4,"query_text":"what is a great dane and mastiff","passage_text":"What are the pros and cons of owning a mastiff x great dane from a puppy? Do they drool excessively?","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":7156377,"ranking":5,"query_text":"what is a great dane and mastiff","passage_text":"Daniff dogs are Offspringâ\u0080\u0099s of Great Danes and other Mastiff dogs. Did you know that the Great Dane is considered a giant breed dog? Most Daniffâ\u0080\u0099s look similar to the Great Dane used for breeding but a little thicker depending on the Mastiff. You can often tell a Daniff apart quite easily as they look like a thicker Great Dane. The Great Dane is not a healthy breed and they have short lifespans, an average Great Dane can only live under 10 years of age. The Daniff however is a healthier line with a lifespan up to 12 years or more. The Daniff is a gentle giant despite of their looks, they are very friendly to people in general.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":137694,"ranking":6,"query_text":"what is a great dane and mastiff","passage_text":"Great Dane. Great Danes are tall, giant mastiff dogs which were originated from Germany. Many people consider that the Great Dane is the tallest dog breed in the world, and worldâ\u0080\u0099s tallest dog â\u0080\u009cGibsonâ\u0080\u009d was also from the Great Dane breed. But the average height of Great Dane, dogs is slightly less than the Irish Wolfhounds.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":1418201,"ranking":7,"query_text":"what is a great dane and mastiff","passage_text":"It depends on what one means by BIGGEST, but typically the heaviest dogs are mastiffs and the tallest are Great Danes or Irish Wolfhounds.p.s lol not it is a chuwawa. 1  In 1991 The Guinness Book of records recognised an English Mastiff who was owned by a man called Chris Euclades from Muswel Hill.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":4704355,"ranking":8,"query_text":"what is a great dane and mastiff","passage_text":"Great Dane (Deutsche Dogge) (German Mastiff). Junior the brindle Great Dane at 8 months old. Find a Great Dane Breeder Place an Ad Rescue a Great Dane List Your Rescue Pronunciation-Description The Great Dane is a giant, powerful dog. Square in body, but females may be slightly longer than tall. The long head is rectangular in shape.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":6533321,"ranking":9,"query_text":"what is a great dane and mastiff","passage_text":"Great Dane (Deutsche Dogge) (German Mastiff). Junior the brindle Great Dane at 8 months old. Find a Great Dane Breeder Place an Ad Rescue a Great Dane List Your Rescue Pronunciation-Description The Great Dane is a giant, powerful dog. Square in body, but females may be slightly longer than tall. The long head is rectangular in shape. The muzzle is deep, with a pronounced stop.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":6972427,"ranking":10,"query_text":"what is a great dane and mastiff","passage_text":"The German name of the breed is Deutsche Dogge, or German mastiff. The Great Dane is one of the world's tallest dog breeds. The world record holder for tallest dog was a Great Dane called Zeus (died September 2014; aged 5), who measured 112 cm (44 in) from paw to shoulder.Great Danes are known for seeking physical affection from their owners.he German name of the breed is Deutsche Dogge, or German mastiff. The Great Dane is one of the world's tallest dog breeds. The world record holder for tallest dog was a Great Dane called Zeus (died September 2014; aged 5), who measured 112 cm (44 in) from paw to shoulder.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":3259270,"ranking":11,"query_text":"what is a great dane and mastiff","passage_text":"The Great Dane is largest dog breed that originally German breed dog and some called it German Mastiff or Deutsche Dogge. Great Dane enjoys socialization with human and kids, Great Dane is usually found with spots (harlequin), while most are solid colored (fawn, black, blue, brindle) or mostly solid (Mantle).","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":4131409,"ranking":12,"query_text":"what is a great dane and mastiff","passage_text":"Mastiff means a large molosser dog. The term the Mastiff group or the Mastiff has been used synonymously with the term molosser. For example, the bulldog breeds, the Great Dane, the mountain dogs, the pit bulls and even smaller dogs such as the Boston terrier, may be considered Mastiff in this broad sense. 1 List of Mastiff breeds.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":7156376,"ranking":13,"query_text":"what is a great dane and mastiff","passage_text":"The Great Dane is often called the German Mastiff and even thought they are called a Dane, the breed was actually developed in Germany. The Great Dane is often used as companion dog, cart dog, packing dog and a watchdog. The head of the Great Dane is very noble in appearance and is carried very high on the neck and shoulders. The head is broad and well developed with a pronounced stop and a large, rectangular shaped muzzle.","bm25_label":"high","relevance_label":1.0},{"query_id":1072603,"passage_id":5831413,"ranking":14,"query_text":"what is a great dane and mastiff","passage_text":"Possibly created by blending the Irish Wolfhound and the Mastiff, the Great Dane was originally used to hunt boar and guard estates, but these days, heâ\u0080\u0099s a family dog. Male Great Danes stand at least 30 inches tall and weigh a minimum of 120 pounds.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":4322637,"ranking":15,"query_text":"what is a great dane and mastiff","passage_text":"The Tibetan Mastiff impresses with his size, which is accentuated by his broad head and thick coat and mane. He is a family and property guardian who is aloof toward and watchful of strangers. Tibetan Mastiff males are 26 to 29 inches tall and usually weigh 100 to 140 pounds.ossibly created by blending the Irish Wolfhound and the Mastiff, the Great Dane was originally used to hunt boar and guard estates, but these days, heâ\u0080\u0099s a family dog. Male Great Danes stand at least 30 inches tall and weigh a minimum of 120 pounds.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":6533317,"ranking":16,"query_text":"what is a great dane and mastiff","passage_text":"The German name of the breed is Deutsche Dogge, or German mastiff. The Great Dane is one of the world's tallest dog breeds. The world record holder for tallest dog was a Great Dane called Zeus (died September 2014; aged 5), who measured 112 cm (44 in) from paw to shoulder. Great Danes are known for seeking physical affection from their owners.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":4322636,"ranking":17,"query_text":"what is a great dane and mastiff","passage_text":"Itâ\u0080\u0099s certainly an appropriate description for a dog with a minimum height of 30 inches at the shoulder for males and 27.5 inches for females. Mastiffs have a weight range of 120 to 200 pounds or more.ossibly created by blending the Irish Wolfhound and the Mastiff, the Great Dane was originally used to hunt boar and guard estates, but these days, heâ\u0080\u0099s a family dog. Male Great Danes stand at least 30 inches tall and weigh a minimum of 120 pounds.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":7721850,"ranking":18,"query_text":"what is a great dane and mastiff","passage_text":"Great Danes are well-known for being the worldâ\u0080\u0099s biggest dog breed, or at least the tallest. The current record holder as worldâ\u0080\u0099s largest dog by height is Zeus, a black Great Dane that is 44 inches tall at the shoulder. Modern Great Danes are descended from lightweight ancestors in Denmark crossed with English Mastiffs in the 16th century to make them sturdier hunting dogs.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":4536874,"ranking":19,"query_text":"what is a great dane and mastiff","passage_text":"Though the Great Dane is typically considered the largest of all dog breeds, we're going to look at a few other breeds that give this one a run for its money, including one breed that is actually even taller.For a better understanding of their height, this Great Dane poses with a small dog standing under her.Photo:Stanimir G.Stoev\/Shutterstock). Mastiff breeds are certainly among the largest dogs in terms of sheer mass. The Neapolitan mastiff originated in southern Italy. Used as a guard dog, the average male mastiff stands between 26-31 inches tall and weighs a hefty 130-155 pounds.","bm25_label":"high","relevance_label":0.0},{"query_id":1072603,"passage_id":4007831,"ranking":20,"query_text":"what is a great dane and mastiff","passage_text":"Growing to a height of 30 inches, these dogs can weigh as much as 250 pounds. As a Great Dane holds the record for tallest dog, an English mastiff holds the record for heaviest. The biggest weight for a dog ever recorded was an English mastiff named Aicama Zorba, who weighed in at 343 pounds.his breed is the tallest of all dogs, even the Great Dane. According to breed standards, the minimum height should be 32 inches for males and 30 inches for females. That's just the minimum.","bm25_label":"high","relevance_label":0.0}]