[{"query_id":1074997,"passage_id":7154420,"ranking":1,"query_text":"cinnamon honey and lemon benefits","passage_text":"Lemon and cinnamon has individual benefits. The combination of lime and cinnamon gives relief to ailments ranging from clearing acne to immunity disorders. Mix 2 tsp of cinnamon powder, a tsp of honey and a little lime juice in a cup of water. Drinking this before breakfast combats arthritis and joint pains. Vitamin C in lemon helps strengthen the immune system and reduces infections while cinnamon kills bacteria.","bm25_label":"high","relevance_label":1.0},{"query_id":1074997,"passage_id":5382884,"ranking":2,"query_text":"cinnamon honey and lemon benefits","passage_text":"Weight Loss: Though honey has more calories than sugar, when honey is consumed with warm water, it helps in digesting the fat stored in your body. Similarly, honey and lemon juice as well as honey and cinnamon help in reducing weight. Read more about the benefits of honey in weight loss.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":7331213,"ranking":3,"query_text":"cinnamon honey and lemon benefits","passage_text":"Have any doubts about honey-lemon water, click here. Start your day with Surya Namaskar. Watch this video to know how. You may also like to read: 1  11 surprising health benefits of warm water. 2  How honey, cinnamon and lemon in water can help you lose weight.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":7051671,"ranking":4,"query_text":"cinnamon honey and lemon benefits","passage_text":"Tags: benefits of cinnamon, blood sugar, cinnamon, cinnamon and honey, cinnamon benefits, cinnamon club, cinnamon for health, cinnamon health, cinnamon health benefits, cinnamon spice, cinnamon sticks, health benefits, health benefits of cinnamon, honey and cinnamon, natural migraine remedies, spices.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":363249,"ranking":5,"query_text":"cinnamon honey and lemon benefits","passage_text":"Ceylon Cinnamon Versus Cassia Cinnamon. Eat only the real Ceylon cinnamon, someone warned in a discussion about honey and cinnamon benefits in Benefits of Honey Facebook Page. This was when I had my epiphany about cinnamon.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":7107701,"ranking":6,"query_text":"cinnamon honey and lemon benefits","passage_text":"Health Benefits of Honey and Cinnamon. The health benefits of honey and cinnamon include the following: Immune System: Honey and cinnamon paste is good for boosting the immune system, eliminating chronic fatigue and increasing the life span of people. It can also be used for treating colds and influenza.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":6061259,"ranking":7,"query_text":"cinnamon honey and lemon benefits","passage_text":"Weight Loss: Though honey has more calories than sugar, when honey is consumed with warm water, it helps in digesting the fat stored in your body. Similarly, honey and lemon juice as well as honey and cinnamon help in reducing weight. Read more about the benefits of honey in weight loss.Energy Source: According to the USDA, honey contains about 64 calories per tablespoon. Therefore, honey is used by many people as a source of energy. On the other hand, one tablespoon of sugar will give you about 15 calories.ne can eat honey directly, put it on bread like a jam, mix it with juice or any drink instead of sugar, or mix it with warm water, lime juice, cinnamon and other herbs to make a medicine. It is savored by all due to its taste as well as health benefits, making it extremely useful and versatile.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":8096229,"ranking":8,"query_text":"cinnamon honey and lemon benefits","passage_text":"Minerals such as calcium, iron, sodium, potassium, magnesium, phosphorus and zinc are found in honey and cinnamon. In terms of vitamins, they contain vitamin C, vitamin B6, folate, niacin, and riboflavin. Cinnamon also contains vitamin A, E, D, and K. Health Benefits of Honey & Cinnamon. The health benefits of the honey and cinnamon combination include the following: Boosts Immunity","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":5629914,"ranking":9,"query_text":"cinnamon honey and lemon benefits","passage_text":"How to Drink Honey & Cinnamon. Honey has been used for thousands of years as a health tonic and is still used to treat coughs, prevent allergies and improve your sleep, reports DoctorOz.com. Add cinnamon to honey and health benefits double. Put honey and cinnamon together in a warm tea, and you have a drink that delivers several health benefits.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":3997223,"ranking":10,"query_text":"cinnamon honey and lemon benefits","passage_text":"Honey and Cinnamon Drink Possible Side Effects; Benefits of Honey for Fat Loss; The Scarsdale diet â\u0080\u0093 all you need to know; Cinnamon â\u0080\u0093 a miracle in a half teaspoon; Honey and Cinnamon Drink Weight Loss Stories; 1 Week Detox Diet Plan; Honey and Cinnamon for Lowering Cholesterol","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":7154421,"ranking":11,"query_text":"cinnamon honey and lemon benefits","passage_text":"I have been taking a honey-cinnamon-lemon juice tea for a year now. Since then, have not gotten sick! Iâ\u0080\u0099ve discovered a mixture of 1.5 tsp of honey + 2 tsp of cinnamon powder + 3 drops of lemon juice mixed in hot water and left to cool at just over room temperature turns the mixture into a glob at the bottom of the mug.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":8047636,"ranking":12,"query_text":"cinnamon honey and lemon benefits","passage_text":"But taking cinnamon as a regimen in teaspoons may not be safe for young children. Honey itself is safe for children above 18 months, but there are differing opinions on how safe cinnamon (especially Cassia Cinnamon) is for children. Thus we would err on the side of caution and recommend this honey cinnamon recipe only for adults. Read More... 1. To read more about the benefits of the cinnamon and honey combination in Cinnamon and Honey Remedy. 2. Find out how the concoction has effectively worked for others in Postings on Honey and Cinnamon Cure.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":6570028,"ranking":13,"query_text":"cinnamon honey and lemon benefits","passage_text":"Benefits of a Tablespoon of Cinnamon and Honey Everyday. Cinnamon and honey are two nutritious foods that boast numerous health properties and delicious flavor. If you combine them, you will increase their benefits and make it easier to consume them everyday.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":7154415,"ranking":14,"query_text":"cinnamon honey and lemon benefits","passage_text":"You can substitute white sugar with honey to sweeten foods and beverages, including tea and coffee. 1  Consider drinking a lukewarm glass of water stirred in with a teaspoon of honey after meals (especially with green tea), rather than eating a tasty treat. This can help with digestion and promote weight loss. Honey can be taken with lemon and cinnamon as well to further promote weight loss. Although honey contains a number of health benefits, itâ\u0080\u0099s important to choose organic, unprocessed honey wherever possible for optimal results.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":6570030,"ranking":15,"query_text":"cinnamon honey and lemon benefits","passage_text":"Honey and Cinnamon Benefits and Natural Cures. Could the honey and cinnamon cure work for you? Cinnamon has been used by Chinese and Ayurvedic folk medicine for over 2,000 years and honey also has a rich history dating back to ancient Greek, Roman, Vedic, and Egyptian texts.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":1822594,"ranking":16,"query_text":"cinnamon honey and lemon benefits","passage_text":"In baklava, layers of crisp phyllo dough alternate with a sugary spiced nut mixture, and the whole thing is then soaked in fragrant sweet syrup made with honey, lemon and cinnamon. Itâ\u0080\u0099s an exotic and decadent treat to be sure.n baklava, layers of crisp phyllo dough alternate with a sugary spiced nut mixture, and the whole thing is then soaked in fragrant sweet syrup made with honey, lemon and cinnamon. Itâ\u0080\u0099s an exotic and decadent treat to be sure.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":7985316,"ranking":17,"query_text":"cinnamon honey and lemon benefits","passage_text":"1 Steap tea and cinnamon stick in hot water for 5-10 minutes. 2  Stir in honey, lemon juice, and cayenne.  Drink immediately.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":1054864,"ranking":18,"query_text":"cinnamon honey and lemon benefits","passage_text":"Combining honey and lemon may not detox your body, but there are some benefits to this tart and sweet combination. The combination of lemon and honey in water is a rich source of antioxidants, may help boost energy and makes a soothing drink. Consult your doctor about the benefits of drinking a lemon and honey mixture.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":6621481,"ranking":19,"query_text":"cinnamon honey and lemon benefits","passage_text":"Adding honey to your beverages will keep your energy levels up during the day. How to prepare honey with warm water: Add one spoon of honey in a cup of warm (not hot) water and mix. You can also add some lemon juice and cinnamon powder to enhance the taste.This drink should be taken on an empty stomach for best results.dding honey to your beverages will keep your energy levels up during the day. How to prepare honey with warm water: Add one spoon of honey in a cup of warm (not hot) water and mix. You can also add some lemon juice and cinnamon powder to enhance the taste.This drink should be taken on an empty stomach for best results.","bm25_label":"high","relevance_label":0.0},{"query_id":1074997,"passage_id":8755854,"ranking":20,"query_text":"cinnamon honey and lemon benefits","passage_text":"Many benefits: Both cinnamon and honey have many proven significant health benefits. Cinnamon is esp. Good at controlling blood sugar & has many other benefits- a good summary of research is at http:\/\/cinnamonvogue.","bm25_label":"high","relevance_label":0.0}]