[{"query_id":1075348,"passage_id":311759,"ranking":1,"query_text":"what is a composite dental procedure","passage_text":"Common Dental Procedures. Below are explanations of some common dental procedures. Use the links to scroll down the page. Applying composite tooth bonding is a restorative procedure that uses tooth enamel-coloured composite resin (plastic) to repair teeth that are decayed, chipped, fractured or discoloured. Tooth gaps can also be closed. Unlike veneers, which require laboratory work, bonding is done in the dental office. Braces.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":8426495,"ranking":2,"query_text":"what is a composite dental procedure","passage_text":"1 A reasonable cost: Along with teeth whitening, dental bonding is one of the least expensive cosmetic dental procedures. 2  Durability: The composite resin used in the dental bonding procedure is quite durable, and can be expected to last for up to 10 years.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":227656,"ranking":3,"query_text":"what is a composite dental procedure","passage_text":"patients do not have to worry one bit when they choose the cosmetic dental bonding procedure here is what patients can look forward to a strong composite resin material is placed on either the front or the back teeth dr leo will apply a thin coating of composite resin to the front surface of the problem tooth","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":8645697,"ranking":4,"query_text":"what is a composite dental procedure","passage_text":"Six Common Dental Procedures and How Much They Cost. 1  Procedure 1: Teeth Cleaning. 2  Procedure 2: Cavity filling (composite) 3  Procedure 3: Wisdom tooth removal (per tooth) 4  Procedure 4: Braces (traditional) 5  Procedure 5: Root Canal. 6  Procedure 6: Dental crown (porcelain-fused-to-metal)","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":4281234,"ranking":5,"query_text":"what is a composite dental procedure","passage_text":"Many dental insurance plans cover the cost of composite resin fillings, even If they are replacing metal fillings. This may be considered a cosmetic dental procedure because it enhances a personâ\u0080\u0099s smile.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":495571,"ranking":6,"query_text":"what is a composite dental procedure","passage_text":"What should be included: Additional costs: 1  Dental bonding is one of the easiest and least expensive cosmetic dental procedures, and unless the bonding is being used to fill a decayed tooth it can be done without anesthesia. 2  Composite bonds typically last about 7-11 years.ental bonding is a relatively quick and easy procedure, and can be used for a tooth-colored filling in a decayed tooth or as a cosmetic process to improve the look of a discolored or chipped tooth, or to fill gaps between teeth.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":6104369,"ranking":7,"query_text":"what is a composite dental procedure","passage_text":"What should be included: Additional costs: 1  Dental bonding is one of the easiest and least expensive cosmetic dental procedures, and unless the bonding is being used to fill a decayed tooth it can be done without anesthesia. 2  Composite bonds typically last about 7-11 years. When dental bonding is used to install a tooth-colored filling created by a dental laboratory, the bonding process is similar but it usually requires two appointments, a mold of the patient's teeth, anesthetic and a temporary filling.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":8139983,"ranking":8,"query_text":"what is a composite dental procedure","passage_text":"After these two dental procedures, the dentist will sit down with the patient and discuss exactly what type of dental work needs to be done. Fillings. There are a few types of dental work which are very common at the dentist office. The first common work performed is a called a filling. If you have a simple cavity on the surface caused by decay, a dentist will fill the hole with a silver metal or white composite material. The material seals the tooth off and prevents the cavity from growing.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":516392,"ranking":9,"query_text":"what is a composite dental procedure","passage_text":"Composite Bonding is among the easiest and least invasive of all cosmetic dental procedures. Bonding is the application of a tooth colored resin called composite to fix the shape or color of your tooth. Composite bonding can easily repair chips, fractures, decay and discolored teeth.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":8433102,"ranking":10,"query_text":"what is a composite dental procedure","passage_text":"The cost of dental fillings depends on a variety of factors, including: 1  The dentist who performs the procedure. 2  The location where it is performed.  The type of dental insurance you have. As mentioned above, dental insurance typically does not cover the additional costs associated with composite fillings.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":5830272,"ranking":11,"query_text":"what is a composite dental procedure","passage_text":"Dental Bonding Procedure. Very little preparation is necessary for dental bonding and anesthesia is generally not required beforehand. We will use a shade guide to select a composite resin color that most closely matches the color of your existing teeth.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":1731464,"ranking":12,"query_text":"what is a composite dental procedure","passage_text":"Benefits. Bonding is among the easiest and least expensive cosmetic dental procedure. The composite resin used in bonding can be shaped and polished to match the surrounding teeth. Most often, bonding is used for cosmetic purposes to improve the appearance of a discolored or chipped tooth.enefits. Bonding is among the easiest and least expensive cosmetic dental procedure. The composite resin used in bonding can be shaped and polished to match the surrounding teeth. Most often, bonding is used for cosmetic purposes to improve the appearance of a discolored or chipped tooth.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":7153739,"ranking":13,"query_text":"what is a composite dental procedure","passage_text":"What is the procedure for having a tooth bonded? Preparation. Little advance preparation is needed for dental bonding. Anaesthesia is often not necessary unless the bonding is being used to fill a decayed tooth. Your dentist will use a shade guide to select a composite resin colour that will closely match the colour of your tooth. The bonding process.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":4005156,"ranking":14,"query_text":"what is a composite dental procedure","passage_text":"1 Dental bonding is one of the easiest and least expensive cosmetic dental procedures, and unless the bonding is being used to fill a decayed tooth it can be done without anesthesia. 2  Composite bonds typically last about 7-11 years.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":7153741,"ranking":15,"query_text":"what is a composite dental procedure","passage_text":"A dental composite procedure has been used for a variety of reasons like, cosmetic reasons, to fix a tooth structure for a severely decayed tooth, to help bond tooth veneers, closing a dental gap, as well as fillings that correct minor cosmetic imperfections.","bm25_label":"high","relevance_label":1.0},{"query_id":1075348,"passage_id":857915,"ranking":16,"query_text":"what is a composite dental procedure","passage_text":"Composite fillings cost around $100-$200 and cost of $1300 for dental cleaning and 4 ceramic dental filling is fine. Your dentist should have disclosed the price of procedure earlier only. he should have told you that you require dental filling and cleaning and it will cost you this much amount.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":6662791,"ranking":17,"query_text":"what is a composite dental procedure","passage_text":"What Is Teeth Bonding. Teeth bonding is a cosmetic dental treatment that makes use of a tooth-colored composite resin. Your dentist can carefully sculpt this resin into the appropriate shape and size to cover the gap between your front incisors. The procedure itself is a fairly simple practice, and can be done in one visit to your dentist.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":4686375,"ranking":18,"query_text":"what is a composite dental procedure","passage_text":"Some common dental procedures include crowns, root canals, braces, teeth cleaning, wisdom tooth removal and cavity filling. Here are some average costs of these dental procedures with and without insurance, as reported by CostHelper. Procedure 1: Teeth Cleaning. Cost with insurance: Completely covered (up to twice a year) Cost without insurance: $127; Procedure 2: Cavity filling (composite) Cost with insurance: Typically covers 50%-80% of the cost ; Cost without insurance: $204","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":3060123,"ranking":19,"query_text":"what is a composite dental procedure","passage_text":"Dentists place the materials in or on the teeth where needed. Because direct composite bonding involves the precise placement of restorative material by the dentist, the direct composite bonding procedure usually is completed in one dental visit. More complicated or extensive treatments may require additional visits.","bm25_label":"high","relevance_label":0.0},{"query_id":1075348,"passage_id":8426501,"ranking":20,"query_text":"what is a composite dental procedure","passage_text":"Composite bonding is an alternative to more expensive procedures such as porcelain veneers, bridges and crowns. Our innovative approach to bonding has allowed us to provide beautiful, ultra-conservative treatment for decades, that otherwise would require more invasive, more expensive dental procedures.","bm25_label":"high","relevance_label":0.0}]