[{"query_id":1077019,"passage_id":7151920,"ranking":1,"query_text":"what internet security do you get with rcn","passage_text":"All RCN internet packages come with RCN webmail, 5 GB of storage, McAfee internet security products and RCN's Service Protection plan. 24\/7 Technical Support. RCN's technical support team is available 24 hours a day, 7 days per week. 30-Day Money Back Guarantee. RCN's 30-day money back guarantee allows customers to cancel within the first 30 days of service.","bm25_label":"high","relevance_label":1.0},{"query_id":1077019,"passage_id":7151915,"ranking":2,"query_text":"what internet security do you get with rcn","passage_text":"To ensure this we, have implemented 100% U.S. based customer service. For speed and convenience of installation, we offer weekend appointments, next-day and self-installation options. With RCN, you get the best of everything including: RCN digital TV RCN high- speed internet RCN Unlimited Nationwide Phone History. Established in 1993.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":7189712,"ranking":3,"query_text":"what internet security do you get with rcn","passage_text":"rcn RCN offers broadband internet, TV and phone services. RCN serves customers in the Boston, New York, Eastern Pennsylvania, Washington, D.C., and Chicago areas. RCN was originally called Residential Communications Network. RCN has previously acquired Consolidated Edison Communications.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":3480243,"ranking":4,"query_text":"what internet security do you get with rcn","passage_text":"In the late 1990s, Erol's sought to become a publicly traded corporation and began the process toward an IPO. Instead, the Internet portion of the company was sold to RCN. It was rebranded Erols Internet (note the lack of the apostrophe). Slowly, over time, the Erols brand was reduced in favor of the Starpower and later RCN brand, although the domain name still resolves to RCN servers.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":7151918,"ranking":5,"query_text":"what internet security do you get with rcn","passage_text":"RCN offers communications products such as high-speed internet, digital TV and home phone. The company was founded in 1993 and is currently headquartered in Princeton, NJ. RCN brings quality high-speed internet to several of the biggest cities in the U.S. Customers can opt for lower speeds starting at 10Mbps up to speeds of 1000Mbps. There are no data usage caps on RCN.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":7189702,"ranking":6,"query_text":"what internet security do you get with rcn","passage_text":"Looking for online definition of RCN or what RCN stands for? RCN is listed in the World's largest and most authoritative dictionary database of abbreviations and acronyms RCN - What does RCN stand for?","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":4045510,"ranking":7,"query_text":"what internet security do you get with rcn","passage_text":"Find 858 listings related to Rcn Lehigh Valley in Lehigh Valley on YP.com. See reviews, photos, directions, phone numbers and more for Rcn Lehigh Valley locations in Lehigh Valley, PA. Start your search by typing in the business name below. What do you want to find?","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":1125770,"ranking":8,"query_text":"what internet security do you get with rcn","passage_text":"Rcn Customer Service Phone Number. Phone Number of Rcn is Residential customers: 800-746-4726, Business: 877-726-7000 . RCN or Residential Communications Network offers the triple play services including cable TV, telephone and Internet access.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":1125777,"ranking":9,"query_text":"what internet security do you get with rcn","passage_text":"Rcn Customer Service Phone Number Phone Number of Rcn is Residential customers: 800-746-4726, Business: 877-726-7000. RCN or Residential Communications Network offers the triple play services including cable TV, telephone and Internet access.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":7189701,"ranking":10,"query_text":"what internet security do you get with rcn","passage_text":"About RCN Business Services. RCN Business Services, offers a full suite of communications products and services to businesses of all sizes, including Internet, voice, video and network solutions. Read more","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":7189703,"ranking":11,"query_text":"what internet security do you get with rcn","passage_text":"About RCN Business Services RCN Business Services, offers a full suite of communications products and services to businesses of all sizes, including Internet, voice, video and network solutions. Read more","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":4045513,"ranking":12,"query_text":"what internet security do you get with rcn","passage_text":"RCN Lehigh Valley Customer Service Phone Number Phone Number of RCN Lehigh Valley is 800-746-4726 \/ 877-726-7000 \/. RCN is short form of Residential Communications Network came into existence to provides reliable Internet, Digital and phone services in Lehigh Valley area of Pennsylvania state.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":1125773,"ranking":13,"query_text":"what internet security do you get with rcn","passage_text":"Phone Number of Rcn is Residential customers:  800-746-4726, Business: 877-726-7000 . RCN or Residential Communications Network offers the triple play services including cable TV, telephone and Internet access.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":7189711,"ranking":14,"query_text":"what internet security do you get with rcn","passage_text":"RCN is a cable Internet provider offering affordable service to a handful of major cities in the Midwest and Northeast.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":4045506,"ranking":15,"query_text":"what internet security do you get with rcn","passage_text":"Phone Number: 800-746-4726, 877-726-7000Website: www.rcn.com Contact Rcn Lehigh Valley Rcn Lehigh Valley address is RCN Lehigh Valley, 2124 Avenue C, Bethlehem, Pennsylvania 18017 United States. You can reach via mobile or landline through contact number 800-746-4726, 877-726-7000. You can also reach there webite www.rcn.com and can get required information regarding to . If you as a customer of the Rcn Lehigh Valley have any query, complaint, suggestion, feedback and reviews related to Rcn Lehigh Valley products and services then you can communicate through its customer service detail.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":2703063,"ranking":16,"query_text":"what internet security do you get with rcn","passage_text":"Best Modem, Router and Gateway for 2017. Out of popular internet providers, Verizon Fios is the best (speed and most reliable), then cable internet such as Comcast or Time Warner or RCN (fast if you pay for 15mbps+ but some rare connectivity issues). Verizon DSL is too slow.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":3425415,"ranking":17,"query_text":"what internet security do you get with rcn","passage_text":"You can try to put the Internet explorer browser settings to its default. How to optimize Internet Explorer. http:\/\/support.microsoft.com\/kb\/936213. This error may occur if there is a problem with the security certificate of a specific website. You can try to install the security certificate. 1.In Windows Internet Explorer 7, click Continue to this website (not recommended).2. A red Address Bar and a certificate warning appear.2..g https:\/\/mymahcinename.mydomain.com:serverPort:\/MyApplicationContext\/Myresource.html) I am getting the following certificate issue. Error Obatined: There is a problem with this website's security certificate. Please let me know what should i do to solve this issue. Thanks in Advance.","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":8265609,"ranking":18,"query_text":"what internet security do you get with rcn","passage_text":"You may need a security clearance to hold different jobs in the military and with civilian contractors. What do they investigate and how far back do they go to decide if you get one? What can keep you from getting a security clearance? For how long is a security clearance valid? What Is a Security Clearance?","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":2703064,"ranking":19,"query_text":"what internet security do you get with rcn","passage_text":"Best Modem, Router and Gateway for 2017. January 2nd, 2017 Filed Under: Electronics Leave a Comment. Out of popular internet providers, Verizon Fios is the best (speed and most reliable), then cable internet such as Comcast or Time Warner or RCN (fast if you pay for 15mbps+ but some rare connectivity issues).","bm25_label":"high","relevance_label":0.0},{"query_id":1077019,"passage_id":1993163,"ranking":20,"query_text":"what internet security do you get with rcn","passage_text":"It has Trend Micro security on it, which is fully updated and has a firewall. When you get the error, you cannot report it to windows. It just appears and you have to restart. I'm asking b\/c I can't find anyting on the internet at all about this error, so I don't know what I can do to fix it.","bm25_label":"high","relevance_label":0.0}]