[{"query_id":1080229,"passage_id":7721015,"ranking":1,"query_text":"would human urine keep deer away","passage_text":"A quick caution is not to do this if small children may be around the garden. Moth balls may look interesting to them and possibly could go into a kidâ\u0080\u0099s mouth. Again, rain will reduce the time this treatment works to keep away deer. Be generous with the amount of moth balls or crystals you put out, too. Some Arkansas gardeners say that urine is a deer deterrent â\u0080\u0094 human urine, dog urine or coyote urine. The latter is available commercially, if you can find it. Close neighbors may not appreciate this in your garden, but modest amounts of urine probably donâ\u0080\u0099t hit on human nostrils nearly as much as on a deerâ\u0080\u0099s.","bm25_label":"high","relevance_label":1.0},{"query_id":1080229,"passage_id":7721014,"ranking":2,"query_text":"would human urine keep deer away","passage_text":"â\u0080\u009cBut itâ\u0080\u0099s unlikely deer associate human urine with humans, unless a human leaves their scent behind along with the urine.â\u0080\u009d. Miller agrees. â\u0080\u009cDeer arenâ\u0080\u0099t genetically programmed to be able to identify human urine.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":7345364,"ranking":3,"query_text":"would human urine keep deer away","passage_text":"That is why the mother feeds and rests several yards away from her fawn. The mother even eats the fawnâ\u0080\u0099s droppings and urine to keep the area free of scents that will attract predators. A mother deer leaves her baby alone in the woods for safety reasons. And for the safety of the baby, you must also stay away.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":7721021,"ranking":4,"query_text":"would human urine keep deer away","passage_text":"It's a simple theory: Spread predator animals' scents to scare away prey animals. In reality, predator urine is only sometimes effective in keeping deer, rabbits and other pests out of the yard. If used properly, it may be an effective part of a garden pest control strategy, but it is not guaranteed to work.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":1839629,"ranking":5,"query_text":"would human urine keep deer away","passage_text":"Deer know what fresh urine smells like and they also know what old urine smells like. Whatever urine you use, try to purchase urine that is fresh as possible. Once purchased, keep it in the freezer for longevity and simply thaw it out as needed.. Deer Urine Strategy. Weâ\u0080\u0099ve all heard the deer urine jokes thrown at the avid hunter. I hear it every year from a friend who doesnâ\u0080\u0099t hunt and is constantly telling me how warped I am for wanting to smell like deer pee.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":7721022,"ranking":6,"query_text":"would human urine keep deer away","passage_text":"Coyote urine has roughly equal power in repelling deer to concentrated Hot Sauce-brand repellent and Deer Away, an organic spray that contains about 5 percent fermented egg solids. Concentrated Hot Sauce-brand repellent was the only product that outperformed urine on elk.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":8163315,"ranking":7,"query_text":"would human urine keep deer away","passage_text":"It is scarecrow sprinkler the humane way to keep deer away. When the ScareCrow detects an animal heat and movement, senses the same security lights detect people in a 1,000 square foot area day and night, it instantly releases a short but startling burst of water.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":4485361,"ranking":8,"query_text":"would human urine keep deer away","passage_text":"According to his website wolf urine can be used to deter cats, feral cats, coyotes and foxes. The Pee Man says that Coyote urine will deter rats, deer, raccoons, groundhogs, gophers and possum. Bobcat urine is good for mice, moles and voles. This is getting bizarre but Iâ\u0080\u0099m just tellin ya what it says! Mountain Lion urine is said to keep deer, wild deer, javelins and armadillo at bay. Okay, Iâ\u0080\u0099m done.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":1002783,"ranking":9,"query_text":"would human urine keep deer away","passage_text":"Deer OffÂ® Works Harder and Faster to Protect Your Yard. Containing the highest concentration of putrescent egg on the market, Deer OffÂ® II works harder than the competition to keep your yard deer-free and beautiful. More egg means a stronger warning signal that will keep away pesky deer, rabbits and squirrels.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":6330846,"ranking":10,"query_text":"would human urine keep deer away","passage_text":"Grow rabbit and deer-resistant plants around the hostas and around the parameter of your garden. These plants act as bodyguards to your hostas and may discourage rabbits and deer. On the West Coast, resistant plants include begonias and impatiens.ncorporate scare tactics to keep rabbits and deer at bay. Pour coyote urine in a 10-foot parameter around the hostas. Reapply the predator urine every two weeks to frighten deer and rabbits. As an alternative or additional scare tactic, install a motion-activated sprinkler system.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":5458296,"ranking":11,"query_text":"would human urine keep deer away","passage_text":"PRODUCT OVERVIEW. Red fox urine is the all natural, organic and humane way to deter most yard and garden pests including deer, rabbits, skunk, ground hogs and small rodents.Long used by gardeners, this proven non kill method utilizes 99% pure red fox urine predator scent to trigger the fight or flight response in small animals of prey.RODUCT OVERVIEW. Red fox urine is the all natural, organic and humane way to deter most yard and garden pests including deer, rabbits, skunk, ground hogs and small rodents.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":5458297,"ranking":12,"query_text":"would human urine keep deer away","passage_text":"Loading... Red fox urine is the all natural, organic and humane way to deter most yard and garden pests including deer, rabbits, skunk, ground hogs and small rodents.Long used by gardeners, this proven non kill method utilizes 99% pure red fox urine predator scent to trigger the fight or flight response in small animals of prey.RODUCT OVERVIEW. Red fox urine is the all natural, organic and humane way to deter most yard and garden pests including deer, rabbits, skunk, ground hogs and small rodents.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":5458298,"ranking":13,"query_text":"would human urine keep deer away","passage_text":"Internet # 205430550. Red fox urine is the all natural, organic and humane way to deter most yard and garden pests including deer, rabbits, skunk, ground hogs and small rodents.Long used by gardeners, this proven non kill method utilizes 99% pure red fox urine predator scent to trigger the fight or flight response in small animals of prey.RODUCT OVERVIEW. Red fox urine is the all natural, organic and humane way to deter most yard and garden pests including deer, rabbits, skunk, ground hogs and small rodents.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":3155097,"ranking":14,"query_text":"would human urine keep deer away","passage_text":"Annuals that repel deer will give your garden an early blooming start. Most of our selection of deer resistant annuals are highly scented and keep the deer away. These deer resistant plants include cottage garden favorites like Cosmos, Cleome, Snapdragons, and Heliotrope.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":1272851,"ranking":15,"query_text":"would human urine keep deer away","passage_text":"There are two main factors involved that deer tend to not like; strong smells and fuzzy foliage. Deer also do not like ornamental grasses. Not only do they not like to eat them, but they don't even like to be around the ornamental grasses. You can plant these in problems areas you have to help keep deer away. Below are a list of plants that deer tend to stay away from.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":6330845,"ranking":16,"query_text":"would human urine keep deer away","passage_text":"Spray deer and rabbit repellent on and around the hosta plants. Repellents have a taste or scent that's disliked by deer and rabbits. Follow the packaging application instructions. Depending on the repellent you use, this may include applying it twice a week and after rainfall.ncorporate scare tactics to keep rabbits and deer at bay. Pour coyote urine in a 10-foot parameter around the hostas. Reapply the predator urine every two weeks to frighten deer and rabbits. As an alternative or additional scare tactic, install a motion-activated sprinkler system.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":4485363,"ranking":17,"query_text":"would human urine keep deer away","passage_text":"There are lots of animals that live in and among humans with no fear of them. Especially the critters you are trying to keep away when camping (mice, porcupines, skunks). They love the salt in urine. Bear love any interesting smells and will investigate human odors looking for food. There are big predators (cougars, polar bears) who have been known to hunt humans.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":1464339,"ranking":18,"query_text":"would human urine keep deer away","passage_text":"Parents are currently drug testing me and I would like to pass with some clean urine I stored away in my bathroom, I can't seem to keep the temperature of the piss warm. I certainly don't want to raise suspicion by giving them a cold sample, any ideas on how to keep it warm for a week or so. Insulatng... show more Parents are currently drug testing me and I would like to pass with some clean urine I stored away in my bathroom, I can't seem to keep the temperature of the piss warm. I certainly don't want to raise suspicion by giving them a cold sample, any ideas on how to keep it warm for a week or so.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":7562417,"ranking":19,"query_text":"would human urine keep deer away","passage_text":"Symptoms are sudden and severe and can include fever, vomiting, change in water intake, change in appetite, and change in amount of urination. To avoid acute kidney disease, keep human medications away from your dog, unless advised otherwise by your vet.","bm25_label":"high","relevance_label":0.0},{"query_id":1080229,"passage_id":6478441,"ranking":20,"query_text":"would human urine keep deer away","passage_text":"Plant marigolds around the perimeter of the pumpkin patch. This is an attractive way to keep deer away from your pumpkins, as deer do not like the scent of marigolds. This method can be used in conjunction with other methods.","bm25_label":"high","relevance_label":0.0}]