[{"query_id":1080948,"passage_id":7155100,"ranking":1,"query_text":"what foods contain histamines?","passage_text":"The following articles contain further information and list many of the foods that either contain histamines or cause a release of histamine: About Allergies: Histamine in Foods. Allergy Dietitian: Foods Containing Amines. International Chronic Urticaria Society: Histamine-Restricted Diet","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":3687940,"ranking":2,"query_text":"what foods contain histamines?","passage_text":"Histamine in Foods. There are many foods that contain histamine or cause the body to release histamine when ingested. These types of reactions are food intolerances, and are different from food allergy in that the immune system is not involved in the reaction.The symptoms, however, can be the same as a food allergy.here are many foods that contain histamine or cause the body to release histamine when ingested. These types of reactions are food intolerances, and are different from food allergy in that the immune system is not involved in the reaction.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":2676675,"ranking":3,"query_text":"what foods contain histamines?","passage_text":"Histamine in Foods. There are many foods that contain histamine or cause the body to release histamine when ingested. These types of reactions are food intolerances, and are different from food allergy in that the immune system is not involved in the reaction.The symptoms, however, can be the same as a food allergy.here are many foods that contain histamine or cause the body to release histamine when ingested. These types of reactions are food intolerances, and are different from food allergy in that the immune system is not involved in the reaction. The symptoms, however, can be the same as a food allergy.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":5429510,"ranking":4,"query_text":"what foods contain histamines?","passage_text":"Histamines and Food. If you want to try an elimination diet, the next thing to learn is what foods youâ\u0080\u0099ll have to cut out. Remember from above that one of the ways to push your internal â\u0080\u009csinkâ\u0080\u009d past the overflow point is by eating too many foods that contain a lot of histamine.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":2426732,"ranking":5,"query_text":"what foods contain histamines?","passage_text":"Is Histamine relevant in food allergy and food intolerance? Amanda Geary, founder of the Food and Mood Project, has been investigating the role of the naturally occurring neurotransmitter, histamine, in food allergy, food intolerance and mood control. Histamine-containing foods can contribute to high histamine levels in the body.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":3496282,"ranking":6,"query_text":"what foods contain histamines?","passage_text":"So, this study looked into the effects of a 4-week low-histamine diet that avoided histamine-containing foods and histamine-releasing foods (see box, bottom) in order to reduce the total load of histamine in the body.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":2390907,"ranking":7,"query_text":"what foods contain histamines?","passage_text":"Histamine in Foods. There are many foods that contain histamine or cause the body to release histamine when ingested. These types of reactions are food intolerances, and are different from food allergy in that the immune. system is not involved in the reaction. The symptoms, however, can be the same as a food allergy.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":4717589,"ranking":8,"query_text":"what foods contain histamines?","passage_text":"Certain foods may also not be high in histamine yet are high in compounds known as histamine liberators which can trigger similar symptoms by increasing histamine levels. The list below contains commonly accepted high histamine foods\/histamine liberators, but this list is by no means exhaustive.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":1748247,"ranking":9,"query_text":"what foods contain histamines?","passage_text":"In addition to the histamine produced inside your body, there are also a variety of foods that naturally contain histamine, cause the release of histamine, or block the enzyme that breaks down histamine, diamine oxidase. Histamine-Rich Foods: 1  Fermented alcoholic beverages, especially wine, champagne and beer. 2  Fermented foods: sauerkraut, vinegar, soy sauce, kefir, yogurt, kombucha, etc. 3  Vinegar-containing foods: pickles, mayonnaise, olives. 4  Cured meats: bacon, salami, pepperoni, luncheon meats and hot dogs.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":7213872,"ranking":10,"query_text":"what foods contain histamines?","passage_text":"Foods which are not high in histamine when fresh will contain high levels of histamine when fermented, such as sauerkraut, yogurt, and kombucha. There is no agreed upon list of foods that are high in histamine, most likely because each individual will react to different amounts of histamine in foods, and food sources and processing methods vary so greatly.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":7148640,"ranking":11,"query_text":"what foods contain histamines?","passage_text":"Histamine-rich Foods\/Substances. Histamine levels will vary based on the maturation process and the degree of freshness. The longer food is stored or left to mature, the greater its histamine content and the more problematic it can be for individuals with food sensitivities and intolerance. Fresh meat contains no or very little histamine. However, when meat is processed further, the maturation process results in the accumulation of biogenic amines. The same is true for fish. Fresh fish contains no or very little histamine. However, fish spoils very easily and this leads to a rapid accumulation of histamine due to bacteria. Further processing, which includes salting, smoke-drying, marinating and preservation, may increase the histamine content.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":8745942,"ranking":12,"query_text":"what foods contain histamines?","passage_text":"This is called histamine intolerance. Foods that are particularly high in histamine and other vasoactive amines include: 1  Champagne, wine, beer, cider and other fermented drinks and spirits. 2  Sauerkraut and other pickled foods. 3  Vinegar and foods containing it such as dressings, pickles, mayonnaise, ketchup, mustard.his is also one of the chemicals that is released in the body as part of an allergic reaction, causing the typical itching, sneezing, wheezing and swelling allergy symptoms. We all have an enzyme (diamine oxidase) which breaks down any histamine that we absorb from a histamine-containing food.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":3496284,"ranking":13,"query_text":"what foods contain histamines?","passage_text":"Histamine-containing foods can contribute to high histamine levels in the body. For histamine-sensitive people, this can be a problem. Recent research suggests that high levels of this essential neurotransmitter are associated with anxiety or panic attacks.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":2060795,"ranking":14,"query_text":"what foods contain histamines?","passage_text":"Histamine in Foods. There are many foods that contain histamine or cause the body to release histamine when ingested. These types of reactions are food intolerances, and are different from food allergy in that the immune system is not involved in the reaction.The symptoms, however, can be the same as a food allergy.oods that may have large amounts of tyramine include: fish, chocolate, alcoholic beverages, cheese, soy sauce, sauerkraut and processed meat. Fermented foods may cause allergy symptoms because they are either rich in histamine or because yeast or mold is involved in the fermentation process.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":3299371,"ranking":15,"query_text":"what foods contain histamines?","passage_text":"Histamine in Foods. There are many foods that contain histamine or cause the body to release histamine when ingested. These types of reactions are food intolerances, and are different from food allergy in that the immune system is not involved in the reaction.The symptoms, however, can be the same as a food allergy.he release of histamine can be caused by almost any allergen. Examples include inhalant allergens (ragweed pollen, dust mite, eat dander), drugs (penicillin, sulfa, aspirin), stinging insect venoms, and foods (egg, wheat, milk, fish, etc).","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":8534731,"ranking":16,"query_text":"what foods contain histamines?","passage_text":"Which foods are the heroes against histamine? Any food containing quercetin or pycnogenol will aid in the reduction of histamine in the body â\u0080\u0093 e.g. some citrus fruits, broccoli, capsicum (especially yellow), berries, onions, garlic, apples.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":3015716,"ranking":17,"query_text":"what foods contain histamines?","passage_text":"Food Allergies and Mucus. Allergies can also cause your body to make more mucus than normal, according to Dr. Anthony Komaroff in an article published on the Monterey Herald website. The main food allergens include eggs, fish, milk, tree nuts, peanuts, shellfish and soybeans.istamine and Mucus. Histamine is released during allergic responses, but it can also come from foods containing histamine or foods that tend to increase histamine production. Increased histamine levels can cause your body to produce more mucus.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":3015718,"ranking":18,"query_text":"what foods contain histamines?","passage_text":"Sometimes, such as when you have a cold or infection, you may have more mucus than normal or thicker mucus than normal, which makes it more noticeable. Typically, foods contribute to mucus mainly if they cause an allergic reaction, increase histamine production or increase acid reflux symptoms.istamine and Mucus. Histamine is released during allergic responses, but it can also come from foods containing histamine or foods that tend to increase histamine production. Increased histamine levels can cause your body to produce more mucus.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":8663926,"ranking":19,"query_text":"what foods contain histamines?","passage_text":"Processed meats like salami, jerky and sausage are high in histamine. Histamine is an indicator of food quality, because meats that are spoiled by microbial contamination can also contain high levels of histamine. All processed meats and leftover cooked meats should be restricted.","bm25_label":"medium","relevance_label":0.0},{"query_id":1080948,"passage_id":7213875,"ranking":20,"query_text":"what foods contain histamines?","passage_text":"If you want to try an elimination diet, the next thing to learn is what foods youâ\u0080\u0099ll have to cut out. 1  Remember from above that one of the ways to push your internal â\u0080\u009csinkâ\u0080\u009d past the overflow point is by eating too many foods that contain a lot of histamine.","bm25_label":"medium","relevance_label":0.0}]