[{"query_id":1081338,"passage_id":7148217,"ranking":1,"query_text":"what flavor is space jam starhunter","passage_text":"Starhunter E-Juice by Space jam begins with classic homemade lemonade. This refreshing and delightful taste is then met with fresh, juicy peaches, resulting in a mouthwatering flavor that will absolutely blow you away.","bm25_label":"high","relevance_label":1.0},{"query_id":1081338,"passage_id":7148223,"ranking":2,"query_text":"what flavor is space jam starhunter","passage_text":"Space Jam flavors focus on creamy, fruity blends, with unusual, unique, yet mouthwatering mixes of flavors.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":3010469,"ranking":3,"query_text":"what flavor is space jam starhunter","passage_text":"Jam, jelly, preserves, confiture. Whether you make your own or buy it, what's your very favorite flavor? It's hard to pick just one, of course, so if you have more favorites, tell us in the comments. What's the best jam you've ever had (and, incidentally, what do you like to eat it on?) We like a good loaf of plain bread, or a crusty baguette, with fresh butter and a spoonful of jam.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":4423002,"ranking":4,"query_text":"what flavor is space jam starhunter","passage_text":"Seedless Black Raspberry-Blackberry Jam. The tart flavor of black raspberries pairs with the lush flavors of blackberries to create a berry loverâ\u0080\u0099s dream jam. Smuckerâ\u0080\u0099s Â® Seedless Black-Raspberry-Blackberry Jam lets the fruit stand out, but without the seeds.Itâ\u0080\u0099s perfect for salad dressings, and pairs well with goat cheeses.NUTRITION INFO INGREDIENTS.he tart flavor of black raspberries pairs with the lush flavors of blackberries to create a berry loverâ\u0080\u0099s dream jam.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":5374915,"ranking":5,"query_text":"what flavor is space jam starhunter","passage_text":"What Is Canning? Stock your pantry with home-canned pickles, preserves, jams, and jellies, adding summer freshness and flavor to your table all year long.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":4506244,"ranking":6,"query_text":"what flavor is space jam starhunter","passage_text":"In The SOS Card Tweak Peek, Lil Oldman says Space Jam is not jam from space; it is a film with basketball players and a much less handsome rabbit, possibly referring to Bugs Bunny, as Space Jam is a basketball movie with the Looney Tunes characters.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":5100755,"ranking":7,"query_text":"what flavor is space jam starhunter","passage_text":"Images and sounds of the characters from Space Jam. Voice actors images from the Space Jam voice cast.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":3010464,"ranking":8,"query_text":"what flavor is space jam starhunter","passage_text":"Jam, jelly, preserves, confiture. Whether you make your own or buy it, what's your very favorite flavor? It's hard to pick just one, of course, so if you have more favorites, tell us in the comments. We like a good loaf of plain bread, or a crusty baguette, with fresh butter and a spoonful of jam. It doesn't get much better than that! We had a baguette with strawberry jam and salted butter this morning.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":9288,"ranking":9,"query_text":"what flavor is space jam starhunter","passage_text":"The title track from the album of the same name, David Bowieâ\u0080\u0099s â\u0080\u009cSpace Oddityâ\u0080\u009d might be the quintessential space jam. Fun fact: Commander Chris Hadfield performed the song on the International Space Station in May 2013, because, like, what is more space than singing in space? ID: 1242389.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":7148220,"ranking":10,"query_text":"what flavor is space jam starhunter","passage_text":"Category: 70VG\/30PG, beverage, Flavor Category_beverage, Flavor Category_fruit, Flavor Tag_jam, Flavor Tag_lemonade, Flavor Tag_peach, fruit, jam, lemonade, peach, PG\/VG Ratio_30PG\/70VG","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":757475,"ranking":11,"query_text":"what flavor is space jam starhunter","passage_text":"5. Use jams to flavor the buttercream. Add up to 1\/3 cup (110 grams) of your favorite jam into the butter and beat it until it is smooth. Mix in the powdered sugar and whipping cream, milk, or half-and-half as usual.Keep in mind that the jam will alter the color of the frosting.. Use jams to flavor the buttercream. Add up to 1\/3 cup (110 grams) of your favorite jam into the butter and beat it until it is smooth. Mix in the powdered sugar and whipping cream, milk, or half-and-half as usual.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":7967584,"ranking":12,"query_text":"what flavor is space jam starhunter","passage_text":"This article is about the film. For the song of the same name, see Space Jam (song). Space Jam is a 1996 Sports Comedy film starring Michael Jordan and the Looney Tunes characters.The film was produced by Ivan Reitman, and directed by Joe Pytka, with Tony Cervone and Bruce W. Smith directing the animation.his article is about the film. For the song of the same name, see Space Jam (song). Space Jam is a 1996 Sports Comedy film starring Michael Jordan and the Looney Tunes characters.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":956808,"ranking":13,"query_text":"what flavor is space jam starhunter","passage_text":"How can you tell if opened strawberry jam is bad or spoiled? The best way is to smell and look at the strawberry jam: if the jam develops an off odor, flavor or appearance, or if mold appears, it should be discarded.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":5100756,"ranking":14,"query_text":"what flavor is space jam starhunter","passage_text":"Lola Bunny getting kissed by Bugs Bunny In Space Jam. Lola Bunny getting kissed by Bugs Bunny In Space Jam. I don't own any rights to this video....","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":3010466,"ranking":15,"query_text":"what flavor is space jam starhunter","passage_text":"Jams and Fruit Spreads from Barry Farm Foods. Barry Farm jams do not contain any artificial flavors, colors, fillers, preservatives, extenders or corn syrup. The only things that go into our fruit jams are fruit, sugar, pectin and some lemon juice (citric acid). We even use a low sugar recipe to make sure the flavor of the fruit is the first thing you taste.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":8769102,"ranking":16,"query_text":"what flavor is space jam starhunter","passage_text":"Peanut Butter vs Jam. Peanut butter and jam are popular spreads and are primarily used in sandwiches. Adding either of this two to your toasted or just plain bread or crackers adds flavor to it. Not only does these two add up to the flavor of your bread but they also have health benefits.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":4423003,"ranking":17,"query_text":"what flavor is space jam starhunter","passage_text":"The tart flavor of black raspberries pairs with the lush flavors of blackberries to create a berry loverâ\u0080\u0099s dream jam.Smuckerâ\u0080\u0099s Â® Seedless Black-Raspberry-Blackberry Jam lets the fruit stand out, but without the seeds. Itâ\u0080\u0099s perfect for salad dressings, and pairs well with goat cheeses.NUTRITION INFO INGREDIENTS.he tart flavor of black raspberries pairs with the lush flavors of blackberries to create a berry loverâ\u0080\u0099s dream jam.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":8444798,"ranking":18,"query_text":"what flavor is space jam starhunter","passage_text":"Sangiovese comes from Italy and is grown all over. Traditionally, when itâ\u0080\u0099s from Chianti or Brunello di Montalcino, it has a smokiness with dried cherry or strawberry flavors. When grown in the US, it has little to no smokiness and fresh strawberry and jam-like flavors. Red Cherry, Strawberry, Jam.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":5100752,"ranking":19,"query_text":"what flavor is space jam starhunter","passage_text":"She first appeared as Bugs Bunny's girlfriend in the 1996 Sports Comedy film Space Jam. Space Jam Edit. Lola first appeared in the 1996 film Space Jam. She is shown with tan fur, blonde bangs, and wears a yellow tank-top, purple shorts and a matching purple rubber band on both ears like a ponytail. She has aqua colored eyes.","bm25_label":"high","relevance_label":0.0},{"query_id":1081338,"passage_id":7148221,"ranking":20,"query_text":"what flavor is space jam starhunter","passage_text":"Space Jam; Squeezee; TearDrip; The Hype; Uncle Junk's; Unicorn; Vapetasia; Verdict Vapors; Whip'd; Zabba > Shop all; NEW BRANDS; Element; Vapetasia; Jam Monster; By The Pound; Solace Salts; Zabba > Shop all; STAFF FAVORITES; Zabba; Zabba Strawberry; Squeezee Super Good; Cannoli Be One; Thunder Pineapple Peach > Shop all; FEATURED BRANDS; Zabba; No Hype; Solace Salts; Squeezee; Space Jam; Dinner Lady; Juice Hog > Shop all; NICOTINE SALTS; Solace Salts Strawberry; SMPO Pod Summer Tasie; Solace Salts Butterscotch; Phix Pod Butterscotch; Naked 100 Salts Really Berry; Naked 100 Salts Lava Flow > Shop all; XL Bottles; Juice Hog; AirFactory; Famous Fair; Squeezee; No Hype; Naked 100 > Shop all; SHOP BY FLAVOR; Beverages; Candy; Cereal; Custard and Cream; Dessert; Fruit; Tobacco","bm25_label":"high","relevance_label":0.0}]