[{"query_id":1082336,"passage_id":7146536,"ranking":1,"query_text":"what dynasty did king tut rule","passage_text":"Tutankhamun's Perfume. The US Tut Exhibit (Coming in 2005) Tut's Tomb. The Tomb of King Tut. Detailed Floor Plan with Explanation. King Tut's Shrines. King Tut's Coffins. The Treasures of King Tut's Mummy. King Tutankhamun's Children. Howard Carter. The Life of Lord Carnarvon. The Robbery of King Tut's Tumb. Excavating the Tomb of Tutankhamun. Politics of the King Tut Discovery. The Mummy's Curse. What's New ? Featured King : HUNI The Last King Of Egypt's 3rd Dynasty. References:","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":8201335,"ranking":2,"query_text":"what dynasty did king tut rule","passage_text":"A: King Tut lived in Armana, Egypt, where he ruled as pharaoh during the 18th dynasty. Known as the boy pharaoh, his enduring notoriety came from his reign and the discovery of his valuable tomb. After his father died, King Tut became the youngest successor to reign at the age of what is believed to be 8 or 9 years old. During his somewhat unremarkable time as pharaoh, King Tut restored religious beliefs back to worshiping the god, Amun.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":8201332,"ranking":3,"query_text":"what dynasty did king tut rule","passage_text":"At what age did King Tut marry? A: King Tut married his half-sister Ankhesenamun at the age of 9. While early Egyptian pharaohs married members of the local nobility to strengthen their poli... Full Answer >","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":1515801,"ranking":4,"query_text":"what dynasty did king tut rule","passage_text":"King Tut was the 12th king of the 18th Egyptian dynasty, in power from 1361 B.C. to 1352 B.C. After his death at 18, he disappeared from history until his tomb King Tut was the 12th king of the 18th Egyptian dynasty, in power from 1361 B.C. to 1352 B.C. After his death at 18, he disappeared from history until his tomb was found in 1922. Tags","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":2416554,"ranking":5,"query_text":"what dynasty did king tut rule","passage_text":"King Tut-Mini Biography (TV-PG; 2:19) King Tut was the 12th king of the 18th Egyptian dynasty, in power from 1361 B.C. to 1352 B.C. After his death at 18, he disappeared from history until his tomb was found in 1922.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":8182478,"ranking":6,"query_text":"what dynasty did king tut rule","passage_text":"When Did King Tut Die? King Tut died circa 1323 B.C.E. How Old Was He When He Died? Tutankhamun died at age 19, after just eight to nine years in power. How Did King Tut Die? Research suggests King Tut died from a gangrene infection resulting from a broken leg.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":5720553,"ranking":7,"query_text":"what dynasty did king tut rule","passage_text":"King Tut, Tutankhamun, was a Pharaoh who ruled  Ancient Egypt during the New Kingdom, 18th Dynasty from 1333 BC -  1323 BC. He began ruling at the age of 9 due to the death â\u0080¦of his  father at the age of 5. His brother had already died, and he was  heir to the throne (next in line).","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":3016617,"ranking":8,"query_text":"what dynasty did king tut rule","passage_text":"King Tut: Royal Lineage. Genetic testing has verified that King Tut was the grandson of the great pharaoh Amenhotep II, and almost certainly the son of Akhenaten, a controversial figure in the history of the 18th dynasty of Egyptâ\u0080\u0099s New Kingdom (c.1550-1295 B.C.).","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":68178,"ranking":9,"query_text":"what dynasty did king tut rule","passage_text":"Tutankhamun (\/Ë\u008ctuË\u0090tÉ\u0099nkÉ\u0091Ë\u0090Ë\u0088muË\u0090n\/ ; alternatively spelled with Tutenkh- , -amen, -amon) was an Egyptian pharaoh of the 18th dynasty (ruled ca. 1332â\u0080\u00931323 BC in the conventional chronology), during the period of Egyptian history known as the New Kingdom. He is colloquially referred to as King Tut.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":4372238,"ranking":10,"query_text":"what dynasty did king tut rule","passage_text":"Tutankhamun, or better known as King Tut, is an 18th dynasty pharaoh who inherited the throne at a young age. His reign was short-lived and upon his death he quickly faded into the sands of Egypt. Once forgotten, King Tut now remains one of Egyptâ\u0080\u0099s grandest icons.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":3062923,"ranking":11,"query_text":"what dynasty did king tut rule","passage_text":"Since Shang bronze inscriptions were very short and did not say much, most of what is known about the Shang Dynasty is from the oracle bones. Toward the end of the Shang, writing was also inscribed on bronze objects.rchaeological evidence suggests that the town of Shang was the ancestral capital of the dynasty that remained in a fixed location throughout the dynasty. It was where the Shang kings kept their most sacred ancestral temples, tablets, and regalia. The political capital was where the kings lived and ruled from.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":851070,"ranking":12,"query_text":"what dynasty did king tut rule","passage_text":"For other uses, see King Tut (disambiguation). Tutankhamun (\/Ë\u008ctuË\u0090tÉ\u0099nkÉ\u0091Ë\u0090Ë\u0088muË\u0090n\/; alternatively spelled with Tutenkh-, -amen, -amon) was an Egyptian pharaoh of the 18th dynasty (ruled c. 1332â\u0080\u00931323 BC in the conventional chronology), during the period of Egyptian history known as the New Kingdom or sometimes the New Empire Period.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":8182474,"ranking":13,"query_text":"what dynasty did king tut rule","passage_text":"When did he rule? King Narmer ruled during the 1st Dynasty around 3100 B.C. How long did he rule? King Narmer ruled from 3100â\u0080\u00933050 B.C. Until he died and Hor-Aha,his son, took over. What does his name mean? King Narmer is a male name which originated from Egypt. It doesn't have a specific meaning to it, but it is known as a name for kings. During his reign, he was known as King Scorpion, this name was found on a macehead also discovered in Hierakonpolis), but he adopted symbols of unification that had already been in use for perhaps a generation.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":1931026,"ranking":14,"query_text":"what dynasty did king tut rule","passage_text":"Akhenaten died when King Tut was a child and he was given the throne at a young age. If Akhenaten did create a hostile environment, his son wouldâ\u0080\u0099ve had to deal with the new state of Egypt. To make matters worse, King Tut was a child and probably did not have the intellect to run Egypt.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":5720555,"ranking":15,"query_text":"what dynasty did king tut rule","passage_text":"King Tut, Tutankhamun , was a Pharaoh who ruledAncient Egypt during the New Kingdom, 18th Dynasty from 1333 BC -1323 BC. He began ruling at the age of 9 due to the death of â\u0080¦ hisfather at the age of 5. His brother had already died, and he washeir to the throne (next in line). He died at the age of 18 due toan infection in the leg.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":510144,"ranking":16,"query_text":"what dynasty did king tut rule","passage_text":"Howard Carter (9 May 1874 â\u0080\u0093 2 March 1939) was a British archaeologist and Egyptologist who became world-famous after discovering the intact tomb (designated KV62) of the 18th Dynasty Pharaoh, Tutankhamun (colloquially known as King Tut and the boy king), in November 1922.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":105523,"ranking":17,"query_text":"what dynasty did king tut rule","passage_text":"There was more than a little reason to believe that King Tut may have been murdered. The two principal suspects, Aye who succeeded him as king, and General Horemhab who in turn succeeded Aye to the throne, both appear to have been powerful men who, in effect, ruled Egypt while King Tut was a child.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":105526,"ranking":18,"query_text":"what dynasty did king tut rule","passage_text":"Genetic testing has verified that King Tut was the grandson of the great pharaoh Amenhotep II, and almost certainly the son of Akhenaten, a controversial figure in the history of the 18th dynasty of Egyptâ\u0080\u0099s New Kingdom (c.1550-1295 B.C.).","bm25_label":"high","relevance_label":1.0},{"query_id":1082336,"passage_id":510140,"ranking":19,"query_text":"what dynasty did king tut rule","passage_text":"Howard Carter. Howard Carter (9 May 1874 â\u0080\u0093 2 March 1939) was a British archaeologist and Egyptologist who became world-famous after discovering the intact tomb (designated KV62) of the 18th Dynasty Pharaoh, Tutankhamun (colloquially known as King Tut and the boy king) in November 1922.","bm25_label":"high","relevance_label":0.0},{"query_id":1082336,"passage_id":7638631,"ranking":20,"query_text":"what dynasty did king tut rule","passage_text":"(King Tut). (King Tut). Now when he was a young man, He never thought he'd see. (King Tut). People stand in line to see the boy king. (King Tut).","bm25_label":"high","relevance_label":0.0}]