[{"query_id":1082377,"passage_id":7146136,"ranking":1,"query_text":"what does wintergreen blend well with","passage_text":"CHEMICAL CONSTITUENTS: The main chemical components of wintergreen oil are menthyl salicylate and gaultherilene. PRECAUTIONS: Wintergreen oil is toxic and when taken internally can be fatal. BLENDS: Blends well with: Oregano, Peppermint, Thyme, Cajuput, Eucalyptus, Niaoli and Ylang Ylang It has been suggested that Wintergreen Oil should not be used in Aromatherapy because of its highly toxic properties, but this could be said of many Essential Oils. wintergreen","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":4415388,"ranking":2,"query_text":"what does wintergreen blend well with","passage_text":"Massage a few drops of a 1% to 2% wintergreen essential oil\/carrier oil blend into painful joints several times a day. Arthritis relief is one of the most common uses for wintergreen oil. Methyl salicylate is the active chemical constituent in wintergreen oil. In fact, wintergreen oil is about 99% Methyl salicylate.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":5380659,"ranking":3,"query_text":"what does wintergreen blend well with","passage_text":"Wintergreen blends well with Bergamot, Basil, Cypress, Geranium, Lavender, Lemongrass, Marjoram, and Peppermint essential oils. Depending on your uses for this oil, substitutes may include White Fir, Peppermint, Spearmint, or Cypress essential oils.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":2334002,"ranking":4,"query_text":"what does wintergreen blend well with","passage_text":"To what group of chemicals do willow tree bark, oil of wintergreen, and aspirin belong? 4. What chemical does each of these contain? willow trees ï\u0083  oil of wintergreen ï\u0083  aspirin ï\u0083  5. What method of investigation was used in the herbal medicine of primitive cultures? 6.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":4415382,"ranking":5,"query_text":"what does wintergreen blend well with","passage_text":"Apply a 1% to 2% wintergreen essential oil\/carrier oil blend to the chest and throat to quiet coughs. It will stop the muscle spasms and soothe the throat. Wintergreen aromatherapy can also be beneficial for excessive coughing.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":3371128,"ranking":6,"query_text":"what does wintergreen blend well with","passage_text":"Wintergreen essential oil is derived from the leaves of a creeping shrub found in coniferous areas. The main chemical component in Wintergreen, methyl salicylate, is used in topical creams and massage blends because of its soothing properties.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":7146138,"ranking":7,"query_text":"what does wintergreen blend well with","passage_text":"BLENDS: Blends well with: Oregano, Peppermint, Thyme, Cajuput, Eucalyptus, Niaoli and Ylang Ylang. It has been suggested that Wintergreen Oil should not be used in Aromatherapy because of its highly toxic properties, but this could be said of many Essential Oils. The main argument is that it can be fatal if taken internally, we at Oilsandplants.com don't reccommend that ANY Essential Oils are taken internally.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":1161001,"ranking":8,"query_text":"what does wintergreen blend well with","passage_text":"The tension blend is a blend of the essential oils of wintergreen, lavender, peppermint, frankincense, cilantro, marjoram, roman chamomile, basil, and rosemary. Rub on the shoulders, neck, or low back for a cooling and relaxing effect.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":3635949,"ranking":9,"query_text":"what does wintergreen blend well with","passage_text":"â\u0080\u008b Wintergreen Membership. Wintergreen Resort has been heralded as one of the most inclusive four season public resort communities, especially for its Wintergreen Members. Wintergreen has an exclusive membership program, open to property owners as well as to a limited number of non-property owners.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":1550562,"ranking":10,"query_text":"what does wintergreen blend well with","passage_text":"The chemical methyl salicylate is what they put in Wintergreen-flavored snuff to make it taste like Wintergreen.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":1161003,"ranking":11,"query_text":"what does wintergreen blend well with","passage_text":"The soothing blend contains the essential oils of wintergreen, camphor, peppermint, blue tansy, German chamomile, helichrysum and osmanthus. The massage blend has the essential oils of basil, grapefruit, cypress, marjoram, peppermint, and lavender. Massage into any sore spots for natural relief and cooling effect.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":1284981,"ranking":12,"query_text":"what does wintergreen blend well with","passage_text":"Product Summary. PanAway essential oil blend is a proprietary. blend of helichrysum, wintergreen, clove, and. peppermint designed to relieve muscle soreness. and tension. Product Story. If you have localized soreness after gardening, shopping, working out, or any other physical. activity, reach for PanAway.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":1284988,"ranking":13,"query_text":"what does wintergreen blend well with","passage_text":"Â© 2011 yleotraining.com. PanAwayÂ®. Introduction. PanAway essential oil blend is a proprietary. blend of helichrysum, wintergreen, clove, and peppermint designed to relieve muscle. soreness and tension. History. If you have localized soreness. after gardening, shopping, working out, or any other.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":6861917,"ranking":14,"query_text":"what does wintergreen blend well with","passage_text":"This blend contains four oils including helichyrsum, clove, and wintergreen. Click on the link below to get a complete description of the oil and each oil contained in this blend. This is a therapeutic grade essential oil. Available in a 5 ml bottle and 15 ml bottle.To find out what oils are in this blend and how to use it, click here: http:\/\/www.experience-essential-oils.com\/panaway.html. Note: This statement has not been evaluated by the Food and Drug Administration.lick on the link below to get a complete description of the oil and each oil contained in this blend. This is a therapeutic grade essential oil. Available in a 5 ml bottle and 15 ml bottle.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":3635940,"ranking":15,"query_text":"what does wintergreen blend well with","passage_text":"Wintergreen Resort has been heralded as one of the most inclusive four season public resort communities, especially for its Wintergreen Members. Wintergreen has an exclusive membership program, open to property owners as well as to a limited number of non-property owners.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":1550566,"ranking":16,"query_text":"what does wintergreen blend well with","passage_text":"The chemical methyl salicylate is what they put in Wintergreen-flavored snuff to make it taste like Wintergreen. report this answer.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":6685287,"ranking":17,"query_text":"what does wintergreen blend well with","passage_text":"This blend contains wintergreen essential oil, which is often used for massage. PanAway is soothing to the skin while providing comforting warmth to muscles after exercise. It helps move oxygen into the tissues to facilitate healing.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":7115061,"ranking":18,"query_text":"what does wintergreen blend well with","passage_text":"â\u0080\u0098The original root beer was a low-alcohol, naturally effervescent drink made by fermenting a blend of sugar and yeast with various roots, herbs and barks, such as sarsaparilla, sassafras, wild cherry, wintergreen, vanilla and ginger.â\u0080\u0099","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":7126068,"ranking":19,"query_text":"what does wintergreen blend well with","passage_text":"Raven has a blend of five essential oils (Ravensara, lemon, wintergreen, peppermint, and Eucalyptus radiata) that can help the respiratory system. When paired with R.C., these two can powerfully support healthy lung function.","bm25_label":"medium","relevance_label":0.0},{"query_id":1082377,"passage_id":4327660,"ranking":20,"query_text":"what does wintergreen blend well with","passage_text":"Virgilâ\u0080\u0099s is a superb blend of spices and herbs gathered from the world over; anise, licorice, vanilla (bourbon), cinnamon, clove, wintergreen, sweet birch, molasses, nutmeg, pimento berry oil, balsam oil and cassia oil.","bm25_label":"medium","relevance_label":0.0}]