[{"query_id":1083161,"passage_id":7140020,"ranking":1,"query_text":"what does qhs stand for","passage_text":"An example of such might include Benadryl 50mg qhs prn insomnia.(qhs is another Latin abbreviation, which stands for quaque hora somni, or at the hour of sleep or bedtime.) Fortunately for patients, pharmacists are also familiar with these shorthand notations.","bm25_label":"high","relevance_label":1.0},{"query_id":1083161,"passage_id":4244593,"ranking":2,"query_text":"what does qhs stand for","passage_text":"Before you can open a QHS file, you'll need to figure out what kind of file the QHS file extension refers to. Tip: Incorrect QHS file association errors can be a symptom of other underlying issues within your Windows operating system.","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":7137907,"ranking":3,"query_text":"what does qhs stand for","passage_text":"military mk, what does mark stand for in military, what does mk 19 mean, what does mk 19 stand for, what does mk mean in military, what does mk mean in weapons, what does mk mean military, what does mk stand for guns, what does mk stand for in guns, what does mk stand for in mk 19, what does mk stand for in newspapers, what does mk stand for on a gun, what does mk19 stand for, what does mod 0 mean, what does the mk stand for in mk-19","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":3234659,"ranking":4,"query_text":"what does qhs stand for","passage_text":"=== What Does MCM Stand For? === By What Does ____ Stand For? Like and subscribe for more acronyms and abbreviations. === What Does MCM Stand For? === By What Does ____ Stand For?","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":5230973,"ranking":5,"query_text":"what does qhs stand for","passage_text":"=== What Does UPC Stand For? === By What Does ____ Stand For? Like and subscribe for more acronyms and abbreviations. === What Does UPC Stand For? === By What Does ____ Stand For?","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":1149020,"ranking":6,"query_text":"what does qhs stand for","passage_text":"45 auto what does xd stand for, what does m stand for in xdm, what does springfield xdm mean, what does the m in xdm mean, what does the m in xdm springfield mean, what does the m stand for in xdm, what does the xdm stand for, what does xd mean in guns, what does xdm mean, what does xdm mean springfield gun, what does xdm mean?, what does xdm stand for springfield, what does xmd xds mean, whats the m mean in xd m pistols, xd-m m stands for","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":4244590,"ranking":7,"query_text":"what does qhs stand for","passage_text":"In the case that your QHS file doesn't open, it is highly likely that you do not have the correct software application installed on your PC to view or edit QHS file extensions. If your PC opens the QHS file, but it's the wrong application, you'll need to change your Windows registry file association settings. In other words, Windows is associating QHS file extensions with the wrong software program.","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":3447509,"ranking":8,"query_text":"what does qhs stand for","passage_text":"My sisters horse is a 19 year old QH mare what is 15 hands and still goes like she is a 3 year old and she has a foal beside her but her foal is 8-10 months old and will be tied beside her mother of course so i am just wondering how long does it take for a horse to walk a mile?","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":3370166,"ranking":9,"query_text":"what does qhs stand for","passage_text":"4. Tree size is determined by the angle of the gullet. Semi QH Bars\/ Reg QH Bars have a higher pitch and Full QH Bars are a flatter pitch. Our saddle experts use our downloadable gullet templates to get an accurate measure. 5.","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":894965,"ranking":10,"query_text":"what does qhs stand for","passage_text":"ThoughtCo, Aug. 21, 2017, thoughtco.com\/what-does-spqr-stand-for-120786. Gill, N.S. (2017, August 21). What Does SPQR Stand For? Retrieved from https:\/\/www.thoughtco.com\/what-does-spqr-stand-for-120786 Gill, N.S. What Does SPQR Stand For? ThoughtCo. https:\/\/www.thoughtco.com\/what-does-spqr-stand-for-120786 (accessed January 18, 2018).","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":331492,"ranking":11,"query_text":"what does qhs stand for","passage_text":"What does nec Stand For In medical Billing â\u0080\u0093 CliffordSnow's Blog â\u0080¦ eagthora What does nec stand for in medical billing WHAT DOES NEC STAND FOR IN MEDICAL BILLING More information â\u0080¦ what does nec mean in. how much does medical billing and. what is a stand-alone code : in medical billing how. What is icd-9 â\u0080¦ What does ICD-9 for medical coding stand for? Meaning of NEC medical term.","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":495895,"ranking":12,"query_text":"what does qhs stand for","passage_text":"Jcrew shoes what does the h stand for. What does preschool and gradeschool in jordan shoe sizes? On the amazon.com website the shoe sizes state `` 8 d (m) us what dies that mean? Woolrich shoes what does the h stand for. What does eee stand for shoe size? What does gp stand for in shoe size? Nike 9h size shoe. What is shoe size 3e stand for?","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":7139848,"ranking":13,"query_text":"what does qhs stand for","passage_text":"What does the acronym, VB stand for when used in text messages? Acronyms: What does ETQF stand for? In the acronym QPRC (biology), what does the letter P stand for?","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":8083790,"ranking":14,"query_text":"what does qhs stand for","passage_text":"What does the stamp mark on jewelry MMOO stand for? What does CZ stand for when found stamped on jewelry? What does the number 334 stamped on jewelry stand for?","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":8682524,"ranking":15,"query_text":"what does qhs stand for","passage_text":"FANBOYS in English stand for? already exists. already exists as an alternate of this question. exists and is an alternate of. Do the emberlight plugins work with any light bulb? What is Fanboys rated? Is because a fanboy? What does IVF stand for in English? What does fanboys stand for? What does FANBOYS mean? What does AAAWWUBBIS stand for in ... W","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":3112254,"ranking":16,"query_text":"what does qhs stand for","passage_text":"What does oof stand for when texting? 1  33% - Heywhat does pk stand for in texting?read more: what does pk stand for in texting-what does pk stands for in abbreviations for texting :: a? 2  84% - What does tvs stand for in texting? 3  82% - What`s lvl stand for when texting? 4  84% - What does imy stand for in texting? 5  80% - What does yrh stand for when 6  ... 5. 1. I think it is a typo, my friend sent me `Mgm and I replied what and then he said mhm So I think he meant mhm. the letters h and g on the keyboard are close together, I could see how that mistake good be made.","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":4744351,"ranking":17,"query_text":"what does qhs stand for","passage_text":"What does TWP stand for? - Abbreviations.com What does TWP stand for? What does TWP mean? This page is about the various possible meanings of the acronym, abbreviation, shorthand or slang term: TWP. abbreviations.com What does TWP stand for? - Abbreviations and â\u0080¦ Rank Abbr.","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":576162,"ranking":18,"query_text":"what does qhs stand for","passage_text":"What does suv stand for? Autos. What does suv stand for? Suv abbreviationsuv, simple unstable vehicle (bicycle like device). What does suv mean? Suv definition meaning of what s. Suv what does suv stand for? The free dictionary. Oct 2013 surprisingly, many drivers don't know what the three letters suv stand for. Suv is a type of car body.","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":7129232,"ranking":19,"query_text":"what does qhs stand for","passage_text":"What does the acronym GOP stand for? If your name was an acronym representing you, what would it possibly stand for? What does the Army acronym METT-TC stand for?","bm25_label":"high","relevance_label":0.0},{"query_id":1083161,"passage_id":5230967,"ranking":20,"query_text":"what does qhs stand for","passage_text":"What Does WYSIWYG Stand For? - Duration: 0:13. What Does ____ Stand For? 29 views","bm25_label":"high","relevance_label":0.0}]