[{"query_id":1083663,"passage_id":2155183,"ranking":1,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Heart on my sleeve. Posted by ESC on May 20, 2000. In Reply to: Heart on sleeve posted by Bob on May 20, 2000: : Where does the phrase I wear my heart on my sleeve come from. I know Shakespeare quotes it in Othello but what does it mean and where does it come from?: I don't know of any uses before Shakespeare, but there may have been. Or... Will was known to coin a phrase or two. It means I do not conceal my feelings; my emotions (usually love and devotion) are visible for all to see. The sense also includes a feeling of vulnerability: when you wear your heart on your sleeve, you risk rejection and pain. From Brush Up Your Shakespeare!","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":2155192,"ranking":2,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"What is the Sybolisom of wearing your heart on your sleeve? Answer . 'Wearing your heart on your sleeves' means instead of keeping a secret heart (loving one or others without communication) the person shows and communicates verball â\u0080¦ y to those around them how much they love and respect others thus, 'wearing your heart on your sleeve.'","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":2155188,"ranking":3,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Heart on my sleeve. Posted by ESC on May 20, 2000. In Reply to: Heart on sleeve posted by Bob on May 20, 2000. : : Where does the phrase I wear my heart on my sleeve come from. I know Shakespeare quotes it in Othello but what does it mean and where does it come from? : I don't know of any uses before Shakespeare, but there may have been. Or...","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":7135414,"ranking":4,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Shakespeare Quotes \/ Wear your heart on your sleeve \/ Meaning Now ; Wear your heart on your sleeve \/ Meaning Now","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":7135409,"ranking":5,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Originally Answered: What does the saying 'wearing your heart on your sleeve mean? You donâ\u0080\u0099t hide your emotions. Itâ\u0080\u0099s as if they are prominently pinned to your clothing for all the world to see.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":7135417,"ranking":6,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"What does the phrase wear (one's) heart on (one's) sleeve mean? I would appreciate if you could also tell me the origin of the same.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":2155186,"ranking":7,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"11. Wear your heart on your sleeve Meaning: to express your emotions openly, especially when others notice without much effort. In Othello, Iago says he'll wear my heart upon my sleeve. For daws to peck at: I am not what I am (Act 1, Scene 1). The phrase most likely stemmed from jousting matches in the Middle Ages. Knights would wear tokens (such as scarfs) from their ladies tucked into the sleeves of their armor. But the first recorded use appears in Shakespeare's play. 12. Dogs of war","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":1166682,"ranking":8,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"wear something on your sleeve. to make your feelings or beliefs known to everyone Some people feel the need to wear their patriotism on their sleeve. Usage notes: often used in the form wear your heart on your sleeve (to make your emotions known to others) : I don't like wearing my heart on my sleeve.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":5072960,"ranking":9,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"wear something on your sleeve. to make your feelings or beliefs known to everyone Some people feel the need to wear their patriotism on their sleeve. Usage notes: often used in the form wear your heart on your sleeve (to make your emotions known to others): I don't like wearing my heart on my sleeve.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":7135416,"ranking":10,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Answer . 'Wearing your heart on your sleeves' means instead of keeping a secret heart (loving one or others without communication) the person shows and communicates verballâ\u0080¦y to those around them how much they love and respect others thus, 'wearing your heart on your sleeve.'.   You do this by outwardly showing your emotions.","bm25_label":"high","relevance_label":1.0},{"query_id":1083663,"passage_id":1166689,"ranking":11,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"wear your heart on your sleeve. to make your feelings and opinions obvious to other people John's always worn his heart on his sleeve, so there's no doubt who he'll be supporting. See also: heart, on, sleeve, wear. Related vocabulary: wear something on your sleeve.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":7135413,"ranking":12,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"The dos and don'ts of wearing your heart on your sleeve. How to put out (your heart, that is) We don't always practice what we preach, but ladies across America know a thing or two about wearing their hearts on their sleeves. We talked with a few of them and they happily provided us with a few of their dating dos and don'ts.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":2155185,"ranking":13,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Heart on my sleeve. 1  Posted by ESC on May 20, 2000. 2  In Reply to: Heart on sleeve posted by Bob on May 20, 2000. : : 3  Where does the phrase I wear my heart on my sleeve come from. : 4  I don't know of any uses before Shakespeare, but there may have been. 5  From Brush Up Your Shakespeare! by Michael Macrone (Gramercy Books, New York, 1990):","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":741807,"ranking":14,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Wear your heart on your sleeve means that you don't hide your emotions. Everyone can see immediately how you feel about something.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":6742896,"ranking":15,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"In compliment extern, â\u0080\u0099tis not long after. But I will wear my heart upon my sleeve. For daws to peck at. I am not what I am. you, as sure as your nameâ\u0080\u0099s Roderigo, if I were the Moor I wouldnâ\u0080\u0099t want to be Iago. I may seem to love and obey him, but in fact, Iâ\u0080\u0099m just serving him to get what I want.n compliment extern, â\u0080\u0099tis not long after. But I will wear my heart upon my sleeve. For daws to peck at. I am not what I am. you, as sure as your nameâ\u0080\u0099s Roderigo, if I were the Moor I wouldnâ\u0080\u0099t want to be Iago. I may seem to love and obey him, but in fact, Iâ\u0080\u0099m just serving him to get what I want.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":2155191,"ranking":16,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"The term wearing your heart on your sleeve is thought to have originated during Medieval Times. During jousting matches knights would wear their ladies colors on their arm. The term wearing your heart on your sleeve is thought to have originated during Medieval Times. During jousting matches knights would wear their ladies colors on their arm.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":4915432,"ranking":17,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Bleeding Heart Flower... The name alone of the Bleeding Heart flower suggests potent symbolism and meaning; wearing your heart on your sleeve and pouring your heart out for all to see. The center of the flower is deep pink, like a heart and the color pours onto the crisp white petals it's innermost feelings.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":7135412,"ranking":18,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"Like you are wearing your heart on your sleeve, where the whole world can see how you feel. Bobby gets walked all over by every girl that he dates because he wears his heart on his sleeve and they realize that he is a pushover. Not to say everyone with their heart on the sleeve, thats just an example for context.","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":361868,"ranking":19,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"wear heart on sleeve; wear heart on sleeve; wear heart on sleeve; wear heart on sleeve; wear heart on sleeve; wear heart on sleeve; wear her fingers to the bone; wear her to a frazzle; wear him to a frazzle; wear his fingers to the bone; wear in; Wear leveling; Wear leveling; Wear leveling; Wear levelling; wear me to a frazzle; wear more than one hat; wear motley","bm25_label":"high","relevance_label":0.0},{"query_id":1083663,"passage_id":741804,"ranking":20,"query_text":"what does i mean to wear your heart on your sleeve","passage_text":"To wear your heart on your cheek is the opposite of wearing your heart on your sleeve. A person who wears their heart on their cheek keeps their true emotions hidden, usually to keep themselves from getting hurt and\/ or to hurt others. This term is from the song 'How to be a Heartbreaker' by Marina and The Diamonds. Rule number three, wear your heart on your cheek.","bm25_label":"high","relevance_label":0.0}]