[{"query_id":1083852,"passage_id":7133662,"ranking":1,"query_text":"what does extravert mean","passage_text":"What does extravert mean in Urban Dictionary?: An Extravert is somebody who does not get stressed or shy when confronted with talking to strangers. They are usually easy-going consequently they are frequentlyâ\u0080¦","bm25_label":"high","relevance_label":1.0},{"query_id":1083852,"passage_id":6039625,"ranking":2,"query_text":"what does extravert mean","passage_text":"That is, extraverted and brave Gryffindors; agreeable and loyal Hufflepuffs; clever and witty Ravenclaws; and manipulative, ends-justifies-the-means Slytherins. Highly extraverted individuals are characterized as energetic, enthusiastic, adventurous, and outgoing.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":2210929,"ranking":3,"query_text":"what does extravert mean","passage_text":"C. G. Jung applied the words extravert and introvert in a different manner than they are most often used in today's world. As they are popularly used, the term extraverted is understood to mean sociable or outgoing, while the term introverted is understood to mean shy or withdrawn.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":7133663,"ranking":4,"query_text":"what does extravert mean","passage_text":"An Extravert is somebody who does not get stressed or shy when confronted with talking to strangers. They are usually easy-going consequently they are frequently good speakers. The Extravert in a group will be the very first individual introduce himself to a small grouping of strangers. by Nickolas Yutzy Report definition Related Sources","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":7133668,"ranking":5,"query_text":"what does extravert mean","passage_text":"It is up to each person to recognize his or her true preferences.. C. G. Jung applied the words extravert and introvert in a different manner than they are most often used in today's world. As they are popularly used, the term extraverted is understood to mean sociable or outgoing, while the term introverted is understood to mean shy or withdrawn. Jung, however, originally intended the words to have an entirely different meaning.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":3798692,"ranking":6,"query_text":"what does extravert mean","passage_text":"Extraversion is the act, state, or habit of being predominantly concerned with obtaining gratification from what is outside the self. Extraverts tend to enjoy human interactions and to be enthusiastic, talkative, assertive, and gregarious. Extraverts are energized and thrive off of being around other people.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":2210928,"ranking":7,"query_text":"what does extravert mean","passage_text":"Extraverted Feeling (Fe) vs. Extraverted Thinking (Te). While the content of an Extraverted Feeling expression need not be emotional, there is a discernible difference in its packaging compared to that of Extraverted Thinking (Te) .","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":699657,"ranking":8,"query_text":"what does extravert mean","passage_text":"Synonyms for Extrovert: extrovert (noun) extraversive, extravert, extraverted, extravertive, extroversive, extroverted, extrovertive. Other synonyms: accessible,","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":2210927,"ranking":9,"query_text":"what does extravert mean","passage_text":"Extraverted Feeling (Fe) vs. Extraverted Thinking (Te). While the content of an Extraverted Feeling expression need not be emotional, there is a discernible difference in its packaging compared to that of Extraverted Thinking (Te) . Te comes across as rather dry, lifeless, and monotonal.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":2210924,"ranking":10,"query_text":"what does extravert mean","passage_text":"As they are popularly used, the term extraverted is understood to mean sociable or outgoing, while the term introverted is understood to mean shy or withdrawn. Jung, however, originally intended the words to have an entirely different meaning.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":6039627,"ranking":11,"query_text":"what does extravert mean","passage_text":"extraverted - being concerned with the social and physical environment. extravert, extravertive, extrovert, extrovertive, extroverted. extraversive, extroversive - directed outward; marked by interest in others or concerned with external reality.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":3798689,"ranking":12,"query_text":"what does extravert mean","passage_text":"Adj. 1. extrovert-being concerned with the social and physical environment. extravert, extraverted, extravertive, extrovertive, extroverted. extraversive, extroversive-directed outward; marked by interest in others or concerned with external reality.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":7277127,"ranking":13,"query_text":"what does extravert mean","passage_text":"Extraverted Feeling (Fe) is the dominant function of the ENFJ and ESFJ types and is considered an extraverted Judging function.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":8300321,"ranking":14,"query_text":"what does extravert mean","passage_text":"An extravert's flow is directed outward toward people and objects, whereas the introvert's is directed inward toward concepts and ideas. 1  Contrasting characteristics between extraverted and introverted people include the following: 2  Extraverted are action-oriented, while introverted are thought-oriented.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":2481,"ranking":15,"query_text":"what does extravert mean","passage_text":"Introvert and extravert. Introvert and extravert, basic personality types according to the theories of the 20th-century Swiss psychiatrist Carl Jung.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":1366702,"ranking":16,"query_text":"what does extravert mean","passage_text":"Extraversion. Extraversion versus introversion is possibly the most recognizable personality trait of the Big Five. The more of an extravert someone is, the more of a social butterfly they are. Extraverts are chatty, sociable and draw energy from crowds.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":7062744,"ranking":17,"query_text":"what does extravert mean","passage_text":"Extrovert (sometimes spelled extravert) means basically turned outwardâ\u0080\u0094that is, toward things outside oneself. The word was coined by the eminent psychologist C. G. Jung in the early 20th century. The opposite personality type, in Jung's view, was the introvert.","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":6958226,"ranking":18,"query_text":"what does extravert mean","passage_text":"What does de mean? What does derecho mean? What does esta mean? What does Juez mean? What does poder mean? What does por favor mean? What does puede mean? What does que mean? What does ser mean? What does su mean What does tener mean? What does tiene mean? What does un mean? What does usted mean? workers compensation","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":169073,"ranking":19,"query_text":"what does extravert mean","passage_text":"What Does T Mean? What Does The Below Sentence Mean? What Does This Mean? What Does Swipe And Ficky Mean In This... What Does This Word Mean? ? Re: What Does It Mean? What Does This Phrase Mean: Burst Into The Seams? What Does It Mean? What Does The Statement Mean? What Does White-Out Mean? What Does Knock Me Clean Over Mean? What Does 'Want' Mean In The Below Example? What Does State To The Left Below Mean? What Does  Sloppy-Joe Mean In Below Lines? What Does Jeopardy Mean?","bm25_label":"high","relevance_label":0.0},{"query_id":1083852,"passage_id":1985345,"ranking":20,"query_text":"what does extravert mean","passage_text":"What does THOT mean? What does IANAL mean? What does MCM mean on Instagram? What does Ayy LMAO mean? What does WCW mean? What does TBT mean? What does OOTD mean? What does SMH mean? What does OOH KILL â\u0080\u0098EM mean? What does TLDR mean? TL;DR; Plural of Crisis; What does igers mean on Instagram? What does FOH mean on Instagram; What does FBF mean on Instagram? What does FML mean?","bm25_label":"high","relevance_label":0.0}]