[{"query_id":1083535,"passage_id":7136575,"ranking":1,"query_text":"what does joe maddon use on his hair","passage_text":"ST. PETERSBURG, Fla. -- Joe Maddon is in favor of the change at the top of Tampa Bay's on-field leadership. Manager Joe Maddon addresses the media before the Rays' game against the Orioles after dyeing his hair black. AP Photo\/Chris O'Meara. The Rays manager came to the ballpark for Tuesday night's game against Baltimore with his silver hair dyed black, a head start on a Johnny Cash-themed road trip next week. I thought, why not in advance? Maddon said.","bm25_label":"high","relevance_label":1.0},{"query_id":1083535,"passage_id":7136573,"ranking":2,"query_text":"what does joe maddon use on his hair","passage_text":"Joe Maddon's Daughter Says What He's Doing With Cubs Is 'Indescribable'. Sarah Maddon (center) with Cubs manager and her dad Joe Maddon and other family members at Wrigley Field. [Sarah Maddon] CHICAGO â\u0080\u0094 Like his grandfather, 4-year-old Tre Bystry is all in for the Cubs this postseason. Of course, Tre's granddad is Cubs manager Joe Maddon, who has the North Siders within four victories of their first World Series appearance since 1945.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7136577,"ranking":3,"query_text":"what does joe maddon use on his hair","passage_text":"Photos of Joe Maddon, the 2015 NL Manager of the Year. Maddon's hair was the elephant in the media room, and the same color to boot. But as the homestand progressed, the topic of hair color receded in importance, replaced by more pressing matters like bullpen walks and Lester's shoulder.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":2293613,"ranking":4,"query_text":"what does joe maddon use on his hair","passage_text":"How Joe Maddon became the most awesome manager in baseball. Joe Maddon has become the best manager in baseball, and itâ\u0080\u0099s no accident how he got there. Joe Maddon quipped at a Chicago area charity event on Wednesday night after his Chicago Cubs had earned their first victory of the season, that his team was the best 1-1 team in the majors.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7136572,"ranking":5,"query_text":"what does joe maddon use on his hair","passage_text":"Get an inside look at Joe Maddon's insanely tricked-out RV. In addition to and , Joe Maddon is a big fan of RVs. He his favorite television shows in them. He spends entire Spring Trainings in them.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7136580,"ranking":6,"query_text":"what does joe maddon use on his hair","passage_text":"Cubs manager Joe Maddon gives his first impression of starter Yu Darvish at spring training on Tuesday, Feb. 20, 2018. (Mark Gonzales\/Chicago Tribune) Cubs manager Joe Maddon gives his first impression of starter Yu Darvish at spring training on Tuesday, Feb. 20, 2018.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":8805627,"ranking":7,"query_text":"what does joe maddon use on his hair","passage_text":"1 Wacky Joe Maddon Game 3 of the NLCS in Chicago tonight, and Joe Maddon wants his guys to turn Wrigley into the streets of Philly. 2  Rishard Matthews Miami wideout talks Dan Campbell Era. 3  Brett Brown Philadelphia head coach talks Jahlil Okafor, Joel Embiid, and more.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":2293618,"ranking":8,"query_text":"what does joe maddon use on his hair","passage_text":"Call to the Pen. Chicago Cubs: Joe Maddon, Baseballâ\u0080\u0099s Most Unique Manager. Joe Maddon is one of the most successful managers in Major League Baseball, and also one of the most unique. What makes the Chicago Cubs skipper one-of-a-kind? There are tens of thousands of athletic coaches all over the world, and all of them have their flaws.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7136576,"ranking":9,"query_text":"what does joe maddon use on his hair","passage_text":"But something strange happened in California, as it often does with the Cubs, and Maddon came home a changed man, at least from the ears up. His hair is noticeably darker in spots, more of a salt-and-pepper look than a straight dye job.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":2293611,"ranking":10,"query_text":"what does joe maddon use on his hair","passage_text":"Organizations need a manager they know is committed to them, to the city, and to winning. That is what the Cubs need and thatâ\u0080\u0099s what they have in Maddon. The Chicago Cubs, for once, have the best manager in baseball, Joe Maddon. Now all they have to do if pull it all together so this doesnâ\u0080\u0099t end up being a waste of everyoneâ\u0080\u0099s time.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":2293620,"ranking":11,"query_text":"what does joe maddon use on his hair","passage_text":"Thatâ\u0080\u0099s perhaps the most Joe Maddon thing ever quipped â\u0080\u0094 and itâ\u0080\u0099s one of them any reasons heâ\u0080\u0099s the most awesome manager in baseball. Maddon is just beginning his career as the Cubsâ\u0080\u0099 manager after a wildly successful eight-year run leading the previously defunct Tampa Bay Rays.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":4589498,"ranking":12,"query_text":"what does joe maddon use on his hair","passage_text":"Not to be confused with Joel Madden or John Madden. Joseph John Joe Maddon Jr. (born February 8, 1954) is an American professional baseball manager who currently manages the Chicago Cubs of Major League Baseball (MLB). Maddon began his coaching career in MLB with the California Angels in 1993 and served under managers Buck Rodgers, Marcel Lachemann, John McNamara, Terry Collins, and Mike Scioscia.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":2293615,"ranking":13,"query_text":"what does joe maddon use on his hair","passage_text":"The giveaway of a Joe Maddon Garden Gnome was such a hit at the ballpark earlier this season that the Rays had to do it again in August, in part because of his popularity, in part because he has a storybook quality to him, even beyond his record of success with a modest payroll.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7731668,"ranking":14,"query_text":"what does joe maddon use on his hair","passage_text":"Kyle Schwarber's road to the Fall Classic is simply remarkable. After his knee exploded in the first week of the season, all thoughts were on next year. But now he's anchoring Joe Maddon's lineup for the Cubs, looking as good as new.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7136574,"ranking":15,"query_text":"what does joe maddon use on his hair","passage_text":"Leave it to Joe Maddon to keep things fun and easy. Of course, thatâ\u0080\u0099s always a little bit easier when youâ\u0080\u0099re talking about one of the best young catchers in the game, Willson Contreras. Your browser does not support iframes.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7136579,"ranking":16,"query_text":"what does joe maddon use on his hair","passage_text":"Initially hesitant to mess with his famous follicles, Maddon finally decided to give the product a try after the Cubs lost their third straight series in San Francisco. Maddon began to adopt the blue-steel look before the start of the Cubs series in Arizona on Aug. 11, and his hair has been getting darker by the day. The early results have been promising, at least for the Cubs.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":8794473,"ranking":17,"query_text":"what does joe maddon use on his hair","passage_text":"One positive has been the emergence of rookie RF Kevin Kiermaier, who extended his hitting streak to five games Friday by stretching a grounder into a double and scoring the game's first run. He's probably playing offensively at maybe his highest level, Rays manaÂ­ger Joe Maddon said. The guy loves to play.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":2293614,"ranking":18,"query_text":"what does joe maddon use on his hair","passage_text":"At 11 a.m. on Sept. 11, 2013, Rays manager Joe Maddon is sitting in the dining area of his brand-new 40-foot Phaeton motor home, nursing his grande Pike Place from Starbucks, staring at his well-worn iPad (he's literally torn the cover off it) and contemplating the lineup for tonight's game against the Red Sox.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":7136578,"ranking":19,"query_text":"what does joe maddon use on his hair","passage_text":"Why Joe Maddon bats the pitcher eighth in the Cubs' lineup. 1  Facebook. 2  Twitter. 3  Facebook Messenger. 4  Email. 5  comment.","bm25_label":"high","relevance_label":0.0},{"query_id":1083535,"passage_id":2293619,"ranking":20,"query_text":"what does joe maddon use on his hair","passage_text":"Maddon takes off, and we drive on ahead to photograph him on the move. And he's moving at a nice clip, maybe 16 mph, as he passes the huge American flag, flying at half-staff on this day of remembrance. Anticipating his route, we stop just beyond the fort, about a mile up the road. But there's no sign of Joe.","bm25_label":"high","relevance_label":0.0}]