[{"query_id":1084624,"passage_id":8042690,"ranking":1,"query_text":"what do whales in the coral reef eat","passage_text":"Coral Reef Ecology. Coral Reef Biodiversity; Coral Polyps; Hard Corals; Soft Corals; How Reefs Are Made; What Do Coral Reefs Need to Survive? Where Are Coral Reefs Located? How Coral Reefs Grow; How Corals Reproduce; Types of Coral Reef Formations; Reef Threats. Global; Direct; Why Care About Reefs? Biodiversity; Coastal Protection; Food; Medicine; Tourism","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":7126558,"ranking":2,"query_text":"what do whales in the coral reef eat","passage_text":"No! Tadpoles do not eat coral reef, they eat the decomposedorganisms there, alongside with Algae.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":7411764,"ranking":3,"query_text":"what do whales in the coral reef eat","passage_text":"Belize is well-known to divers for the worldâ\u0080\u0099s largest blue hole, but its diving scene also features amazing coral reefs and whale shark adventures. Belize is well-known to divers for the worldâ\u0080\u0099s largest blue hole, but its diving scene also features amazing coral reefs and whale shark adventures.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":367271,"ranking":4,"query_text":"what do whales in the coral reef eat","passage_text":"What you can see in Western Australia. Visit Perth to enjoy parklands and beaches. Explore Margaret River for food, wine and surf beaches. Swim with Whale Sharks in Ningaloo and be awe-struck by the Kimberley.ive the Ningaloo Marine Park, which protects a 260km fringing reef off Western Australia's mid north coast. Snorkel through coral lagoons in Coral Bay, swim with the huge whale shark, and 4WD red... View more information. Discover Margaret River, Ningaloo Reef, Broome, Darwin or Sydney from Perth.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":5839795,"ranking":5,"query_text":"what do whales in the coral reef eat","passage_text":"Soft corals do not form reefs. Examples of this kind of coral include sea whips and sea fingers. Different Types of Coral Reefs When hard coral gathers together, it forms reefs. In this category of coral, there are different kinds of reefs that develop.When coral gathers about the coastline, it is referred to as a fringing reef.oft corals do not form reefs. Examples of this kind of coral include sea whips and sea fingers. Different Types of Coral Reefs When hard coral gathers together, it forms reefs. In this category of coral, there are different kinds of reefs that develop.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":2003702,"ranking":6,"query_text":"what do whales in the coral reef eat","passage_text":"Coral reefs are vitally important to the health of all oceans. Corals are a source of primary production, which is the base of the seas food web. Reef habitats are important in cycling nutrients and water quality, which are important to all species from the smallest plankton to the largest whales. Photo: NOAA.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":7126557,"ranking":7,"query_text":"what do whales in the coral reef eat","passage_text":"Coral reefs are vitally important to the health of all oceans. Corals are a source of primary production, which is the base of the seasâ\u0080\u0099 food web. Reef habitats are important in cycling nutrients and water quality, which are important to all species from the smallest plankton to the largest whales. Dolphin foraging.","bm25_label":"high","relevance_label":1.0},{"query_id":1084624,"passage_id":7252959,"ranking":8,"query_text":"what do whales in the coral reef eat","passage_text":"The reef is home to more than 400 types of coral, as well as coral sponges, mollusks, rays, dolphins, and a diverse array of tropical fish, birds, and reptiles. The reef is a breeding ground for humpback whales and a habitat for endangered species, such as the dugong (sea cow) and the large green sea turtle.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":1883766,"ranking":9,"query_text":"what do whales in the coral reef eat","passage_text":"Coral reefs are built by coral polyps as they secrete layers of calcium carbonate beneath their bodies. The corals that build reefs are known as â\u0080\u009chardâ\u0080\u009d or â\u0080\u009creef-buildingâ\u0080\u009d corals. Soft corals, such as sea fans and sea whips, do not produce reefs; they are flexible organisms that sometimes resemble plants or trees.oral reefs are built by coral polyps as they secrete layers of calcium carbonate beneath their bodies. The corals that build reefs are known as â\u0080\u009chardâ\u0080\u009d or â\u0080\u009creef-buildingâ\u0080\u009d corals. Soft corals, such as sea fans and sea whips, do not produce reefs; they are flexible organisms that sometimes resemble plants or trees.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":5839792,"ranking":10,"query_text":"what do whales in the coral reef eat","passage_text":"Different Types of Coral Reefs. When hard coral gathers together, it forms reefs. In this category of coral, there are different kinds of reefs that develop. When coral gathers about the coastline, it is referred to as a fringing reef.oft corals do not form reefs. Examples of this kind of coral include sea whips and sea fingers. Different Types of Coral Reefs When hard coral gathers together, it forms reefs. In this category of coral, there are different kinds of reefs that develop.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":1616622,"ranking":11,"query_text":"what do whales in the coral reef eat","passage_text":"Invasive Lionfish Diet Could Impact Native Coral Reef Fishes. The beauty of lionfish makes them very popular in the aquarium trade, and their introduction into Atlantic waters was likely due to release from private aquaria. Lionfish are uninvited visitors in Atlantic waters. Now, research suggests that the diet of these invasive fish could impact the distribution of other fish living in Bahamian coral reefs. The National Centers for Coastal Ocean Science and the Reef Environmental Education Foundation conducted a comprehensive study on what lionfish eat in Bahamian coral reef environments.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":3425153,"ranking":12,"query_text":"what do whales in the coral reef eat","passage_text":"3. Classify: A producer is an organism that makes its own energy, usually from sunlight. A consumer is an organism that gets energy by feeding on other organisms. A. Which of the reef organisms in this Gizmo are producers? algae B. Which of the reef organisms are consumers? all but algae C. Filter feeders: sponges Grazers: staghorn coral, star coral, parrotfish, urchins Predators: angelfish, snapper, grouper, sea turtle 4. Create: A food chain is a series that shows what organisms eat other organisms. For example, the food chain â\u0080\u009cgrass â\u0086\u0092 mouse â\u0086\u0092 hawkâ\u0080\u009d means that the mouse eats grass and the hawk eats the mouse. Create two possible food chains for the Caribbean coral reef based on what you have learned about the ten organisms in this Gizmo.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":2519493,"ranking":13,"query_text":"what do whales in the coral reef eat","passage_text":"(Redirected from Ahermatypic) Hermatypic corals or stony corals are reef-building corals, while corals that do not deposit aragonite structures and contribute to coral reef development are referred to as ahermatypic (non-reef-building) species. References â\u0086\u0091","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":2936071,"ranking":14,"query_text":"what do whales in the coral reef eat","passage_text":"   Great: The Great Barrier Reef is a large and vast coral reef: at  2000km long, it is the largest coral reef in the world.   Barrier: The Great Barrier Reef is a barrier reef. A barrier reef  is one which runs parallel to the shore, separated by a channel of  water.  Reef: The Great Barrier Reef is a coral reef.   When people say reef, they imply coral reef.. Corals, and other things like coralline algae, are what form reefs.     Corals are Cnidarians, the same ph â\u0080¦ ylum as anemones and jellyfish. Being a Cnidarian, a coral contains nematocysts to sting and capture prey in their tentacles.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":7126562,"ranking":15,"query_text":"what do whales in the coral reef eat","passage_text":"A coral reef is actually a collection of tiny organisms housed in calcified skeletons that, as a group, create the reefs that you see, as opposed to being a single organism.â\u0080¦ Thus, the tiny organisms called polyps are the ones doing the eating and do so by filtering through water for food particles.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":2519491,"ranking":16,"query_text":"what do whales in the coral reef eat","passage_text":"(Redirected from Ahermatypic) Jump to: navigation, search Hermatypic corals or stony corals are reef-building corals, while corals that do not deposit aragonite structures and contribute to coral reef development are referred to as ahermatypic (non-reef-building) species.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":5928057,"ranking":17,"query_text":"what do whales in the coral reef eat","passage_text":"Coral reefs are built by coral polyps as they secrete layers of calcium carbonate beneath their bodies. The corals that build reefs are known as â\u0080\u009chardâ\u0080\u009d or â\u0080\u009creef-buildingâ\u0080\u009d corals. Soft corals, such as sea fans and sea whips, do not produce reefs; they are flexible organisms that sometimes resemble plants or trees.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":8053993,"ranking":18,"query_text":"what do whales in the coral reef eat","passage_text":"Coral bleaching in the Red Sea is more common in the northern section of the reefs, the southern part of the reef has been plagued by coral eating starfish, dynamite fishing and human impacts on the environment.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":7167676,"ranking":19,"query_text":"what do whales in the coral reef eat","passage_text":"Artificial reefs and reef restoration. What is a reef? For review, a reef is a bar of sand, rock, coral, or similar material lying below the surface of a body of water. Most people immediately think coral reef when they hear the word reef, but there are many other types of reef. The below images show an oyster reef and a coral reef.","bm25_label":"high","relevance_label":0.0},{"query_id":1084624,"passage_id":2730284,"ranking":20,"query_text":"what do whales in the coral reef eat","passage_text":"â\u0080¢ The third trophic level in a coral reef ecosystem are the secondary consumers that eat primary consumers. These organisms typically include larger reef fishes(Barramundi),Trigger fish,Parrot fish,Surgeon fish, lobsters and sea turtles. â\u0080¢ The fourth trophic level in a coral reef ecosystem are the tertiary consumers that eat secondary consumers. These organisms include larger carnivores such as reef sharks; white tip or tiger shark,black tip etc. Decomposers. â\u0080¢ Fan worms, Crustaceans (which are the closest to decomposers in the coral reef) etc.","bm25_label":"high","relevance_label":0.0}]