[{"query_id":1085584,"passage_id":7117874,"ranking":1,"query_text":"carbon reactivation facilities california","passage_text":"With three spent carbon reactivation facilities (Darlington, PA, Parker, AZ and Red Bluff, CA), Evoqua Water Technologies is a leader in spent carbon reactivation. The Darlington and Parker facilities are both permitted to process RCRA hazardous spent carbon, making Evoqua the only supplier with permitted capacity serving both the East and West Coasts. The Red Bluff facility is the largest non-hazardous carbon reactivation facility in the western United States.","bm25_label":"high","relevance_label":1.0},{"query_id":1085584,"passage_id":7117880,"ranking":2,"query_text":"carbon reactivation facilities california","passage_text":"Carbon reactivation services for municipal and industrial customers including granular activated carbon reactivation, recycling and other carbon services. Operates two reactivation facilities, a testing laboratory and service centers. www.evoqua.com\/en\/brands\/IPS\/productinforma...","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":2060645,"ranking":3,"query_text":"carbon reactivation facilities california","passage_text":"In some cases, the spent GAC can be sent back to reactivation facilities for reactivation and reuse. The applications that Carbonair uses GAC to treat contaminated water and air flows are the following: Liquid Phase Carbon Vessels, Vapor Phase Carbon Vessels.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":7117879,"ranking":4,"query_text":"carbon reactivation facilities california","passage_text":"Reactivation Services Utilizing our indirect fired rotary kilns we provide spent non-hazardous reactivated carbon exchange and custom spent carbon reactivation services. All spent carbon accepted for reactivation must qualify as non-hazardous under Title 22 of the California Code of Regulations, Chapter 11, Article 3, 66261.24 Characteristics of Toxicity, and a Spent Carbon Profile Form must accompany test reports.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":7117871,"ranking":5,"query_text":"carbon reactivation facilities california","passage_text":"Spent Carbon Reactivation And Recycling. Evoqua Water Technologies operates three regional state-of-the-art reactivation and recycling facilities to handle RCRA hazardous and non-hazardous liquid and vapor phase spent carbon. In recent years, a variety of market dynamics have driven the cost of virgin activated carbon upward.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":5632502,"ranking":6,"query_text":"carbon reactivation facilities california","passage_text":"(s) Volatile organic compounds (VOC) means any compound of carbon, excluding carbon monoxide, carbon dioxide, carbonic acid, metallic carbides or carbonates, and ammonium carbonate, which participates in atmospheric photochemical reactions.herefore, the compounds identified in paragraph (s) of this section as negligibly reactive and excluded from EPA's definition of VOCs are to be counted towards a product's reactivity limit for the purposes of determining compliance with California's aerosol coatings reactivity-based regulation.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":7117877,"ranking":7,"query_text":"carbon reactivation facilities california","passage_text":"Features and Benefits. 1  Facilities meet and comply with all RCRA, Benzene NESHAP and Subpart CC requirements. 2  Limit liabilities - Certificate of Reactivation certifies processing meets or exceeds appropriate regulations. 3  Cost effective â\u0080\u0093 easy procedures for carbon profiling and acceptance.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":7117875,"ranking":8,"query_text":"carbon reactivation facilities california","passage_text":"Utilizing our indirect fired rotary kilns; we provide spent non-hazardous reactivated carbon exchange and custom spent carbon reactivation services. All spent carbon accepted for reactivation must qualify as non-hazardous.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":3000665,"ranking":9,"query_text":"carbon reactivation facilities california","passage_text":"Properties. Epoxyethane is very reactive becacuse of its structure. The ring between the two carbons and oxygen is very strained and the bond angle is forced to be much smaller than is normal in carbon. This means that it is very reactive; and the carbon-oxygen bond is also broken in reactions.poxyethane is very reactive becacuse of its structure. The ring between the two carbons and oxygen is very strained and the bond angle is forced to be much smaller than is normal in carbon. This means that it is very reactive; and the carbon-oxygen bond is also broken in reactions.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":7117873,"ranking":10,"query_text":"carbon reactivation facilities california","passage_text":"Spent non-hazardous reactivated carbon exchange & custom spent carbon reactivation services. Manufacturer of activated carbon for use in pollution control systems & industrial wastewater applications.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":887718,"ranking":11,"query_text":"carbon reactivation facilities california","passage_text":"CHEMICAL PROPERTIES OF ACIDS: 1. React with reactive metals (above H in Reactivity Series) to form Salt & Hydrogen Gas 2. React with Metal Carbonates to form Salt, Carbon Dioxide & Water.3. React with Bases\/Alkali to form Salt & Water (Neutralistion Reaction).HEMICAL PROPERTIES OF ACIDS: 1. React with reactive metals (above H in Reactivity Series) to form Salt & Hydrogen Gas 2. React with Metal Carbonates to form Salt, Carbon Dioxide & Water.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":2822545,"ranking":12,"query_text":"carbon reactivation facilities california","passage_text":"The method used to extract a metal from its ore depends on where the metal is in the reactivity series. Metals above Carbon in the Reactivity Series. A metal above carbon in the reactivity series (potassium, sodium, lithium, calcium, magnesium and aluminium) can be extracted by electrolysis.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":2137227,"ranking":13,"query_text":"carbon reactivation facilities california","passage_text":"Chemically some metals are more reactive than others. This can be deduced using the reactivity series of metals, which is an arrangement of metals (and carbon and hydrogen) from the most reactive to the least reactive. Any metal will displace another metal lower on the reactivity series from a solution of its ions. This does not apply to any metals that react with water, so can only be applied to magnesium and below. Using the displacement theory above we can also include carbon and hydrogen in the reactivity series.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":6396969,"ranking":14,"query_text":"carbon reactivation facilities california","passage_text":"Hydrocarbons that have 4 bonds to every carbon atom are called alkanes. These are the least reactive of the hydrocarbons. Hydrocarbons that have a double bond between two carbon atoms are called alkenes. These are more reactive than alkanes.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":2822547,"ranking":15,"query_text":"carbon reactivation facilities california","passage_text":"Metals above Carbon in the Reactivity Series. A metal above carbon in the reactivity series (potassium, sodium, lithium, calcium, magnesium and aluminium) can be extracted by electrolysis. Extraction of the metal from its ore involves reduction of the metal ions.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":247428,"ranking":16,"query_text":"carbon reactivation facilities california","passage_text":"Hydrocarbons that have 4 bonds to every carbon atom are called alkanes. These are the least reactive of the hydrocarbons. Hydrocarbons that have a double bond between two carbon atoms are called alkenes. These are more reactive than alkanes.Electron-poor molecules react at the pi bond of alkenes. Hydrocarbons that have a triple bond between two carbon atoms are called alkynes.ydrocarbons that have a double bond between two carbon atoms are called alkenes. These are more reactive than alkanes. Electron-poor molecules react at the pi bond of alkenes.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":7872731,"ranking":17,"query_text":"carbon reactivation facilities california","passage_text":"What Facilities are CoveredWhat Facilities are Covered. ï\u0081® Those Who Use Chemicals in Appendix A: A List of highly. hazardous chemicals, toxics and reactive (Mandatory). Contains a. listing of 137 toxic and reactive highly hazardous chemicals which. present a potential for a catastrophic event at or above the.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":7117872,"ranking":18,"query_text":"carbon reactivation facilities california","passage_text":"Carbon reactivation services. Reactivated carbon is available with bulk density ranging from 0.45 g\/cu.cm to 0.51 g\/cu.cm, 5 percent moisture, 3 mm x 4.5 mm particle size, 800 sq. m\/g substrate surface area, 50 percent carbon tetrachloride activity & 95 percent hardness.","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":2060637,"ranking":19,"query_text":"carbon reactivation facilities california","passage_text":"Liquid phase granular activated carbon or virgin\/reactivated impregnated granular activated carbon liquid adsorber vessels & vapor phase granular activated carbon or...","bm25_label":"high","relevance_label":0.0},{"query_id":1085584,"passage_id":4524454,"ranking":20,"query_text":"carbon reactivation facilities california","passage_text":"Double and triple bonds are known as functional groups, a term that is used to identify atoms or groups of atoms within a molecule that are sites of comparatively high reactivity. A second type of reactive site results when an atom other than carbon or hydrogen (termed a heteroatom) is bonded to carbon.","bm25_label":"high","relevance_label":0.0}]