[{"query_id":1085339,"passage_id":7119912,"ranking":1,"query_text":"what county is racine wv in","passage_text":"Find 11 listings related to Boone County Ambulance Authority in Racine on YP.com. See reviews, photos, directions, phone numbers and more for Boone County Ambulance Authority locations in Racine, WV. Start your search by typing in the business name below. What do you want to find?","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":7119906,"ranking":2,"query_text":"what county is racine wv in","passage_text":"Kanawha County Clerk 111 Court Street Charleston WV 25301 14.7 miles from Racine 304-357-0440. St Albans City Clerk 1499 Maccorkle Avenue St. Albans WV 25177 19.4 miles from Racine 304-722-3391. Chapmanville Clerk 349 Tiger Circle Chapmanville WV 25508 23.1 miles from Racine 304-855-4582.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":7279745,"ranking":3,"query_text":"what county is racine wv in","passage_text":"White Pine Millings is located at 119 Loghouse Rd, Racine, WV 25165.. This location is in Boone County and the Charleston, WV Metropolitan Area. Is there a key contact at White Pine Millings?","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":653451,"ranking":4,"query_text":"what county is racine wv in","passage_text":"Find 32 listings related to Racine County Sheriff Non Emergency in Racine on YP.com. See reviews, photos, directions, phone numbers and more for Racine County Sheriff Non Emergency locations in Racine, WI. Start your search by typing in the business name below. What do you want to find?","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":3824121,"ranking":5,"query_text":"what county is racine wv in","passage_text":"Sponsored Topics. Burlington is a city in Racine and Walworth counties in the U.S. state of Wisconsin, with the majority of the city located in Racine County. The population was 10,421 at the 2009 census. Prior to the arrival of Europeans in the area, Native American mounds were constructed in what is now Burlington.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":4073976,"ranking":6,"query_text":"what county is racine wv in","passage_text":"Racine County Breakfast on the Farm shared Agri-View's post. Racine County Breakfast on the Farm shared Racine County Agriculture Ambassador's post. Kayla Wilson, this years scholarship recipient is going above and beyond in her role as the Racine County Agriculture Ambassador.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":4088457,"ranking":7,"query_text":"what county is racine wv in","passage_text":"Burlington, WI. Online Offers. Burlington is a city in Racine and Walworth counties in the U.S. state of Wisconsin, with the majority of the city located in Racine County. The population was 10,421 at the 2009 census. Prior to the arrival of Europeans in the area, Native American mounds were constructed in what is now Burlington.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":323824,"ranking":8,"query_text":"what county is racine wv in","passage_text":"Burlington is a city in Racine and Walworth counties in the U.S. state of Wisconsin, with the majority of the city located in Racine County. The population of the portion of the city inside Racine County was 10,464 as of the 2010 census.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":2126804,"ranking":9,"query_text":"what county is racine wv in","passage_text":"Racine County, Wisconsin. Racine County is a county located in southeastern Wisconsin. As of the 2010 census, its population was 195,408, making it the fifth-most populous county in Wisconsin. Its county seat is Racine. The county was founded in 1836, then a part of the Wisconsin Territory.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":7581378,"ranking":10,"query_text":"what county is racine wv in","passage_text":"Burlington is a city in Racine and Walworth counties in the U.S. state of Wisconsin, with the majority of the city located in Racine County. The population of the portion of the city inside Racine County was 10,464 as of the 2010 census. 1 History.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":7119905,"ranking":11,"query_text":"what county is racine wv in","passage_text":"Racine, WV - Peer Comparisons by Rank and Percentile. The table below compares Racine to the other 405 incorporated cities, towns and CDPs in West Virginia by rank and percentile using July 1, 2017 data. The location Ranked # 1 has the highest value. A location that ranks higher than 75% of its peers would be in the 75th percentile of the peer group.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":3487058,"ranking":12,"query_text":"what county is racine wv in","passage_text":"Welcome to Racine County. Racine County is a mix of whatâ\u0080\u0099s best about Wisconsin and the Midwest. A prime location in southeastern Wisconsin, Racine County is located approximately 30 miles south of Milwaukee and 60 miles north of Chicago. Interstate 94 conveniently links the Racine County with Milwaukee, Madison, and Minneapolis to the west, and Chicago and Detroit to the east.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":3930607,"ranking":13,"query_text":"what county is racine wv in","passage_text":"The combined sales tax rate for Racine, WI is 5.1%. This is the total of state, county and city sales tax rates. The Wisconsin state sales tax rate is currently 5%. The Racine County sales tax rate is 0%. Racine sales tax rate is 0%. Other Cities in Racine County. Burlington; Caledonia; Franksville; Kansasville; Mount Pleasant; Racine; Rochester; Sturtevant","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":173444,"ranking":14,"query_text":"what county is racine wv in","passage_text":"Burlington, Wisconsin. Burlington is a city in Racine and Walworth counties in the U.S. state of Wisconsin,[4] with the majority of the city located in Racine County.[5] The population of the portion of the city inside Racine County was 10,464 as of the 2010 census.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":3387863,"ranking":15,"query_text":"what county is racine wv in","passage_text":"Racine, WI. Sponsored Topics. Racine is a city in and the county seat of Racine County, Wisconsin, United States. According to 2008 U.S. Census Bureau estimates, the city had a population of 82,196.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":4073979,"ranking":16,"query_text":"what county is racine wv in","passage_text":"Racine County Breakfast on the Farm shared Racine County Agriculture Ambassador's post. August 4 at 12:05pm Â·. Kayla Wilson, this years scholarship recipient is going above and beyond in her role as the Racine County Agriculture Ambassador.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":3930604,"ranking":17,"query_text":"what county is racine wv in","passage_text":"The combined sales tax rate for Racine County, WI is 5.1%. This is the total of state and county sales tax rates. The Wisconsin state sales tax rate is currently 5%. The Racine County sales tax rate is 0%. Cities in Racine County. Burlington; Caledonia; Franksville; Kansasville; Mount Pleasant; Racine; Rochester; Sturtevant; Union Grove; Waterford; Wind Lake; Wind Point","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":2388602,"ranking":18,"query_text":"what county is racine wv in","passage_text":"March of Dimes to hold biggest annual fundraiser at Racine County Zoo to help babies be born healthy Kenosha County Executive Jim Kreuser and Racine County Executive Jonathan Delagrave are asking residents in both counties to consider participating in the 2017 March for Babies on April 29 at the Racine County Zoo.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":3824115,"ranking":19,"query_text":"what county is racine wv in","passage_text":"For the second capital of Wisconsin Territory, see Burlington, Iowa. Burlington is a city in Racine and Walworth counties in the U.S. state of Wisconsin, with the majority of the city located in Racine County. The population of the portion of the city inside Racine County was 10,464 as of the 2010 census. 1 History.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085339,"passage_id":3387865,"ranking":20,"query_text":"what county is racine wv in","passage_text":"Racine, Wisconsin. Racine (\/Ë\u0088reÉªsiË\u0090n\/ RAY-seen) or (\/rÉ\u0099Ë\u0088siË\u0090n\/ rÉ\u0099-SEEN) is a city in and the county seat of Racine County, Wisconsin, United States. It is located on the shore of Lake Michigan at the mouth of the Root River. Racine is located 22 miles south of Milwaukee.","bm25_label":"medium","relevance_label":0.0}]