[{"query_id":1085454,"passage_id":274364,"ranking":1,"query_text":"what county is lumberton, nc","passage_text":"Robeson County is the largest county in the U.S. state of North Carolina. As of the 2010 census, the population was 134,168. Its county seat is Lumberton. The county was formed in 1787 from part of Bladen County. It was named in honor of Col. Thomas Robeson of Tar Heel, North Carolina, a hero of the Revolutionary War. Robeson County comprises the Lumberton, NC Micropolitan Statistical Area, which is included in the Fayetteville-Lumberton-Laurinburg, NC Combined Statistical Area.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":8699143,"ranking":2,"query_text":"what county is lumberton, nc","passage_text":"View a list of ZIP codes in Lumberton, NC; Lumberton, NC ZIP Code Boundaries; Download Lumberton, NC ZIP Code Database","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":8699146,"ranking":3,"query_text":"what county is lumberton, nc","passage_text":"City of Lumberton, NC - ROBESON County North Carolina ZIP Codes. Detailed information on every zip code in Lumberton Home | Products | Learn About ZIP Codes | Find a Post Office | Search | Contact | FAQs","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7487839,"ranking":4,"query_text":"what county is lumberton, nc","passage_text":"Robeson County Jail â\u0080\u0093 Lumberton, NC. December 19, 2011 By Leave a Comment. Robeson County Jail is located in Robeson County, North Carolina and is the primary jail for the area.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":2944962,"ranking":5,"query_text":"what county is lumberton, nc","passage_text":"Scotland County is a county located in the U.S. state of North Carolina. As of the 2010 census, the population was 36,157. Its county seat is Laurinburg. Scotland County comprises the Laurinburg, NC Micropolitan Statistical Area, which is also included in the Fayetteville-Lumberton-Laurinburg, NC Combined Statistical Area.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":6877621,"ranking":6,"query_text":"what county is lumberton, nc","passage_text":"Robeson County Tax Office. 500 N Elm St, Room 103. Lumberton, NC 28358. Phone: 910.671.3060. Robeson County GIS Information. Robeson County GIS Data Distribution Agreement.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":475124,"ranking":7,"query_text":"what county is lumberton, nc","passage_text":"1 result for Vision Center At Walmart in Lumberton, NC 1 result for Vision Center At Walmart in Lumberton, NC View Map","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7267679,"ranking":8,"query_text":"what county is lumberton, nc","passage_text":"Lumberton Mobile & Manufactured homes for Sale There are 238 real estate listings found in Lumberton, NC. View our Lumberton real estate area information to learn about the weather, local school districts, demographic data, and general information about Lumberton, NC. Get in touch with a Lumberton real estate agent who can help you find the home of your dreams in Lumberton.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7181101,"ranking":9,"query_text":"what county is lumberton, nc","passage_text":"Cumberland County Assessor's Office PO Box 449 Fayetteville NC 28302 14.4 miles from Lumber Bridge 910-321-6804. Robeson County Assessor's Office 500 North Elm Street Lumberton NC 28358 19.0 miles from Lumber Bridge 910-671-3060.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7118997,"ranking":10,"query_text":"what county is lumberton, nc","passage_text":"Detention Center. Robeson County Detention Center. The Robeson County Detention Center currently may house 420 inmates and is located at : 122 Legend Rd, Lumberton, NC 28358. Phone â\u0080\u0093 (910) 671-3130.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7119006,"ranking":11,"query_text":"what county is lumberton, nc","passage_text":"Lumberton, NC Robeson County Nc. YP - The Real Yellow PagesSM - helps you find the right local businesses to meet your specific needs. Search results are sorted by a combination of factors to give you a set of choices in response to your search criteria.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7119005,"ranking":12,"query_text":"what county is lumberton, nc","passage_text":"7 Building Permits for Lumberton, NC View All ; In 2014, the city of Lumberton, NC issued 7 building permits. All permits issued were for Single Family Homes. All permits issued were for Single Family Homes. In 2013, the city of Lumberton, NC issued 13 building permits. All permits issued were for Single Family Homes. All permits issued were for Single Family Homes.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":370764,"ranking":13,"query_text":"what county is lumberton, nc","passage_text":"Here is jail inmate information for the Lumberton Correctional Institution. Lumberton Correctional Institution is located at 75 Legend Road Box 1649 Lumberton, NC, 28359, in , North Carolina and has the capacity of 768 beds.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":242779,"ranking":14,"query_text":"what county is lumberton, nc","passage_text":"Bladen County Clerk PO Box 1048 Elizabethtown NC 28337 10.1 miles from White Oak 910-862-6702. Robeson County Clerk 701 North Elm Street Lumberton NC 28358 18.4 miles from White Oak 910-671-3022. Pembroke Town Clerk 100 Union Chapel Road Pembroke NC 28372 27.1 miles from White Oak 910-521-9758.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7487831,"ranking":15,"query_text":"what county is lumberton, nc","passage_text":"Robeson County NC Jail is located in the city of Lumberton, North Carolina which has a population of 21,542 (as of 2015) residents. This prison has a capacity of 410 inmates, which means this is the maximum amount of beds per facility.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7267681,"ranking":16,"query_text":"what county is lumberton, nc","passage_text":"Find homes for sale and real estate in Lumberton, NC at realtor.comÂ®. Search and filter Lumberton homes by price, beds, baths and property type.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":8699149,"ranking":17,"query_text":"what county is lumberton, nc","passage_text":"Compare deals from five residential internet service providers in Lumberton, NC including Charter, AT&T and Horry Telephone Cooperative. Compare deals from five residential internet service providers in Lumberton, NC including Charter, AT&T and Horry Telephone Cooperative.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":1912851,"ranking":18,"query_text":"what county is lumberton, nc","passage_text":"Welcome to COMTech Business Park, located in the heart of Robeson County, NC near the I-95\/I-74 interchange. Weâ\u0080\u0099re a business, industrial, and technology park that caters to a diverse group of thriving businesses. We are located between Lumberton and Pembroke, NC and are home to many businesses. From healthcare to education, agriculture to accounting and more, COMtech Business Park is where youâ\u0080\u0099ll find the best Robeson County has to offer.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":7119000,"ranking":19,"query_text":"what county is lumberton, nc","passage_text":"Lumberton, NC County Parish Government. About Search Results. YP - The Real Yellow PagesSM - helps you find the right local businesses to meet your specific needs. Search results are sorted by a combination of factors to give you a set of choices in response to your search criteria.","bm25_label":"medium","relevance_label":0.0},{"query_id":1085454,"passage_id":1942389,"ranking":20,"query_text":"what county is lumberton, nc","passage_text":"Welcome to Holiday Inn Lumberton North - I-95. Whether you're coming to Lumberton for business or traveling on I-95, you'll find a comfortable stay at the Holiday InnÂ® hotel in Lumberton, NC. Our hotel's location near I-95 businesses, attractions and restaurants and our spacious rooms ensure a convenient stay.","bm25_label":"medium","relevance_label":0.0}]