[{"query_id":1085422,"passage_id":7119324,"ranking":1,"query_text":"what county is new london tx","passage_text":"New London is located in Rusk County, TX. The population is 1,126, making New London the 2nd largest city in Rusk County. There are 5 public schools in New London with an average Homefacts rating of B-. The total crime rate for New London is , and there are 2 registered sex offenders residing in the city.","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":7119316,"ranking":2,"query_text":"what county is new london tx","passage_text":"New London, TX Homefacts Overview of Rusk County includes data on offenders, schools, foreclosures, environmental hazards, and more.","bm25_label":"high","relevance_label":1.0},{"query_id":1085422,"passage_id":6952012,"ranking":3,"query_text":"what county is new london tx","passage_text":"1 What's the time difference between hawaii & tx. 2  What is the time difference between London and New York? 3  What's the time difference between new york and florida. 4  What is the time difference between new york and ohio?  What is the time difference between ny and hawaii.","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":7119325,"ranking":4,"query_text":"what county is new london tx","passage_text":"10750 S Main St, New London, New London, TX 75682: Email: cityofnewlondon@aol.com: Comments","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":2877437,"ranking":5,"query_text":"what county is new london tx","passage_text":"LONDON, TX (KIMBLE COUNTY) LONDON, TEXAS (Kimble County). London, also known as London Town, is a farming community on U.S. Highway 377 about eighteen miles northeast of Junction in northeastern Kimble County. The town was established in the late 1870s or early 1880s by Len L. Lewis, a horse trader and former officer in the Union Army who moved to the area in 1878.","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":7119323,"ranking":6,"query_text":"what county is new london tx","passage_text":"Unemployment for New London, TX Unemployment in New London is 4.1%. It is higher than the state and national averages, 3.7% and 4.1% respectively","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":218182,"ranking":7,"query_text":"what county is new london tx","passage_text":"N3215 County Road D New London, WI 54961: N3219 County Road D New London, WI 54961: N3253 County Road D New London, WI 54961: N3273 County Road D New London, WI 54961: N3313 County Road D New London, WI 54961: N3331 County Road D New London, WI 54961: N3501 County Road D New London, WI 54961: N3508 County Road D New London, WI 54961","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":899379,"ranking":8,"query_text":"what county is new london tx","passage_text":"Town of Old Lyme CT; 52 Lyme St, Old Lyme, CT 06371. Town Links and Information. Map of Old Lyme; Lyme \/ Old Lyme Chamber of Commerce; Old Lyme Historical Society; Zip Code: 06371 New London County Directories. Attractions in New London County; Chambers of Commerce in New London County; Education in New London County; Event Sites in New London County; Golf Courses in New London County; Historical Societies in New London County; Hotels in New London County","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":7119319,"ranking":9,"query_text":"what county is new london tx","passage_text":"New London Municipal Court Mail: Po Box 428, New London, TX 75682; Map ...; Phone ...; Neighboring to Overton, Arp, Carlisle Turnertown, Kilgore, Henderson, and Sabine; ...","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":7268249,"ranking":10,"query_text":"what county is new london tx","passage_text":"New Braunfels, TX is in the central part of Texas in the west south central United States Is In New Braunfels, TX These Counties: Comal County, Guadalupe County","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":218178,"ranking":11,"query_text":"what county is new london tx","passage_text":"U.S. City: New London, WI. State: New London, WI is in the central part of Wisconsin in the east north central United States. Is In New London, WI These Counties: Waupaca County, Outagamie County. ZIP Codes for New London, WI:","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":1004954,"ranking":12,"query_text":"what county is new london tx","passage_text":"Viewing Tweets won't unblock @TravisCountyTX. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TXâ\u0080\u008fVerified account @TravisCountyTX Aug 29. #TravCo speaking with Planning and Budget about budget amendments and transfers, specifically what is happening in wake of #Harvey (Item 12) Thanks. Twitter will use this to make your timeline better.","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":1693945,"ranking":13,"query_text":"what county is new london tx","passage_text":"Galveston County, TX Property Tax information Galveston County, TX Property Tax Search by Address See what the tax bill is for any Galveston County, TX property by simply typing its address into a search bar!","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":899378,"ranking":14,"query_text":"what county is new london tx","passage_text":"Old Lyme is located in New London County Connecticut. Connecticut > New London County > Old Lyme, CT Old Lyme Connecticut Offical Town Website. Town of Old Lyme CT; 52 Lyme St, Old Lyme, CT 06371. Town Links and Information. Map of Old Lyme; Lyme \/ Old Lyme Chamber of Commerce; Old Lyme Historical Society; Zip Code: 06371 New London County Directories. Attractions in New London County; Chambers of Commerce in New London County","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":4703138,"ranking":15,"query_text":"what county is new london tx","passage_text":"Lubbock County, TX. State: Lubbock County, TX is in the northern part of Texas in the west south central United States. Closest City to the Center of Lubbock County, TX: Lubbock, Texas. Cities in Lubbock County, TX: Lubbock, Buffalo Springs, New Deal, Idalou, Ransom Canyon, Shallowater, Wolfforth, Slaton, Abernathy.","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":218185,"ranking":16,"query_text":"what county is new london tx","passage_text":"New London, WI is in the central part of Wisconsin in the east north central United States Is In New London, WI These Counties: Waupaca County, Outagamie County","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":7119322,"ranking":17,"query_text":"what county is new london tx","passage_text":"New London, Rusk County, Texas: Browse Thousands of Acres of Land for Sale in New London, Rusk County, Texas.","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":4917682,"ranking":18,"query_text":"what county is new london tx","passage_text":"Due to this outward expansion, in 1965 the old County of London (which by now only covered part of the London conurbation) and the London County Council were abolished, and the much larger area of Greater London was established with a new Greater London Council (GLC) to administer it, along with 32 new London boroughs.","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":4715171,"ranking":19,"query_text":"what county is new london tx","passage_text":"What County Is Donna Texas In Donna, texas wikipedia, donna is a city in hidalgo county, texas, united states the population was 15,798 at the 2010 census. City of donna, hidalgo county, tx public records, search city of donna, tx, criminal and public records access citywide free arrest, police reports, open warrants and court searches. Donna, tx donna, texas map & directions mapquest, donna is a city in hidalgo county, texas, united states the population was 15,798 at the 2010 census the city's motto is the heart of the valley. Donna, texas, city news, government information, resources for visitors, and","bm25_label":"high","relevance_label":0.0},{"query_id":1085422,"passage_id":4938551,"ranking":20,"query_text":"what county is new london tx","passage_text":"Home Care Assistance of Denton County, Highland Village, TX shared New York Post's video. The benefits of practicing yoga are incredible. Watch the video to see the transformation of this grandmother living with scoliosis. Home Care Assistance of Denton County, Highland Village, TX added a new photo. Home Care Assistance of Denton County, Highland Village, TX shared Unforgettable.org's post.","bm25_label":"high","relevance_label":0.0}]