[{"query_id":1085796,"passage_id":7115948,"ranking":1,"query_text":"what company was skittles made by?","passage_text":"Answers.com Â® WikiAnswers Â® Categories Food & Cooking Desserts, Snacks, and Treats Candy Skittles Skittles is made by what company? What would you like to do? Flag","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":7115950,"ranking":2,"query_text":"what company was skittles made by?","passage_text":"Skittles are made by The William Wrigley Jr. Company, which is owned by Mars Inc. Skittles are made by The William Wrigley Jr. Company, which is owned by Mars Inc.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":765210,"ranking":3,"query_text":"what company was skittles made by?","passage_text":"Skittles History. Skittles were first made commercially in 1974 by a British company. They were then introduced in North America in 1979 as an import confectionery. Finally in 1982, domestic production of Skittles began in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":765218,"ranking":4,"query_text":"what company was skittles made by?","passage_text":"Skittles were first made commercially in 1974 by a British company. They were then introduced in North America in 1979 as an import confectionery. Finally in 1982, domestic production of Skittles began in the United States. Today they are made by Wrigley.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":7115943,"ranking":5,"query_text":"what company was skittles made by?","passage_text":"Skittles are small chewy candies in a package of original fruit flavors which are grape, green apple, lemon, orange and strawberry. Taste the rainbow of fruit flavors! Skittles History. Skittles were first made commercially in 1974 by a British company. They were then introduced in North America in 1979 as an import confectionery. Finally in 1982, domestic production of Skittles began in the United States. Today they are made by Wrigley.","bm25_label":"high","relevance_label":1.0},{"query_id":1085796,"passage_id":7115945,"ranking":6,"query_text":"what company was skittles made by?","passage_text":"Skittles are small chewy candies in a package of original fruit flavors which are grape, green apple, lemon, orange and strawberry. Taste the rainbow of fruit flavors!. Skittles were first made commercially in 1974 by a British company. They were then introduced in North America in 1979 as an import confectionery. Finally in 1982, domestic production of Skittles began in the United States. Today they are made by Wrigley.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":7263017,"ranking":7,"query_text":"what company was skittles made by?","passage_text":"Skittles were first made commercially in 1974 by a British company. They were first introduced in North America in 1979 as an import confectionery. In 1982, domestic productio â\u0080¦ n of Skittles began in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":2720474,"ranking":8,"query_text":"what company was skittles made by?","passage_text":"Skittles. Skittles is a brand of chewy fruit flavored candies made by The MARS Company. They have hard, colorful shells which have the letter S on them. They come in many different flavors, some of which are covered in a sour powder, made from citric acid.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":7115951,"ranking":9,"query_text":"what company was skittles made by?","passage_text":"Skittles now fall under the Wrigley umbrella. This is the first time since the Wrigley acquisition that U.S. production capacity for Skittles has expanded. Skittles for the United States are currently made in Waco, Texas, and will continue to be made there, Wrigley said. Over the past five years, the company has seen double-digit percentage sales growth globally for Skittles, the brightly-colored chewy candies with crisp shells. Sales in the United States continue to accelerate, Wrigley said. Skittles was recently announced as an official sponsor of the National Football League. Snickers, another candy made by Mars, has been an NFL sponsor since 2003. Skittles are made at six facilities around the world, including the one in Waco. Wrigley already added more capacity to make Skittles at a factory in Yonghe, China, in 2012 and plans to add production in a facility in Porici, Czech Republic, in 2015.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":5514429,"ranking":10,"query_text":"what company was skittles made by?","passage_text":"What are Skittles Made of. Skittles are a popular confectionery product, first made in Britain. They were introduced into the United States not long after and were an instant hit. Today they are a part of Mars Inc., and are produced and marketed by Wrigley.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":5514425,"ranking":11,"query_text":"what company was skittles made by?","passage_text":"What are Skittles made out of? Despite the differences in flavor the main ingredients of Skittles do not change. Like many other candy products, about 98% of each Skittle consists of sugar, corn syrup and hydrogenated palm kernel oil.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":6092645,"ranking":12,"query_text":"what company was skittles made by?","passage_text":"History and overview. Skittles were first made commercially in 1974 by a British company. They were first introduced in North America in 1979 as an import confectionery. In 1982, domestic production of Skittles began in the United States. Skittles' taste the rainbow theme was created by New York ad agency D'Arcy Masius Benton & Bowles.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":5950852,"ranking":13,"query_text":"what company was skittles made by?","passage_text":"What are the average number of candies in a bag of Skittles? A standard 2-ounce bag of Skittles has an average of 54 candies per bag. Skittles are candy-coated, fruit-flavored chewy candy that debuted in 1979. They are made by Wrigley and are part of the Mars, Inc. brand of candies.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":5514431,"ranking":14,"query_text":"what company was skittles made by?","passage_text":"18 Nov, 2011 how is 0. Skittles are a popular confectionery product, first made in Britain. They were introduced into the United States not long after and were an instant hit. Today they are a part of Mars Inc., and are produced and marketed by Wrigley. Apart from the popular original flavor still available today, Skittles are also available in other flavors such as Wild Berry and Tropical. If you have ever wondered what Skittles are made of, keep reading to find out.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":8202232,"ranking":15,"query_text":"what company was skittles made by?","passage_text":"So, where did Skittles originate from? Surprisingly, Skittles is a relatively young candy in America. They were first made in 1974 in Britain and were imported to America in 1979. By 1982 Skittles were being made domestically and we were all invited to â\u0080\u009ctaste the rainbow.â\u0080\u009d Skittles now come in many different flavors, including: Original","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":8202235,"ranking":16,"query_text":"what company was skittles made by?","passage_text":"Surprisingly, Skittles is a relatively young candy in America. They were first made in 1974 in Britain and were imported to America in 1979. By 1982 Skittles were being made domestically and we were all invited to â\u0080\u009ctaste the rainbow.â\u0080\u009d Skittles now come in many different flavors, including: Original; Tropical; Wild Berry; Crazy Cores; Sour Skittles","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":6092641,"ranking":17,"query_text":"what company was skittles made by?","passage_text":"They have hard sugar shells and inside mainly contains sugar, corn syrup, and hydrogenated palm kernel oil. Skittles have no vitamin a, proteins, or calcium. There is over 47,000 bags of skittles made each day and more than 200,000,000 individual skittles made each day. And to put the coating of the skittles on it takes around 8 hours. The original fruit flavor skittles consist of orange, lemon, lime, grape, and strawberry. Later on different\/new flavors were introduced.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":902056,"ranking":18,"query_text":"what company was skittles made by?","passage_text":"Skittles is a brand of chewy fruit flavored candies made by The MARS Company. They have hard, colorful shells which have the letter S on them. They come in many different flavors, some of which are covered in a sour powder, made from citric acid.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":8202238,"ranking":19,"query_text":"what company was skittles made by?","passage_text":"Although the makers of Skittles would like us to think that they come from rainbows, thatâ\u0080\u0099s not really true. So, where did Skittles originate from? Surprisingly, Skittles is a relatively young candy in America. They were first made in 1974 in Britain and were imported to America in 1979. By 1982 Skittles were being made domestically and we were all invited to â\u0080\u009ctaste the rainbow.â\u0080\u009d. Skittles now come in many different flavors, including: 1  Original. 2  Tropical. 3  Wild Berry. 4  Crazy Cores. 5  Sour Skittles.","bm25_label":"high","relevance_label":0.0},{"query_id":1085796,"passage_id":8202231,"ranking":20,"query_text":"what company was skittles made by?","passage_text":"By 1982 Skittles were being made domestically and we were all invited to â\u0080\u009ctaste the rainbow.â\u0080\u009d Skittles now come in many different flavors, including: Original; Tropical; Wild Berry; Crazy Cores; Sour Skittles; Did you know that if you buy Original Skittles in England, the purple Skittle is Black Currant flavor and not grape?","bm25_label":"high","relevance_label":0.0}]