[{"query_id":1085780,"passage_id":2356679,"ranking":1,"query_text":"what conference is bryant for football","passage_text":"Bear Bryant. Paul William Bear Bryant (September 11, 1913 â\u0080\u0093 January 26, 1983) was an American college football player and coach. He was best known as the longtime head coach of the University of Alabama football team. During his 25-year tenure as Alabama's head coach, he amassed six national championships and thirteen conference championships.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":7116118,"ranking":2,"query_text":"what conference is bryant for football","passage_text":"A member of the Northeast Conference, Bryant University sponsors teams in eleven men's and eleven women's NCAA sanctioned sports: Men's Intercollegiate Sports. Baseball (go to Bulldogs baseball) Basketball (go to Bulldogs men's basketball) Cross Country. Football (go to Bulldogs football) Golf.","bm25_label":"high","relevance_label":1.0},{"query_id":1085780,"passage_id":5095441,"ranking":3,"query_text":"what conference is bryant for football","passage_text":"Alabama experienced a slight dip in football game attendance at Bryant-Denny Stadium this season. Alabama averaged 101,112 fans per game this season, a decrease by less than one percent from 2014. Alabama announced attendances of 101,821 for all of its conference games.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":7116116,"ranking":4,"query_text":"what conference is bryant for football","passage_text":"Bryant competed in the Northeast-10 Conference from the conference's founding in 1980 until 2008 when the university began the transition to Division I. In 2012, Bryant became a full Division I member.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":4215829,"ranking":5,"query_text":"what conference is bryant for football","passage_text":"Dez Bryant Net Worth is .. Desmond Demond Bryant (born November 4, 1988) is an American football wide receiver for the Dallas Cowboys of the National Football League (NFL). He played college football for Oklahoma State University, and earned All-American honors. He was chosen by ...","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":7116112,"ranking":6,"query_text":"what conference is bryant for football","passage_text":"Bryant Bulldogs. The Bryant Bulldogs are the athletic teams representing Bryant University in Smithfield, Rhode Island. The Bulldogs are currently in NCAA Division I reclassification process and compete at the Division I level as a member of the Northeast Conference.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":4215833,"ranking":7,"query_text":"what conference is bryant for football","passage_text":"Dez Bryant. Desmond Demond Dez Bryant (born November 4, 1988) is an American football wide receiver for the Dallas Cowboys of the National Football League (NFL). He played college football at Oklahoma State, where he earned All-American honors in 2008. He was drafted by the Cowboys in the first round of the 2010 NFL Draft.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":7231765,"ranking":8,"query_text":"what conference is bryant for football","passage_text":"Dez Bryant. Desmond Demond Bryant (born November 4, 1988) is an American football wide receiver for the Dallas Cowboys of the National Football League (NFL). He played college football at Oklahoma State, where he earned All-American honors in 2008. He was drafted by the Cowboys in the first round of the 2010 NFL Draft.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":1743726,"ranking":9,"query_text":"what conference is bryant for football","passage_text":"Meet Kris Bryant's girlfriend, Jessica Delp. In a press conference prior to his Major League Baseball debut, Chicago Cubs super prospect Kris Bryant mentioned that he has a girlfriend. Bryant, a handsome 23-year-old millionaire, was immediately chastised by some on social media. Kris Bryant saying in his first press conference he has a girlfriend. Definitely showing signs of being a rookie there. Nonetheless, Bryantâ\u0080\u0099s girlfriendâ\u0080\u0099s name is Jessica Delp â\u0080\u0094 and the two have been together for more than six years.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":5509493,"ranking":10,"query_text":"what conference is bryant for football","passage_text":"What's wrong with football? It's written in the pain on Greg Hadley's face. The senior from Colgate University, a two-time all-conference linebacker on the school's football team, is sitting in a Bedford, Mass., laboratory, staring at shattered brains of dead football players.he senior from Colgate University, a two-time all-conference linebacker on the school's football team, is sitting in a Bedford, Mass., laboratory, staring at shattered brains of dead football players.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":4869284,"ranking":11,"query_text":"what conference is bryant for football","passage_text":"Dez Bryant's House. Dez Bryant is is an American football wide receiver for the Dallas Cowboys of the NFL. According to public documents this is the house where he resides. The owner is David Wells, Bryant's mentor. Regarded as a four-star recruit by Rivals.com, Bryant was listed as the No. 9 wide receiver prospect in the class of 2007.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":4991435,"ranking":12,"query_text":"what conference is bryant for football","passage_text":"1 In addition to NCAA college football, many high school play-off and championship football games are held at Bryant-Denny Stadium.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":3891510,"ranking":13,"query_text":"what conference is bryant for football","passage_text":"American Football Conference. The American Football Conference (AFC) is one of the two conferences of the National Football League (NFL), the highest professional level of American football in the United States. This conference and its counterpart, the National Football Conference (NFC), currently contain 16 teams each, making up the 32 teams of the NFL.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":1980597,"ranking":14,"query_text":"what conference is bryant for football","passage_text":"Sports. 1  American Football Conference, a professional American football league. 2  National Football Conference, a professional American football league. 3  Athletic conference, a competitive grouping of teams, often geographical. 4  Football Conference, an English football league, known since 2015 as the National League.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":6807558,"ranking":15,"query_text":"what conference is bryant for football","passage_text":"The National Football League (NFL) is a professional American football league consisting of 32 teams, divided equally between the National Football Conference (NFC) and the American Football Conference (AFC).he National Football League (NFL) is a professional American football league consisting of 32 teams, divided equally between the National Football Conference (NFC) and the American Football Conference (AFC).","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":8758253,"ranking":16,"query_text":"what conference is bryant for football","passage_text":"Leslie Bryant has a somewhat more legitimate claim. There is, indeed, a photo of a UC football player - Leslie Bryant himself - in the Oct. 14, 1913, Cincinnati Post. In both instances, however, it's clear that Bear Cat is a personal nickname for Mr. Bryant - not a team name.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":7031461,"ranking":17,"query_text":"what conference is bryant for football","passage_text":"Ute Conference a Model for USA Football. Viking Youth Football and the Ute Conference recently announced Viking Youth Football teams would compete in the Ute Conference as its 34th football district.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":442384,"ranking":18,"query_text":"what conference is bryant for football","passage_text":"NFC stands for National Football Conference, while AFC is short for American Football Conference. The two are conferences of the National Football League, and each comprises 16 football teams that play in the NFL. Continue Reading.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":258265,"ranking":19,"query_text":"what conference is bryant for football","passage_text":"The National Football League (NFL) is a professional American football league consisting of 32 teams, divided equally between the National Football Conference (NFC) and the American Football Conference (AFC).fter the league merged, it was reorganized into two conferences: the National Football Conference (NFC), consisting of most of the pre-merger NFL teams, and the American Football Conference (AFC), consisting of all of the AFL teams as well as three pre-merger NFL teams.","bm25_label":"high","relevance_label":0.0},{"query_id":1085780,"passage_id":7116111,"ranking":20,"query_text":"what conference is bryant for football","passage_text":"The Bryant Bulldogs are the athletic teams representing Bryant University in Smithfield, Rhode Island. The Bulldogs compete at the Division I level as a member of the Northeast Conference. Bryant's largest rivalry during its Division II years was Bentley College, both founders of the Northeast-10 and both have prominent business programs. Bryant University athletics started out as a member of the National Association of Intercollegiate Athletics before it transitioned into Division II. Bryant co","bm25_label":"high","relevance_label":0.0}]