[{"query_id":1085279,"passage_id":2466249,"ranking":1,"query_text":"what county is stacy minnesota","passage_text":"Stacy, Minnesota. Stacy is a city in Chisago County, Minnesota, United States, along the Sunrise River. The population was 1,456 at the 2010 census. Interstate 35 serves as a main route for the community.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7120427,"ranking":2,"query_text":"what county is stacy minnesota","passage_text":"Stacy, MN Other Information. Located in CHISAGO County, Minnesota; Stacy, MN is also known as: LENT, MN; MARTIN LAKE, MN","bm25_label":"high","relevance_label":1.0},{"query_id":1085279,"passage_id":7269348,"ranking":3,"query_text":"what county is stacy minnesota","passage_text":"Stacy, Minnesota is located in Chisago County. Zip codes in Stacy, MN include 55079, and 55078. The median home price in Stacy is $6 which is roughly $6\/per square foot.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7120426,"ranking":4,"query_text":"what county is stacy minnesota","passage_text":"Stacy, MN Other Information. 1  Located in CHISAGO County, Minnesota. 2  Stacy, MN is also known as: 3  LENT, MN. 4  MARTIN LAKE, MN.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7120424,"ranking":5,"query_text":"what county is stacy minnesota","passage_text":"City of Stacy, MN - CHISAGO County Minnesota ZIP Codes. Detailed information on every zip code in Stacy Home | Products | Learn About ZIP Codes | Find a Post Office | Search | Contact | FAQs","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7120428,"ranking":6,"query_text":"what county is stacy minnesota","passage_text":"At the time of the 2010 Census, Stacy had a population of 1,456 people. This makes Stacy the county's 6th most populous community. The population of Stacy represents 0.03% of the population of Minnesota (which has 5,303,925 people), making it the state's 297th most populous community. With a 2010 count of 1,456 people, the population of Stacy increased 13.93% from the 2000 Census (which had a count of 1,278 people).","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7120431,"ranking":7,"query_text":"what county is stacy minnesota","passage_text":"Stacy is located in southeast Minnesota. Stacy is between the Chisago, Washington, Anoka, Isanti county. Stacy has 3.51 square miles of land area and 0.07 square miles of water area. As of 2010-2014, the total Stacy population is 1,539, which has grown 20.42% since 2000. The population growth rate is much higher than the state average rate of 9.44% and is much higher than the national average rate of 11.61%.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7269352,"ranking":8,"query_text":"what county is stacy minnesota","passage_text":"Driving distance from Stacy, MN to Minneapolis, MN The total driving distance from Stacy, MN to Minneapolis, MN is 38 miles or 61 kilometers. Your trip begins in Stacy, Minnesota.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7269345,"ranking":9,"query_text":"what county is stacy minnesota","passage_text":"Driving distance from Stacy, MN to Minneapolis, MN. The total driving distance from Stacy, MN to Minneapolis, MN is 38 miles or 61 kilometers. Your trip begins in Stacy, Minnesota. It ends in Minneapolis, Minnesota. If you are planning a road trip, you might also want to calculate the total driving time from Stacy, MN to Minneapolis, MN so you can see when you'll arrive at your destination.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":2466252,"ranking":10,"query_text":"what county is stacy minnesota","passage_text":"Recent posts about Stacy, Minnesota on our local forum with over 2,000,000 registered users. Stacy is mentioned 13 times on our forum: Latest news from Stacy, MN collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: German (34.0%), Swedish (13.8%), American (9.6%), Norwegian (8.6%), Irish (4.7%), Italian (3.3%).","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7269350,"ranking":11,"query_text":"what county is stacy minnesota","passage_text":"Latest news from Stacy, MN collected exclusively by city-data.com from local newspapers, TV, and radio stations. Forest Lake Times Gordon 8220 Gordy 8221 Grubbs. Gordy Grubbs, age 65 of Stacy, Minnesota, died on April 17, 2017 after battling cancer.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":4127234,"ranking":12,"query_text":"what county is stacy minnesota","passage_text":"Annie Rachel Stacy was the daughter of George Lafayette Stacey and Levina. These were her children Please let us know if you know of a photograph of her. She was born in 1872 in Burke County, NC and her husband, Alexander Clark(e) was born in Burke County, NC in 1864 during the War Between the States.Welcome to the Stacy family photograph Album. You will find Stacy and related family photographs here.enjamin Franklin Stacy, b. 13 July, 1803 in Burke County, NC, the Grandson of Bennet Stacey, b. Dec. 19, 1725, St. Mary's, MD and Son of Elisha Stacy, b. 1772, probably in Brunswick County, VA.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7120432,"ranking":13,"query_text":"what county is stacy minnesota","passage_text":"The city of Stacy is located in Chisago County. From the Census Estimates for 2016, Stacy has a population of 1,475 people <1> (see below for details). Stacy is 880 feet [268 m] above sea level. <2>. Time Zone: Stacy lies in the Central Time Zone (CST\/CDT) and observes daylight saving time. Stacy is within the boundaries of the (651) area code.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7120425,"ranking":14,"query_text":"what county is stacy minnesota","passage_text":"The City of Stacy had a population of 1,583 as of July 1, 2017. The primary coordinate point for Stacy is located at latitude 45.3765 and longitude -92.9903 in Chisago County. The formal boundaries for the City of Stacy (see map below) encompass a land area of 3.17 sq. miles and a water area of 0.07 sq. miles. Chisago County is in the Central time zone (GMT -6). The elevation is 899 feet.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":4966495,"ranking":15,"query_text":"what county is stacy minnesota","passage_text":"Stacy Peralta. Stacy Peralta was born on October 15, 1957 in Los Angeles County, California, USA as Stacy Douglas Peralta. He is a director and producer, known for Dogtown and Z-Boys (2001), Riding Giants (2004) and Crips and Bloods: Made in America (2008).","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":7238874,"ranking":16,"query_text":"what county is stacy minnesota","passage_text":"Lodi township, Mower County, Minnesota: Mount Pleasant township, Wabasha County, Minnesota: Sunnyside township, Wilkin County, Minnesota: Lyle township, Mower County, Minnesota: Oakwood township, Wabasha County, Minnesota: Tanberg township, Wilkin County, Minnesota: Marshall township, Mower County, Minnesota: Pepin township, Wabasha County, Minnesota: Wolverton township, Wilkin County, Minnesota: Nevada township, Mower County, Minnesota","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":4966498,"ranking":17,"query_text":"what county is stacy minnesota","passage_text":"Stacy Peralta, Director: Dogtown and Z-Boys. Stacy Peralta was born on October 15, 1957 in Los Angeles County, California, USA as Stacy Douglas Peralta. He is a director and producer, known for Dogtown and Z-Boys (2001), Crips and Bloods: Made in America (2008) and Lords of Dogtown (2005). See full bio Â»","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":8315641,"ranking":18,"query_text":"what county is stacy minnesota","passage_text":"Explore Hennepin County, Minnesota Salaries See Hennepin County, Minnesota Hourly Pay, Hennepin County, Minnesota Bonuses, or check out salaries for Hennepin County, Minnesota Internship or Hennepin County, Minnesota Contractor.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":8770852,"ranking":19,"query_text":"what county is stacy minnesota","passage_text":"This is what happened to the little girl from Fountains of Wayne's Stacy's Mom music video. STACY'S Mom has got it going on - and so has Stacy herself, now. Thirteen years since Fountains of Wayne released their hit single, Stacy's mom, the girl who played Stacy in the music video has blossomed into a total babe. Gianna Distenca played Stacy in the music video[YouTube] Now in her mid 20s, Gianna Distenca is living in Beirut, Lebanon, where she works as an artist and sculptor.","bm25_label":"high","relevance_label":0.0},{"query_id":1085279,"passage_id":8684795,"ranking":20,"query_text":"what county is stacy minnesota","passage_text":"Ramsey, Minnesota. This article is about the city in Anoka County. For the unincorporated community in southern Minnesota named Ramsey, see Ramsey, Mower County, Minnesota. For the county, see Ramsey County, Minnesota.","bm25_label":"high","relevance_label":0.0}]