[{"query_id":1086675,"passage_id":7108287,"ranking":1,"query_text":"what are thomas jefferson's kids named","passage_text":"Related Searches: 1  thomas jefferson wife. 2  thomas jefferson s wife. 3  thomas jefferson family. 4  thomas jefferson descendants. 5  thomas jefferson s family. 6  thomas jefferson wife name. 7  thomas jefferson siblings. 8  thomas jefferson s parents. 9  thomas jefferson s kids. 10  thomas jefferson s kids names.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":7108284,"ranking":2,"query_text":"what are thomas jefferson's kids named","passage_text":"What were Thomas Jefferson's children names? Thomas Jefferson had a total of four children. Three daughters named Martha Jefferson Randolph, Lucy Elizabeth Jefferson and Mary Jefferson Eppes. His son name was Peter J â\u0080¦ efferson.","bm25_label":"high","relevance_label":1.0},{"query_id":1086675,"passage_id":7108285,"ranking":3,"query_text":"what are thomas jefferson's kids named","passage_text":"Thomas Jefferson. Thomas Jefferson Kids. With all the great accomplishments of his public life, for Thomas Jefferson, family life may have held great pain and suffering never witnessed in the halls of power. Was Thomas Jefferson married? Yes, on New Year's Day of 1772, Jefferson married Martha Wayles Skelton.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":8605142,"ranking":4,"query_text":"what are thomas jefferson's kids named","passage_text":"The most popular patriotic name in America is... Parents do still give their kids patriotic names, particularly those of the Founding Fathers, research has found. You've seen the names in history books: Alexander Hamilton, Samuel Adams, Thomas Jefferson.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":7108286,"ranking":5,"query_text":"what are thomas jefferson's kids named","passage_text":"Thomas Jefferson had no other name. His parents, Peter and Jane (nee Randolph) Jefferson named him Thomas. A link to the Wikipedia on Thomas Jefferson is provided.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":8471202,"ranking":6,"query_text":"what are thomas jefferson's kids named","passage_text":"Thomas Jefferson had no other name. His parents, Peter and Jane (nee Randolph) Jefferson named him Thomas.   A link to the Wikipedia on Thomas Jefferson is provided.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":7108281,"ranking":7,"query_text":"what are thomas jefferson's kids named","passage_text":"Of the Thomas Jefferson kids, only Patsy would outlive her father. For Thomas Jefferson, ancestry was never a topic of much curiosity as he had few records to which he could refer. In the young Thomas Jefferson's family, parents were Peter Jefferson, a surveyor and planter, and Jane Randolph, daughter of a ship's captain who was also an occasional planter.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":8437140,"ranking":8,"query_text":"what are thomas jefferson's kids named","passage_text":"What was Thomas Jefferson's wife and childrens names? Jefferson's wife was named Martha Wayles Skelton. He had 5 daughters who were named Martha, Jane, Mary, and two who were named Lucy.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":8396359,"ranking":9,"query_text":"what are thomas jefferson's kids named","passage_text":"What 6 languages did thomas Jefferson speak? What do you think of accounts that have Thomas Jefferson as their avatar, and criticize Obama? Did Benjamin Franklin & Thomas Jefferson actually speak French when in Paris, or did they have translators?","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":4092474,"ranking":10,"query_text":"what are thomas jefferson's kids named","passage_text":"The name of Clinton's father is either unknown or has never been revealed. The reason I find this question to be particularly interesting is that Clinton's middle name is Jefferson. Clinton also invokes the name of Thomas Jefferson at every opportunity. I am really an expert on the slaves of Thomas Jefferson.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":2147972,"ranking":11,"query_text":"what are thomas jefferson's kids named","passage_text":"According to Thomas Jefferson in the Declaration of independence, what has been the King's... 1 educator answer; What did Thomas Jefferson hope to achieve in the Declaration of Independence? 2 educator answers; From The Declaration of Independence by Thomas Jefferson, identify the reasons that made the... 1 educator answer","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":8437139,"ranking":12,"query_text":"what are thomas jefferson's kids named","passage_text":"What were the names of Thomas Jefferson's children? He had two daughters that lived to adulthood: Martha Patsy Jefferson Randolph and Mary Polly Jefferson Eppes. He also had three other daughters and a son who all died â\u0080¦ before they were three.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":8437136,"ranking":13,"query_text":"what are thomas jefferson's kids named","passage_text":"Thomas Jefferson had a total of four children. Three daughters  named Martha Jefferson Randolph, Lucy Elizabeth Jefferson and Mary  Jefferson Eppes. His son name was Peter Jâ\u0080¦efferson.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":5383277,"ranking":14,"query_text":"what are thomas jefferson's kids named","passage_text":"What did Thomas Jefferson do as a scientist? It's true that Thomas Jefferson contributed some new knowledge directly to science and technology. Jefferson also helped invent modern agricultural science and technology. Jefferson also invented methods for excavating archeological sites.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":8816285,"ranking":15,"query_text":"what are thomas jefferson's kids named","passage_text":"Jefferson County is a county located in the U.S. state of Georgia. As of the 2010 census, the population was 16,930.The county seat is Louisville. The county was created on February 20, 1796 and named for Thomas Jefferson, the third president of the United States.he county was created on February 20, 1796 and named for Thomas Jefferson, the third president of the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":6793925,"ranking":16,"query_text":"what are thomas jefferson's kids named","passage_text":"Thomas Jefferson and food. One of my students is doing a project on Thomas Jefferson, and I have blanked out on what food items he introduced to America.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":5387457,"ranking":17,"query_text":"what are thomas jefferson's kids named","passage_text":"United States Declaration of Independence - Wikipedia, the ... The Declaration of Independence is the usual name of ... to select Thomas Jefferson to compose ... that the language of the Declaration indicated that the ... ... Thomas Paine published a ... Jefferson concluded the declaration with a line ...","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":5142346,"ranking":18,"query_text":"what are thomas jefferson's kids named","passage_text":"Thomas Jefferson. On October 25, 1783, Thomas Jefferson visited Harpers Ferry, viewing the passage of the Patowmac though the Blue Ridge from a rock that now bears his name. In 1785, Jefferson's description of this view was published in the Notes on the State of Virginia.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":5383276,"ranking":19,"query_text":"what are thomas jefferson's kids named","passage_text":"I've placed their names at the bottom.) This answer to your question barely begins to show how much Thomas Jefferson did for science and technology. If you want to read more, here's the name of a good book: Thomas Jefferson: Statesman of Science, by Silvio Bedini.","bm25_label":"high","relevance_label":0.0},{"query_id":1086675,"passage_id":282566,"ranking":20,"query_text":"what are thomas jefferson's kids named","passage_text":"The Heming's and Jefferson Controversy Thomas Jefferson had a number of children by his slave Sally Hemings. Sally Hemings, whose given name was probably Sarah, was the daughter of Elizabeth (Betty) Hemings and, allegedly, John Wayles, Thomas Jefferson's father-in-law. She became Thomas Jefferson's property as part of his inheritance from the Wayles estate in 1774 and came with her mother to Monticello by 1776.","bm25_label":"high","relevance_label":0.0}]