[{"query_id":1086477,"passage_id":7109836,"ranking":1,"query_text":"what belongs in an affirmative action plan?","passage_text":"Affirmative action does not mandate quotas or extending preferences to any individual based on race, color, religion, gender, or national origin. What is an Affirmative Action Plan? An Affirmative Action Plan (AAP) contains statistical and narrative information. The statistical information includes: organizational profile, job group analysis, availability analysis, utilization analysis and personnel action analysis.","bm25_label":"high","relevance_label":1.0},{"query_id":1086477,"passage_id":2470108,"ranking":2,"query_text":"what belongs in an affirmative action plan?","passage_text":"â\u0080\u009cWhat is an Affirmative Action Plan?â\u0080\u009d, â\u0080\u009cDoes my company need an AAP?â\u0080\u009d, â\u0080\u009cHow do we implement it?â\u0080\u009d, â\u0080\u009cWhat do I do if we get audited?â\u0080\u009d. These are all frequently asked questions I hear just about every week as the resident Affirmative Action Plan expert at Helios.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":2470107,"ranking":3,"query_text":"what belongs in an affirmative action plan?","passage_text":"The local JATC will complete all seven (7) copies of the Affirmative Action Plan, being careful to. make proper entries everywhere within the Affirmative Action Plan that require a specific entry by the. JATC. 3. The JATC will officially adopt the Affirmative Action Plan, as provided in the Apprenticeship.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":4281161,"ranking":4,"query_text":"what belongs in an affirmative action plan?","passage_text":"The contractor shall, in all advertisements and business with the public, indicate that it is. an affirmative action\/equal opportunity employer. The plan shall include information on. what steps the contractor undertook to advise the public concerning its affirmative. action requirements; [Sec. 46a-68j-27(3)].","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":4776832,"ranking":5,"query_text":"what belongs in an affirmative action plan?","passage_text":"Agencies' affirmative action obligations include a requirement to submit Affirmative Action Plans (Plans) for the hiring, placement, and advancement of individuals with disabilities to the Commission on an annual basis.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":3450546,"ranking":6,"query_text":"what belongs in an affirmative action plan?","passage_text":"1 Overall direction of the University's Affirmative Action Plan within their colleges, divisions, and departments. 2  Maintenance of central personnel and related records in a manner facilitating achievement of the goals of the Affirmative Action Plan.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":32579,"ranking":7,"query_text":"what belongs in an affirmative action plan?","passage_text":"ORIGINS AND DEVELOPMENT. OF AFFIRMATIVE ACTION. Although the roots of affirmative action in the United States go back to the nineteenth century, modern affirmative action plans originated with executive orders issued by Presidents John F. Kennedy, Lyndon B. Johnson, and Richard M. Nixon in the 1960s.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":200521,"ranking":8,"query_text":"what belongs in an affirmative action plan?","passage_text":"United States History. Affirmative Action. Affirmative Action began as a plan to equalize the educational, employment, and contracting opportunities for minorities and women with opportunities given to their white, male counterparts.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":8426287,"ranking":9,"query_text":"what belongs in an affirmative action plan?","passage_text":"Affirmative Action and People with Disabilities Explains why people with disabilities should be included in affirmative action programs and what contractors' affirmative action obligations are pertaining to outreach and recruitment of people with disabilities.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":4776829,"ranking":10,"query_text":"what belongs in an affirmative action plan?","passage_text":"Provides oversight and coordination of the collegeâ\u0080\u0099s Affirmative Action and Equal Employment Opportunity programs and compliance with state and federal laws. Leads the development, implementation and maintenance of the Collegeâ\u0080\u0099s affirmative action plan.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":7109839,"ranking":11,"query_text":"what belongs in an affirmative action plan?","passage_text":"OHSU's Affirmative Action & Equal Opportunity department (AAEO) produces OHSU's Affirmative Action Plan (AAP) annually. The AAP provides analysis identifying areas of under-representation of females and minorities in OHSU's workforce.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":4281166,"ranking":12,"query_text":"what belongs in an affirmative action plan?","passage_text":"ALP: Does my company need to have a written affirmative action plan, or is its written EEO policy enough? It depends. Not all employers subject to the federal laws that mandate equal employment opportunity (EEO) are also required to develop affirmative action plans, and vice versa.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":5387415,"ranking":13,"query_text":"what belongs in an affirmative action plan?","passage_text":"The answer is no.. Empirical claims about affirmative action generally exist in response to two overarching questions: what is the underlying cause of the inequalities that are targeted by affirmative action policies, and what effect have these policies displayed in solving the core problem.onclusion. Affirmative Action is as hard an issue to define as it is to implement. One must remember that Affirmative Action is an imperfect solution to an underlying problem, a problem that is usually not addressed by either side of the issue.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":4281160,"ranking":14,"query_text":"what belongs in an affirmative action plan?","passage_text":"Ultimate responsibility for this Affirmative Action\/Equal Opportunity Employment Program will be with the. (Insert Head of Companyâ\u0080\u0099s Official Title). The day-to-day duties for the plan will be coordinated by (Insert. the name of the companyâ\u0080\u0099s Affirmative Action\/Equal Opportunity Employment Officer), who is hereby. designated the Affirmative Action\/Equal Opportunity Employment Officer for XYZ Company.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":2470106,"ranking":15,"query_text":"what belongs in an affirmative action plan?","passage_text":"We will develop your affirmative action plan from scratch and hold your hand through the entire process. We have developed affirmative action plans and provided audit support for clients in every OFCCP region. Call us at (866) 433-6752 to start the relationship today.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":3450544,"ranking":16,"query_text":"what belongs in an affirmative action plan?","passage_text":"Responsibility for Implementation. Through the policies and programs set forth in the Affirmative Action Plan, the university undertakes to comply fully with all federal, state, and local laws relating to educational opportunity, equal employment opportunity, and affirmative action.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":8460183,"ranking":17,"query_text":"what belongs in an affirmative action plan?","passage_text":"Affirmative action is not â\u0080\u009cquotasâ\u0080\u009d nor the substitution of numerical dictates for merit-based decisions. Some affirmative action plans include the management tools of numerical goals or targets for representation of women or minorities, and timetables for meeting those objectives.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":1813861,"ranking":18,"query_text":"what belongs in an affirmative action plan?","passage_text":"Affirmative action program goals are not required to be met, but it is expected that good faith efforts will be made to meet each goal. The affirmative action plan must show that good faith efforts were carried out in advertisement, recruitment, promotions, trainings, and terminations.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":2470111,"ranking":19,"query_text":"what belongs in an affirmative action plan?","passage_text":"â\u0080\u009cWhat is an Affirmative Action Plan?â\u0080\u009d. In the simplest terms, AAPâ\u0080\u0099s are a roadmap of an organizationâ\u0080\u0099s programs, policies, and procedures for ensuring equal opportunity in all aspects of employment including recruiting, hiring, training, promoting, and compensation.","bm25_label":"high","relevance_label":0.0},{"query_id":1086477,"passage_id":7109835,"ranking":20,"query_text":"what belongs in an affirmative action plan?","passage_text":"FAQ and More Information. 1  Frequently Asked Questions â\u0080\u0094 Affirmative Action. 2  OHSU's policy regarding Affirmative Action Goals: Employment. 3  Current OHSU Diversity Action Plan. 4  Diversity Strategy Tips. 5  Covered Veteran Status Categories. 6  Additional Potential Qualifying Disabilities.","bm25_label":"high","relevance_label":0.0}]