[{"query_id":1086248,"passage_id":6250561,"ranking":1,"query_text":"what causes a prickly itchy feeling all over","passage_text":"The common symptoms of heat rash are red bumps on the skin, and an itchy or prickly feeling to the skin. These are due to inflammation of the superficial layers of the skin (the epidermis) and the prickly sensation is similar to the feeling of mild sunburn.he common symptoms of heat rash are red bumps on the skin, and an itchy or prickly feeling to the skin. These are due to inflammation of the superficial layers of the skin (the epidermis) and the prickly sensation is similar to the feeling of mild sunburn.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":5934969,"ranking":2,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Prickly Heat. Prickly heat is also known as heat rash or miliaria. It is a red and itchy rash on the skin that causes a stinging or prickly feeling, hence the name. Although prickly heat usually occurs in hot conditions, it can affect people in winter if they are wearing too much clothing or sit too close to a heater.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":5934967,"ranking":3,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Prickly heat is also known as heat rash or miliaria. It is a red and itchy rash on the skin that causes a stinging or prickly feeling, hence the name. Although prickly heat usually occurs in hot conditions, it can affect people in winter if they are wearing too much clothing or sit too close to a heater.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":7111937,"ranking":4,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Itchy Skin No Rash â\u0080\u0093 Causes of Burning, Prickly Skin at Night without Rash Do you have itchy burning skin no rash symptoms? Find out what the symptoms for this type of itching are and their cause.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":725448,"ranking":5,"query_text":"what causes a prickly itchy feeling all over","passage_text":"The common symptoms of heat rash are red bumps on the skin, and an itchy or prickly feeling to the skin. These are due to inflammation of the superficial layers of the skin (the epidermis) and the prickly sensation is similar to the feeling of mild sunburn.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":2035968,"ranking":6,"query_text":"what causes a prickly itchy feeling all over","passage_text":"1 Heat rash occurs when the skin's sweat glands are blocked and the sweat produced cannot get to the surface of the skin to evaporate. This causes inflammation that results in a rash.  Common symptoms of heat rash include red bumps on the skin, and a prickly or itchy feeling to the skin (also known as prickly heat).","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":3733172,"ranking":7,"query_text":"what causes a prickly itchy feeling all over","passage_text":"1 Heat rash occurs when the skin's sweat glands are blocked and the sweat produced cannot get to the surface of the skin to evaporate. 2  This causes inflammation that results in a rash. 3  Common symptoms of heat rash include red bumps on the skin, and a prickly or itchy feeling to the skin (also known as prickly heat).","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":2035966,"ranking":8,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Heat rash facts. 1  Heat rash occurs when the skin's sweat glands are blocked and the sweat produced cannot get to the surface of the skin to evaporate. This causes inflammation that results in a rash.  Common symptoms of heat rash include red bumps on the skin, and a prickly or itchy feeling to the skin (also known as prickly heat).","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":3648380,"ranking":9,"query_text":"what causes a prickly itchy feeling all over","passage_text":"This causes inflammation that results in a rash. Common symptoms of heat rash include red bumps on the skin, and a prickly or itchy feeling to the skin (also known as prickly heat). The rash appears as reddened skin with tiny blisters and is due to inflammation. It often occurs in skin creases or areas of tight clothing where air cannot circulate.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":5874830,"ranking":10,"query_text":"what causes a prickly itchy feeling all over","passage_text":"11 Home Remedies for Heat Rash. Heat rash, or prickly heat, is an itchy rash that is defined by the red spots that it causes on the skin. People with heat rash will feel constantly itchy and a stinging sensation on the skin will be quite persistent. This kind of rash will occur usually when somebody sweats more than they would usually, which is itself caused by heat.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":3338806,"ranking":11,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Heat Rash - Prickly Heat. Unlike golfer's vasculitis, prickly heat is itchy. It is triggered by blocked sweat glands and causes raised itchy red dots or bumps. It is best treated by getting out of the heat for a few days and not scratching the area. Heat Rash and Prickly Heat.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":4532719,"ranking":12,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Pictures of heat rash (prickly heat) pictures and read about heat rash symptoms like red bumps on the skin and an itchy or prickly feeling to the skin. Treatment information is also included.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":1284921,"ranking":13,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Other Heat Rashes. Heat Rash - Prickly Heat. Unlike golfer's vasculitis, prickly heat is itchy. It is triggered by blocked sweat glands and causes raised itchy red dots or bumps. It is best treated by getting out of the heat for a few days and not scratching the area. Heat Rash and Prickly Heat.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":4611669,"ranking":14,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Read More. Hello, These symptoms are due to heat rashes or prickly heat. Prickly heat (miliaria) is an itchy skin rash caused by trapped sweat. Tiny red spots with itching and pricking sensation are the characteristic appearance of this rash.ead More. Hello, These symptoms are due to heat rashes or prickly heat. Prickly heat (miliaria) is an itchy skin rash caused by trapped sweat. Tiny red spots with itching and pricking sensation are the characteristic appearance of this rash.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":7111944,"ranking":15,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Prickly, itchy feeling all over the body when sweating? Dr. Keshab Paudel Dr. Paudel Please see below: This may be cholinergic urticaria : cu typically presents with a number of small, short-lasting hives but may also involve cutaneous inflammation (wheals) and pain which develops usually in response to exercise, bathing, staying in a heated environment, or emotional stress.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":7111936,"ranking":16,"query_text":"what causes a prickly itchy feeling all over","passage_text":"A body that becomes hyperstimulated can behave oddly and erratically, which can cause a wide range of unusual sensations and symptoms, including feeling an itchy, itching, tingly, tingling, crawly, crawling, pins and needles, prickly, and any other odd or unusual feelings and sensations under the skin and\/or anywhere inside or deep inside the body.","bm25_label":"high","relevance_label":1.0},{"query_id":1086248,"passage_id":154620,"ranking":17,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Heat rash occurs when the skin's sweat glands are blocked and the sweat produced cannot get to the surface of the skin to evaporate. This causes inflammation that results in a rash. Common symptoms of heat rash include red bumps on the skin, and a prickly or itchy feeling to the skin (also known as prickly heat). The rash appears as reddened skin with tiny blisters and is due to inflammation. It often occurs in skin creases or areas of tight clothing where air cannot circulate.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":2035965,"ranking":18,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Heat rash facts. 1  Heat rash occurs when the skin's sweat glands are blocked and the sweat produced cannot get to the surface of the skin to evaporate.  Common symptoms of heat rash include red bumps on the skin, and a prickly or itchy feeling to the skin (also known as prickly heat).","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":5934971,"ranking":19,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Heat rash, also called miliaria or prickly heat, is a skin irritation that stings and makes your skin red. If you have heat rash, your skin may feel itchy, small bumps may form, and you may feel some â\u0080\u009cprickly,â\u0080\u009d tingling pain. Heat rash occurs most often in hot, humid weather.","bm25_label":"high","relevance_label":0.0},{"query_id":1086248,"passage_id":150018,"ranking":20,"query_text":"what causes a prickly itchy feeling all over","passage_text":"Prickly heat (heat rash), also known as miliaria, is an itchy rash of small, raised red spots that causes a stinging or prickly sensation on the skin. It occurs when the sweat ducts in the outer layer of skin (epidermis) are obstructed.","bm25_label":"high","relevance_label":0.0}]