[{"query_id":1086430,"passage_id":7110145,"ranking":1,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Patti Callahan Henry is an American author. Personal life. Henry graduated from Auburn University and worked in nursing before fitting a full-time writer. She has a sister, Barbi, on whose experiences Henry's novel And Then I Found You is based. Writing career. Henry's book Driftwood Summer appeared on the New York Times best seller list.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110150,"ranking":2,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Patti Callahan Henry is the New York Times Bestelling novelist of eleven novels. Her latest is THE BOOKSHOP AT WATER'S END with Penguin Random House\/Berk... Patti Callahan Henry is the New York Times Bestelling novelist of eleven novels. Her latest is THE BOOKSHOP AT WATER'S END with Penguin Random House\/Berkley.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110142,"ranking":3,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"The Idea of Love: A Novel by Patti Callahan Henry On Sale June 23rd, 2015 From New York Times bestselling author Patti Henry, comes a riveting drama about the about the lengths we go to for love.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110151,"ranking":4,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"â\u0080\u009cPatti Callahan Henry asks the big, equivocal questions about what it means to be a mother, a child, a family, and the answers she finds in And Then I Found You will surprise you, provoke you, and rearrange your heart.â\u0080\u009dâ\u0080\u0094Jacquelyn Mitchard, #1 New York Times bestselling author of Two If by Sea","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110144,"ranking":5,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"More About Patti Patti Callahan Henry is a New York Times bestselling author of Between the Tides; Where the River Runs; When Light Breaks; Between the Tides; The Art of Keeping Secrets; Driftwood Summer; The Perfect Love Song: A Holiday Story; Coming up for Air; And Then I Found You; The Stories We Tell; The Idea of Love and The Bookshop at Waterâ\u0080\u0099s End (July 2017).","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110147,"ranking":6,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Buy a cheap copy of Driftwood Summer book by Patti Callahan Henry. An engaging novel of sisters, from the acclaimed author who writes movingly about love and family and the voyage we all take to discover what we really value.(The... Free shipping over $10.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110143,"ranking":7,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"New York Times bestselling author Patti Callahan Henry has published numerous novels including Friend Request, Losing the Moon, Where the River Runs, When Light Breaks, Between the Tides, The Art of Keeping Secrets, Driftwood Summer, The Perfect Love Song, Coming up for Air, And Then I Found You, The Stories We Tell, and The Idea of Love.","bm25_label":"high","relevance_label":1.0},{"query_id":1086430,"passage_id":7110148,"ranking":8,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Patti Callahan Henry is with Carol Carr and 2 others. Â· January 29 at 8:23am Â· Writing might not be a great way to make a living but it's a great way to make a life.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110146,"ranking":9,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"New York Times bestselling author Patti Callahan Henrydelivers an engaging novel about a South Carolina woman who goes back home to face the past and discovers herself... Meridy Dresden was once a free-spirited, fun-loving girl. All that changed when the boy she loved was killed in a tragic fire.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":7110149,"ranking":10,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Personal life. Henry graduated from Auburn University and worked in nursing before becoming a full-time writer. She has a sister, Barbi, on whose experiences Henry's novel And Then I Found You is based. Writing career. Henry's book Driftwood Summer appeared on the New York Times best seller list. Her work has been shortlisted for the Townsend Prize for Fiction and nominated for the Southeastern Independent Booksellers Novel of the Year. Books","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":5326969,"ranking":11,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"York Peppermint Patties History. The York Peppermint Pattie was first produced at the York Cone Company in 1940 by Henry C. Kessler. It was introduced into the northeast United States, Ohio, Florida and Indiana. The Peter Paul Company bought the York Cone Company in 1972 and launched the York Peppermint Pattie nationally in 1975. Today it is made by Hershey's.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":3474382,"ranking":12,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"In Ireland the region of Munster has high number with the Callahan name. In Scotland the Callahan population is centered in Lanarkshire and Stirlingshire. Within the United States the Callahan families are mostly in Massachusetts, New York, New Jersey, Ohio, Illinois, California and Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":5292549,"ranking":13,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"In Defense of Food: An Eater's Manifesto is a 2008 book by journalist and activist Michael Pollan.It was number one on the New York Times Non-Fiction Best Seller List for six weeks. The book grew out of Pollan's 2007 essay Unhappy Meals published in the New York Times Magazine.t was number one on the New York Times Non-Fiction Best Seller List for six weeks. The book grew out of Pollan's 2007 essay Unhappy Meals published in the New York Times Magazine.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":5292550,"ranking":14,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"From Wikipedia, the free encyclopedia. In Defense of Food: An Eater's Manifesto is a 2008 book by journalist and activist Michael Pollan. It was number one on the New York Times Non-Fiction Best Seller List for six weeks. The book grew out of Pollan's 2007 essay Unhappy Meals published in the New York Times Magazine.t was number one on the New York Times Non-Fiction Best Seller List for six weeks. The book grew out of Pollan's 2007 essay Unhappy Meals published in the New York Times Magazine.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":5292556,"ranking":15,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Pollan has also said that he wrote In Defense of Food as a response to people asking him what they should eat after having read his previous book, The Omnivore's Dilemma.t was number one on the New York Times Non-Fiction Best Seller List for six weeks. The book grew out of Pollan's 2007 essay Unhappy Meals published in the New York Times Magazine.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":6794124,"ranking":16,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Callahan was also the first native of the State of New York to serve as the Rangers' team captain. On February 11, 2012, Callahan scored his second hat-trick against the Philadelphia Flyers.ust five days after having surgery, however, Callahan returned to the lineup for Game 1 of the Eastern Conference Final against his former team, the New York Rangers. The Lightning eventually defeated the Rangers in seven games.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":3032000,"ranking":17,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Are you wondering What's my boat worth or What's my Jet Ski worth. Our boat value or boat blue book value service is fast and easy! For a one time fee of $9.95 we will give you a boat blue book value or estimate of the value of your new or used boat or Jet Ski and list it for sale nationally for 1 year!Babylon, New York 11702 631-517-0645.ur boat value or boat blue book value service is fast and easy! For a one time fee of $9.95 we will give you a boat blue book value or estimate of the value of your new or used boat or Jet Ski and list it for sale nationally for 1 year! Babylon, New York 11702 631-517-0645.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":6028852,"ranking":18,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"1 In 2010, 14-year-old Henry Ermer of Brooklyn, New York, attempted to enter the Guinness Book of World Records by building what is believed to be the world's largest bobblehead, standing 16 feet tall.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":8198176,"ranking":19,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"McCormack wrote several books, including The Terrible Truth About Lawyers and What They Don't Teach You at Harvard Business School, which spent 21 consecutive weeks at No. 1 on The New York Times bestseller list.","bm25_label":"high","relevance_label":0.0},{"query_id":1086430,"passage_id":2348425,"ranking":20,"query_text":"what book was on new york times list for patti callahan henry","passage_text":"Categories Trivia Tags Question: What is the highest military rank achieved by a dog? Post navigation Previous Post Previous Ans: According to a book that topped the New York Times Best Seller list in 1982, real men donâ\u0080\u0099t eat what?","bm25_label":"high","relevance_label":0.0}]