[{"query_id":1087425,"passage_id":7445537,"ranking":1,"query_text":"what are pitchforks","passage_text":"World's Largest Pitchfork. The World's Largest Pitchfork really is huge and in a little town in front of what looks to be a pretty cool restaurant. There are photo ops for the restaurant around the pitchfork. [Mallory Billings, 12\/01\/2016]","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7375448,"ranking":2,"query_text":"what are pitchforks","passage_text":"Pitchfork Music Festivals: Chicago \/ Paris; Pitchfork Radio; Newsletter; Advertising; Masthead; Careers; Contact; Accessibility Help; Follow Pitchfork on Facebook; Follow Pitchfork on Twitter; Follow Pitchfork on Instagram; Follow Pitchfork on Tumblr; Follow Pitchfork on Snapchat Â©","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7375455,"ranking":3,"query_text":"what are pitchforks","passage_text":"pitchfork (plural pitchforks) An agricultural tool comprising a fork attached to a long handle used for pitching hay or bales of hay high up onto a haystack. Derived terms . pitchforkful; rain pitchforks; Translations","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7375451,"ranking":4,"query_text":"what are pitchforks","passage_text":"Shop pitchforks in the rakes & pitchforks section of Lowes.com. Find quality pitchforks online or in store. Skip to main content free parcel shipping with mylowe's. get started >","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":3449365,"ranking":5,"query_text":"what are pitchforks","passage_text":"Because the pitchfork tool can serve as an early indicator of trend reversals, pitchforks can be used with Channel trading or with an indicator based trading system.The charts below show the Andrews Pitchfork tool indicated a potential reversal early on.otice after price breaks out of the pitchfork, it rallies, only to retest the support level close to the lower channel line before rallying. Andrews Pitchfork Trading â\u0080\u0093 Conclusion. To summarize, the Andrewâ\u0080\u0099s Pitchfork tool is a versatile trading tool that can be used in any market and in any timeframe.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":3449361,"ranking":6,"query_text":"what are pitchforks","passage_text":"Pitchforks typically have only two, three or four tines while dung forks have four or five, other types of fork even up to ten tines with different lengths and spacing depending on purpose. They are usually made of steel with a long wooden handle, but may also be made from wood, wrought iron, bamboo, alloy, etc.In some parts of England a pitchfork is known as a prong and, in parts of Ireland, a sprong refers to a 4-pronged pitchfork. The pitchfork is similar to the shorter and sturdier garden fork.n Europe, the pitchfork was first used in the early Middle Ages, at about the same time as the harrow. The pitchfork was originally made entirely of wood; today, the tines are usually made of hard metal.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":4374730,"ranking":7,"query_text":"what are pitchforks","passage_text":"The Womenâ\u0080\u0099s March on Versailles. Two hundred and twenty-five years ago today, an angry mob of nearly 7,000 working women â\u0080\u0093 armed with pitchforks, pikes and muskets â\u0080\u0093 marched in the rain from Paris to Versailles in what was to be a pivotal event in the intensifying French Revolution.wo hundred and twenty-five years ago today, an angry mob of nearly 7,000 working women â\u0080\u0093 armed with pitchforks, pikes and muskets â\u0080\u0093 marched in the rain from Paris to Versailles in what was to be a pivotal event in the intensifying French Revolution.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7375457,"ranking":8,"query_text":"what are pitchforks","passage_text":"Andrews Pitchfork Trading. Trading with Andrews Pitchfork or Median Line Tool. The Andrews Median line or Pitchfork is a form of tool that is used to identify potential reversals or continuation of trends. The median line tool is one of the standard charting tools available with most trading\/charting platforms.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":3449359,"ranking":9,"query_text":"what are pitchforks","passage_text":"Pitchforks and scythes have frequently been used as weapons by those who couldn't afford or didn't have access to more expensive weapons such as swords, or, later, guns. As a result, pitchforks and scythes are stereotypically carried by angry mobs or gangs of enraged peasants.n Europe, the pitchfork was first used in the early Middle Ages, at about the same time as the harrow. The pitchfork was originally made entirely of wood; today, the tines are usually made of hard metal.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7445541,"ranking":10,"query_text":"what are pitchforks","passage_text":"Reviewed December 30, 2016. Located north of town, Casey, Illinois, not only is the world's largest pitchfork available to see 24\/7 but the pitchfork has over photo opportunities for the family and kids all pitchfork related. Be part of a art masterpiece or dine with the swine using their face cutouts for a fun memory.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":3449360,"ranking":11,"query_text":"what are pitchforks","passage_text":"The pitchfork got its name from its use in pitching bundles. True pitchforks had two or three tines. Forks with four or more tines were not designed to pitch bundles and, technically speaking, were not pitchforks.They were called simply forks or manure forks.If the tines were spread widely apart, the fork was known as a barley fork or straw fork.n the threshing era, it rained pitchforks, in the sense that every general store carried a full line of them. Thousands were needed. In any harvest season across North America, pitchforks lifted every bundle of wheat or other grain. Pitchforks made a back-breaking job a little easier.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":1692178,"ranking":12,"query_text":"what are pitchforks","passage_text":"Reading trees: Phylogenetic pitchforks Often, one sees phylogenies that include polytomies, nodes with more than two descendent lineages, creating a pitchfork. This can mean one of two things:","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":3449358,"ranking":13,"query_text":"what are pitchforks","passage_text":"A pitchfork is an agricultural tool with a long handle and long, thick, widely separated pointed tines (also called prongs) used to lift and pitch (throw) loose material, such as hay, straw or leaves.n Europe, the pitchfork was first used in the early Middle Ages, at about the same time as the harrow. The pitchfork was originally made entirely of wood; today, the tines are usually made of hard metal.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":1627378,"ranking":14,"query_text":"what are pitchforks","passage_text":"Pitchforks can have two, three, four or more tines. Unlike garden forks, the tines are usually curved upwards to provide more scooping ability. Common types of pitchforks in gardens include: Compost fork â\u0080\u0093 A compost fork is a pitchfork with very sharp tines that are designed for cutting into the compost. This makes it easier to grab and lift the compost when turning over the compost pile.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7443680,"ranking":15,"query_text":"what are pitchforks","passage_text":"Halloween 5: The Revenge of Michael Myers. 1  Hermit: Knifed in back. 2  Rachel Carruthers: Stabbed with scissors. 3  Mike: Head impaled with garden claw. 4  Spitz: Impaled with pitchfork. 5  Samantha Thomas: Sliced with scythe. 6  Nick Ross: Killed with pitchfork off-screen. 7  Tom Farrah: Killed with pitchfork off-screen. 8  Tina Williams: Stabbed.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":3449363,"ranking":16,"query_text":"what are pitchforks","passage_text":"A two-pronged pitchfork was one of these tools. Made by the blacksmith farmer, a pitchfork like this one had two metal tines that were secured to a long wooden stick, often with wire. The fork was used to pitch hay on the farm, and was also used in the corn-shelling process to collect the corncobs. two-pronged pitchfork was one of these tools. Made by the blacksmith farmer, a pitchfork like this one had two metal tines that were secured to a long wooden stick, often with wire. The fork was used to pitch hay on the farm, and was also used in the corn-shelling process to collect the corncobs.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7102188,"ranking":17,"query_text":"what are pitchforks","passage_text":"We are the Pitchforks Founded in 1979, The Pitchforks are the oldest a cappella group at Duke University. They perform on campus and across the country throughout the year, appearing in venues ranging from dorm common rooms to professional sports arenas.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":7375454,"ranking":18,"query_text":"what are pitchforks","passage_text":"The design of the pitchfork looks superficially similar to that of the trident, a type of spear used historically for fishing and associated with the Greek Gods. However, pitchforks and tridents are designed for different uses, with the format of the tines being slightly different to reflect this.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":1596416,"ranking":19,"query_text":"what are pitchforks","passage_text":"Cont: http:\/\/koreanovernight.com ... what does Hul! mean??? Well, there is no direct english translation for this korean slang expression. But you'll find that it closely resembles the idiomatic use of words like gross, no way!, and even gag me with a pitchfork..","bm25_label":"medium","relevance_label":0.0},{"query_id":1087425,"passage_id":3449362,"ranking":20,"query_text":"what are pitchforks","passage_text":"10 most extreme places on Earth. A pitchfork is an agricultural implement which is used to handle materials such as hay, straw, and manure. The implement consists of a series of forked tines on the end of a long handle, with the number of tines varying, depending on the use the pitchfork is designed for. suppose the pitchfork is a symbol of torture in this regard and therefore appropriate to the depiction of the devil and his minions. Perhaps if the images were being created today some other more modern implement might be the chosen symbol.","bm25_label":"medium","relevance_label":0.0}]