[{"query_id":1087858,"passage_id":7098185,"ranking":1,"query_text":"what airport is in wilder ky","passage_text":"Closest Airport to Wilder, KY. The closest airport to Wilder is Cincinnati\/Northern Kentucky International Airport (CVG). Distance from Cincinnati\/Northern Kentucky International Airport to Wilder, KY is 15,7 kilometers (9,7 miles). Cincinnati\/Northern Kentucky International Airport (CVG)","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7098181,"ranking":2,"query_text":"what airport is in wilder ky","passage_text":"The closest airport to Wilder, KY, United States is Cincinnati\/Northern Kentucky International Airport (CVG). See also a map of the airports near Wilder.","bm25_label":"high","relevance_label":1.0},{"query_id":1087858,"passage_id":7098188,"ranking":3,"query_text":"what airport is in wilder ky","passage_text":"The closest major airport to Wilder Park, Kentucky is Louisville International Airport (SDF \/ KSDF). This airport is in Louisville, Kentucky and is 3 miles from the center of Wilder Park, KY. If you're looking for domestic flights to SDF, check the airlines that fly to SDF. Search for direct flights from your hometown and find hotels near Wilder Park, KY, or scroll down for more international airports or domestic airports.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7098187,"ranking":4,"query_text":"what airport is in wilder ky","passage_text":"Hotels near Beckfield College - Florence, KY Campus; Hotels near Brown Mackie - Northern Kentucky Fort Mitchell, KY; Hotels near Christ Hospital School of Nursing; Hotels near Cincinnati Christian University; Explore Hotels. Greater Cincinnati Hotels; All Wilder Restaurants; Restaurants near Hampton Inn & Suites Wilder; All things to do in Wilder","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":4477919,"ranking":5,"query_text":"what airport is in wilder ky","passage_text":"Local airports near Park City, KY. 13 miles: Glasgow, KY (GLW \/ KGLW) Glasgow Municipal Airport. 29 miles: Bowling Green, KY (BWG \/ KBWG) Bowling Green-Warren County Regional Airport. 50 miles: Tompkinsville, KY (KTZV \/ TZV) Tompkinsville-Monroe County Airport.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7098180,"ranking":6,"query_text":"what airport is in wilder ky","passage_text":"Next Image. 1  All Hampton Inn & Suites - Wilder, KY is visible from I-275, located on a hill that provides guests with a magnificent view of the downtown Cincinnati skyline! Hampton Inn & Suites - Wilder, KY is visible from I-275 at Exit #77, located on a hill with a magnificent view of the downtown Cincinnati skyline!","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7098184,"ranking":7,"query_text":"what airport is in wilder ky","passage_text":"Wilder Airport. Find Wilder Kentucky airports, local, private and regional and international airports. Airports provide information about flights, departures, arrivals, times, airport delays, international airlines, and airport codes.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7098183,"ranking":8,"query_text":"what airport is in wilder ky","passage_text":"Next Image. 1  All Hampton Inn & Suites - Wilder, KY is visible from I-275, located on a hill that provides guests with a magnificent view of the downtown Cincinnati skyline! 2  Exterior Hampton Inn & Suites - Wilder, KY is visible from I-275, located on a hill that provides guests with a magnificent view of the downtown Cincinnati skyline! 1  Now showing. 2  Hampton Inn & Suites - Wilder, KY is visible from I-275 at Exit #77, located on a hill with a magnificent view of the downtown Cincinnati skyline! Take in the sunshine and fresh air as you sip your morning coffee and peruse the USA Today in our courtyard area.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":2358103,"ranking":9,"query_text":"what airport is in wilder ky","passage_text":"Major cities near Larue County, KY. This is a list of large cities closest to Larue County, KY. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Larue County, KY.1  50 miles to Louisville, KY.2  77 miles to Lexington-Fayette, KY.his is a list of large cities closest to Larue County, KY. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Larue County, KY. 1  50 miles to Louisville, KY. 2  77 miles to Lexington-Fayette, KY.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":1258845,"ranking":10,"query_text":"what airport is in wilder ky","passage_text":"Geographically, the city is based on Simpsonville, KY, and it is possibly where the family name Simpson for the show originates. Simpsonville neighbors with Shelbyville, KY. Springfield's state's capital, Capital City, is inspired by Frankfurt, KY's airport, Capital City Airport.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":4914359,"ranking":11,"query_text":"what airport is in wilder ky","passage_text":"vacation deals to Williamstown, KY. Major cities near Williamstown, KY. This is a list of large cities closest to Williamstown, KY. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Williamstown, KY.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7098186,"ranking":12,"query_text":"what airport is in wilder ky","passage_text":"How to get to Wilder. Fly in to Cincinnati, OH (LUK-Cincinnati Municipal - Lunken Field), 4.8 mi (7.8 km) from downtown Wilder. Cincinnati, OH (CVG-Cincinnati - Northern Kentucky Intl.) is the next closest major airport, 9.7 mi (15.6 km) away. What to see around Wilder Fun outdoor activities are on hand along with these attractions:","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7680931,"ranking":13,"query_text":"what airport is in wilder ky","passage_text":"This is a list of large cities closest to Big Clifty, KY. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Big Clifty, KY. 54 miles to Louisville, KY. 99 miles to Lexington-Fayette, KY.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":3638456,"ranking":14,"query_text":"what airport is in wilder ky","passage_text":"Major cities near Mammoth Cave, KY. This is a list of large cities closest to Mammoth Cave, KY. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Mammoth Cave, KY. 76 miles to Louisville, KY.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7638316,"ranking":15,"query_text":"what airport is in wilder ky","passage_text":"Major cities near Todd County, KY. This is a list of large cities closest to Todd County, KY. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Todd County, KY. 1  50 miles to Nashville, TN. 2  126 miles to Louisville, KY.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":6844588,"ranking":16,"query_text":"what airport is in wilder ky","passage_text":"More than 3,715 passengers travel on flights from this airport every day. View popular flights from this airport and the average price travelers paid. Pikeville, KY Travel Tips: First, start by examining the different airport options that are availble to you. You may find different low-fare airlines or cheaper tickets by flying into one airport and driving a short distance to Pikeville, KY. Be flexible in your travel plans in order to get the lowest fare to Pikeville, KY.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7201882,"ranking":17,"query_text":"what airport is in wilder ky","passage_text":"Major cities near Gilbertsville, KY This is a list of large cities closest to Gilbertsville, KY. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Gilbertsville, KY. 103 miles to Nashville, TN; 152 miles to Saint Louis, MO; 162 miles to Memphis, TN; 164 miles to Louisville, KY; 223 miles to Indianapolis, IN; 223 miles to Lexington-Fayette, KY","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":5795252,"ranking":18,"query_text":"what airport is in wilder ky","passage_text":"Mt Sterling Montgomery County Airport. 709 Airport Rd Mount Sterling, KY 40353.","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":7455260,"ranking":19,"query_text":"what airport is in wilder ky","passage_text":"Lexington, KY is 7,969 miles from Nairobi; Atlanta, GA - Hartsfield-Jackson Atlanta Intl Airport is the most popular connection for one stop flights between Lexington, KY and Nairobi Arrival information Wilson Airport (Nairobi, Kenya)","bm25_label":"high","relevance_label":0.0},{"query_id":1087858,"passage_id":4477921,"ranking":20,"query_text":"what airport is in wilder ky","passage_text":"Another major airport is Nashville International Airport (BNA \/ KBNA), which has international and domestic flights from Nashville, Tennessee and is 91 miles from Park City, KY. Owensboro-Daviess County Regional Airport (OWB \/ KOWB) has domestic flights from Owensboro, Kentucky and is 104 miles from Park City, KY.","bm25_label":"high","relevance_label":0.0}]