[{"query_id":1087014,"passage_id":7105513,"ranking":1,"query_text":"what are the hazards of ammonium","passage_text":"The Hazards and Dangers of Ammonium Nitrate. What is Ammonium Nitrate? Ammonium nitrate is an odorless, colorless or white, crystal salt produced by the reaction of ammonia and nitric acid. How is Ammonium Nitrate used? Ammonium nitrate is an important component of many fertilizer mixtures. It provides a sourceof nitrogen to plants, which increases growth and crop yields. Small quantities of ammonium nitrate are also sold as an additive for mining explosives and other nonagricultural uses. What are the potential hazards? Under normal handling conditions, ammonium nitrate is not harmful. However, inhalation of high concentrations of ammonium nitrate dust can cause respiratory tract irritation. Symptoms may include: coughing, sore throat, shortness of breath, or even suffocation.","bm25_label":"high","relevance_label":1.0},{"query_id":1087014,"passage_id":5248917,"ranking":2,"query_text":"what are the hazards of ammonium","passage_text":"Fire Fighting Measures. Not considered a fire hazard, but fire may decompose ammonium thiocyanate to form toxic gases more hazardous than ammonium thiocyanate itself. Not considered to be an explosion hazard. Water spray, dry chemical, alcohol foam, or carbon dioxide.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":7427156,"ranking":3,"query_text":"what are the hazards of ammonium","passage_text":"Hazards Associated with HF, F. 2. and Other Fluorine Compounds. â\u0080¢ Many chemicals containing fluorine, such as. ammonium fluoride, sodium fluoride, sulfur. tetrafluoride, and ammonium bifluoride, may. react with acid or water to produce HF. â\u0080¢ Review the MSDS of all fluoride compounds. carefully for safety precautions to reduce the. risk of creating a HF hazard.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":7424168,"ranking":4,"query_text":"what are the hazards of ammonium","passage_text":"Ammonium chloride is a white crystalline solid. It is soluble in water(37%). The primary hazard is the threat posed to the environment. Immediate steps should be taken to limit its spread to the environment. It is used to make other ammonium compounds, as a soldering flux, as a fertilizer, and for many other uses.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":5248918,"ranking":5,"query_text":"what are the hazards of ammonium","passage_text":"Ammonium thiocyanate. Outline Industrial ammonium thiocyanate thiocyanic acid Potassium thiocyanate Solubility in water (g \/ 100ml) Chemical Properties Uses Production method Category Toxicity grading Acute toxicity Flammability and hazard characteristics Storage characteristics Extinguishing agent Professional standards.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":225666,"ranking":6,"query_text":"what are the hazards of ammonium","passage_text":"Reactivity Profile. The hazards of AMMONIUM NITRATE have been well studied because of several extremely severe explosions [Chem. Eng., 1962, 70, 91; Bretherick, 5th Ed., 1995].","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":2556516,"ranking":7,"query_text":"what are the hazards of ammonium","passage_text":"Ammonium carbonate is designated as a hazardous substance under section 311(b)(2)(A) of the Federal Water Pollution Control Act and further regulated by the Clean Water Act Amendments of 1977 and 1978.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":7176305,"ranking":8,"query_text":"what are the hazards of ammonium","passage_text":"Ferrous ammonium sulfate | FeH8N2O8S2 | CID 24863 - structure, chemical names, physical and chemical properties, classification, patents, literature, biological activities, safety\/hazards\/toxicity information, supplier lists, and more.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":225667,"ranking":9,"query_text":"what are the hazards of ammonium","passage_text":"This process is aided catalytically with such substances as nitric acid and chloride ion, [Chem. Abs., 1982, 97, 78074]. Reactivity Profile. The hazards of AMMONIUM NITRATE have been well studied because of several extremely severe explosions [Chem.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":5211059,"ranking":10,"query_text":"what are the hazards of ammonium","passage_text":"The chemical compound ammonium sulfate is primarily used in fertilizers but is important in other industries as well. While it isnâ\u0080\u0099t considered highly hazardous to humans, there are some important precautions to take if youâ\u0080\u0099re using it.Chemical Properties.Ammonium sulfate, also called diammonium sulfate or sulfuric acid diammonium salt, is a white crystalline solid with no smell. It tastes salty. The compound dissolves easily in water but will not dissolve in alcohol or acetone.he chemical compound ammonium sulfate is primarily used in fertilizers but is important in other industries as well. While it isnâ\u0080\u0099t considered highly hazardous to humans, there are some important precautions to take if youâ\u0080\u0099re using it. Chemical Properties.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":225664,"ranking":11,"query_text":"what are the hazards of ammonium","passage_text":"The hazards of AMMONIUM NITRATE have been well studied because of several extremely severe explosions [Chem. Eng., 1962, 70, 91; Bretherick, 5th Ed., 1995]. Mixtures with alkyl esters may explode, owing to the formation of alkyl nitrates.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":8752974,"ranking":12,"query_text":"what are the hazards of ammonium","passage_text":"What reactions does ammonium chloride and water produce? No chemical reactions will happen when ammonium chloride and water is mixed. Water will dissolve ammonium chloride, meaning the ions of ammonium chloride will dissociate, but â\u0080¦no chemical reaction involving the creation of new species will occur.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":1204913,"ranking":13,"query_text":"what are the hazards of ammonium","passage_text":"Ammonium sulfide is a very useful reagent in mineral analysis. It's easy to prepare in the modestly-equipped laboratory, though there's the significant hazard of hydrogen sulfide during its production.he ammonium sulfide solution, prepared as outlined above, can be used to precipitate certain metal cations as sulfides (some, such as iron, precipitate as hydroxides if the pH is adjusted toward alkalinity). For detailed information on sulfide precipitations, see Orsino Smith's procedures P-8 and P-14 (1946).","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":225665,"ranking":14,"query_text":"what are the hazards of ammonium","passage_text":"Reactivity Profile. The hazards of AMMONIUM NITRATE have been well studied because of several extremely severe explosions [Chem. Eng., 1962, 70, 91; Bretherick, 5th Ed., 1995]. Mixtures with alkyl esters may explode, owing to the formation of alkyl nitrates.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":3341318,"ranking":15,"query_text":"what are the hazards of ammonium","passage_text":"The Role of Ammonium Excretion. 1  What happens next to ammonium is somewhat complex. 2  Now remember; free hydrogen ions are not filtered by the kidney. 3  Notice that ammonium, not ammonia is produced in the proximal tubule.  The answer to this is somewhat controversial in the literature.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":2116151,"ranking":16,"query_text":"what are the hazards of ammonium","passage_text":"Ammonium carbonate decomposes when heated to give gaseous ammonia and gaseous carbon dioxide. Reaction is non-explosvie. Causes decomposition of sodium hypochlorite within a few seconds [Mellor 2 Supp. 1:550 1956]. Health Hazard. Inhalation causes irritation of nose and throat.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":2556518,"ranking":17,"query_text":"what are the hazards of ammonium","passage_text":"What is Ammonium Bicarbonate Used For? Health Benefits and Side Effects of Ammonium Bicarbonate. Ammonium Bicarbonate or commonly known as baking soda is a compound that is formed by passing carbon dioxide through a solution of a normal compound slightly soluble in water. It is used as raising agent in foods.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":916847,"ranking":18,"query_text":"what are the hazards of ammonium","passage_text":"Diagram of the nitrogen cycle. 1  Fixation-Fixation is the first step in the process of making nitrogen usable by plants. 2  Here bacteria change nitrogen into ammonium. 3  Nitrification-This is the process by which ammonium gets changed into nitrates by bacteria. 4  Nitrates are what the plants can then absorb. Here bacteria change nitrogen into ammonium. 2  Nitrification-This is the process by which ammonium gets changed into nitrates by bacteria. 3  Nitrates are what the plants can then absorb. 4  Assimilation-This is how plants get nitrogen.","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":225663,"ranking":19,"query_text":"what are the hazards of ammonium","passage_text":"This process is aided catalytically with such substances as nitric acid and chloride ion, [Chem. Abs., 1982, 97, 78074]. Reactivity Profile. The hazards of AMMONIUM NITRATE have been well studied because of several extremely severe explosions [Chem. Eng., 1962, 70, 91; Bretherick, 5th Ed., 1995].","bm25_label":"high","relevance_label":0.0},{"query_id":1087014,"passage_id":548918,"ranking":20,"query_text":"what are the hazards of ammonium","passage_text":"Best Answer: In ammonium chloride, you don't have any ammonia - all the ammonia is protonated, the species you do have are ammonium (NH4+) and chloride. Now, the ammonium ion is a weak acid, so it can donate protons to water, which is what happens in the second step.","bm25_label":"high","relevance_label":0.0}]