[{"query_id":1087114,"passage_id":2795191,"ranking":1,"query_text":"what are the complications of varicose vein","passage_text":"Complications of varicose veins. Varicose veins can cause complications because they stop your blood flowing properly. Most people who have varicose veins won't develop complications, but, if you do, it will usually be several years after your varicose veins first appear.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":2025657,"ranking":2,"query_text":"what are the complications of varicose vein","passage_text":"Treatment is required for varicose veins only when they cause symptoms or when complications arise. Occasionally, varicose veins may be complicated by manifestations of chronic venous insufficiency such as leg swelling, skin discolouration, eczema, induration, venous ulcers and varicose vein rupture.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":7113966,"ranking":3,"query_text":"what are the complications of varicose vein","passage_text":"Varicose veins have a demonstrated loss of contractility. 28. Varicose veins are often complicated by local inflammation and thrombosis. This may be due to venous hypertension to an inherent histochemical abnormality in the varicose vein\/endothelial wall.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":3039969,"ranking":4,"query_text":"what are the complications of varicose vein","passage_text":"Spider\/Varicose Vein Complications. Spider veins and varicose veins may be unsightly and annoying, but they rarely pose a serious health threat. Occasionally, they may cause ulcers -- large sores in the skin -- especially near the ankles. Varicose veins can also form painful blood clots.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":8715755,"ranking":5,"query_text":"what are the complications of varicose vein","passage_text":"Varicose Veins. Varicose (VAR-i-kos) veins are swollen, twisted veins that you can see just under the surface of the skin. These veins usually occur in the legs. However, they also can form in other parts of your body. Varicose veins are a common condition. They usually cause few signs or symptoms. In some cases, varicose veins may cause complications, such as mild to moderate pain, blood clots, or skin ulcers.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":5167224,"ranking":6,"query_text":"what are the complications of varicose vein","passage_text":"Varicose Veins. The goals of varicose vein treatment are to reduce symptoms and prevent complications. For some, the goal may be improved appearance. Home treatment-such as exercising and wearing compression stockings-is typically the first approach.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":6916376,"ranking":7,"query_text":"what are the complications of varicose vein","passage_text":"Varicose veins are treated with lifestyle changes and medical procedures. The goals of treatment are to relieve symptoms, prevent complications, and improve appearance. If varicose veins cause few symptoms, your doctor may simply suggest making lifestyle changes.If your symptoms are more severe, your doctor may recommend one or more medical procedures.ifestyle changes often are the first treatment for varicose veins. These changes can prevent varicose veins from getting worse, reduce pain, and delay other varicose veins from forming.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":7104604,"ranking":8,"query_text":"what are the complications of varicose vein","passage_text":"Complications. Vein disease does not go away by itself and may worsen over time if ignored or treatment is delayed. Complications of untreated varicose veins may include: Thrombophlebitis: Blood flow in the superficial varicose veins is often sluggish and may result in blood clots near the surface of the skin. Superficial vein thrombosis (clots) rarely cause serious problems but can be very painful and may require further evaluation and treatment.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":392471,"ranking":9,"query_text":"what are the complications of varicose vein","passage_text":"Varicose veins are treated with lifestyle changes and medical procedures. The goals of treatment are to relieve symptoms, prevent complications, and improve appearance. If varicose veins cause few symptoms, your doctor may simply suggest making lifestyle changes.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":7110674,"ranking":10,"query_text":"what are the complications of varicose vein","passage_text":"Complications of varicose veins, although rare, can include: Ulcers. Extremely painful ulcers may form on the skin near varicose veins, particularly near the ankles. Ulcers are caused by long-term fluid buildup in these tissues, caused by increased pressure of blood within affected veins.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":8169891,"ranking":11,"query_text":"what are the complications of varicose vein","passage_text":"Varicose veins usually don't cause medical problems. If your varicose veins cause few signs and symptoms, your doctor may suggest simply making lifestyle changes. In some cases, varicose veins can cause complications, such as pain, blood clots, or skin ulcers. If your condition is more severe, your doctor may recommend one or more medical procedures. Some people choose to have these procedures to improve the appearance of their varicose veins or to relieve pain.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":5829210,"ranking":12,"query_text":"what are the complications of varicose vein","passage_text":"These veins usually occur in the legs. However, they also can form in other parts of your body. Varicose veins are a common condition. They usually cause few signs or symptoms. In some cases, varicose veins may cause complications, such as mild to moderate pain, blood clots, or skin ulcers.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":3749575,"ranking":13,"query_text":"what are the complications of varicose vein","passage_text":"Thrombophlebitis is inflammation or swelling in leg veins caused by blood clots. Thrombophlebitis can be a complication of varicose veins and can look red, feel warm to the touch and can be painful. With thrombophlebitis, a blocked vein in the leg becomes swollen, irritated, and even hard to the touch.hrombophlebitis is inflammation or swelling in leg veins caused by blood clots. Thrombophlebitis can be a complication of varicose veins and can look red, feel warm to the touch and can be painful. With thrombophlebitis, a blocked vein in the leg becomes swollen, irritated, and even hard to the touch.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":398531,"ranking":14,"query_text":"what are the complications of varicose vein","passage_text":"The use of radiofrequency ablation has obtained importance as it can be used to treat most of the skin lesions with minimal side effects and complications. Varicose veins. Radiofrequency ablation is a minimally invasive procedure used in the treatment of varicose veins. It is an alternative to the traditional stripping operation.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":1730122,"ranking":15,"query_text":"what are the complications of varicose vein","passage_text":"What is Varicose Vein Treatment (Endovenous Ablation of Varicose Veins)? Varicose veins are abnormally large veins commonly seen in the legs. Normally, blood circulates from the heart to the legs via arteries and back to the heart through veins.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":992269,"ranking":16,"query_text":"what are the complications of varicose vein","passage_text":"What are varicose veins? Varicose veins are veins that are swollen and bulge above the surface of the skin. They may be twisted and are often blue or dark purple. Varicose veins are most commonly found on the legs or feet, but they can also be found on the groin. Varicose veins that you see are just under the surface of the skin.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":2498892,"ranking":17,"query_text":"what are the complications of varicose vein","passage_text":"The treatment of varicose veins is usually necessary to ease pain or discomfort, to treat complications, such as leg ulcers and swelling, or simply required for cosmetic reasons.his treatment is only suitable to reduce minor varicose veins (reticular veins) with no blood in the vein. For thread or spider veins (telangectasia), we use Microinjection Sclerotherapy which uses diluted solutions of the sclerosant substance administered through very small needles.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":6856977,"ranking":18,"query_text":"what are the complications of varicose vein","passage_text":"What Are Noninvasive Treatments for Varicose Veins? Varicose veins are twisted, enlarged, and painful veins that fill with blood. They usually develop in the legs and are raised above the surface of the skin. Traditionally, a surgery known as â\u0080\u009cvein strippingâ\u0080\u009d was performed to remove varicose veins.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":2107910,"ranking":19,"query_text":"what are the complications of varicose vein","passage_text":"Varicose Veins Treatment. involves injecting a chemical inside the vein that obliterates it and causes it to scar. Sclerotherapy is not completely successful in aleviating symptoms, and preventing formation of more varicose veins. Complications associated with sclerotherapy include allergic reactions to the chemical used, stinging or burning at the various injection sites, inflammation, skin ulcerations, and permanent discoloration of the skin.","bm25_label":"medium","relevance_label":0.0},{"query_id":1087114,"passage_id":7279404,"ranking":20,"query_text":"what are the complications of varicose vein","passage_text":"Severe long-standing varicose veins can lead to leg swelling, venous eczema, skin thickening (lipodermatosclerosis) and ulceration. Although life-threatening complications are uncommon, varicose veins may be confused with deep vein thrombosis, which may be life-threatening. Non-surgical treatments include sclerotherapy, elastic stockings, leg elevation and exercise.","bm25_label":"medium","relevance_label":0.0}]