[{"query_id":1087803,"passage_id":5085923,"ranking":1,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Redness, swelling, itching and pain are all common at the site of the bee sting. There are a few things you can do to try to alleviate the symptoms: Use an ice pack to reduce swelling at the site, but take care not to cause frostbite. Use an antihistamine like diphenhydramine (Benadryl) to reduce swelling and itching.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":5205279,"ranking":2,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"The pain should subside quickly, but the redness and swelling will be there for some time. Swelling duration is about a day for normal person with no allergic response to bee stings. Antihistamines, corticosteroid cream or calamine lotion should be applied on the site of the sting to reduce inflammation.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":3938270,"ranking":3,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Prescription eyedrops and medications. 1  Antihistamine eyedrops: These can reduce the itching, redness and swelling associated with eye allergies. 2  Mast cell stabilizer eyedrops: These prevent the release of histamine and other substances that cause allergy symptoms.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":7098774,"ranking":4,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"If the swelling is due to an allergic reaction, then yes, antihistamines do help to reduce swelling.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":7112594,"ranking":5,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"People with allergies can come into contact with something that causes a reaction in their body and end up with red skin and swollen fingers, in the morning especially because thereâ\u0080\u0099s one nightâ\u0080\u0099s reaction. To treat this, the individual is given an antihistamine. This drastically reduces swelling, itching and redness. 6. Pregnancy","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":7098776,"ranking":6,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"'+' + (voteCount + 1) : (voteCount + 1) }}. Benadryl and Zyrtec are antihistamines and not diuretics (or waterpills). Unless you have swelling produced by an allergic reaction related to the release of histamine, then antihistamines are not expected to reduce your swelling. Benadryl and Zyrtec are antihistamines and not diuretics (or waterpills).","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":1379790,"ranking":7,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"1 Place ice (wrapped in a washcloth) on the site of the sting for 10 minutes and then off for 10 minutes. Repeat this process. 2  If necessary, take an antihistamine, or apply creams that reduce itching.  Over the next several days, watch for signs of infection (such as increasing redness, swelling, or pain).","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":796544,"ranking":8,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Antihistamines Antihistamines, which are taken by mouth or as a nasal spray, can relieve sneezing and itching in the nose and eyes. They also reduce runny nose and, to a lesser extent, nasal stuffiness. Some older antihistamines can cause side effects such as drowsiness and loss of alertness and coordination. NIAID â\u0080¢ Runny nose and mucus productionâ\u0080¢ Sneezingâ\u0080¢ Itchy nose, eyes, ears, and mouthâ\u0080¢ Stuffy noseâ\u0080¢ Red and watery eyesâ\u0080¢ Swelling around the eyesâ\u0080¢ Coughingâ\u0080¢ Wheezingâ\u0080¢ Chest tightnessâ\u0080¢ Shortness of breathHowever, not all of these seasonal symptoms are due to pollen.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":4639935,"ranking":9,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Toothpaste can soothe pain from ant bites. Antihistamines can be used to reduce swelling and redness from a bite. An allergy to ant bites might include shortness of breath and a rapid heart beat. The aloe vera plant can be used to treat pain and inflammation caused by ant bites.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":3467870,"ranking":10,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Treatment Tip #4: Combat the Itch. Treat your bed bug bites with your favorite anti-itch cream to get relieve itchiness and reduce other bed bug rash symptoms like redness and swelling. Some folks like to use an antihistamine based cream while others like a hydro-cortisone base cream.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":6171505,"ranking":11,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"If the pinkeye is caused by an infection, then a warm, moist compress may soothe your eye and help reduce redness and swelling. Warm, moist compresses can spread infection from one eye to the other.Use a different compress for each eye, and use a clean compress for each application.ye Problems: Using Eyedrops and Eye Ointments. For pinkeye related to allergies, antihistamines, such as loratadine (Claritin) or cetirizine (Zyrtec), may help relieve your symptoms. Don't give antihistamines to your child unless you've checked with the doctor first.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":3720170,"ranking":12,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"1 An antihistamine taken by mouth, such as Benadryl or Chlor-Trimeton, may help relieve itching, redness, and swelling. Don't give antihistamines to your child unless you've checked with the doctor first.  A spray of local anesthetic containing benzocaine, such as Solarcaine, may help relieve pain.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":7581674,"ranking":13,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"What is cetirizine? Cetirizine is an antihistamine that reduces the natural chemical histamine in the body. Histamine can produce symptoms of sneezing, itching, watery eyes, and runny nose. It is used to treat cold or allergy symptoms such as sneezing, itching, watery eyes, or runny nose. Cetirizine is also used to treat itching and swelling caused by hives.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":1847749,"ranking":14,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Licking of feet, inflamed ears, itching, redness, and hair loss; sometimes development of infection or hot spots. Intradermal or serologic (blood) testing for allergies. Reduce exposure to allergen (what the dog is allergic to); steroids, fatty acid supplements, biotin, antihistamines, shampoos, or immunotherapy.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":7135895,"ranking":15,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Licking of feet, inflamed ears, itching, redness, and hair loss; sometimes development of infection or hot spots Intradermal or serologic (blood) testing for allergies Reduce exposure to allergen (what the dog is allergic to); steroids, fatty acid supplements, biotin, antihistamines, shampoos, or immunotherapy","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":3177809,"ranking":16,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Other medications that might be prescribed include: 1  Corticosteriods to reduce swelling and pain. 2  Antihistamines to reduce itching. 3  Numbing medication that can be applied through a gel, cream, spray or skin patch. 4  Other pain medications.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":3681440,"ranking":17,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Swollen mosquito bites can be dealt with using antihistamines. Q AFTER recently returning from a week's holiday in Italy I am still covered in mosquito bites. A few have swelled up to the size of a tennis ball. Does this mean I am allergic to them and if so what can I do to protect myself besides using sprays containing DEET? Also how can I reduce the swelling?","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":6349891,"ranking":18,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Swelling caused by allergic reaction. When your body encounters something that it's allergic to, it released histamines into your bloodstream. In order to reduce the swelling, you can take antihistamines. If you experience severe difficulty in breathing after an allergic reaction, consult a doctor immediately.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":461515,"ranking":19,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Licking of feet, inflamed ears, itching, redness, and hair loss; sometimes development of infection or hot spots. Intradermal or serologic (blood) testing for allergies. Reduce exposure to allergen (what the cat is allergic to), steroids, omega 3 fatty acid supplements, antihistamines, shampoos, immunotherapy.","bm25_label":"high","relevance_label":0.0},{"query_id":1087803,"passage_id":7098781,"ranking":20,"query_text":"what antihistamines will reduce redness and swelling","passage_text":"Swelling post Fraxel treatments is normal. Intensity of the treatment usually correlates with the downtime and inflammation. Keeping the head or area treated elevated and Icing the first 24 hours can help reduce the swelling as well as antihistamines (Claritin, Benadryl,Zyrtec) and anti-inflammatories (Aleve, Motrin, Advil).","bm25_label":"high","relevance_label":1.0}]