[{"query_id":1088541,"passage_id":7092968,"ranking":1,"query_text":"weather in fletcher,nc","passage_text":"Weather for Fletcher, NC - Fletcher, NC 28732 Weather, Current Weather in Fletcher, NC. Local weather report for Fletcher, NC, Local Fletcher, NC 28732 weather. Forecast for Fletcher, North Carolina, Fletcher, NC weather forecast. Find your local Fletcher weather forecast. Fletcher, NC weather conditions. Weather outlook for Fletcher, NC. Weather report for Fletcher, NC. Weather Maps and Driving Directions fletcher nc weather.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092965,"ranking":2,"query_text":"weather in fletcher,nc","passage_text":"Fletcher NC Weather Forecast - Find local 28732 Fletcher weather forecasts and current conditions for Fletcher, NC. Local travel weather conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092966,"ranking":3,"query_text":"weather in fletcher,nc","passage_text":"Fletcher Weather Forecast for Sunday, February 11 Countries\/United States\/ North Carolina\/ Fletcher The Fletcher, NC forecast for Feb 11 is 58 degrees and Overcast .","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":2318326,"ranking":4,"query_text":"weather in fletcher,nc","passage_text":"There are 177 real estate listings found in Fletcher, NC. View our Fletcher real estate area information to learn about the weather, local school districts, demographic data, and general information about Fletcher, NC. Get in touch with a Fletcher real estate agent who can help you find the home of your dreams in Fletcher.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092964,"ranking":5,"query_text":"weather in fletcher,nc","passage_text":"9pm: The Fletcher, NC forecast for Feb 11 is 58 degrees and Light rain shower. There is 87 percentage chance of rain and 8 mph winds from the South-Southwest. Fletcher 10 Day Weather. Sunday: The Fletcher forecast for Feb 11 is 58","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092967,"ranking":6,"query_text":"weather in fletcher,nc","passage_text":"Fletcher Weather Forecast for Monday, August 14. Countries\/United States\/ North Carolina\/ Fletcher. The Fletcher, NC forecast for Aug 14 is 80 degrees and Thundery outbreaks possible . There is 87 percentage chance of rain and 3 mph winds from the East-Northeast.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092959,"ranking":7,"query_text":"weather in fletcher,nc","passage_text":"Fletcher Weather Forecast for Monday, August 14. The Fletcher, NC forecast for Aug 14 is 80 degrees and Thundery outbreaks possible . There is 87 percentage chance of rain and 3 mph winds from the East-Northeast.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092962,"ranking":8,"query_text":"weather in fletcher,nc","passage_text":"Hourly Forecast Detailed. 1  0am:The Fletcher, NC forecast for Aug 14 is 68 degrees and Fog. 2  3am:The Fletcher, NC forecast for Aug 14 is 66 degrees and Fog. 3  6am:The Fletcher, NC forecast for Aug 14 is 67 degrees and Light rain shower. 4  9am:The Fletcher, NC forecast for Aug 14 is 72 degrees and Cloudy.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092963,"ranking":9,"query_text":"weather in fletcher,nc","passage_text":"0am: The Fletcher, NC forecast for Feb 11 is 52 degrees and Mist. There is 94 percentage chance of rain and 6 mph winds from the South. 3am: The Fletcher, NC forecast for Feb 11 is 50 degrees and Light rain. There is 99 percentage chance of rain and 5 mph winds from the South. 6am: The Fletcher, NC forecast for Feb 11 is 51 degrees and Light rain shower. There is 97 percentage chance of rain and 7 mph winds from the South. 9am: The Fletcher, NC forecast for Feb 11 is 58 degrees and Moderate rain.","bm25_label":"high","relevance_label":1.0},{"query_id":1088541,"passage_id":2318320,"ranking":10,"query_text":"weather in fletcher,nc","passage_text":"Fletcher, NC. Sponsored Topics. Fletcher is a town in Henderson County, North Carolina, United States. The population was 4,185 at the 2000 census. Fletcher is home to Asheville Regional Airport, which serves Western North Carolina. It is part of the Asheville Metropolitan Statistical Area.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":2318325,"ranking":11,"query_text":"weather in fletcher,nc","passage_text":"Fletcher, NC Employment Information. If youâ\u0080\u0099re ready for a new and challenging job, take a look at our wide range of Fletcher, North Carolina jobs. Whatever type of job in Fletcher youâ\u0080\u0099re seeking, you can find it on Monster. View our listings of Fletcher job opportunities and find your perfect fit today. View More.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":7092961,"ranking":12,"query_text":"weather in fletcher,nc","passage_text":"Hourly Forecast Detailed. 1  0am:The Fletcher, NC forecast for Aug 14 is 68 degrees and Fog. There is 97 percentage chance of rain and 4 mph winds from the East-Northeast. 2  3am:The Fletcher, NC forecast for Aug 14 is 66 degrees and Fog. There is 98 percentage chance of rain and 2 mph winds from the South-Southeast.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":4476128,"ranking":13,"query_text":"weather in fletcher,nc","passage_text":"Zip code 28704 is primarily located in Buncombe County. Portions of 28704 are also located in Henderson County. The official US Postal Service name for 28704 is ARDEN, North Carolina. Portions of zip code 28704 are contained within or border the city limits of Royal Pines, NC, Avery Creek, NC, Asheville, NC, and Fletcher, NC. The area code for zip code 28704 is 828.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":5825672,"ranking":14,"query_text":"weather in fletcher,nc","passage_text":"arden nc weather copyright Â© 2018 Weather for Arden, NC - Arden, NC 28704 Weather, Current Weather in Arden, NC. Local weather report for Arden, NC, Local Arden, NC 28704 weather. Forecast for Arden, North Carolina, Arden, NC weather forecast. Find your local Arden weather forecast. Arden, NC weather conditions. Weather outlook for Arden, NC. Weather report for Arden, NC. Weather Maps and Driving Directions arden nc weather.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":6019383,"ranking":15,"query_text":"weather in fletcher,nc","passage_text":"harmony nc weather copyright Â© 2018 Weather for Harmony, NC - Harmony, NC 28634 Weather, Current Weather in Harmony, NC. Local weather report for Harmony, NC, Local Harmony, NC 28634 weather. Forecast for Harmony, North Carolina, Harmony, NC weather forecast. Find your local Harmony weather forecast. Harmony, NC weather conditions. Weather outlook for Harmony, NC. Weather report for Harmony, NC. Weather Maps and Driving Directions harmony nc weather.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":521456,"ranking":16,"query_text":"weather in fletcher,nc","passage_text":"Weather for Enfield, NC - Enfield, NC 27823 Weather, Current Weather in Enfield, NC. Local weather report for Enfield, NC, Local Enfield, NC 27823 weather. Forecast for Enfield, North Carolina, Enfield, NC weather forecast. Find your local Enfield weather forecast. Enfield, NC weather conditions. Weather outlook for Enfield, NC. Weather report for Enfield, NC. Weather Maps and Driving Directions enfield nc weather.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":1983614,"ranking":17,"query_text":"weather in fletcher,nc","passage_text":"Weather for Cherokee, NC - Cherokee, NC Weather, Current Weather in Cherokee, NC. Local weather report for Cherokee, NC, Local Cherokee, NC weather. Forecast for Cherokee, North Carolina, Cherokee, NC weather forecast. Find your local Cherokee weather forecast. Cherokee, NC weather conditions. Weather outlook for Cherokee, NC.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":5173859,"ranking":18,"query_text":"weather in fletcher,nc","passage_text":"Park Fletcher Commercial Real Estate. View our Park Fletcher real estate area information to learn about the weather, local school districts, demographic data, and general information about Park Fletcher, IN. Get in touch with a Park Fletcher real estate agent who can help you find the home of your dreams in Park Fletcher.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":1224812,"ranking":19,"query_text":"weather in fletcher,nc","passage_text":"Weather for Mooresville, NC - Mooresville, NC Weather, Current Weather in Mooresville, NC. Local weather report for Mooresville, NC, Local Mooresville, NC weather. Forecast for Mooresville, North Carolina, Mooresville, NC weather forecast. Find your local Mooresville weather forecast. Mooresville, NC weather conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":1088541,"passage_id":8556888,"ranking":20,"query_text":"weather in fletcher,nc","passage_text":"Weather for Belhaven, NC - Belhaven, NC Weather, Current Weather in Belhaven, NC. Local weather report for Belhaven, NC, Local Belhaven, NC weather. Forecast for Belhaven, North Carolina, Belhaven, NC weather forecast. Find your local Belhaven weather forecast. Belhaven, NC weather conditions.","bm25_label":"high","relevance_label":0.0}]