[{"query_id":1088444,"passage_id":7093560,"ranking":1,"query_text":"weather in kashan","passage_text":"Weekly Weather Report for Kashan, Iran. Looking at the weather in Kashan, Iran over the next 7 days, the maximum temperature will be 40â\u0084\u0083 (or 103â\u0084\u0089) on Monday 14th August at around 3 pm. In the same week the minimum temperature will be 28â\u0084\u0083 (or 83â\u0084\u0089) on Tuesday 8th August at around 3 am.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7093559,"ranking":2,"query_text":"weather in kashan","passage_text":"Interactive Kashan, Iranweather map allows you to pan and zoom to get unmatched weather details in your local neighbourhood or half a world away from The Weather Channel and Weather.com Interactive Kashan, Iranweather map allows you to pan and zoom to get unmatched weather details in your local neighbourhood or half a world away from The Weather Channel and Weather.com Show me the weather in... city, zip, or place","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7093556,"ranking":3,"query_text":"weather in kashan","passage_text":"Kashan, Iran weather text for Wed 14 th February. It looks on Wednesday, 14 February the Kashan, Iran weather is going to be patchy rain possible. The visibility is going to be around 17 km i.e. 10 miles and an atmospheric pressure of 1014 mb. The daytime temperature is going to reach 12 Â°c and the temperature is going to dip to 6 Â°c at night.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7093554,"ranking":4,"query_text":"weather in kashan","passage_text":"Guide to Kashan weather in December. The average maximum daytime temperature in Kashan in December is a cool 11Â°C (52Â°F). The average night-time temperature is usually a cold 1Â°C (34Â°F). There are usually 6 hours of bright sunshine each day, which represents 58% of the 10 hours of daylight.","bm25_label":"high","relevance_label":1.0},{"query_id":1088444,"passage_id":7093558,"ranking":5,"query_text":"weather in kashan","passage_text":"Weather is too cold this time of year in Kashan to be enjoyable for warm weather travelers. The average high during this season is between 63.2Â°F (17.3Â°C) and 47.8Â°F (8.8Â°C). On average, it rains or snows a smalll amount: 1 to 2 times per month.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7863443,"ranking":6,"query_text":"weather in kashan","passage_text":"My name is kashan and it is good name. My son name is Muhammad Kashan Qamar. My name is Muhammad Kashan Haider khattak. It is one of unique and best name.kashan lucky number is 3 dont 1. My name is Muhammad Kashan and it is attractive name! my baby name is kahan and its so lovely name as it is unique and attractive. love hin very very very much. ASSALAM WALEYKUM,MY NAME IS MOHD.KASHAN WASIM AND I LIKE MY NAME BECOZ ITS A UNIQUE NAME FOR ME...... could u please tell me the meaning of KASHAN. i like this name but in our area mardan this name not liked by people.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7863441,"ranking":7,"query_text":"weather in kashan","passage_text":"Find Kashan meaning and definition at Hamariweb.com name dictionary a Best place to find your accurate name meanings in Urdu. Kashan name reviews, Origin, gender, rating an many more about Kashan. love hin very very very much. ASSALAM WALEYKUM,MY NAME IS MOHD.KASHAN WASIM AND I LIKE MY NAME BECOZ ITS A UNIQUE NAME FOR ME...... could u please tell me the meaning of KASHAN. i like this name but in our area mardan this name not liked by people.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7863440,"ranking":8,"query_text":"weather in kashan","passage_text":"[ syll. kas-han, ka-sh-an ] The baby boy name Kashan is pronounced as K AE-SHAHN â\u0080 . Kashan's origin is English-American. Kashan is a variant of the name Kashawn.Kashan is not popular as a baby name for boys. It is not listed within the top 1000 names.Baby names that sound like Kashan include Cassian (English), Kaegan, Kaem, Kaeme, Kagan (Irish and English), Kagann, Kagen (English), Kahan, Kaihan, Kaimee, Kaimey, Kaimi, Kaimie, Kaimy, Kaiwan, Kaiyan, Kamee, Kamen, Kamey, and Kami.t is not listed within the top 1000 names. Baby names that sound like Kashan include Cassian (English), Kaegan, Kaem, Kaeme, Kagan (Irish and English), Kagann, Kagen (English), Kahan, Kaihan, Kaimee, Kaimey, Kaimi, Kaimie, Kaimy, Kaiwan, Kaiyan, Kamee, Kamen, Kamey, and Kami.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":3356833,"ranking":9,"query_text":"weather in kashan","passage_text":"A Kashan rug (Persian: Ù\u0082Ø§Ù\u0084Û\u008c Ú©Ø§Ø´Ø§Ù\u0086 â\u0080\u008eâ\u0080\u008e) is a type of Persian rug from the area of Kashan. Kashan is a city in Isfahan Province in North Central Iran. There was production of Persian carpet at Royal workshops in the 17th and early 18th century. The Persian carpet workshops ceased production in about 1722 after the Afghan invasion. Persian carpet production was very minor until the 20th century. Historically, Kashan was a major center in the garment trade. In the late 19th century, the market shifted and the local industry went from fine wool cloth to fine wool carpets.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":2122001,"ranking":10,"query_text":"weather in kashan","passage_text":"Sheikh Lotfolah mosque and Ali Ghapo- Isfahan. Jewels Museum and Golestan Palace- Tehran. The holy cities of Qom and Mashhad ( For Islamic culture) a few holy shrines are there. You can also visit the Imam Khomeini tomb near Tehran. Yazd and Kashan both have incredible Architecture. Kashan is also a center for rosewater production (to smell) As to what to listen, look for concerts at Ni...","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7863444,"ranking":11,"query_text":"weather in kashan","passage_text":"My younger brother's name is Kashan. I love hin very very very much. ASSALAM WALEYKUM,MY NAME IS MOHD.KASHAN WASIM AND I LIKE MY NAME BECOZ ITS A UNIQUE NAME FOR ME...... could u please tell me the meaning of KASHAN. i like this name but in our area mardan this name not liked by people. love hin very very very much. ASSALAM WALEYKUM,MY NAME IS MOHD.KASHAN WASIM AND I LIKE MY NAME BECOZ ITS A UNIQUE NAME FOR ME...... could u please tell me the meaning of KASHAN. i like this name but in our area mardan this name not liked by people.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7863447,"ranking":12,"query_text":"weather in kashan","passage_text":"Definition of KASHAN. : an Oriental rug with floral motifs in soft colors. ADVERTISEMENT. an Oriental rug with floral motifs in soft colors.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":6019105,"ranking":13,"query_text":"weather in kashan","passage_text":"86 The USA Patriot Act: Impact on Freedoms and Civil Libertiesby Sunya Kashan(English 1102)espite being the super-power of the world, the United States of America does not enjoy anyexception from the global threats and challenges.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7812170,"ranking":14,"query_text":"weather in kashan","passage_text":"1 Kashgar (pinyin transliteration), a city in the region of Xinjiang, China. 2  Kashi, Hamadan, a village in Hamadan Province, Iran. 3  Kashi, Hormozgan, a village in Hormozgan Province, Iran.  Kashan, a city in the province of Isfahan, Iran.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7863442,"ranking":15,"query_text":"weather in kashan","passage_text":"Kashan (Persian: Ú©Ø§Ø´Ø§Ù\u0086 â\u0080\u008eâ\u0080\u008e, also Romanized as KÄ\u0081shÄ\u0081n; also known as Kachan) is a city in and the capital of Kashan County, in the province of Isfahan, Iran.At the 2006 census, its population was 248,789, in 67,464 families.The etymology of the city name comes from the Kasian, the original inhabitants of the city, whose remains are found at Tapeh Sialk dating back 9,000 years; later this was changed to Kashian, hence the town name.he etymology of the city name comes from the Kasian, the original inhabitants of the city, whose remains are found at Tapeh Sialk dating back 9,000 years; later this was changed to Kashian, hence the town name.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7124605,"ranking":16,"query_text":"weather in kashan","passage_text":"Bagh-e Fin, located in Kashan, Iran, is a historical Persian garden. It contains Kashanâ\u0080\u0099s Fin Bath, where Amir Kabir, the Qajarid chancellor, was murdered by an assassin sent by King Nasereddin Shah in 1852. Completed in 1590, the Fin Garden is the oldest extant garden in the list of most beautiful gardens in Iran.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7933769,"ranking":17,"query_text":"weather in kashan","passage_text":"The earliest known examples are Egyptian and from 4,000 BC. Through history, tiles were made by Assyrians, Babylonians and the Islamic Empire. Early tiles can be seen in Tunisia (c.9th), Kashan Iran (c.11th), and many middle-eastern mosques display Koranic scripts using highly colored relief tiles (c.12th onwards).","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":7863445,"ranking":18,"query_text":"weather in kashan","passage_text":"Between the 12th and the 14th centuries Kashan was an important centre for the production of high quality pottery and tiles. In modern Persian, the word for a tile (kashi) comes from the name of the town.he etymology of the city name comes from the Kasian, the original inhabitants of the city, whose remains are found at Tapeh Sialk dating back 9,000 years; later this was changed to Kashian, hence the town name.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":8570000,"ranking":19,"query_text":"weather in kashan","passage_text":"Stucco from the House of Borujerdi-ha, 1850s, Kashan, Iran. Stucco from the Sardar Rafie Yanehsari building (Shahryari building 1), Hezarjarib District, Behshahr County, Iran. Stucco or render is a material made of aggregates, a binder, and water. Stucco is applied wet and hardens to a very dense solid. It is used as decorative coating for walls and ceilings and as a sculptural and artistic material in architecture.","bm25_label":"high","relevance_label":0.0},{"query_id":1088444,"passage_id":2964451,"ranking":20,"query_text":"weather in kashan","passage_text":"Iwan of the Ä\u0080meri House in Kashan, Iran. An iwan (Persian: Ø§Û\u008cÙ\u0088Ø§Ù\u0086 eyvÄ\u0081n, Arabic: Ø¥Ù\u008aÙ\u0088Ø§Ù\u0086 â\u0080\u008e Iwan, also spelled ivan, Turkish: eyvan) is a rectangular hall or space, usually vaulted, walled on three sides, with one end entirely open.he Iwan of Khosrau is a Sassanid-era Persian monument in Mada'in which is the only visible remaining structure of the ancient city of Ctesiphon. It is near the modern town of Salman Pak, Iraq.","bm25_label":"high","relevance_label":0.0}]