[{"query_id":1089906,"passage_id":7080204,"ranking":1,"query_text":"the cast of emoji movie","passage_text":"Images and sounds of the characters from The Emoji Movie. Voice actors images from the The Emoji Movie voice cast.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":7080207,"ranking":2,"query_text":"the cast of emoji movie","passage_text":"The Emoji Movie Details. Full Cast and Crew; Release Dates; Official Sites; Company Credits; Filming & Production; Technical Specs","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2725601,"ranking":3,"query_text":"the cast of emoji movie","passage_text":"News Voice Compare Voice Directors Franchises Casting Call Top Listings Coming Soon VA Quotes AYVO 5th BTVA Anime Dub Awards WINNERS! Mary Meh Movie: The Emoji Movie","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2725602,"ranking":4,"query_text":"the cast of emoji movie","passage_text":"News Voice Compare Voice Directors Franchises Casting Call Top Listings Coming Soon VA Quotes AYVO 5th BTVA Anime Dub Awards WINNERS! Mel Meh Movie: The Emoji Movie","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2428501,"ranking":5,"query_text":"the cast of emoji movie","passage_text":"Maybe even one that could get the â\u0080\u009cmehâ\u0080\u009d emoji to transform himself into a â\u0080\u009cWTFâ\u0080\u009d one. UPDATE: There is an Emoji Movie trailer in the horizontal format now. It is not better. The Emoji Movie opens August 4, 2017.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":3857664,"ranking":6,"query_text":"the cast of emoji movie","passage_text":"Patrick Stewart to voice poo emoji in The Emoji Movie. Patrick Stewart is set to voice the poo emoji in animated adventure The Emoji Movie. The actor, known for his stage and screen work, will play Poop alongside Silicon Valley star TJ Miller, Broad City star Ilana Glazer and James Corden.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":1638013,"ranking":7,"query_text":"the cast of emoji movie","passage_text":"Movies Emoji Pop answers and cheats for level 6 of the game for iPhone, iPod, iPad, and Android. The best Movies Emoji Pop cheats, hints, and solutions to all of level 6 (puzzles 90-109).ovies Emoji Pop answers and cheats for level 6 of the game for iPhone, iPod, iPad, and Android. The best Movies Emoji Pop cheats, hints, and solutions to all of level 6 (puzzles 90-109).","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2428500,"ranking":8,"query_text":"the cast of emoji movie","passage_text":"It seems like a bad sign that the first Emoji Movie trailer does not seem all that excited about The Emoji Movie. I guess the marketing team thought they were being ironic, but really all I see is a reflection of my own lack of interest in this film. Watch the first The Emoji Movie trailer below.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2540626,"ranking":9,"query_text":"the cast of emoji movie","passage_text":"Below, learn more about The Smurfs cast and The Emoji Movie. Julia Roberts is playing SmurfWillow in the Smurfs film, which looks like a considerable improvement over the last two Smurfs films. SmurfWillow is the leader of The Lost Village, where Smurfette, Hefty, Brainy, and Clumsyâ\u0080\u0099s adventure takes them.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2978053,"ranking":10,"query_text":"the cast of emoji movie","passage_text":"Emoji Movie Answers. Emoji Movie Answers, Cheats, Solution for Level 1-23 with Word List and Screenshot for iPhone, iPad, iPod, Android. This game brought to you by Six Wave. Emoji Movie Cheats. If you donâ\u0080\u0099t want to view the answers directly, you can use this Solver to Solve your letters.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":6106264,"ranking":11,"query_text":"the cast of emoji movie","passage_text":"The Cast Of 'Unbreakable Kimmy Schmidt' Reveal Their Favorite Emojis. Emojis are the language of the Internet, so when we went to the Webby Awards on Monday night we had to ask some of the stars there about their favorite emojis.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":7257041,"ranking":12,"query_text":"the cast of emoji movie","passage_text":"The Emoji Movie Release Date Initially The Emoji Movie was scheduled to hit the theatres on August 11, 2017 but later Sony Pictures scheduled this movie to release on August 4, 2011 and now Baby Driver is releasing on August 11, 2017 in USA.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":7294978,"ranking":13,"query_text":"the cast of emoji movie","passage_text":"The Emoji Movie - Hidden inside a smartphone, the bustling city of Textopolis is home to all emojis. Each emoji has only one facial expression, except... Hidden inside a smartphone, the bustling city of Textopolis is home to all emojis. Each emoji has only one facial expression, except for...","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":5223775,"ranking":14,"query_text":"the cast of emoji movie","passage_text":"Sonyâ\u0080\u0099s Emoji Movie Will Arrive in Summer 2017. Dave McNary. Sony Pictures Animation has set an Aug. 11, 2017, release date for â\u0080\u009cThe Emoji Movie,â\u0080\u009d making it the first title to land on the date.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":7257033,"ranking":15,"query_text":"the cast of emoji movie","passage_text":"The Emoji Movie The Emoji Movie DVD and Blu-ray release date was set for October 24, 2017 and available on Digital HD from Amazon Video and iTunes on October 10, 2017. 1; 2; 3; 4; 5","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":7080244,"ranking":16,"query_text":"the cast of emoji movie","passage_text":"Cast. 1  T. J. Miller as Gene, an outsider meh emoji who can show multiple expressions. 2  James Corden as Hi-5, a hand emoji representing a high five signal. 3  Anna Faris as Jailbreak, a codebreaker emoji. 4  Maya Rudolph as Smiler, a smiley emoji and leader of the text center. 5  Steven Wright as Mel Meh, Gene's emoji father.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2725598,"ranking":17,"query_text":"the cast of emoji movie","passage_text":"Any cynicism I might have had about The Emoji Movie was knocked away months ago by the filmâ\u0080\u0099s very funny trailer, which featured Steven Wright as the morosely indifferent, slightly constipated voice of Mel Meh. That trailer suggested that a seemingly obvious movie might be throwing you curveballs. The bad news is that The Emoji Movie really is meh. There have been worse ideas, but in this case the execution isnâ\u0080\u0099t good enough to bring the notion of an emoji movie to funky, surprising life. The main character, it turns out, is the son of Mel Meh â\u0080\u0094 a junior grouch-face named Gene (voiced by T.J. Miller), who is getting ready to make his debut in the bustling workplace of emojis.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":6662587,"ranking":18,"query_text":"the cast of emoji movie","passage_text":"Yeeeahhh, ð\u009f\u0098» this because ð\u009f\u0092©ð\u009f\u0091\u008dð\u009f\u0092\u0083. Here's the Product Hunt homepage, as translated by the Chrome extensions: http:\/\/i.imgur.com\/Wma52Pk.png Also check out Moviemoji (movie synopses in emojis), Emoji Type (custom iOS keyboard that auto suggests emojis as you type), and Emojinate (stories translated into 5 emojis) for more emoji-based communication. Perhapsâ\u0080¦ See more.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":2965472,"ranking":19,"query_text":"the cast of emoji movie","passage_text":"The Emoji Movie is an upcoming 2017 computer-animated film featuring anthropomorphic, talking Emoji characters. The movie, set for released on August 4th, is directed by Tony Leondis, animated by Sony Pictures Animation and starring T. J. Miller as Gene, Ilana Glazer as Jailbreak and Patrick Stewart as Poop.","bm25_label":"medium","relevance_label":0.0},{"query_id":1089906,"passage_id":7080241,"ranking":20,"query_text":"the cast of emoji movie","passage_text":"The Emoji Movie was released on Blu-ray and DVD on October 24, 2017, by Sony Pictures Home Entertainment. Reception Box office. The Emoji Movie has grossed $86.1 million in the United States and Canada and $130.9 million in other territories, for a worldwide total of $217 million, against a production budget of $50 million.","bm25_label":"medium","relevance_label":0.0}]