[{"query_id":1089727,"passage_id":7081950,"ranking":1,"query_text":"the role of a champion on an improvement team","passage_text":"It is extremely important for the Champion to be present at the team kickoff to clarify the charter and objectives, and to inspire the team toward success. Team Member Roles and Responsibilities. Team membership must be based on personal involvement and vested interest in the process selected for improvement.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":7081946,"ranking":2,"query_text":"the role of a champion on an improvement team","passage_text":"the team and its purpose. Examples of when combining team roles may be appropriate are: A three-person team self selects the person who originated and sold the idea to management (the Champion) as Team Leader. A cross-functional, performance improvement team chooses to rotate the Team Leader role at specific intervals. A departmental work group (natural team) rotates Timekeeper and Scribe roles at each meeting to eliminate perceived discrimination based on gender, job held, age, schooling, etc.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":624672,"ranking":3,"query_text":"the role of a champion on an improvement team","passage_text":"ADC (Attack Damage Carry) | Champions' roles in team League of Legends Guide. Their main task is to eliminate specific targets. Their strength lies in items improving damage. Because they attack from a distance, they always need to care the right position, so as not to suddenly find themselves on the line of enemy fire.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":8827878,"ranking":4,"query_text":"the role of a champion on an improvement team","passage_text":"You can further establish your Champion's role (or help them blend two roles) through their item build. The recommended items for each Champion is a decent template for a standard game within the Champion's role, but you should definitely experiment to find the right build for you and your team each game.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":7081948,"ranking":5,"query_text":"the role of a champion on an improvement team","passage_text":"The Champion is usually at the upper management level. The Champion is fundamentally someone who sees the benefits of quality improvement. Sometimes the Champion and the Sponsor is the same person. The role of the Champion is to: â\u0080¢ support the LEAN event within the home and advocate for spread of improvements â\u0080¢ provide on-going leadership to ensure the positive changes continue as time goes on","bm25_label":"high","relevance_label":1.0},{"query_id":1089727,"passage_id":7593612,"ranking":6,"query_text":"the role of a champion on an improvement team","passage_text":"Wellness Champions. A Wellness Champion is someone who is a role model for living a healthy lifestyle and takes their Wellness practice to work. Our goal at Hooâ\u0080\u0099s Well is to continue to improve the culture of wellness at the University and it â\u0080\u009ctakes a villageâ\u0080\u009d to make this happen.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":2586718,"ranking":7,"query_text":"the role of a champion on an improvement team","passage_text":"Our definition of a Customer Champion. Perhaps the best way to describe the role of a Customer Champion is to define their characteristics and the benefits they will bring to both the company, and vitally the customer. Ensuring both the company and individuals understand the customer feedback and what is being done to improve their experience.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":8829255,"ranking":8,"query_text":"the role of a champion on an improvement team","passage_text":"Therefore, if the FMEA should be owned by anyone, I say the Champion who is responsible for improving the process owns it, regardless of the matrix and actual functional and process owners. Let the Champion deal with the various roles and owners. Dr. I agree with both of you. The owner is who owns the process.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":8472782,"ranking":9,"query_text":"the role of a champion on an improvement team","passage_text":"Want it! A robot boxing game based on the film, REAL STEEL. Assume the role of a robot owner and battle against different rival robots to become the champion of robot boxing.Earn in-game cash by winning matches, and use this cash to periodically improve your robot so it can compete against stronger rivals.ssume the role of a robot owner and battle against different rival robots to become the champion of robot boxing. Earn in-game cash by winning matches, and use this cash to periodically improve your robot so it can compete against stronger rivals.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":7727925,"ranking":10,"query_text":"the role of a champion on an improvement team","passage_text":"In order for teams to fulfill their intended role of improving organizational effectiveness, it is critical that teams develop into working units that are focused on their goal, mission, or reason for existing. Many times when you're hired or promoted into a leadership role, the team is already there.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":5277231,"ranking":11,"query_text":"the role of a champion on an improvement team","passage_text":"Enzo came on in midfield to replace Lucas Vazquez as Zidane changed his entire team in the International Champions Cup friendly. Zinedine Zidane's son Enzo (right) played under his father in a senior game for the first time. The France legend watches from the sidelines during the International Champions Cup clash. Enzo plays in the No 10 role - where he competes with Martin Odegaard in the club's B team.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":5136868,"ranking":12,"query_text":"the role of a champion on an improvement team","passage_text":"There are two basic types of roles and responsibilities that employees should be expected to assume and to be evaluated on. The first role is that of technical expert. The employee must be able to do the work well. The second type is the social role that involves the management of the processes of the team. Both roles are important to the team's success and performance improvement. In his book, Building Productive Teams, Glenn H. Varney explains the importance of clarifying the roles of team members.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":2527092,"ranking":13,"query_text":"the role of a champion on an improvement team","passage_text":"To be successful in this transformation, the project manager needs to take on the role of a Scrum Master to become the champion of the Scrum process and facilitate the teamâ\u0080\u0099s adoption of Scrum with the understanding that they have no authority over the Scrum team.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":1445565,"ranking":14,"query_text":"the role of a champion on an improvement team","passage_text":"In WCW, he was a two-time United States Heavyweight Champion, a one-time Six-Man Tag Team Champion, and a two-time World Tag Team Champion. In WWF\/E, he is a three-time Intercontinental Champion, a nine-time Hardcore Champion, a one-time World Tag Team Champion, and a two-time WWE Tag Team Champion.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":7914062,"ranking":15,"query_text":"the role of a champion on an improvement team","passage_text":"Carron specified that roles are an important aspect of group cohesion. If a team. member is given an individual role within the group then they will feel that they. have a sense of purpose and that they have a part to play in helping the team â\u0080\u0093 in. this case group cohesion will improve.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":8507447,"ranking":16,"query_text":"the role of a champion on an improvement team","passage_text":"In cricket and rugby , a test match is a one of a series of matches played between teams representing two countries . Allan Simmons, a former Scrabble champion, shares his tips on how to learn words to improve your Scrabble game.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":628704,"ranking":17,"query_text":"the role of a champion on an improvement team","passage_text":"As of October 2015, Cena has won 24 championships, with 15 reigns as World Champion; a record 12 reigns as WWE (World Heavyweight) Champion and three reigns as World Heavyweight Champion, five reigns as United States Champion, and four reigns as world tag team champion (two World Tag Team and two WWE Tag Team).s of October 2015, Cena has won 24 championships, with 15 reigns as World Champion; a record 12 reigns as WWE (World Heavyweight) Champion and three reigns as World Heavyweight Champion, five reigns as United States Champion, and four reigns as world tag team champion (two World Tag Team and two WWE Tag Team).","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":8641340,"ranking":18,"query_text":"the role of a champion on an improvement team","passage_text":"Team development is a process aimed at improving team performance in any one or all of the five factors in the team hierarchy. After examining your team's performance in these areas, your role as a manager is to identify where your focus for team development needs to be.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":4653953,"ranking":19,"query_text":"the role of a champion on an improvement team","passage_text":"The Premier League could lose its fourth qualifying spot if results in Europe don't improve. GETTY. Then, if English clubs perform as badly next season in European competitions, the fourth Champions League qualifying place will be given instead to a team in Italy.","bm25_label":"high","relevance_label":0.0},{"query_id":1089727,"passage_id":2113743,"ranking":20,"query_text":"the role of a champion on an improvement team","passage_text":"League of Legends teams emulate basketball teams in a few ways. It's a five-versus-five game, and each player has a specific role to play and must work in tandem with their teammates toward a common object.In basketball, it's scoring points. In League of Legends, it's killing champions and destroying enemy structures.For years now, Team SoloMid has been led by founding member Andy Reginald Dinh in the middle lane. After no shortage of retirement talk, Dinh announced that heâ\u0080\u0099s stepping back to take on a coaching role for TSM.eague of Legends teams emulate basketball teams in a few ways. It's a five-versus-five game, and each player has a specific role to play and must work in tandem with their teammates toward a common object.","bm25_label":"high","relevance_label":0.0}]