[{"query_id":1089810,"passage_id":7081123,"ranking":1,"query_text":"the largest company in each state","passage_text":"Click here to see the largest company in each state. While these companies are the largest in their home states, they are not necessarily among the largest in the nation. Exxon Mobil, the largest company in Texas and the second-largest in the U.S., reported revenue of $411.9 billion last year.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":7081119,"ranking":2,"query_text":"the largest company in each state","passage_text":"The Largest Company Headquartered in Each State Todayâ\u0080\u0099s infographic comes to us from Business Insider, and it shows the largest company headquartered in each state, based on headcount data from CapRelo. In order to be considered one of the largest corporations in America, a company needs to have thousands of employees and billions in revenue.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":441291,"ranking":3,"query_text":"the largest company in each state","passage_text":"The Largest Company in Each State. The largest companies in the United States are almost all concentrated in major metropolitan areas. Nearly one in 10 Fortune 500 companies are headquartered in New York City.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":7081128,"ranking":4,"query_text":"the largest company in each state","passage_text":"In Michigan, home of Detroit, the motor city, General Motors is the biggest company. To identify the biggest company in each state, 247 Wall St. reviewed the 1,000 largest public U.S. companies by revenue from Fortune. Revenue figures for the largest private companies in the country were provided by PrivCo. When available, more recent figures were obtained from annual SEC filings. These are the largest companies in each state.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":7081127,"ranking":5,"query_text":"the largest company in each state","passage_text":"For this reason, the vast majority of the largest companies in each state are public. The largest company in all but 13 states is publicly traded. Still, there are dozens of very large corporations that never opted to make a public offering, and in many cases, these companies generate the most revenue of any enterprise in a state.","bm25_label":"high","relevance_label":1.0},{"query_id":1089810,"passage_id":5838661,"ranking":6,"query_text":"the largest company in each state","passage_text":"In each state, there is one company that employs the most people. As a stateâ\u0080\u0099s largest employer, the company may have a disproportionately large impact on its economy as well as on the surrounding region. 24\/7 Wall St. reviewed data from a range of sources in order to identify the largest employers in each state.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":4965887,"ranking":7,"query_text":"the largest company in each state","passage_text":"The Southern Company (SO) is a holding company that owns Alabama Power Company, Georgia Power Company, Gulf Power Company, and Mississippi Power Company, each of which operates as a public utility company. SO is the 16th largest utility company in the world, and the fourth largest in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":7081121,"ranking":8,"query_text":"the largest company in each state","passage_text":"Broadview Networks looked at the largest company in each state by revenue, using data from Hoover's and Fortune. Broadview excluded companies that are subsidiaries or government entities. Locations are corporate headquarters.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":3697688,"ranking":9,"query_text":"the largest company in each state","passage_text":"The â\u0080\u009cDowâ\u0080\u009d usually refers to the Dow Jones Industrial Average. It was invented by Charles Dow, a co-founder of Dow Jones & Company, which is a publishing and information company. The â\u0080\u009cDowâ\u0080\u009d is simply an average of the value of one share each of thirty of the largest companies in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":3861921,"ranking":10,"query_text":"the largest company in each state","passage_text":"We noticed that many states did not have companies included in the [Fortune 500] list, so we decided to perform our own research to find the largest company by revenue in each state based on the location of the corporate headquarters, wrote Russ Fordyce, a managing director at Broadview, in a Tuesday blog post about the map.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":5161390,"ranking":11,"query_text":"the largest company in each state","passage_text":"With seven new American retail chains joining the world's largest retailer list, now 33% of the 250 largest retail companies in the world are based in the United States, according to the 2014 Global Powers of Retailing report, which is published each year by Deloitte Touche Tohmatsu and STORES Magazine.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":3978093,"ranking":12,"query_text":"the largest company in each state","passage_text":"The new company is expected to become the fifth-largest food and beverage company in the world and the third-largest in the United States. The company will have dual headquarters in Pittsburgh and Chicago, the respective headquarters of Heinz and Kraft.Under the merger, Kraft's shareholders received 49% of shares in the combined company, plus a one-time payment of US$16.50 dividend per share.he Kraft Heinz Company now has 13 different brands valued at $500 million or more each. The merger has been agreed to by the boards of both companies, with approvals by shareholders and regulatory authorities.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":7247295,"ranking":13,"query_text":"the largest company in each state","passage_text":"In April 2011, General Mills announced that it will switch all 1 million eggs it uses each year to cage-free. General Mills was ranked #181 on the 2012 Fortune 500 list of America's largest corporations, 161 in 2015 and was the third-largest food consumer products company in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":7081122,"ranking":14,"query_text":"the largest company in each state","passage_text":"Databases differ on which business is the largest in each state, however. We reviewed the Fortune 1000, as well as a mixture of sources listed on research source Lexis Nexis, and confirmed many, but not all, of the companies on Broadviewâ\u0080\u0099s list.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":2723449,"ranking":15,"query_text":"the largest company in each state","passage_text":"Chevron is based in San Ramon, California and duck $186 billion in sales is the 3rd largest company in the United States and 2nd largest oil company in the USA. Chevron is the 12th largest company in the apple and 7th largest oil and gas company on the planet.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":6218147,"ranking":16,"query_text":"the largest company in each state","passage_text":"It is the world's largest baking company and operates the largest bakeries in the United States, Mexico, Canada and Spain, and has some of the widest distribution networks in Mexico and the United States. It was also the ninth largest company of Mexico by revenues in 2013.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":8679875,"ranking":17,"query_text":"the largest company in each state","passage_text":"About the event. One of the state's largest industries, manufacturing represents 15 percent of the state's gross domestic product. Each year Minnesota Business magazine honors the industry's best leaders and companies with a prestigious awards event and a much-read feature article spotlighting all the finalists.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":7081120,"ranking":18,"query_text":"the largest company in each state","passage_text":"For each of the states, we highlight the top three in terms of market cap. Some of the names will be familiarâ\u0080\u0094Californiaâ\u0080\u0099s top three, for instance, are Apple, Google, and Wells Fargo. But plenty, we think, may surprise you. The Biggest Public Companies in Every State. Take New Mexico. The largest company in that state is the $2.3 billion (market cap), Albuquerque-based PNM Resources, Inc., an energy holding company that provides electricity to homes in Northern New Mexico and Western Texas.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":3861920,"ranking":19,"query_text":"the largest company in each state","passage_text":"It looks like the largest companies by revenue aren't always the big Silicon Valley names. Broadview Networks, a communications provider for small businesses along the East Coast, used data from the research firm Hoover's to put together a map of the companies with the biggest revenue in each state in the last fiscal year.","bm25_label":"high","relevance_label":0.0},{"query_id":1089810,"passage_id":4796979,"ranking":20,"query_text":"the largest company in each state","passage_text":"The Kroger Company, or simply Kroger, is an American retailing company founded by Bernard Kroger in 1883 in Cincinnati, Ohio. It is the United States's largest supermarket chain by revenue ($109.83 billion for fiscal year 2016), the second-largest general retailer (behind Walmart) and the twenty-third largest company in the United States. Kroger is also the third-largest retailer in the world.","bm25_label":"high","relevance_label":0.0}]