[{"query_id":1090311,"passage_id":8006790,"ranking":1,"query_text":"sustained definition law","passage_text":"Sustain Sustain Law and Legal Definition Sustain is a term that is subject to different definitions, but in the context of trial practice, it refers to a judge agreeing that an attorney's objection is valid. It usually occurs in the USLegal Home","bm25_label":"high","relevance_label":1.0},{"query_id":1090311,"passage_id":7142078,"ranking":2,"query_text":"sustained definition law","passage_text":"Definition of sustain in the Legal Dictionary - by Free online English dictionary and encyclopedia. What is sustain? Meaning of sustain as a legal term. What does sustain mean in law?","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":2505097,"ranking":3,"query_text":"sustained definition law","passage_text":"You are entitled to make a claim if you sustain an injury in the course of your employment and are defined by law as a worker. The legal definition of a worker includes full-time, part-time, casual, seasonal, piece and commission workers.ou are entitled to make a claim if you sustain an injury in the course of your employment and are defined by law as a worker. The legal definition of a worker includes full-time, part-time, casual, seasonal, piece and commission workers.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":483360,"ranking":4,"query_text":"sustained definition law","passage_text":"1 The Ideal Gas Law The Ideal Gas Law definition claims that the variables of pressure, volume, temperature, and number of moles in a gas are interrelated. 2  The Ideal Gas Law is hypothetical, butâ\u0080¦. 3  The Periodic Table of Elements Life is sustained by a number of chemical elements.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":1526604,"ranking":5,"query_text":"sustained definition law","passage_text":"legal reserve life insurance company. A life insurance company that sustains the reserve amount mandated by the laws of the area in which it operates. http:\/\/www.businessdictionary.com\/definition\/legal-reserve-life-insurance-company.html.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":545401,"ranking":6,"query_text":"sustained definition law","passage_text":"A ninth attribute of moral law is independence. It is founded in the self-existent nature of God. It is an eternal and necessary idea of the divine reason. It is the eternal self-existent rule of the divine conduct, the law which the intelligence of God prescribes to himself.t is contrary to the true definition of law. Moral law is a rule of action, founded in the nature and relations of moral beings, sustained by sanctions equal to the merit of obedience, and the guilt of disobedience. 8. An eighth attribute of moral law is practicability.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":7051853,"ranking":7,"query_text":"sustained definition law","passage_text":"Unfortunately, that also means the lower the sustainability of society's actions. Therefore the Brundtland definition is too flawed to use. Here's the real surprise. Actually the Brundtland definition is not defining sustainability. It's defining sustainable development.he above definition of sustainability goes against the norm. The most popular definition of sustainability is that from the Brundtland Report of 1987, which said: Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":1767853,"ranking":8,"query_text":"sustained definition law","passage_text":"Definition of damage. 1 : loss or harm resulting from injury to person, property, or reputation flood damage sustained severe damage to her knee. 2 damages plural : compensation in money imposed by law for loss or injury The judge awarded them $5,000 in damages.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":7051854,"ranking":9,"query_text":"sustained definition law","passage_text":"The above definition of sustainability goes against the norm. The most popular definition of sustainability is that from the Brundtland Report of 1987, which said: Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs.he above definition of sustainability goes against the norm. The most popular definition of sustainability is that from the Brundtland Report of 1987, which said: Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":7051845,"ranking":10,"query_text":"sustained definition law","passage_text":"We're going to define sustainability quite differently from normal definitions because the most popular definition in the world, the Brundtland definition of so called sustainable development, is flawed.It's so flawed it should be tossed on the rubbish heap of history's biggest catastrophic mistakes.he above definition of sustainability goes against the norm. The most popular definition of sustainability is that from the Brundtland Report of 1987, which said: Sustainable development is development that meets the needs of the present without compromising the ability of future generations to meet their own needs.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":545397,"ranking":11,"query_text":"sustained definition law","passage_text":"That this affirmation assumes, that moral law and moral obligation are founded in the will of God;--that his mere will makes law. This is a fundamental mistake. God cannot legislate in the sense of making law. He declares and enforces the common law of the universe, or, in other words, the law of nature.This law, I repeat it, is nothing else than that rule of conduct which is in accordance with the nature and relations of moral beings.t is contrary to the true definition of law. Moral law is a rule of action, founded in the nature and relations of moral beings, sustained by sanctions equal to the merit of obedience, and the guilt of disobedience. 8. An eighth attribute of moral law is practicability.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":525668,"ranking":12,"query_text":"sustained definition law","passage_text":"There may be as many definitions of sustainability and sustainable development as there are groups trying to define it. All the definitions have to do with:","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":6670170,"ranking":13,"query_text":"sustained definition law","passage_text":"Why this particular definition is important. This is discussed on the glossary page for sustainability. Basically the world's standard definition of environmental sustainability is sustainable development, which means sustainable economic growth, which is an oxymoron. No form of economic growth can be continued indefinitely.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":1335678,"ranking":14,"query_text":"sustained definition law","passage_text":"Sustainability. We're going to define sustainability quite differently from normal definitions because the most popular definition in the world, the Brundtland definition of so called sustainable development, is flawed. It's so flawed it should be tossed on the rubbish heap of history's biggest catastrophic mistakes.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":5137072,"ranking":15,"query_text":"sustained definition law","passage_text":"What is sustainability? There is no universally agreed definition on what sustainability means. There are many different views on what it is and how it can be achieved. The idea of sustainability stems from the concept of sustainable development which became common language at the World's first Earth Summit in Rio in 1992. The original definition of sustainable development is usually considered to be:","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":6350045,"ranking":16,"query_text":"sustained definition law","passage_text":"Sustainability. We're going to define sustainability quite differently from normal definitions because the most popular definition in the world, the Brundtland definition of so called sustainable development, is flawed.It's so flawed it should be tossed on the rubbish heap of history's biggest catastrophic mistakes.he three pillars are social, environmental, and economic sustainability. The flaw in the Brundtland definition of sustainability arose in a short term effort to make the social pillar stronger as the world's top priority. However, that requires giving the environmental pillar a lower short term priority.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":5455775,"ranking":17,"query_text":"sustained definition law","passage_text":"Sustainability. We're going to define sustainability quite differently from normal definitions because the most popular definition in the world, the Brundtland definition of so called sustainable development, is flawed. It's so flawed it should be tossed on the rubbish heap of history's biggest catastrophic mistakes.conomic sustainability is the ability to support a defined level of economic production indefinitely. Social sustainability is the ability of a social system, such as a country, to function at a defined level of social well being indefinitely.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":391727,"ranking":18,"query_text":"sustained definition law","passage_text":"Attachment Bond Law and Legal Definition. Attachment bond is a bond given by a defendant in order to have an attachment released that ensures payment of a judgment awarded to the plaintiff. It is a bond required of a plaintiff seeking an attachment, conditioned to pay the costs and damages which the defendant may sustain in the event the plaintiff loses the suit.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":391730,"ranking":19,"query_text":"sustained definition law","passage_text":"Attachment Bond Law and Legal Definition Attachment bond is a bond given by a defendant in order to have an attachment released that ensures payment of a judgment awarded to the plaintiff. It is a bond required of a plaintiff seeking an attachment, conditioned to pay the costs and damages which the defendant may sustain in the event the plaintiff loses the suit.","bm25_label":"high","relevance_label":0.0},{"query_id":1090311,"passage_id":5878797,"ranking":20,"query_text":"sustained definition law","passage_text":"Definition of a Sustainable Food System Calgaryâ\u0080\u0099s definition A sustainable food system is a collaborative network that integrates several components in order to enhance a communityâ\u0080\u0099s environmental, economic and social well-being.SDA Definition Congress arrived at a definition of sustainable agriculture when it passed the Farm Bill (Food, Agriculture, Conservation, and Trade Act of 1990).","bm25_label":"high","relevance_label":0.0}]