[{"query_id":1090833,"passage_id":7966414,"ranking":1,"query_text":"seattle city light salary","passage_text":"17 Seattle City Light Employee Salaries. 1  $99K Team Supervisor Average Salary at Seattle City Light (2 salaries) 2  $34K Accounting Technician Average Salary at Seattle City Light (2 salaries) 3  $140K Senior Project Manager Average Salary at Seattle City Light (1 salaries) 4  $131K Senior Oracle DBA Average Salary at Seattle City Light (1 salaries) +$30K (25%) more than national average Senior Oracle DBA salary ($101K) +$55K (53%) more than average Seattle City Light salary ($76K)","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7966418,"ranking":2,"query_text":"seattle city light salary","passage_text":"17 Seattle City Light Employee Salaries Browse Seattle City Light Salaries by Job Title â\u0086\u0092","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7966419,"ranking":3,"query_text":"seattle city light salary","passage_text":"$99K Team Supervisor Average Salary at Seattle City Light (2 salaries) + 1 $58K (82%) more than national average Team Supervisor salary ($41K) + 2 $23K (26%) more than average Seattle City Light salary ($76K) + 3 $23K (26%) more than average Seattle City Light salary ($76K) + 4 $22K (25%) more than average Seattle City Light salary ($76K)","bm25_label":"high","relevance_label":1.0},{"query_id":1090833,"passage_id":7966417,"ranking":4,"query_text":"seattle city light salary","passage_text":"Browse Seattle City Light annual salaries by job title. See what others thought about what they got paid at Seattle City Light.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7966413,"ranking":5,"query_text":"seattle city light salary","passage_text":"$91K Senior Management Systems Analyst Average Salary at Seattle City Light (1 salaries) +$46K (67%) more than national average Senior Management Systems Analyst salary ($45K) +$15K (17%) more than average Seattle City Light salary ($76K)","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7966416,"ranking":6,"query_text":"seattle city light salary","passage_text":"Seattle City Light - Salary - Get a free salary comparison based on job title, skills, experience and education. Accurate, reliable salary and compensation comparisons for United States Welcome back!","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7966420,"ranking":7,"query_text":"seattle city light salary","passage_text":"Oops, we don't have any salaries at Seattle City Light right now... Please try another job title.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7966412,"ranking":8,"query_text":"seattle city light salary","passage_text":"Seattle City Light Careers & Jobs. Unfortunately, there are currently no jobs available at Seattle City Light which match this search: Use the job search form above. Subscribe to email alerts for Seattle City Light jobs.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7918057,"ranking":9,"query_text":"seattle city light salary","passage_text":"Seattle is the city where you get paid the highest salary and make the most of your money, according to Glassdoor's data. Seattle is the city where you get paid the highest salary and make the most of your money, according to Glassdoor's data.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":4080006,"ranking":10,"query_text":"seattle city light salary","passage_text":"The Seattle 2030 District has compiled a comprehensive spreadsheet of incentives and resources for energy and water-saving projects available from Puget Sound Energy, Seattle City Light, Seattle Public Utilities and Seattle Steam.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7045639,"ranking":11,"query_text":"seattle city light salary","passage_text":"City of Seattle Section A. 2017 Salary Schedule and Compensation Plan Page 2 of 14. INTRODUCTION. The initial printing of this City of Seattle Salary Schedule and Compensation Plan reflects 2017 general wage. rates reflecting increases authorized for non-represented and represented payroll titles at the time of publication. of January 13, 2017.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":6443712,"ranking":12,"query_text":"seattle city light salary","passage_text":"Salaries for Electrician Apprentices in Seattle and Spokane. Electrician apprentices in Washington State earned the highest average salary in the country as of 2015 according to the US Bureau of Labor Statistics. In fact, electrician apprentices in Seattle earned the highest average salary of electrician apprentices in any city in the country that year.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":2852203,"ranking":13,"query_text":"seattle city light salary","passage_text":"Administrative Specialist I-BU. This position will perform a full range of general administrative support duties, including processing work orders from the Meter Shop and performing related... 3 hours ago-save job-email-more... 1  View all City of Seattle jobs in Seattle, WA-Seattle jobs. 2  Salary Search: Administrative Specialist salaries in Seattle, WA.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":2847748,"ranking":14,"query_text":"seattle city light salary","passage_text":"Search Entry Level Web Developer jobs in Seattle, WA. 342 open jobs in Seattle for Entry Level Web Developer. Average Salary: $82,566. 25 Best Cities for Jobs 2017 NEW!","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":7564428,"ranking":15,"query_text":"seattle city light salary","passage_text":"The Cost of Transportation in Seattle While Seattle does have a light rail system, it only serves a limited portion of the city. Most Seattleites either own a car or use the public bus system.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":8820320,"ranking":16,"query_text":"seattle city light salary","passage_text":"City of Seattle 2014 SALARY SCHEDULE AND COMPENSATION PLAN TABLE OF CONTENTS Section A Page(s) Table of Contents Introduction ...............................................................................................................................................................ity of Seattle Section A 2014 Salary Schedule and Compensation Plan Page 3 of 14 COMPENSATION PLAN ADMINISTRATION Compensation policy is established by a variety of ordinances, personnel rules and regulations.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":3757279,"ranking":17,"query_text":"seattle city light salary","passage_text":"Tags: Idaho Winds, renewable energy, renewable energy credits, Sawtooth Wind Project, Seattle City Light.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":3362819,"ranking":18,"query_text":"seattle city light salary","passage_text":"An increased amount of BPA power and a 20-year wind contract from the Stateline Wind project are among City Light's new resources. The table below provides information on the fuels used to generate the electricity Seattle City Light provided to its customers in 2013.While Seattle owns no nuclear or coal generation, a portion of the power we purchase from BPA comes from these sources and is reflected in our fuel mix.he remainder comes from a mix of power sources, including long-term contracts with the Bonneville Power Administration (BPA) and others. Since 2001, City Light increased and diversified its resource mix to minimize future dependence on market purchases to meet Seattle's needs.","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":5019047,"ranking":19,"query_text":"seattle city light salary","passage_text":"Highest-Paying Cities. San Francisco companies pay the highest salary for software engineers ($130,000), the runner-up is New York City ($128,000) then Seattle ($117,000), Washington ($116,000). Computer companies in Minneapolis pay the lowest salary for their employees ($90,000).","bm25_label":"high","relevance_label":0.0},{"query_id":1090833,"passage_id":8240879,"ranking":20,"query_text":"seattle city light salary","passage_text":"City of Seattle Section A 2014 Salary Schedule and Compensation Plan Page 11 of 14 EEO JOB CATEGORIES All City ordinance titles are assigned to one of the eight EEO job categories listed below for affirmative action reporting purposes.ity of Seattle Section A 2014 Salary Schedule and Compensation Plan Page 3 of 14 COMPENSATION PLAN ADMINISTRATION Compensation policy is established by a variety of ordinances, personnel rules and regulations.","bm25_label":"high","relevance_label":0.0}]