[{"query_id":1091688,"passage_id":7894008,"ranking":1,"query_text":"phone number for bc transit junction","passage_text":"Details of Transit Number # 05800-004 . Bank : Toronto-Dominion Bank . Branch : The Junction Shopping Centre . Routing Number : 000405800. Transit Numner (MICR) # 05800-004. Address : 32555-140 London Ave., Mission, BC V2V 6M7.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":7894012,"ranking":2,"query_text":"phone number for bc transit junction","passage_text":"Bc Transit Vancouver Customer Service Phone Numbers. The Customer Service Phone Number of Bc Transit Vancouver is +1- 250-385-2551, Fax: +1-250-995-5639 (touch to call) If the contact information is incorrect, please let us know HERE.","bm25_label":"high","relevance_label":1.0},{"query_id":1091688,"passage_id":7894007,"ranking":3,"query_text":"phone number for bc transit junction","passage_text":"BC Junction Office hours are: Monday-Friday 7:45 AM to 4:00 PM; Saturday 9:00 AM to 5:00 PM; The BC Junction Office is closed and buses will not run on major holidays. Routes Serving the BC Junction. If you are new to BC Transit, we strongly recommend you review our how to ride guide.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":3933301,"ranking":4,"query_text":"phone number for bc transit junction","passage_text":"Email: - I would like a transit representative to contact me to discuss the incident (a phone number or email address is required). Yes, I have read this privacy policy. Information on this page is collected under the Freedom of Information and Protection of Privacy Act to provide the service you request.If you have questions about this collection, please email FOI_Request@BCTransit.com or call (1-844-482-6161) or visit BC Transit at 520 Gorge Road East, Victoria, BC V8W 2P3. I would like a transit representative to contact me to discuss the incident (a phone number or email address is required). Yes, I have read this privacy policy.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":5688126,"ranking":5,"query_text":"phone number for bc transit junction","passage_text":"American Furniture - Grand Junction 865 North Avenue, Grand Junction CO 81501 Phone Number: (970) 243-0634","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":1560755,"ranking":6,"query_text":"phone number for bc transit junction","passage_text":"The customer support phone number of New Jersey Transit Lost and Found is +1 973-275-5555 \/ 973-491-7220 (Click phone number to call). The postal and official address, email address and phone number (helpline) of New Jersey Transit Lost and Found Service Center and New Jersey Transit Lost and Found customer service phone number is given below.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":3215661,"ranking":7,"query_text":"phone number for bc transit junction","passage_text":"Compare with other York Region Transit phone numbers Compare all York Region Transit contact info Find another company phone number.his phone number is popular with other York Region Transit customers, but be sure to follow the 6 steps further down. 15 mins average hold time. call Mon-Fri 7am-7pm, Sat-Sun 8:30am-4:30pm EST open now. #1 of 2 York Region Transit phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":3215662,"ranking":8,"query_text":"phone number for bc transit junction","passage_text":"York Region Transit Phone Number. The number and steps below are voted #1 of 2 by over 2100 York Region Transit customers. 905-762-2100. York Region Transit phone support. Read key steps and hints below. They call you insteadNo waiting on hold.Free.his phone number is popular with other York Region Transit customers, but be sure to follow the 6 steps further down. 15 mins average hold time. call Mon-Fri 7am-7pm, Sat-Sun 8:30am-4:30pm EST open now. #1 of 2 York Region Transit phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":7089141,"ranking":9,"query_text":"phone number for bc transit junction","passage_text":"Vermont Judicial Bureau located in White River Junction, VT - address, phone numbers, fax numbers and other information.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":1560753,"ranking":10,"query_text":"phone number for bc transit junction","passage_text":"New Jersey Transit Lost and Found Customer Service Phone Number. Phone Number of New Jersey Transit Lost and Found is +1 973-275-5555 \/ 973-491-7220 . New Jersey Transit is abbreviated as NJ Transit. It is a public transportation organization which is used to find the lost items.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":12424,"ranking":11,"query_text":"phone number for bc transit junction","passage_text":"Alcaeus (4th century BC), Athenian comic poet whose comedies marked the transition between Old Comedy and Middle Comedy. Alcaeus of Messene (fl. late 3rd\/early 2nd century BC), Greek author of a number of epigrams in the Greek Anthology.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":3913618,"ranking":12,"query_text":"phone number for bc transit junction","passage_text":"Enter only information associated with the branch where you opened your CIBC account. Click the Search button and review the search results. Click the branch name's link. Look below the branch's address, phone numbers and fax information for the branch's transit number. It appears next to the Transit # heading.lick the Search button and review the search results. Click the branch name's link. Look below the branch's address, phone numbers and fax information for the branch's transit number. It appears next to the Transit # heading.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":3933303,"ranking":13,"query_text":"phone number for bc transit junction","passage_text":"The successor to the British Columbia Electric Railway, which started in 1897 and in 1961 became a division of BC Hydro, BC Transit was created in 1972 as the provincial government took over BC Hydro systems.C Transit carries out overall planning and delivery for all of the different municipal transit systems in British Columbia.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":4427673,"ranking":14,"query_text":"phone number for bc transit junction","passage_text":"A transitional vertebra at the junction between the chest and the lumbar spine may have a vestigial rib. However it is at the lumbosacral junction that transitional vertebrae occur commonly, especially in German Shepherds, and they often have clinical consequences.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":7894005,"ranking":15,"query_text":"phone number for bc transit junction","passage_text":"Welcome to. BC Transit. From small towns to large urban centres, BC Transit connects over 50 million customers in communities across the province every year. Searching For a Transit System Near You or","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":3144082,"ranking":16,"query_text":"phone number for bc transit junction","passage_text":"Find DMV Office of White River Junction, VT, obtain DMV phone number, available services and appointments, and then pass your test.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":6094175,"ranking":17,"query_text":"phone number for bc transit junction","passage_text":"Alternate Phone Number for City Hall & Other City Departments At the end of 2016, the City transitioned to a new telephone system, which resulted in a new phone number of 321.221.7540 for all City departments. An alternate phone number, 321.604.3017, is also available.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":8100199,"ranking":18,"query_text":"phone number for bc transit junction","passage_text":"Atlanta MARTA Customer Service Phone Number Phone Number of Atlanta MARTA is (404) 848-5000. Atlanta Marta is a short form, used for The Metropolitan Atlanta Rapid Transit Authority.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":4427675,"ranking":19,"query_text":"phone number for bc transit junction","passage_text":"Each segment has characteristically shaped vertebrae. A transitional vertebra is one that lies at the junction of two of the segments and tries to take on the shape of the vertebra of both segments. A transitional vertebra at the junction between the chest and the lumbar spine may have a vestigial rib.","bm25_label":"high","relevance_label":0.0},{"query_id":1091688,"passage_id":3933302,"ranking":20,"query_text":"phone number for bc transit junction","passage_text":"- I would like a transit representative to contact me to discuss the incident (a phone number or email address is required). Yes, I have read this privacy policy. I would like a transit representative to contact me to discuss the incident (a phone number or email address is required). Yes, I have read this privacy policy.","bm25_label":"high","relevance_label":0.0}]