[{"query_id":1091108,"passage_id":2770278,"ranking":1,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"View Full Document. 1  she says â\u0080\u009cIâ\u0080\u0099m not hungry.â\u0080\u009d a. bottom-up b. sensory adaptation c. top-down d. vertical-horizontal Answer: _____ 17. ________ refers to the way that sensory information is interpreted and consciously experienced; ________ refers to what happens when sensory information is detected by a sensory receptor.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":5224795,"ranking":2,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"1 Sensory neuron(s) then transmit information from the sensory receptor(s) to the Central Nervous System (i.e. the brain and spinal cord, sometimes referred to in the abbreviated form: C.N.S.). 2  This is happens because peripheral nerves connect to the spinal cord via the network of nerves within the nervous system. (Stimuli is the plural form, referring to more than one stimulus.). 2  In this context, a stimulus is something that human sensory receptors are able to detect. 3  E.g. sounds, physical contact, tastes, visual sensation, etc..","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":2770277,"ranking":3,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"What does it mean to sense something? Sensory receptors are specialized neurons that respond to specific types of stimuli. When sensory information is detected by a sensory receptor, sensation has occurred. For example, light that enters the eye causes chemical changes in cells that line the back of the eye. These cells relay messages, in the form of action potentials (as you learned when studying biopsychology), to the central nervous system.","bm25_label":"high","relevance_label":1.0},{"query_id":1091108,"passage_id":8829217,"ranking":4,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Related Eyes Questions When the eyes are open, what sensory organs provide information needed to maintain equilibrium? Sensory nerve fibers of cochlear provides information needed to maintain... What are the sensory receptors for the eyes and the nose? In the nose there are olfactory receptors. Photoreceptors are found in the eyes. What carries sensory information from the eye to the brain?","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":8829225,"ranking":5,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Related Eyes Questions. When the eyes are open, what sensory organs provide information needed to maintain equilibrium? Sensory nerve fibers of cochlear provides information needed to maintain... What are the sensory receptors for the eyes and the nose? In the nose there are olfactory receptors. Photoreceptors are found in the eyes.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":7942127,"ranking":6,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Sensation occurs when sensory receptors detect sensory stimuli. Perception involves the organization, interpretation, and conscious experience of those sensations. All sensory systems have both absolute and difference thresholds, which refer to the minimum amount of stimulus energy or the minimum amount of difference in stimulus energy required to be detected about 50% of the time, respectively.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":8829222,"ranking":7,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Related Eyes Questions Which sensory organs provide information needed to maintain equilibrium when the eyes are closed? The ear is the sensory organ needed to maintain equilibrium. The vestibulocochlear... What are the sensory receptors for the eyes and the nose? In the nose there are olfactory receptors. Photoreceptors are found in the eyes. What carries sensory information from the eye to the brain? Sensory neurons take information from the eyes, ears, nose, tongue, and skin to... How does the eye process and receive sensory information?","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":1952196,"ranking":8,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Sensation is the process by which our sense organs. and receptors detect and respond to sensory. information that stimulates them. The information. at this stage is simply raw sensory data. It is. meaningless until it is sent to the relevant sensory. area in the brain for processing.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":7840619,"ranking":9,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"In the periphery, the somatosensory system detects various stimuli by sensory receptors, e.g. by mechanoreceptors for tactile sensation and nociceptors for pain sensation. The sensory information (touch, pain, temperature etc.,) is then conveyed to the central nervous system by afferent neurons.There are a number of different types of afferent neurons that vary in their size, structure and properties.n the periphery, the somatosensory system detects various stimuli by sensory receptors, e.g. by mechanoreceptors for tactile sensation and nociceptors for pain sensation. The sensory information (touch, pain, temperature etc.,) is then conveyed to the central nervous system by afferent neurons.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":1686734,"ranking":10,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"In physiology, a stimulus is a detectable change in the internal or external environment. The ability of an organism or organ to respond to external stimuli is called sensitivity. When a stimulus is applied to a sensory receptor, it normally elicits or influences a reflex via stimulus transduction. These sensory receptors can receive information from outside the body, as in touch receptors found in the skin or light receptors in the eye, as well as from inside the body, as in chemoreceptors and","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":1565603,"ranking":11,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Classify general sensory receptors by structure, stimulus detected, and body location. 3. Outline the events that lead to sensation and perception. 4. Describe receptor and generator potentials and sensory adaptation.5. Describe the main aspects of sensory perception. 6.lassify general sensory receptors by structure, stimulus detected, and body location. 3. Outline the events that lead to sensation and perception. 4. Describe receptor and generator potentials and sensory adaptation.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":1565601,"ranking":12,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"2. Classify general sensory receptors by structure, stimulus detected, and body location. 3. Outline the events that lead to sensation and perception. 4. Describe receptor and generator potentials and sensory adaptation. 5.Describe the main aspects of sensory perception. 6.lassify general sensory receptors by structure, stimulus detected, and body location. 3. Outline the events that lead to sensation and perception. 4. Describe receptor and generator potentials and sensory adaptation.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":3612929,"ranking":13,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Sensory receptors. Sensory receptors are specialized structures that detect changes in their immediate environment. The primary modality of the receptor is determined by how sensitive the receptor is to the size of an applied sensory stimulus and by its connections to the fibers that transmit the applied stimulus.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":7942125,"ranking":14,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"to a speciË\u009ac type of sensory information, such as light or chemical molecules. Reception is the process of detecting and responding to incoming sensory information. Every receptor cell within a sensory system has an area of sensitivity. This is called its receptive Ë\u009aeld. A receptive Ë\u009celd is the area of space in which a","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":7949456,"ranking":15,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Sensory neurons carry information from receptors located throughout the body to the brain. Information from both the internal (inside the body) and external environments, in the form of light, heat, pressure, taste, and smell is detected by sensory neurons.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":957235,"ranking":16,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Chemoreceptor. Definition. noun, plural: chemoreceptors. (1) A sensory nerve cell or sense organ, as of smell, or taste, that are able to detect and respond to chemical stimuli. (2) A sensory receptor that detects chemical stimuli in the environment and relay that information to the central nervous system.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":2235731,"ranking":17,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Sensation is the detection of physical stimuli in the environment. Perception is our conscious experience of those stimuli. Describe how sensory information is translated into meaningful stimuli. Transduction is the process by which sensory stimuli are translated into signals the brain can interpret. Transduction occurs at sensory receptors, specialized cells in each sense organ. Sensory receptors send messages to the thalamus, which sends projections to cortical areas for perceptual processing.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":2597413,"ranking":18,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Sensory Receptors for Hearing. Summary Information: Sensory Receptors for Hearing. Sensory Receptors for Hearing: The sensory receptors for hearing are specialized types of sensory receptors that are located in the inner ear. The sensory receptors for hearing play an important role in sensing sound waves or vibrations and in hearing.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":4854674,"ranking":19,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Adequate stimulus refers to the property of a sensory receptor that describes the type of energy to which the sensory receptor reacts to. In short, adequate stimulus is the ability of a sensory receptor to determine the stimulus modality. Sensory Receptor.","bm25_label":"high","relevance_label":0.0},{"query_id":1091108,"passage_id":6576464,"ranking":20,"query_text":"refers to what happens when sensory information is detected by a sensory receptor","passage_text":"Processing primarily occurs in the primary somatosensory area in the parietal lobe of the cerebral cortex: information is sent from the receptors via sensory nerves, through tracts in the spinal cord and finally into the brain.n the periphery, the somatosensory system detects various stimuli by sensory receptors, e.g. by mechanoreceptors for tactile sensation and nociceptors for pain sensation. The sensory information (touch, pain, temperature etc.,) is then conveyed to the central nervous system by afferent neurons.","bm25_label":"high","relevance_label":0.0}]