[{"query_id":1091450,"passage_id":5928216,"ranking":1,"query_text":"population of quartzsite az","passage_text":"Homefacts City Report. Quartzsite is located in La Paz County, AZ. The population is 3,664, making Quartzsite the largest city in La Paz County. There are 1 public schools in Quartzsite with an average Homefacts rating of C-. The total crime rate for Quartzsite is moderate, and there are 6 registered sex offenders residing in the city.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7914031,"ranking":2,"query_text":"population of quartzsite az","passage_text":"Information, history, photos and links to numerous web sites regarding Quartzsite, Arizona. With just two exits on I-10 and just over 1800 permanant residents, Quartzsite, AZ becomes the third largest city, by population, in the state of Arizona during the Quartzsite Sports, Vacation & RV Show.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7914033,"ranking":3,"query_text":"population of quartzsite az","passage_text":"Local Information about Quartzsite, AZ. and Surrounding Areas Here is a copy of The Quartzsite Area Guide where you will find lots of information on what's happening, in and around Quartzsite, AZ., including a Calandar of Events, business listings and much, much more. Town of Quartzsite - Official Web Site for the Town of Quartzsite. Quartzsite Chamber of Commerce. Local News, Blogs and other information on The Town of Quartzsite, AZ - The Desert Messenger. Blythe, California Chamber of Commerce - (760) 922-8166. More Blythe info.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7914039,"ranking":4,"query_text":"population of quartzsite az","passage_text":"Quartzsite, Arizona Population: Census 2010 and 2000 Interactive Map, Demographics, Statistics, Quick Facts. Compare population statistics about Quartzsite, AZ by race, age, gender, Latino\/Hispanic origin etc. CensusViewer delivers detailed demographics and population statistics from the 2010 Census, 2000 Census, American Community Survey (ACS), registered voter files, commercial data sources and more.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7914035,"ranking":5,"query_text":"population of quartzsite az","passage_text":"92.55%. 1  Graph: Population by Age and Race - Quartzsite, Arizona. 2  Graph: Population by Age and Race, 2000 Census - Quartzsite, Arizona. 3  Graph: Change in Population between 2000 and 2010, by Age and Race - Quartzsite, Arizona. 4  Graph: Population by Age and Hispanic or Latino Origin, 2010 Census - Quartzsite, Arizona.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7094714,"ranking":6,"query_text":"population of quartzsite az","passage_text":"Climate Quartzsite - Arizona. Â°C | Â°F. Climate data for quartzsite, Longitude: -114.227, Latitude: 33.665. Average weather Quartzsite, AZ - 85346 - 1981-2010 normals. Jan: January, Feb: February, Mar: March, Apr: April, May: May, Jun: June, Jul: July, Aug: August, Sep: September, Oct: October, Nov: November, Dec: December.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":5928214,"ranking":7,"query_text":"population of quartzsite az","passage_text":"Quartzsite, Arizona. Quartzsite is a town in La Paz County, Arizona, United States. According to the 2010 census, the population was 3,677. Interstate 10 runs directly through Quartzsite and is at the intersection of U.S. Route 95 and Arizona State Route 95 with I-10.","bm25_label":"high","relevance_label":1.0},{"query_id":1091450,"passage_id":7914037,"ranking":8,"query_text":"population of quartzsite az","passage_text":"Quartzsite is a town in La Paz County, Arizona, United States. According to Census Bureau estimates, the population of the town was 3,397 in 2006. Interstate 10 runs directly through Quartzsite. It is at the intersection of U.S. Route 95 and Arizona State Route 95 with I 10. Quartzsite is located at 33Â°39â\u0080²54â\u0080³N 114Â°13â\u0080²15â\u0080³W \/ 33.665Â°N 114.22083Â°W \/ 33.665; -114.22083 (33.665116, -114.220913).","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":2930787,"ranking":9,"query_text":"population of quartzsite az","passage_text":"Start Your Review of Santa_Rosa, CA David Quartzsite, AZ Send Message 11\/12\/2016 The good, the bad, the ugly The good is the great climate, excellent resources like quality food choices (groceries and restaurants), and medical services and shopping opportunities, college town,...","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":3786617,"ranking":10,"query_text":"population of quartzsite az","passage_text":"Nearest city with pop. 1,000,000+: Phoenix, AZ (137.4 miles, pop. 1,321,045). Nearest cities: Big River, CA (3.2 miles), Parker, AZ (3.5 miles), Bluewater, AZ (3.8 miles), Bluewater, CA (4.0 miles), Cienega Springs, AZ (4.1 miles), Parker Strip, AZ (4.5 miles), Bouse, AZ (4.8 miles), Quartzsite, AZ (5.0 miles).olleges\/universities with over 2000 students nearest to Poston: 1  Arizona Western College (about 91 miles; Yuma, AZ; Full-time enrollment: 5,454). 2  Mohave Community College (about 92 miles; Kingman, AZ; FT enrollment: 3,309). 3  Imperial Valley College (about 103 miles; Imperial, CA; FT enrollment: 5,313).","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":5251878,"ranking":11,"query_text":"population of quartzsite az","passage_text":"I-10 is the Pearl Harbor Memorial Highway throughout Arizona. I-10 has Business Loops in Quartzsite (old US 60), Casa Grande (AZ 387 \/ 84), Tucson, Benson (both old US 80), Willcox, Bowie, and Sam Simon (all old AZ 86). There is also a Business Spur from exit 304 to BL-10 in Benson, though I don't know if it's marked.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7094717,"ranking":12,"query_text":"population of quartzsite az","passage_text":"Weather in Quartzsite, Arizona : 5 day Forecast, Temperature, humidity, rain , sun forecast for Quartzsite. Monthly average weather in Quartzsite through out the year. Weather widget for Quartzsite, and community of people linking to Quartzsite.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7914032,"ranking":13,"query_text":"population of quartzsite az","passage_text":"The difference between a â\u0080\u009cShowâ\u0080\u009d and a â\u0080\u009cShowcase.â\u0080\u009d. Overview: The Quartzsite shows are famous among professional and amateur lapidaries and jewelry artists. The small desert town lies about 18 miles east of the Arizona-California border, and about 250 miles northwest of Tucson. A quiet town of about 3,000 year-round residents, that population explodes during the January-February show, making Quartzsite a vibrant outdoor desert shopping mall.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7914036,"ranking":14,"query_text":"population of quartzsite az","passage_text":"The most up-to-date information about shows, vendors, news, and weather for the Quartzsite Showcase & Swapmeet in Quartzsite, Arizona. Browse the guides for this showcase and view a map of show locations. The Quartzsite Showcase & Swapmeet starts on 1\/1\/2018. The show ends on 2\/28\/2018. The Showcase is located at Quartzsite, Arizona United States.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7914038,"ranking":15,"query_text":"population of quartzsite az","passage_text":"Quartzsite is located at (33.665116, â\u0088\u0092114.220913). According to the United States Census Bureau Quartzsite is all land and has a total area of 36.3 sq mi (94.0 km 2). Quartzsite lies on the western portion of the La Posa Plain along Tyson Wash.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":3452599,"ranking":16,"query_text":"population of quartzsite az","passage_text":"Percentage of Population employed in Manufacturing in Peoria, AZ by Zip Code. Percentage of Population employed in Retail in Peoria, AZ by Zip Code. Percentage of Population employed in Transportation in Peoria, AZ by Zip Code. Percentage of Population employed in Information Technology in Peoria, AZ by Zip Code. Percentage of Population employed in Finance, Insurance & Real Estate in Peoria, AZ by Zip Code.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":5928207,"ranking":17,"query_text":"population of quartzsite az","passage_text":"Quartzsite, Arizona. 1  Quartzsite is a well known destinations for snowbirds and tourism is the major contributor to Quartzsite's economy. 2  Many take part in the nine major gem, mineral shows and over 15 general swapmeeting shows. 3  The nearby Colorado River offers visitors a variety of water sports ranging from fishing to speed boat racing.","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7977770,"ranking":18,"query_text":"population of quartzsite az","passage_text":"A desert oasis with the largest campground sites in the Quartzsite and Salome areas! Located in the Arizona desert outback in the McMullen Valley, Black Rock RV Village is the best place to go camping in the Quartzsite and Salome areas!","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":7436282,"ranking":19,"query_text":"population of quartzsite az","passage_text":"One Race Percent in Williams, AZ. At the time of the last census survey, the number of people of one race in Williams, AZ was 2,766. White Population in Williams, AZ. The estimated White population in the Williams community is 2,192, which is 77.1 percent of the total population (The U.S. average is 75.10%).","bm25_label":"high","relevance_label":0.0},{"query_id":1091450,"passage_id":6105053,"ranking":20,"query_text":"population of quartzsite az","passage_text":"A small mining boom revitalized the town and it became known as Quartzsite in 1897. It remained a mining town until 1965, when the Pow Wow Rock, Gem & Mineral Show initiated the rockhound winter migration to Quartzsite each year.","bm25_label":"high","relevance_label":0.0}]