[{"query_id":1091206,"passage_id":7933343,"ranking":1,"query_text":"putrescine definition","passage_text":"Learn English watching your favourite videos | Learn English with movies | Learn English with TV shows. All English definitions from our dictionary. Search putrescine and thousands of other words in English definition and synonym dictionary from Reverso. You can complete the definition of putrescine given by the English Definition dictionary with other English dictionaries: Wikipedia, Lexilogos, Oxford, Cambridge, Chambers Harrap, Wordreference, Collins Lexibase dictionaries, Merriam Webster...","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":7933349,"ranking":2,"query_text":"putrescine definition","passage_text":"Sentence Examples with Putrescine One is called putrescine, the other is called cadaverine, very pungent smells. 0 | 0 | Write your own sentence example for Putrescine and get creative, maybe even funny. Your Word Lists","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":7933348,"ranking":3,"query_text":"putrescine definition","passage_text":"Related Terms: Cadaverine, Forensic Anthropology. According to Stedman's, putrescine is poisonous ... formed during putrefaction (and) found in urine and feces.. The production of putrescine by the decaying dead human body is the cause of the strong odour. Cadaver dogs, trained to locate bodies under rubble, are trained to react and point to the smell of putrescine.1.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":8444599,"ranking":4,"query_text":"putrescine definition","passage_text":"Putrescine is related to cadaverine (another polyamine). Both are produced by the breakdown of amino acids in living and dead organisms and both are toxic in large doses. Putrescine and cadaverine are largely responsible for the foul odor of putrefying flesh, but also contribute to the odor of such processes as bad breath and bacterial vaginosis. Putrescine is also found in semen.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":7933346,"ranking":5,"query_text":"putrescine definition","passage_text":"Putrescine is synthesized in small quantities by healthy living cells by the action of ornithine decarboxylase. Putrescine is synthesized biologically via two different pathways, both starting from arginine.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":7910002,"ranking":6,"query_text":"putrescine definition","passage_text":"The gab operon contributes to homeostasis of polyamines such as putrescine, during nitrogen-limited growth.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":1548665,"ranking":7,"query_text":"putrescine definition","passage_text":"The ornithine decarboxylation reaction catalyzed by ornithine decarboxylase is the first and committed step in the synthesis of polyamines, particularly putrescine, spermidine and spermine.Polyamines are important for stabilizing DNA structure, the DNA double strand-break repair pathway and as antioxidants.he ornithine decarboxylation reaction catalyzed by ornithine decarboxylase is the first and committed step in the synthesis of polyamines, particularly putrescine, spermidine and spermine.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":3719891,"ranking":8,"query_text":"putrescine definition","passage_text":"Ornithine decarboxylase (ODC), the rate-limiting enzyme in polyamine biosynthesis that decarboxylates ornithine to putrescine, has become a promising target for cancer research.The aim of this study is to investigate the role of ODC in breast cancer.rnithine decarboxylase (ODC), the rate-limiting enzyme in polyamine biosynthesis that decarboxylates ornithine to putrescine, has become a promising target for cancer research.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":8444592,"ranking":9,"query_text":"putrescine definition","passage_text":"Putrescine is produced during the decay and protein breakdown of meats and is responsible for some of the odor found in them. Identify the functional group circled. a.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":7933342,"ranking":10,"query_text":"putrescine definition","passage_text":"Na3, Fe(NO3)3, FeSO4, folic acid, glucose, H2Se03, HEPES, hypoxanthine, insulin human, KCI, linoleic acid, lipoic acid, MgC12, MnC12, MnSO4, myo-inositol, Na2HPO4, Na2Se03, Na2SiO3, NaC1, NaH2PO4, NaHCO3, sodium pyruvate, sodium acetate, NH4V03, NiC12, nicotinamide, phenol red, polysorbate 80, putrescine, putrescine 2HC1, pyridoxine HO, pyridoxal Ha, riboflavin, SnC12, thiamine HO, thymidine, vitamin B12 and ZnSO4.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":8444594,"ranking":11,"query_text":"putrescine definition","passage_text":"Cadaverine is a foul-smelling diamine compound produced by the putrefaction of animal tissue. Cadaverine is a toxic[1] diamine with the formula NH2(CH2)5NH2, which is similar to putrescine.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":4514303,"ranking":12,"query_text":"putrescine definition","passage_text":"As hyoscyamine is a direct precursor in the plant biosynthesis of scopolamine, it is produced via the same metabolic pathway. The biosynthesis of scopolamine begins with the decarboxylation of L-ornithine to putrescine by ornithine decarboxylase (EC 4.1.1.17).","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":4757653,"ranking":13,"query_text":"putrescine definition","passage_text":"The Smell of Maggots. Everyone has experienced the smell of a rotting carcass. That characteristic odor of cadaverine and putrescine are unmistakable. The odor of these proteins in the trunk of Casey Anthonyâ\u0080\u0099s car was the basis for trying her for the death of her daughter.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":8444593,"ranking":14,"query_text":"putrescine definition","passage_text":"Cadaverine is a foul-smelling diamine compound produced by the putrefaction of animal tissue. Cadaverine is a toxic diamine with the formula NH2(CH2)5NH2, which is similar to putrescine. Cadaverine is also known by the names 1,5-pentanediamine and pentamethylenediamine.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":340743,"ranking":15,"query_text":"putrescine definition","passage_text":"Ornithine decarboxylation yields putrescine. Lysine decarboxylation results in cadaverine. These byproducts are sufficient to raise the pH of the media so that the broth turns purple. If the inoculated medium is yellow, or if there is no color change, the organism is decarboxylase-negative for that amino acid.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":2812248,"ranking":16,"query_text":"putrescine definition","passage_text":"Carrion begins to decay the moment of the animal's death, and it will increasingly attract insects and breed bacteria. Not long after the animal has died, its body will begin to exude a foul odor caused by the presence of bacteria and the emission of cadaverine and putrescine.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":7933347,"ranking":17,"query_text":"putrescine definition","passage_text":"Cadaverine is a foul-smelling diamine compound produced by the putrefaction of animal tissue. Cadaverine is a toxic diamine with the formula NH 2 (CH 2) 5 NH 2, which is similar to putrescine. Cadaverine is also known by the names 1,5-pentanediamine and pentamethylenediamine","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":5674521,"ranking":18,"query_text":"putrescine definition","passage_text":"There are indeed times we in the field of death investigation have to push through the repelling olfactory assault of cadaverine and putrescine to do our job. (It isnâ\u0080\u0099t always as glamourous as they portray on TV.) But even the most odiferous is treated with respect. We complete what we must.","bm25_label":"high","relevance_label":0.0},{"query_id":1091206,"passage_id":7933345,"ranking":19,"query_text":"putrescine definition","passage_text":"Putrescine, or tetramethylenediamine, is a foul-smelling[1] organic chemical compound NH2(CH2)4NH2 (1,4-diaminobutane or butanediamine) that is related to cadaverine; both are produced by the breakdown of amino acids in living and dead organisms and both are toxic in large doses.[2][3] The two compounds are largely responsible for the foul odor of ...","bm25_label":"high","relevance_label":1.0},{"query_id":1091206,"passage_id":8444595,"ranking":20,"query_text":"putrescine definition","passage_text":"Putrescine and cadaverine were first described in 1885 by the Berlin physician Ludwig Brieger (1849â\u0080\u00931919). Production. Cadaverine is the decarboxylation product of the amino acid lysine. This can be done by heating lysine with a small amount of sodium bicarbonate mixed in. The produced gas should be led to a glass container which is surrounded by ice water.","bm25_label":"high","relevance_label":0.0}]