[{"query_id":1091520,"passage_id":7907510,"ranking":1,"query_text":"population decline new castle pa","passage_text":"Population changes over time are one way of gauging the amount of moving activity in New Castle. The New Castle metro area saw its population decline from 23,230 persons in 2010 to 22,575 persons in 2014 according to the US Census, a decrease of -2.82%. The Real Estate Climate and Self Storage in New Castle, PA","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":7907516,"ranking":2,"query_text":"population decline new castle pa","passage_text":"The New Castle metro area saw its population decline from 23,230 persons in 2010 to 22,575 persons in 2014 according to the US Census, a decrease of -2.82%. The Real Estate Climate and Self Storage in New Castle, PA. Housing unit occupancy can give us an idea of what the demand is like for living and storage space in New Castle.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":3731673,"ranking":3,"query_text":"population decline new castle pa","passage_text":"New Castle is the principal city of the New Castle, PA Micropolitan Statistical Area, which had a population of 91,108 in 2010. New Castle also anchors the northwestern part of the Pittsburgh-New Castle-Weirton, PA-WV-OH Combined Statistical Area.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":6016760,"ranking":4,"query_text":"population decline new castle pa","passage_text":"Homefacts City Report. New Castle is located in Lawrence County, PA. The population is 23,025, making New Castle the largest city in Lawrence County. There are 17 public schools in New Castle with an average Homefacts rating of B-. The total crime rate for New Castle is moderate, and there are 71 registered sex offenders residing in the city.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":3731667,"ranking":5,"query_text":"population decline new castle pa","passage_text":"New Castle, PA Profile: Facts, Map & Data. New Castle, Pennsylvania - Basic Facts. The City of New Castle had a population of 22,717 as of July 1, 2016. New Castle ranks in the upper quartile for Diversity Index when compared to the other cities, towns and Census Designated Places (CDPs) in Pennsylvania. See peer rankings below.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":7907511,"ranking":6,"query_text":"population decline new castle pa","passage_text":"New Castle Pennsylvania Population Charts According to the most recent demographics data available from the Census Bureau released in December of 2017, Figure 1 New Castle shows it has 22,500 population which is the most of all placesin the area. Figure 3 compares the population change from 2010 to 2016 and we can see New Castle indicates a decline of 773 (3%). The population percent change for all areas for 2010 to 2016 is shown in Figure 4 and for New Castle reveals it has -3.3% Population Change which is the 4th in Population Change out of 10 total in the area.","bm25_label":"high","relevance_label":1.0},{"query_id":1091520,"passage_id":2440096,"ranking":7,"query_text":"population decline new castle pa","passage_text":"People Also Viewed. 1  PNC Bank 2660 Ellwood Rd, New Castle, PA. 2  PNC Bank 2650 Ellwood Rd, New Castle, PA. 3  First National Bank 2353 Harlansburg Rd, New Castle, PA.  Huntington Bank 2501 W State St Ste E, New Castle, 1  PA. Family 1St Federal Credit Union 917 Moravia St, New Castle,  PA.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":6016766,"ranking":8,"query_text":"population decline new castle pa","passage_text":"New Castle, PA. Sponsored Topics. New Castle is a city in Lawrence County, Pennsylvania, United States, 50 miles (80 km) northwest of Pittsburgh and near the Pennsylvania-Ohio border just 18 miles (30 km) east of Youngstown, Ohio; in 1910, the total population was 36,280; in 1920, 44,938; and in 1940, 47,638.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":2232211,"ranking":9,"query_text":"population decline new castle pa","passage_text":"Patton, PA Profile. Patton, PA, population 1,837, is located in Pennsylvania's Cambria county, about 72.0 miles from Pittsburgh and 127.4 miles from Erie. Through the 90's Patton's population has declined by about 8%. It is estimated that in the first 5 years of the past decade the population of Patton has declined by about 5%. Since 2005 Patton's population has declined by about 3%. Population Statistics Gender","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":7713600,"ranking":10,"query_text":"population decline new castle pa","passage_text":"It is the county seat of Lawrence County. New Castle is the principal city of the New Castle, PA Micropolitan Statistical Area and a part of the Pittsburgh-New Castle-Weirton, PA-OH-WV Combined Statistical Area, which is the 20th largest in the United States. It is the commercial center of a fertile agricultural region.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":3596665,"ranking":11,"query_text":"population decline new castle pa","passage_text":"Lewisburg, PA Profile. Lewisburg, PA, population 5,500, is located in Pennsylvania's Union county, about 77.1 miles from Allentown and 114.5 miles from Philadelphia.Through the 90's Lewisburg's population has declined by about 3%.It is estimated that in the first 5 years of the past decade the population of Lewisburg has declined by about 1%. Since 2005 Lewisburg's population has declined by about 1%.Lewisburg's property crime levels tend to be much lower than Pennsylvania's average level.t is estimated that in the first 5 years of the past decade the population of Lewisburg has declined by about 1%. Since 2005 Lewisburg's population has declined by about 1%.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":8501771,"ranking":12,"query_text":"population decline new castle pa","passage_text":"Wyndmoor, PA has a population of 5,611 people with a median age of 48.2 and a median household income of $85,244. Between 2014 and 2015 the population of Wyndmoor, PA declined from 5,681 to 5,611, a -1.23% decrease and its median household income declined from $86,619 to $85,244, a -1.59% decrease.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":1925906,"ranking":13,"query_text":"population decline new castle pa","passage_text":"Route Map from Slippery Rock, PA to New Castle, PA. Optimal route map between Slippery Rock, PA and New Castle, PA. This route will be about 17 Miles. The driving route information(distance, estimated time, directions), flight route, traffic information and print the map features are placed on the top right corner of the map. Slippery Rock, PA Weather","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":3641107,"ranking":14,"query_text":"population decline new castle pa","passage_text":"Harrisburg, PA Profile. Harrisburg, PA, population 47,418, is located in Pennsylvania's Dauphin county, about 69.5 miles from Baltimore and 77.0 miles from Allentown. Through the 90's Harrisburg's population has declined by about 7%. It is estimated that in the first 5 years of the past decade the population of Harrisburg has declined by about 3%. Since 2005 Harrisburg's population has stayed about the same.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":3731670,"ranking":15,"query_text":"population decline new castle pa","passage_text":"Lawrence County is also a part of the Pittsburgh-New Castle-Weirton, PA-OH-WV Combined Statistical Area (CSA), which combines the population of Lawrence, as well as the Allegheny, Armstrong, Beaver, Butler, Fayette, Indiana, Washington and Westmoreland county areas in Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":8811297,"ranking":16,"query_text":"population decline new castle pa","passage_text":"Visit UPMC Jameson, a full-service community hospital located in New Castle, PA. Learn about our surgical services, emergency medicine, and other services. Visit UPMC Jameson, a full-service community hospital located in New Castle, PA.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":3323683,"ranking":17,"query_text":"population decline new castle pa","passage_text":"1 Kmart - New Castle, PA 16101. 2  Kmart - New Kensington, PA 15068. 3  Sears - Ross Park Mall - Pittsburgh, PA 15237. 4  Kmart - Leechburg, PA 15656.  Kmart - Pittsburgh, PA 15223.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":4066784,"ranking":18,"query_text":"population decline new castle pa","passage_text":"Local news for New Castle, PA continually updated from thousands of sources on the web.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":2232204,"ranking":19,"query_text":"population decline new castle pa","passage_text":"Patton, PA Profile Patton, PA, population 1,837, is located in Pennsylvania's Cambria county, about 72.0 miles from Pittsburgh and 127.4 miles from Erie. Through the 90's Patton's population has declined by about 8%.","bm25_label":"high","relevance_label":0.0},{"query_id":1091520,"passage_id":2855710,"ranking":20,"query_text":"population decline new castle pa","passage_text":"Pennsylvania Weather > New Castle Weather New Castle, PA Weather New Castle, PA climate is warm during summer when temperatures tend to be in the 70's and very cold during winter when temperatures tend to be in the 20's. The warmest month of the year is July with an average maximum temperature of 84.50 degrees Fahrenheit, while the coldest month of the year is January with an average minimum temperature of 16.40 degrees Fahrenheit.","bm25_label":"high","relevance_label":0.0}]