[{"query_id":1091719,"passage_id":7891241,"ranking":1,"query_text":"petrol price in pakistan","passage_text":"Petrol Prices In Pakistan. Petrol Prices in Pakistan â\u0080\u0093 Find current petroleum prices in Pakistan as petroleum products is updated after every 15 days by the OGRA-Oil & Gas Regulatory Authority. Fuel prices of HOBC, Premium, diesel prices of High Speed Diesel, Light Speed Diesel & Kerosene Oil prices in Pakistan. Petroleum prices are causes major impact on Pakistanâ\u0080\u0099s economy and it directly effects on general public. Petrol Price in Pakistan November 2017","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":5508175,"ranking":2,"query_text":"petrol price in pakistan","passage_text":"A password will be e-mailed to you. Petrol Price in Pakistan. Latest and updated Petrol Price in Pakistan January 2017 are presented here each month after price announcement by the Oil & Regularity Authority of Pakistan (OGRA) under the Ministry of Petroleum.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":7891238,"ranking":3,"query_text":"petrol price in pakistan","passage_text":"Due to the early major fluctuation in international oil market effects directly to the petroleum products prices in Pakistan as well and the average price of petrol in Pakistan is 72.68 Pakistan rupee while the price of petrol in India is 62.24 Indian rupees per litre.","bm25_label":"high","relevance_label":1.0},{"query_id":1091719,"passage_id":7891236,"ranking":4,"query_text":"petrol price in pakistan","passage_text":"Pakistan petrol price lower than India. LAHORE: Petrol in Pakistan costs less than India. Premium petrol price of Rs 62.24 (99.58 Pakistani rupees) per litre in New Delhi is higher than the price of Premium in Pakistan, which is Rs 64.27 per litre. The currency difference is one Indian rupee is equal to 1.60 Pakistani rupee. The US Dollar costs Rs 65.53 in India while it is selling at Rs105.24 in Pakistan.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":665798,"ranking":5,"query_text":"petrol price in pakistan","passage_text":"1st September 2015, Petrol Prices in Pakistan â\u0080\u0093 Find current petroleum prices in Pakistan as petroleum products is updated after every 15 days by the OGRA-Oil & Gas Regulatory Authority.IA. Petrol Prices In Pakistan september 2015 â\u0080\u0093 INCPak will keep updating this page as the prices will change, since there is no assurance when government raise the prices.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":665800,"ranking":6,"query_text":"petrol price in pakistan","passage_text":"FIA. Petrol Prices In Pakistan september 2015 â\u0080\u0093 INCPak will keep updating this page as the prices will change, since there is no assurance when government raise the prices.People always wanted to know about the current prices.IA. Petrol Prices In Pakistan september 2015 â\u0080\u0093 INCPak will keep updating this page as the prices will change, since there is no assurance when government raise the prices.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":6770933,"ranking":7,"query_text":"petrol price in pakistan","passage_text":"What about the price of the petroleum in the upcoming month, our government should relief in the price because in the whole market the price of petroleum decreases much fast. fawad. Wed 30 Sep, 2015. I heard that the petrol prices in Pakistan are going to be drastically down.he international market of oil is keeo descreasing, and obviously it is directly effected to the Asian oil market and Pakistan as well, and the petroleum products prices are declining, now Petrol is Rs. 78\/Ltr but it can be more down, Saudi Arabia offers Pakistan $40 Per Barrel with subsidy.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":6770937,"ranking":8,"query_text":"petrol price in pakistan","passage_text":"The international market of oil is keeo descreasing, and obviously it is directly effected to the Asian oil market and Pakistan as well, and the petroleum products prices are declining, now Petrol is Rs. 78\/Ltr but it can be more down, Saudi Arabia offers Pakistan $40 Per Barrel with subsidy.he international market of oil is keeo descreasing, and obviously it is directly effected to the Asian oil market and Pakistan as well, and the petroleum products prices are declining, now Petrol is Rs. 78\/Ltr but it can be more down, Saudi Arabia offers Pakistan $40 Per Barrel with subsidy.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":7891242,"ranking":9,"query_text":"petrol price in pakistan","passage_text":"Petrol Prices In Pakistan â\u0080\u0093 INCPak will keep updating this page as the prices will change, since there is no assurance when government raise the prices. People always wanted to know about the current prices. Fuel prices of HOBC, Premium, diesel prices of High Speed Diesel, Light Speed Diesel & Kerosene Oil prices in Pakistan.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":6864261,"ranking":10,"query_text":"petrol price in pakistan","passage_text":"New Delhi: Petrol in India costs more than neighbouring Pakistan and Sri Lanka but is cheaper than Bangladesh and Nepal, Oil Minister Dharmendra Pradhan said on Wednesday. Petrol price of Rs 63.16 per litre in Delhi is more than Rs 44.05 per litre rate of the fuel in Pakistan and Rs 54.75 in Sri Lanka. However, it is cheaper than Rs 76.97 per litre price in Bangladesh and Rs 68.13 a litre in Nepal.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":7891240,"ranking":11,"query_text":"petrol price in pakistan","passage_text":"New Delhi: Petrol in India costs more than neighbouring Pakistan and Sri Lanka but is cheaper than Bangladesh and Nepal, Oil Minister Dharmendra Pradhan said on Wednesday. Petrol price of Rs. 63.16 per litre in Delhi is more than Rs. 44.05 per litre rate of the fuel in Pakistan and Rs. 54.75 in Sri Lanka. However, it is cheaper than Rs. 76.97 per litre price in Bangladesh and Rs. 68.13 a litre in Nepal.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":6770936,"ranking":12,"query_text":"petrol price in pakistan","passage_text":"You can find the current petroleum prices in Pakistan as the update takes place for the petroleum products every month by the Oil & Gas Regulatory Authority (OGRA). Find fuel prices of HOBC, premium\/petrol, HSD-high speed diesel prices, LSD-light speed diesel and Kerosene Oil prices in Pakistan.The projected fuel prices by OGRA are merely based on international market of Oil & gas and its current fluctuating position.he international market of oil is keeo descreasing, and obviously it is directly effected to the Asian oil market and Pakistan as well, and the petroleum products prices are declining, now Petrol is Rs. 78\/Ltr but it can be more down, Saudi Arabia offers Pakistan $40 Per Barrel with subsidy.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":665803,"ranking":13,"query_text":"petrol price in pakistan","passage_text":"Fuel prices of HOBC, Premium, diesel prices of High Speed Diesel, Light Speed Diesel & Kerosene Oil prices in Pakistan. Petroleum prices are causes major impact on Pakistanâ\u0080\u0099s economy and it directly effects on general public.IA. Petrol Prices In Pakistan september 2015 â\u0080\u0093 INCPak will keep updating this page as the prices will change, since there is no assurance when government raise the prices.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":7891237,"ranking":14,"query_text":"petrol price in pakistan","passage_text":"Petrol Prices in Pakistan June 2017. ISLAMABAD: The government has cut the prices of petrol and high speed diesel (HSD), effective from June 1, 2017. However, the prices of light diesel oil (LDO) and kerosene oil have been kept unchanged for month of June. The new prices have been announced after getting a nod from Prime Minister Nawaz Sharif.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":6864264,"ranking":15,"query_text":"petrol price in pakistan","passage_text":"Petrol price of Rs 71.41 a litre at Delhi was cheaper than Bangladesh (Rs 74.43), Sri Lanka (Rs 74.92) and Nepal (Rs 83.61) but costlier than Rs 66.17 a litre price in Pakistan.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":665799,"ranking":16,"query_text":"petrol price in pakistan","passage_text":"You can find the current petroleum prices in Pakistan as the update takes place for the petroleum products every month by the Oil & Gas Regulatory Authority (OGRA). Find fuel prices of HOBC, premium\/petrol, HSD-high speed diesel prices, LSD-light speed diesel and Kerosene Oil prices in Pakistan.The projected fuel prices by OGRA are merely based on international market of Oil & gas and its current fluctuating position.hat about the price of the petroleum in the upcoming month, our government should relief in the price because in the whole market the price of petroleum decreases much fast. fawad. Wed 30 Sep, 2015. I heard that the petrol prices in Pakistan are going to be drastically down.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":2066032,"ranking":17,"query_text":"petrol price in pakistan","passage_text":"Among the other major world countries, petrol prices in the UK are the 13th highest in the world as the Brits pay $8.25 for a gallon of petrol. The petrol per gallon price is $7.51 in Switzerland, $6.65 in South Korea, $6.55 in Singapore, $5.84 in Japan and $5.27 in Australia.Petrol gallon cost in the worldâ\u0080\u0099s largest consumer US is $3.69 â\u0080\u0093 which is rated 51st on the list. In India and Pakistan, a gallon costs $4.79 and $4.08, respectively.ublished. Petrol prices in the UAE are among the lowest in the world â\u0080\u0093 thanks to the government subsidy, according to latest statistics. Figures released by Bloomberg show that a gallon of petrol costs $1.77 (Dh6.5) in the UAE, which is sixth most economical in the world.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":5508179,"ranking":18,"query_text":"petrol price in pakistan","passage_text":"New Delhi: Petrol in India costs more than neighbouring Pakistan and Sri Lanka but is cheaper than Bangladesh and Nepal, Oil Minister Dharmendra Pradhan said on Wednesday. Petrol price of Rs 63.16 per litre in Delhi is more than Rs 44.05 per litre rate of the fuel in Pakistan and Rs 54.75 in Sri Lanka. However, it is cheaper than Rs 76.97 per litre price in Bangladesh and Rs 68.13 a litre in Nepal. Press Trust of India | Last Updated: May 13, 2015 22:47 (IST)","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":6864260,"ranking":19,"query_text":"petrol price in pakistan","passage_text":"Comments. One litre of petrol costs Rs48.64 in Pakistan, Rs52.42 in Bangladesh and Rs61.38 in Sri Lanka. In India, the fuel costs Rs66.42, despite oil marketing companies reducing prices Nov 16.","bm25_label":"high","relevance_label":0.0},{"query_id":1091719,"passage_id":665802,"ranking":20,"query_text":"petrol price in pakistan","passage_text":"General public of Pakistan can find updates prices of premium XL \/ petrol prices, Green XL \/ HSD (high speed diesel) prices, LSD (light speed diesel) prices, SKO (Kerosene oil) prices, E-10 Gasoline and HOBC (Hi-octane Blending compound) prices on Pakbiz.com.he department dispatched a summary regarding petroleum productsâ\u0080\u0099 prices to the PM. The summary recommends a price cut of at least Rs 6.15 in petrol prices from the start of September. Petrolâ\u0080\u0099s current price is Rs 76.76 per litre.","bm25_label":"high","relevance_label":0.0}]