[{"query_id":1092093,"passage_id":1783238,"ranking":1,"query_text":"number of people ditching their landline","passage_text":"As of late 2007, 16 percent of U.S. households had no landline whatsoever, compared to just 5 percent in 2004 [source: Associated Press ]. If that rapid trend of ditching landlines continues, half of the U.S. could be without one in about 10 years. Among the people who have landlines in the U.S., 13 percent nevertheless rely on their cell phones for the majority of their calls. Across the country, people are hanging up their home phones: 1  In New York state, the number of landline subscribers has fallen by 55 percent since the year 2000. 2  New Jersey landline subscribers have decreased by 50 percent.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":5513817,"ranking":2,"query_text":"number of people ditching their landline","passage_text":"Ditching your landline may also mean ditching your phone number: Google Voice, MagicJack, and NetTalk don't yet allow you to port an existing number, though all three services say that this option is in the works).If you want to keep your old, familiar digits, you'll have to choose Ooma. Or not.ranted, most of us could reach for a cell phone in that situation, but if you're concerned about 911 accessibility, you might want to stick with your landline (which is immune to power and Internet outages).","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":7859449,"ranking":3,"query_text":"number of people ditching their landline","passage_text":"The latest research from the Australian Communications and Media Authority (ACMA) has highlighted that an increasing number of Australians are choosing to ditch their landlines and instead rely on their smartphones and internet connection for voice communication.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":1783239,"ranking":4,"query_text":"number of people ditching their landline","passage_text":"Follow CBS-FM. New data shows that the vast majority of Americans still have a landline but they are slowly fading away. The Wall Street Journal reports 71% of households currently have a landline compared to 96% 15 years ago. Obviously most of the households that have landlines also have cell phones too. However with the economic downturn a few years ago, many people have ditched 2 phone services and got rid of their landlines and went wireless. Bundled intenet lines, TV, and phone also make wired landline service obsolete.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":6279221,"ranking":5,"query_text":"number of people ditching their landline","passage_text":"Google Voice: A step-by-step primer on ditching your landline while keeping your number. Google doesn't normally allow you to port a landline phone number to Google Voice. This step-by-step primer shows you how you can do it.By David Gewirtz for ZDNet Government |.gnore this. Tell Google Voice the number of the phone you want to port (your former land line number, now residing on the GoPhone), and the account number you extracted earlier from the AT&T rep (see Step 5).","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":7859453,"ranking":6,"query_text":"number of people ditching their landline","passage_text":"A third of Australians have ditched their landline. Photo: Theresa Ambrose If the move away from the landline continues at the same pace, the majority of Australians would be mobile-only within the next five years.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":7859456,"ranking":7,"query_text":"number of people ditching their landline","passage_text":"Is It Time To Ditch Your Landline Phone? By: Andrea Eldridge, CEO and co-founder of Nerds On Call, an on-site computer and laptop repair service company. Pretty much everyone these days has a cell phone, including some people who probably shouldnâ\u0080\u0099t. With the popularity and commonality of cell phones ever increasing, the landline phone is becoming a thing of the past, much like the pager and Walkman over the last few decades.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":8596490,"ranking":8,"query_text":"number of people ditching their landline","passage_text":"May 30, 2009. eFax is a subscription-based company that provides electronic fax services. With more people ditching landline telephone service and reducing paper clutter, eFax's services are designed to meet consumers' fax communication needs with the technology they want to use. Woman clicking computer mouse.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":6279223,"ranking":9,"query_text":"number of people ditching their landline","passage_text":"When people call my landline, I want it to ring on my cell phone, because my landline is going to be tied up by my pc. I know that it's * or # something. I just can't remember the number that follows.1 following.hen people call my landline, I want it to ring on my cell phone, because my landline is going to be tied up by my pc. I know that it's * or # something. I just can't remember the number that follows. 1 following.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":7859458,"ranking":10,"query_text":"number of people ditching their landline","passage_text":"The days of having a fixed-line home phone are coming to an end, with 6.67 million Australians ditching the landline in 2017 and moving completely to mobile. By June 30, 36 per cent of Australian adults had scrapped their landline, up from 22 per cent five years ago, the Australian Communications and Media Authority's latest communications report found.","bm25_label":"high","relevance_label":1.0},{"query_id":1092093,"passage_id":5493158,"ranking":11,"query_text":"number of people ditching their landline","passage_text":"How do I transfer my landline phone to my cell phone? When people call my landline, I want it to ring on my cell phone, because my landline is going to be tied up by my pc.I know that it's * or # something. I just can't remember the number that follows.1 following.ow do I transfer my landline phone to my cell phone? When people call my landline, I want it to ring on my cell phone, because my landline is going to be tied up by my pc.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":1429255,"ranking":12,"query_text":"number of people ditching their landline","passage_text":"To determine a landline number, contact the customer service department of the landline service provider or review the most recent landline phone bill. If this information is unavailable, call a... To determine a landline number, contact the customer service department of the landline service provider or review the most recent landline phone bill. If this information is unavailable, call a phone with caller ID to reveal the landline number. Continue Reading","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":6279215,"ranking":13,"query_text":"number of people ditching their landline","passage_text":"If you transfer your landline telephone number to Straight Talk, your landline phone service will be disconnected and you will no longer receive calls on your landline phone.f you transfer your landline telephone number to Straight Talk, your landline phone service will be disconnected and you will no longer receive calls on your landline phone.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":1429254,"ranking":14,"query_text":"number of people ditching their landline","passage_text":"A: To determine a landline number, contact the customer service department of the landline service provider or review the most recent landline phone bill. If this information is unavailable, call a phone with caller ID to reveal the landline number. Landlines work by transmitting your call via metal or optical wires.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":1095256,"ranking":15,"query_text":"number of people ditching their landline","passage_text":"In total we have over 10 free features packed into each phone number. With mobile landline numbers available from just Â£4.99 a month, it really is one of the best mobile landline number services on the market.You can buy a mobile landline number for over 650 different UK areas. Search for and order your new mobile landline number below and be up and running within one working hour.n total we have over 10 free features packed into each phone number. With mobile landline numbers available from just Â£4.99 a month, it really is one of the best mobile landline number services on the market.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":6594201,"ranking":16,"query_text":"number of people ditching their landline","passage_text":"Subscribers get a stronger, clearer, more reliable signal at home -- which means more users may finally be able to ditch their landline phone service for good. Carriers benefit by being able to offload traffic from their main networks, saving the substantial cost of building more cell towers.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":5142483,"ranking":17,"query_text":"number of people ditching their landline","passage_text":"For outgoing calls, users can dial a landline or cellphone for a low per-minute or monthly charge, and subscribers can obtain a Skype number to receive calls from landlines and cellphones worldwide. In May 2010, Skype introduced its group video calling service that lets five people have a videoconference.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":6842850,"ranking":18,"query_text":"number of people ditching their landline","passage_text":"The other day, in my post listing , I suggested ditching your landline in favor of a voice-over-IP option like MagicJack or Ooma. But there's another option, one that lets you embrace the goodness that is Google Voice: Obihai's OBi100 VoIP phone adapter, which Amazon has for $39.24 shipped.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":1153918,"ranking":19,"query_text":"number of people ditching their landline","passage_text":"For example, to dial a landline number in Indore, one would have to dial. 1  from a landline in Indore: the phone number. 2  from a landline in Mumbai: 0731 and then the phone number. 3  from any mobile phone in India: 0731 and then the phone number.  from outside India: Country Code 91 then 0731 and then the phone number.","bm25_label":"high","relevance_label":0.0},{"query_id":1092093,"passage_id":7354824,"ranking":20,"query_text":"number of people ditching their landline","passage_text":"Subscriptions offer the best value for calling mobiles and landlines from Skype - you'll save up to 60% off our standard calling rates. With a Skype Number (previously known as an Online Number), people can call you from mobiles or landlines and you can pick up the call in Skype. Itâ\u0080\u0099s perfect if you have friends, family or colleagues who donâ\u0080\u0099t use Skype.","bm25_label":"high","relevance_label":0.0}]