[{"query_id":1092522,"passage_id":7823509,"ranking":1,"query_text":"most durable paint in aerosol","passage_text":"Eastwood 2K High-Gloss and Matte Clear Aerosols allows you to paint with the durability and precision of a two-component coating without the paint gun! Formulated with Eastwood proprietary nano ceramic technology to provide a long-lasting and durable finish, while keeping its beautiful finish for years. 2-Component Catalyzed Technology; Two Chamber Design Aerosol; Most Durable Paint in an Aerosol Available; Sprays Like a Paint Gun","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":7823503,"ranking":2,"query_text":"most durable paint in aerosol","passage_text":"Most Durable Paint in an Aerosol Available Sprays Like a Paint Gun The innovative nozzle and valve technology, combined with its two internal chambers, ensure the right ratio is mixed every time.","bm25_label":"high","relevance_label":1.0},{"query_id":1092522,"passage_id":2944163,"ranking":3,"query_text":"most durable paint in aerosol","passage_text":"1 Includes two 11 oz. aerosol cans; a factory-matched top-coat (color) and high-quality clearcoat for a long-lasting, durable finish. 2  Touch-up paint designed specifically by ColorRite.  ColorRite aerosol paints are ideal for larger areas - about 5-6 square feet, but darker colors require more paint than the lighter ones.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":2952582,"ranking":4,"query_text":"most durable paint in aerosol","passage_text":"DESCRIPTION AND USES. Rust-OleumÂ® Inverted Striping Paint is a lead-free aerosol paint that. features weather and abrasion resistance for durability. When used. with one of the Rust-Oleum Striping Machines, these coatings are. ideal for striping parking lots and aisles. They dry fast and adhere to. concrete, pavement, gravel, grass and more.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":905677,"ranking":5,"query_text":"most durable paint in aerosol","passage_text":"Paint Sheen Properties. Flat paint, the least shiny, is also the least durable. Flat paint isn't the best choice in a damp area such as bathroom, as moisture may remove some of the paint. At the other end of the spectrum is gloss paint: very shiny and extremely durable. In between are eggshell, satin and semigloss, in order of least to most shiny and durable.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":5808345,"ranking":6,"query_text":"most durable paint in aerosol","passage_text":"A Aerosol is a fast-drying, solvent-based, easy-to-use aerosol spray can that allows easy application of Aluminum Oxide to most any substrate for use in any atmosphere.escription. ZYP Coatingâ\u0080\u0099s â\u0080\u009cA Aerosol Brushableâ\u0080\u009d is the same formulation that is used in our A Aerosol spray can â\u0080¦ but is in BULK (paint) form, sold by the gallon. The A Aerosol Brushable can be applied by brushing, traditional air-spraying means, or dipping.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":4901517,"ranking":7,"query_text":"most durable paint in aerosol","passage_text":"It is commonly used as an extraction solvent, as a cleaning solvent, as a. degreasing solvent and as a solvent in aerosols, paints, wood preservatives, lacquers, varnishes, and asphalt products. It is the most widely used solvent. in the paint industry.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":6083674,"ranking":8,"query_text":"most durable paint in aerosol","passage_text":"Rust-Oleum Automotive 8 oz. Gunmetal Auto Touch-Up Spray (Case of 6) is ideal for use on your vehicleâ\u0080\u0099s trim and accessories. Our paint provides long-lasting coverage and durability. Automotive Touch-Up aerosols are available in a wide variety of factory matched colors. California residents: see Proposition 65 information.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":6974508,"ranking":9,"query_text":"most durable paint in aerosol","passage_text":"Aerosol and Paint Containers. Completely empty aerosol containers and empty paint containers may often be recycled at the curb along with other materials such as paper, bottles and cans.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":4951591,"ranking":10,"query_text":"most durable paint in aerosol","passage_text":"Most aerosol paints also have a metal, glass or plastic ball called a pea inside of the can, which is used to mix the paint when the can is shaken. A typical paint valve system has a female valve; the stem is part of the top actuator.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":4042400,"ranking":11,"query_text":"most durable paint in aerosol","passage_text":"â\u0080¢ Paint and varnish remover: Methylene chloride is the most commonly used solvent in paint stripping, which accounts for 11% of European usage of this compound. It is a quick acting solvent for both wash-off and scrape-off formulations.or sensitive metals, methylene chloride is ideal because of its low boiling temperature. â\u0080¢ Aerosols: Methylene chloride is an excellent solvent for most of the ingredients in aerosol formulations, an end-use that represents 4% of European usage of this product.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":3913839,"ranking":12,"query_text":"most durable paint in aerosol","passage_text":"Aerosol paint (also called spray paint) is a type of paint that comes in a sealed pressurized container and is released in a fine spray mist when depressing a valve button. A form of spray painting, aerosol paint leaves a smooth, evenly coated surface. Standard sized cans are portable, inexpensive and easy to store.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":8131484,"ranking":13,"query_text":"most durable paint in aerosol","passage_text":"Paint and Surface. 20L Paint; 5L Paint; 1L Paint; Floor Paint; Speciality Paints; Aerosols; Wood Finishing; Painting Accessories","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":4120080,"ranking":14,"query_text":"most durable paint in aerosol","passage_text":"A form of spray painting, aerosol paint leaves a smooth, evenly coated surface, unlike many rolled or brushed paints. Standard sized cans are portable, inexpensive and easy to store. Aerosol primer can be applied directly to bare metal and many plastics.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":4951589,"ranking":15,"query_text":"most durable paint in aerosol","passage_text":"Spray paint (scientific name aerosol paint ) is a type of paint that comes in a sealed pressurized container and is released in a Aerosol spray when depressing a valve button. Spray paint leaves a smooth, evenly coated surface, unlike many traditional rolled or brushed paints. Standard sized cans are lightweight, portable, cheap, and easy to store.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":7290606,"ranking":16,"query_text":"most durable paint in aerosol","passage_text":"Waste aerosols and compressed gas cylinders . Guidance for generators and collection sites . What are waste aerosols? Aerosols are chemical products, such as paint, solvent, or cleaner, released as a spray or stream from a pressurized container. A waste aerosol is an aerosol container that will no longer be used for its intended purpose.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":8326796,"ranking":17,"query_text":"most durable paint in aerosol","passage_text":"If you are unsure of the surface you are recoating test a small. inconspicuous area for paint compatibility. Be sure to shake the aerosol can for 1 full minute prior to painting. Always test the aerosol can on a test surface or piece of cardboard. before starting your paint project. This will show if the product is.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":5808353,"ranking":18,"query_text":"most durable paint in aerosol","passage_text":"Description. ZYP Coatingâ\u0080\u0099s â\u0080\u009cA Aerosol Brushableâ\u0080\u009d is the same formulation that is used in our A Aerosol spray can â\u0080¦ but is in BULK (paint) form, sold by the gallon. The A Aerosol Brushable can be applied by brushing, traditional air-spraying means, or dipping.Usable in any environment from room temperature to 1800 C (3275 F).escription. ZYP Coatingâ\u0080\u0099s â\u0080\u009cA Aerosol Brushableâ\u0080\u009d is the same formulation that is used in our A Aerosol spray can â\u0080¦ but is in BULK (paint) form, sold by the gallon. The A Aerosol Brushable can be applied by brushing, traditional air-spraying means, or dipping.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":4895622,"ranking":19,"query_text":"most durable paint in aerosol","passage_text":"Latex Enamel Paint. The first latex house paint -- a water-based paint -- was introduced by the Sherwin-Williams paint company in 1941. Most paint professionals still preferred the durability of oil-based or alkyd paints.","bm25_label":"high","relevance_label":0.0},{"query_id":1092522,"passage_id":6969393,"ranking":20,"query_text":"most durable paint in aerosol","passage_text":"Sculptures are often painted, but commonly lose their paint to time, or restorers. Many different painting techniques have been used in making sculpture, including tempera, oil painting, gilding, house paint, aerosol, enamel and sandblasting. Many sculptors seek new ways and materials to make art. One of Pablo Picasso's most famous sculptures included bicycle parts.","bm25_label":"high","relevance_label":0.0}]