[{"query_id":1092238,"passage_id":7846445,"ranking":1,"query_text":"net worth for rupert grint","passage_text":"It has been announced that Rupert Grint net worth reaches 50 million dollars. He is known as an actor who became an international celebrity when he together with his two co-stars appeared in the movie series of Harry Potter where he portrayed a character of Ron Weasley and which added a lot of revenues to the overall amount of Rupert Grint net worth.","bm25_label":"high","relevance_label":1.0},{"query_id":1092238,"passage_id":7846447,"ranking":2,"query_text":"net worth for rupert grint","passage_text":"After Harry Potter series were finished, Rupert Grint got a lot of offers to act in other productions. One of them was in an anti-war oriented film called â\u0080\u009cInto the Whiteâ\u0080\u009d which was released in 2012 and which increased the total amount of Rupert Grint net worth. Rupert Grint is of English origin. He was born to his mother who was a homemaker and his father who was a dealer of memorabilia.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":6763811,"ranking":3,"query_text":"net worth for rupert grint","passage_text":"Mark Indelicato Net Worth; Andy Garcia Net Worth; Rupert Grint Net Worth; Gale Anne Hurd Net Worth; Robbie Knievel Net Worth; Gore Verbinski Net Worth; Jussie Smollett Net Worth; Linda Blair Net Worth; Kyra Sedgwick Net Worth; Larry Merchant Net Worth","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":833602,"ranking":4,"query_text":"net worth for rupert grint","passage_text":"Marilyn Manson Net Worth; Joey Fatone Net Worth; Monica Bellucci Net Worth; Waheed Alli Baron Alli Net Worth; Cissy Houston Net Worth; Jacqueline Laurita Net Worth; Jacqueline Gold Net Worth; Carson Palmer Net Worth; Gwyneth Paltrow Net Worth; Brian Scalabrine Net Worth; Raymond Ackerman Net Worth; Birdman Net Worth; Rupert Grint Net Worth; Paris Hilton Net Worth","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":6353389,"ranking":5,"query_text":"net worth for rupert grint","passage_text":"Daniel Radcliffe: $110 Million: Radcliffe, who played Harry Potter, is known to have the largest net worth out of his two co-actors, Rupert Grint and Emma Watson. Since the films, Radcliffe has continued to perform on and off the stage including The Woman in Black andVictor Frankenstein (post-production).","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":1327143,"ranking":6,"query_text":"net worth for rupert grint","passage_text":"What does the name Rupert mean? already exists. already exists as an alternate of this question. exists and is an alternate of. If people want to see your Gluten Free Chick web series, where can they find it? Has Rupert Grint ever had a girlfriend? Who is Rupert Bathurst? What are the names of the movies Rupert Grint was in? What is Rupert ... Diupert Grint was born Rupert Alexander Lloyd Grint. He was born on August 24, 1988 in Stevenage, Hertfordshire, England, UK. He is the oldest of four children, he has one brot â\u0080¦ her and two sisters. Rupert Grint lives with his family. Rupert Grint plays Ron Weasley in the Harry Potter movies.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":4902324,"ranking":7,"query_text":"net worth for rupert grint","passage_text":"1). Daniel Radcliffe: $110 Million: Radcliffe, who played Harry Potter, is known to have the largest net worth out of his two co-actors, Rupert Grint and Emma Watson. Since the films, Radcliffe has continued to perform on and off the stage including The Woman in Black andVictor Frankenstein (post-production).","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":2922814,"ranking":8,"query_text":"net worth for rupert grint","passage_text":"Rupert Grint. Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":2922816,"ranking":9,"query_text":"net worth for rupert grint","passage_text":"Rupert Grint. Actor | Producer | Soundtrack. Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":7225330,"ranking":10,"query_text":"net worth for rupert grint","passage_text":"Rupert Grint. Actor, Harry Potter and the Chamber of Secrets. Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":3256093,"ranking":11,"query_text":"net worth for rupert grint","passage_text":"Rupert Everett Net Worth is $24 Million. Rupert Everett Net Worth is $24 Million. Rupert Everett is an English actor with a net worth of $24 million. Rupert Everett built his net worth as a film and television actor. He was born in Norfolk, England. A popular movie Everett starred in was Rupert James Hector Everett is an English actor.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":6353391,"ranking":12,"query_text":"net worth for rupert grint","passage_text":"Well, the exact figures are not, well, exactly revealed in public. However the net worth of each of these actors were as following (after the Harry Potter movies) -. Daniel Radcliffe (actor) - $110 Million [1] \/ Â£30m [2] Rupert Grint (actor) - $50 million [1] \/ Â£7m [2] Emma Watson (actor) - $60 million [1] \/ Â£12m [2]","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":3256095,"ranking":13,"query_text":"net worth for rupert grint","passage_text":"Rupert Everett Net Worth is $24 Million. Rupert Everett is an English actor with a net worth of $24 million. Rupert Everett built his net worth as a film and television actor. He was born in Norfolk, England. A popular movie Everett starred in was. Rupert James Hector Everett ...","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":3012957,"ranking":14,"query_text":"net worth for rupert grint","passage_text":"Rupert Boneham Net Worth. How much is Rupert Boneham Worth? Rupert Boneham net worth: Rupert Boneham is an American mentor and renowned social -service personality, who guides troubled teens in US and has appeared in a number of reality TV shows, and having estimated net worth value of $3.8 Million of property.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":3012955,"ranking":15,"query_text":"net worth for rupert grint","passage_text":"Rupert Boneham net worth: $3.8 Million Rupert Boneham net worth: Rupert Boneham is an American mentor and renowned social -service personality, who guides troubled teens in US and has appeared in a number of reality TV shows, and having estimated net worth value of $3.8 Million of property.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":2520399,"ranking":16,"query_text":"net worth for rupert grint","passage_text":"Actor | Producer | Soundtrack. Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":1152982,"ranking":17,"query_text":"net worth for rupert grint","passage_text":"Pictured: Rupert Grint's tears at funeral for murdered teenage Harry Potter actor. Harry Potter star Rupert Grint was unable to contain his emotions at the funeral for his fellow Hogwarts' actor, Robert Knox who was stabbed to death last month.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":3012961,"ranking":18,"query_text":"net worth for rupert grint","passage_text":"Rupert Boneham net worth: Rupert Boneham is an American mentor and renowned social -service personality, who guides troubled teens in US and has appeared Rupert Boneham net worth: Rupert Boneham is an American mentor and renowned social -service personality, who guides troubled teens in US and has appeared","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":1327145,"ranking":19,"query_text":"net worth for rupert grint","passage_text":"Meanings and history of the name Rupert : | Edit. Share what you know! Famous real-life people named Rupert: | Edit. Rupert Grint, actor who plays Ron in the Harry Potter movies. Rupert Brooke, poet (1887-1915). Rupert Everett, British actor. Rupert Graves, British actor. Rupert Murdoch, media tycoon.eanings and history of the name Rupert : | Edit. Share what you know! Famous real-life people named Rupert: | Edit. Rupert Grint, actor who plays Ron in the Harry Potter movies. Rupert Brooke, poet (1887-1915). Rupert Everett, British actor. Rupert Graves, British actor. Rupert Murdoch, media tycoon.","bm25_label":"high","relevance_label":0.0},{"query_id":1092238,"passage_id":3688202,"ranking":20,"query_text":"net worth for rupert grint","passage_text":"Rupert Grint. This is the latest accepted revision, reviewed on 6 April 2017. Rupert Alexander Lloyd Grint (born 24 August 1988) is an English actor who rose to prominence playing Ron Weasley, one of the three main characters in the Harry Potter film series. Grint was cast as Ron Weasley at the age of 11, having previously acted only in school plays and at his local theatre group.","bm25_label":"high","relevance_label":0.0}]