[{"query_id":1092911,"passage_id":7794418,"ranking":1,"query_text":"meaning of yay","passage_text":"2 definitions of YAY. Meaning of YAY. What does YAY stand for? YAY abbreviation. Define YAY at AcronymFinder.com","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":7794425,"ranking":2,"query_text":"meaning of yay","passage_text":"Per the dictionary there is no shortcut for Hooray, but yay does does fit the pronunciation of Yippee-ki-yay! Yeah, or yea is short for yes. Yay it says means size, as in yay big.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":4801297,"ranking":3,"query_text":"meaning of yay","passage_text":"Per the dictionary there is no shortcut for Hooray, but yay does does fit the pronunciation of Yippee-ki-yay! Yeah, or yea is short for yes. Yay it says means size, as in yay big. And yah is a derisive term, like, Yah, yah sure!.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":7794422,"ranking":4,"query_text":"meaning of yay","passage_text":"Yay. The word yay is usually used as an interjection and exclamation to show joy. A person might say something like, Yay! My new kitten finally arrived! The word is likely derived from yea, meaning simply yes, but shifted spelling over time, perhaps to indicate excitement. Yay has the same pronunciation as yea and rhymes with hay.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":254906,"ranking":5,"query_text":"meaning of yay","passage_text":"It has prune juice, kale (yay veggies), flax seed (yay more fiber) and coconut milk which helps keep things goingâ\u0080¦if you know what I mean. The best part is this smoothie made her â\u0080\u009cgoâ\u0080\u009d immediately and as long as I give her this smoothie four to five times a week, we have success.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":1784473,"ranking":6,"query_text":"meaning of yay","passage_text":"1 meanings of YASS acronym and YASS abbreviation in Texting. Get the definition of YASS in Texting by All Acronyms dictionary. Top Definition: Yay A Sex Slave In Texting.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":7794424,"ranking":7,"query_text":"meaning of yay","passage_text":"Yay definition: an exclamation indicating approval , congratulation, or triumph | Meaning, pronunciation, translations and examples English Dictionary | Thesaurus | Translator | COBUILD Grammar Patterns | Scrabble | Blog","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":7794419,"ranking":8,"query_text":"meaning of yay","passage_text":"Yay; YAY!!! YAY!!!! Yaya; Yaya'd; yayade; Yayah; Yaya Han; yayaii; ya-ya'ing the sisterhood; yayaism; Yayaman; Yayan; Yay Anja; Ya ya papaya","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":3400161,"ranking":9,"query_text":"meaning of yay","passage_text":"FRISCO - Cowboys rookie cornerback Chidobe Awuzie is fine with being called Chido, and most everybody does.But there is meaning behind the names that some find so hard to pronounce correctly.Chidobe (CHID-oh-bay) means for God to protect. Awuzie (ah-WOOZ-yay) means I have arrived.Being Nigerian","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":4245901,"ranking":10,"query_text":"meaning of yay","passage_text":"It's yea both for voting (Yea or Nay) and as an exclamation (Yea!). In both cases, it signifies affirmation. That is, exclaiming Yea! is equivalent to exclaiming Yes!; it's a word, not simply a noise. Yay means about so much.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":3589830,"ranking":11,"query_text":"meaning of yay","passage_text":"The other matrices I need are much the same, I simply need to count the pairs for nay-yay, yay-nay and yay-yay, so if anyone can help me out with how to create just one of these matrices I'll be on my way.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":7794421,"ranking":12,"query_text":"meaning of yay","passage_text":"There are at least four other words with similar spelling that are used commonly in English: yah, ya, yay, and yea. The previous term and yah are quite similar in usage, pronunciation, and meaning, expressing an affirmative. People typically use ya as a slang version of you, yay as an expression of happiness, and yea as an affirmative vote or for more archaic purposes. Yeah and Yah. Yeah is the most common of these words, and seems to have originated sometime around the early 20th century, likely in the US.","bm25_label":"high","relevance_label":1.0},{"query_id":1092911,"passage_id":4245900,"ranking":13,"query_text":"meaning of yay","passage_text":"4 Answers 4. The words yea and yay are homophones, meaning they are pronounced the same. Yea is a somewhat specialized word (â\u0080\u009cyesâ\u0080\u0094used in oral votingâ\u0080\u009d) most often used in a spoken context, so I would expect that many people would not realize there are two spellings for two different meanings.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":604982,"ranking":14,"query_text":"meaning of yay","passage_text":"Demographics mean many people put into a series of groups which are used around the world in many of the industries so they can sell their products to a group that they find w â\u0080¦ ould suit that product. ! yay lets have fun","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":4245899,"ranking":15,"query_text":"meaning of yay","passage_text":"I heard from people who object to the use of yea and yeah to mean yay, and although I believe such use is often the result of confusion about what each word means, I also like to remember that people shout the word yes when they are excited too, so it's not necessarily inappropriate to use yea or yeah in such instances.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":4108679,"ranking":16,"query_text":"meaning of yay","passage_text":"There are several ways the phrase is commonly spelled in the English language, such as â\u0080\u009caye yi yi,â\u0080\u009d â\u0080\u009cai yai yaiâ\u0080\u009d and â\u0080\u009cay yai yai,â\u0080\u009d but there is no formal acknowledgement about which is correct given its slang nature.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":4245898,"ranking":17,"query_text":"meaning of yay","passage_text":"The word yea is the oldest of the group, and it is likely that yeah, ya, and yay all derive from it. Yea goes back more than a thousand years, from the Old English gea by way of Middle English ye.. It has a number of meanings, but all are roughly affirmations, much as yeah is.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":4245903,"ranking":18,"query_text":"meaning of yay","passage_text":"Yay, Yea, Yeah, or Yes? When should you should yay? Two of my friends (Trent Armstrong, the former Modern Manners Guy, and Hyatt Bass, author of the novel The Embers) asked about the word yay and why people so often seem to incorrectly use yea or yeah instead.","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":3400159,"ranking":19,"query_text":"meaning of yay","passage_text":"How Chidobe Awuzieâ\u0080\u0099s Nigerian background, Bay Area childhood led him to Dallas FRISCO â\u0080\u0093 Cowboys rookie cornerback Chidobe Awuzie is fine with being called â\u0080\u009cChido,â\u0080\u009d and most everybody does. But there is meaning behind the names that some find so hard to pronounce correctly. Chidobe (CHID-oh-bay) means for God to protect. Awuzie (ah-WOOZ-yay) means â\u0080\u009cI have arrived.â\u0080\u009d","bm25_label":"high","relevance_label":0.0},{"query_id":1092911,"passage_id":4245904,"ranking":20,"query_text":"meaning of yay","passage_text":"Historical Examples. 1  Ickle bother can't say nuffin, without me to sow him the yay of it. 2  At this moment a shout was heard from the alley, yay, Penrod!.  3 yay, sed the Shaker, and he led the way into the house, another Shaker bein sent to put my hosses and waggin under kiver.","bm25_label":"high","relevance_label":0.0}]