[{"query_id":1093717,"passage_id":7725943,"ranking":1,"query_text":"kamikaze definition","passage_text":"Define kamikaze. kamikaze synonyms, kamikaze pronunciation, kamikaze translation, English dictionary definition of kamikaze. n. 1. A Japanese pilot trained in World War II to make a suicidal crash attack, especially upon a ship. 2. An airplane loaded with explosives to be piloted...","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":2378646,"ranking":2,"query_text":"kamikaze definition","passage_text":"Definition of kamikaze - (in the Second World War) a Japanese aircraft loaded with explosives and making a deliberate suicidal crash on an enemy target. Definition of kamikaze - (in the Second World War) a Japanese aircraft loaded with explosives and making a deliberate suicidal crash on an enemy target. dictionary thesaurus","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":2378648,"ranking":3,"query_text":"kamikaze definition","passage_text":"Definition of kamikaze for English Language Learners. : one of a group of Japanese pilots in World War II who were assigned to crash their planes into their targets.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":2378649,"ranking":4,"query_text":"kamikaze definition","passage_text":"Definition of kamikaze written for English Language Learners from the Merriam-Webster Learner's Dictionary with audio pronunciations, usage examples, and count\/noncount noun labels. Learner's Dictionary mobile search","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":2378652,"ranking":5,"query_text":"kamikaze definition","passage_text":"Kamikaze definition, (during World War II) a member of a special corps in the Japanese air force charged with the suicidal mission of crashing an aircraft laden with explosives into an enemy target, especially a warship. See more.","bm25_label":"high","relevance_label":1.0},{"query_id":1093717,"passage_id":7725945,"ranking":6,"query_text":"kamikaze definition","passage_text":"Kamikaze definition, (during World War II) a member of a special corps in the Japanese air force charged with the suicidal mission of crashing an aircraft laden with explosives into an enemy target, especially a warship. an airplane used for this purpose.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":1424430,"ranking":7,"query_text":"kamikaze definition","passage_text":"During World War II, about 3,862 kamikaze pilots died, and about 19% of kamikaze attacks managed to hit a ship. Kamikaze aircraft were essentially pilot-guided explosive missiles, purpose-built or converted from conventional aircraft.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":2378651,"ranking":8,"query_text":"kamikaze definition","passage_text":"1attributive Relating to or denoting a kamikaze attack or pilot. â\u0080\u0098a kamikaze attackâ\u0080\u0099. â\u0080\u0098The first modern instance was in 1944-45, when the US navy was confronted by kamikaze pilots trying to fly planes loaded with high explosive into their ships as they approached Japan.â\u0080\u0099.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":2378653,"ranking":9,"query_text":"kamikaze definition","passage_text":"When Japan was in equally desperate straits in 1944, using the word kamikaze for the suicide pilots was not for nothing. Japan's Shattered Mirror This is the origin of the term kamikaze, divine wind. Japan's Shattered Mirror. The reason I ask is that kamikaze is Japanese for â\u0080\u009cDivine Windâ\u0080\u009d, and it would just be too funny if he chose to call himself William â\u0080\u009ckamikazeâ\u0080\u009d Dembski. Now, That's a Video to Look Forward To - The Panda's Thumb. Don't forget where the term 'kamikaze' originated.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":2469419,"ranking":10,"query_text":"kamikaze definition","passage_text":"Okinawa demonstrated the first MASSED assaults by the Kamikaze pilots. The Kamikaze first showed up at the battle of Leyte Gulf in Oct 1944, but at Okinawa, they came by the h â\u0080¦ undreds.Okinawa also had the first successful Japanese use of the Baka bomb, a manned flying missile, launched from the belly of a Betty (medium) bomber.kinawa demonstrated the first MASSED assaults by the Kamikaze pilots. The Kamikaze first showed up at the battle of Leyte Gulf in Oct 1944, but at Okinawa, they came by the h â\u0080¦ undreds.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":5460104,"ranking":11,"query_text":"kamikaze definition","passage_text":"47 Ships Sunk by Kamikaze Aircraft. by Bill Gordon. Sources differ regarding the number of ships sunk by kamikaze aircraft during World War II. Inoguchi (1958, 211-34) lists the names of 34 ships sunk by kamikaze attacks, and Warner (1982, 323-34) gives the names of 57 ships sunk by special attack aircraft. However, an examination of other historical records indicates that both of these two lists do not have the correct number of ships sunk by kamikaze.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":7133321,"ranking":12,"query_text":"kamikaze definition","passage_text":"Kamikaze, officially Tokubetsu KÅ\u008dgekitai, were a part of the Japanese Special Attack Units of military aviators who initiated suicide attacks for the Empire of Japan against Allied naval vessels in the closing stages of the Pacific campaign of World War II, designed to destroy warships more effectively than was possible with conventional air attacks. About 3,862 kamikaze pilots died during the war, and more than 7,000 naval personnel were killed by kamikaze attacks. Kamikaze aircraft were ...","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":7726915,"ranking":13,"query_text":"kamikaze definition","passage_text":"Okinawa demonstrated the first MASSED assaults by the Kamikaze pilots. The Kamikaze first showed up at the battle of Leyte Gulf in Oct 1944, but at Okinawa, they came by the hâ\u0080¦undreds.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":7542003,"ranking":14,"query_text":"kamikaze definition","passage_text":"The name of Japanese suicide pilots were called Kamikazes. Kamikazes were pilots who were trained to ship the Allies ships by crashing bomb-filled planes into them..","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":7725947,"ranking":15,"query_text":"kamikaze definition","passage_text":"(modifier) (of an action) undertaken or (of a person) undertaking an action in the knowledge that it will result in the death of the person performing it in order that maximum damage may be inflicted on an enemy: a kamikaze attack; a kamikaze bomber.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":7725948,"ranking":16,"query_text":"kamikaze definition","passage_text":"(modifier) (of an action) undertaken or (of a person) undertaking an action in the knowledge that it will result in the death of the person performing it in order that maximum damage may be inflicted on an enemy: a kamikaze attack, a kamikaze bomber","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":7272415,"ranking":17,"query_text":"kamikaze definition","passage_text":"Pearl Harbor to mark 70th anniversary of kamikaze attack on USS Missouri. A Japanese kamikaze pilot steers his plane toward the USS Missouri during the Battle of Okinawa on April 11, 1945. The ship's baker snapped this photo.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":1553175,"ranking":18,"query_text":"kamikaze definition","passage_text":"What is in a Kamikaze shot? A Kamikaze shot is made with 1.5 ounces of vodka, 0.75 ounce of triple sec and 0.75 ounce of lime juice. It is served in a cocktail glass and typically garnished with a lime wedge. The drink first appeared in the 1970s, and many variations exist.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":1424431,"ranking":19,"query_text":"kamikaze definition","passage_text":"There is another similarity with these two warsâ\u0080\u0094fanaticism and suicide tactics. While Japan apparently did not use suicide tactics at Pearl Harbor, we know of their use of the Kamikaze later in the war. One historian stated that by the end of WWII: 7,465 Kamikazes flew to their deaths; 120 US ships were sunk, with many more damaged 3,048 allied sailors were killed and anther 6,025 wounded Although there may be some question about the exact numbers, the damage done by Kamikazes is almost unbelievable.","bm25_label":"high","relevance_label":0.0},{"query_id":1093717,"passage_id":5258458,"ranking":20,"query_text":"kamikaze definition","passage_text":"Best Answer: Hellen Keller's dog name is Kamikaze-go. When Keller visited Akita Prefecture in Japan in July 1937, she inquired about HachikÅ\u008d, the famed Akita dog that had died in 1935. She told a Japanese person that she would like to have an Akita dog; one was given to her within a month, with the name of Kamikaze-go.est Answer: Hellen Keller's dog name is Kamikaze-go. When Keller visited Akita Prefecture in Japan in July 1937, she inquired about HachikÅ\u008d, the famed Akita dog that had died in 1935. She told a Japanese person that she would like to have an Akita dog; one was given to her within a month, with the name of Kamikaze-go.","bm25_label":"high","relevance_label":0.0}]