[{"query_id":1093322,"passage_id":7757070,"ranking":1,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Kenan Thompson (born May 10, 1978) is a current cast member of Saturday Night Live who currently... Kenan Thompson (born May 10, 1978) is a current cast member of Saturday Night Live who currently holds the record of SNL's longest-serving cast member. Kenan was added to the cast in 2003, along with Finesse Mitchell.","bm25_label":"high","relevance_label":1.0},{"query_id":1093322,"passage_id":7757078,"ranking":2,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Saturday Night Live cast members. The following is a list of Saturday Night Live cast members, past and present. The cast members of Saturday Night Live were originally referred to as the Not Ready For Prime Time Players.. The original cast (l to r): Laraine Newman, John Belushi, Jane Curtin, Gilda Radner, Dan Aykroyd, Garrett Morris, and Chevy Chase.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":6662302,"ranking":3,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Days of Our Lives cast members. Days of Our Lives is a long-running American television soap opera drama, airing on NBC. Created by Ted and Betty Corday, the series premiered on November 8, 1965. The longest-running cast member is Suzanne Rogers, who has portrayed Maggie Horton since August 20, 1973, making her one of the longest-tenured actors in American soap operas. Original cast member, Frances Reid, was previously the soap's longest-running cast member, portraying Horton family matriarch, Alice Horton, from 1965 to 2007. Actresses Susan Seaforth Hayes and Deidre Hall, who portray Julie Olson Williams and Dr. Marlena Evans, are currently the second and third longest tenured actors on Days of Our Lives, joining in 1968 and 1976, respectively.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":2525235,"ranking":4,"query_text":"longest-tenured cast member of saturday night live","passage_text":"In May 2000, Rudolph joined the cast of Saturday Night Live as a featured player for the final three episodes of the 1999â\u0080\u00932000 season, after a stint as a member of The Groundlings improv troupe, where she met future Saturday Night Live cast member Will Forte.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":5381770,"ranking":5,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Which cast member on Saturday Night Live plays former President Clinton? Will Ferrel   Darrell Hammond   Hammond has been a regular cast member on Saturday Night Live for a record-setting 12 seasons, impersonating everyone from Regis Philbin â\u0080¦ to Jesse Jackson to great acclaim.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":7757074,"ranking":6,"query_text":"longest-tenured cast member of saturday night live","passage_text":"The Top 50 Hottest Saturday Night Live Cast Members Of All Time The definitive countdown of all of the most crushworthy Saturday Night Sweeties.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":2477463,"ranking":7,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Days of Our Lives cast members. Days of Our Lives is a long-running American television soap opera drama, airing on NBC. Created by Ted and Betty Corday, the series premiered on November 8, 1965. The longest-running cast member is Suzanne Rogers, who has portrayed Maggie Horton since August 20, 1973, making her one of the longest-tenured actors in American soap operas.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":461037,"ranking":8,"query_text":"longest-tenured cast member of saturday night live","passage_text":"SNL Alum Rachel Dratch Will Guest-Star on Parks and Recreation's Final Season Live from Pawnee, it's Saturday night! Former Saturday Night Live cast member Rachel Dratch has signâ\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":5805758,"ranking":9,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Celebrity Jeopardy! (Saturday Night Live) Celebrity Jeopardy! is a series of sketches that aired regularly on the television comedy\/variety show Saturday Night Live between 1996 and 2002, the years when Will Ferrell was a cast member.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":4331463,"ranking":10,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Josh was a part of the original cast and the only cast member to last throughout the entire 6 seasons of the Golden Era, because he got along with every cast member. This makes Josh the All That cast member with the longest tenure on the show.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":4108835,"ranking":11,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Pete Davidson (born November 16, 1993) is an American actor and comedian. He is a featured player on Saturday Night Live, the youngest member of the current cast, and the first SNL cast member to be born in the 1990s.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":5392780,"ranking":12,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Saturday Night Live was born in 1975 and Gilda was the first of the show's Not Ready for Prime Time Players Michaels decided to hire. We both came to Saturday Night Live at the same time, her as a cast member and me as the pianist and other sundries, said Shaffer.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":5805755,"ranking":13,"query_text":"longest-tenured cast member of saturday night live","passage_text":"People who liked this also liked... A TV special celebrating the 25th anniversary of Saturday Night Live. Before a celebrity audience, many of the former cast members and guest hosts return to perform their signature ... A famous guest host stars in parodies and sketches created by the cast of this witty show. A retrospective of the first 5 years of Saturday Night Live.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":2133390,"ranking":14,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Darrell Hammond holds the record for the number of seasons as a cast member (1995-2009), the oldest cast member (53 in his final season), and the number of times saying Live from New York, it's Saturday night! (70).","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":1688612,"ranking":15,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Saturday Night Live (abbreviated as SNL) is an American late-night live television sketch comedy and variety show created by Lorne Michaels and developed by Dick Ebersol. The show premiered on NBC on October 11, 1975, under the original title NBC's Saturday Night. The show's comedy sketches, which parody contemporary culture and politics, are performed by a large and varying cast of repertory and newer cast members.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":8220321,"ranking":16,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Darrell Hammond holds the record for the number of seasons as a cast member, fourteen (1995-2009), the oldest cast member (fifty-three in his final season), and the number of times saying Live from New York, it's Saturday night!","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":4716723,"ranking":17,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Ferrell became the highest paid cast member of Saturday Night Live in 2001 with a season salary of $350,000. Ferrell returned to Saturday Night Live as a guest host on May 14, 2005, and May 16, 2009. Both times, he reprised his role as Alex Trebek in the Celebrity Jeopardy sketches.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":4788455,"ranking":18,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Kenan Thompson (born May 10, 1978) is an American actor and comedian. He is known for his work as a cast member of NBC's Saturday Night Live. In his teenage years, he was an original cast member of Nickelodeon's sketch comedy series All That.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":3599755,"ranking":19,"query_text":"longest-tenured cast member of saturday night live","passage_text":"According to the official memoir, Live from New York: An Uncensored History of Saturday Night Live, Chevy Chase is banned from ever hosting the show again. In the book, numerous cast members recall stories in which Chase insulted cast and crew.","bm25_label":"high","relevance_label":0.0},{"query_id":1093322,"passage_id":3923281,"ranking":20,"query_text":"longest-tenured cast member of saturday night live","passage_text":"Saturday Night Live characters appearing on Weekend Update. Weekend Update has been a platform for Saturday Night Live characters to grow and gain popularity ever since Gilda Radner used it to create Emily Litella and Roseanne Roseannadanna. Many cast members have used Update as the primary vehicle for a certain character.","bm25_label":"high","relevance_label":0.0}]