[{"query_id":1094460,"passage_id":8149357,"ranking":1,"query_text":"inches of mercury meaning","passage_text":"If you mean inches of mercury 1 atmosphere = 29.92 inches of mercury = 760 mm of mercury = 760 Torr = 101325 Pa = 1013.25 mb = 1013.25 hPa = 101.325 kPa. So you just multi â\u0080¦ ply by the one you want and divide by the one you have. 99.1 kPa * (29.92 inches Hg\/101.325 kPa) = 29.26 inches.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":7668617,"ranking":2,"query_text":"inches of mercury meaning","passage_text":"Asker's rating. 1  It means that the weight of the atmosphere where the measurement was taken will lift a column of mercury 30.22 inches. 2  30.22 inches of mercury is a pressure measurement. 3  One atmosphere is 33.90 ft. of water at 4 degrees C.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":804242,"ranking":3,"query_text":"inches of mercury meaning","passage_text":"100 Inches Of Mercury to Pounds Per Square Inch = 49.1154. 5 Inches Of Mercury to Pounds Per Square Inch = 2.4558. 200 Inches Of Mercury to Pounds Per Square Inch = 98.2308. 6 Inches Of Mercury to Pounds Per Square Inch = 2.9469. 300 Inches Of Mercury to Pounds Per Square Inch = 147.3463. 7 Inches Of Mercury to Pounds Per Square Inch = 3.4381.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":804244,"ranking":4,"query_text":"inches of mercury meaning","passage_text":"800 Inches Of Mercury to Pounds Per Square Inch = 392.9234. 20 Inches Of Mercury to Pounds Per Square Inch = 9.8231. 900 Inches Of Mercury to Pounds Per Square Inch = 442.0388. 30 Inches Of Mercury to Pounds Per Square Inch = 14.7346. 1,000 Inches Of Mercury to Pounds Per Square Inch = 491.1542. 40 Inches Of Mercury to Pounds Per Square Inch = 19.6462.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":8510380,"ranking":5,"query_text":"inches of mercury meaning","passage_text":"Hg (inches of mercury) or 14.696 psi (pounds per square inch). This means that, at sea level, the weight of air pressing on every square inch of something is almost 15 pounds. Something to think about: If you had 1 square inch of room-temperature mercury that was 29.92 tall, it would weigh ... 14.696 pounds! Again, these are the average atmospheric pressures only at sea level.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":804250,"ranking":6,"query_text":"inches of mercury meaning","passage_text":"80 Inches Of Mercury to Pounds Per Square Inch = 39.2923. 3 Inches Of Mercury to Pounds Per Square Inch = 1.4735. 90 Inches Of Mercury to Pounds Per Square Inch = 44.2039. 4 Inches Of Mercury to Pounds Per Square Inch = 1.9646.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":7668620,"ranking":7,"query_text":"inches of mercury meaning","passage_text":"Define Inches of mercury. Inches of mercury synonyms, Inches of mercury pronunciation, Inches of mercury translation, English dictionary definition of Inches of mercury. n. Abbr. in or in. 1. A unit of length in the US Customary and British Imperial systems, equal to 1\/12 of a foot . See Table at measurement. 2.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":1235059,"ranking":8,"query_text":"inches of mercury meaning","passage_text":"Barometric pressure is typically reported in inches of mercury or in millibars. 1 inch of mercury equals about 33.9 millibars, Inches of mercury is the traditional way of reporting air pressure. Greater air pressure pushes a column of mercury higher in a barometer.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":5206378,"ranking":9,"query_text":"inches of mercury meaning","passage_text":"The table below lists average sea level pressure in units commonly used. Values of Average Sea Level Pressure 1 ATM (atmosphere) 1013.25 millibars (mb) 14.7 pounds per square inch (lb\/in2) 760 millimeters of mercury (mmHg) 29.92 inches of mercury (Hg) or (inHg) 1013.25 hectoPascals (hPa).All of these pressure values are equivalent, meaning they express the same amount of pressure, i.e., average sea level pressure.he table below lists average sea level pressure in units commonly used. Values of Average Sea Level Pressure 1 ATM (atmosphere) 1013.25 millibars (mb) 14.7 pounds per square inch (lb\/in2) 760 millimeters of mercury (mmHg) 29.92 inches of mercury (Hg) or (inHg) 1013.25 hectoPascals (hPa).","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":6714839,"ranking":10,"query_text":"inches of mercury meaning","passage_text":"Pressure is measured in Pascals in the metric system, but barometers are often calibrated in inches of mercury or millibars (1 millibar = 1 hectoPascal = 100 Pascals). Divide the reading in inches of mercury by 0.0295 to convert it to a pressure in millibars.Some continental barometers are calibrated in centimetres of mercury. To convert this to a reading in millibars, first multiply the number of cm by 2.54 to get to inches of mercury, and then divide by 0.0295 as above.ivide the reading in inches of mercury by 0.0295 to convert it to a pressure in millibars. Some continental barometers are calibrated in centimetres of mercury. To convert this to a reading in millibars, first multiply the number of cm by 2.54 to get to inches of mercury, and then divide by 0.0295 as above.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":4255693,"ranking":11,"query_text":"inches of mercury meaning","passage_text":"Most National Weather Service measurements are given in inches of mercury. At sea level, standard air pressure is 29.92 inches of mercury and 1,013 millibars. Inches of mercury is measured in how high a column of mercury rises in a barometer.One millibar is equivalent to one-thousandth of a single bar, or 1,000 dynes.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":298432,"ranking":12,"query_text":"inches of mercury meaning","passage_text":"The two most common units in the United States to measure the pressure are Inches of Mercury and Millibars. Inches of mercury refers to the height of a column of mercury measured in hundredths of inches. This is what you will usually hear from the NOAA Weather Radio or from your favorite weather or news source. At sea level, standard air pressure is 29.92 inches of mercury.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":4255699,"ranking":13,"query_text":"inches of mercury meaning","passage_text":"Most National Weather Service measurements are given in inches of mercury. At sea level, standard air pressure is 29.92 inches of mercury and 1,013 millibars. Inches of mercury is measured in how high a column of mercury rises in a barometer. One millibar is equivalent to one-thousandth of a single bar, or 1,000 dynes.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":8167051,"ranking":14,"query_text":"inches of mercury meaning","passage_text":"Barometric pressure of under 29.50 inches of mercury at sea level is considered low. At sea level, a normal barometer reading is between about 29.70 inches of mercury and 30.20... Barometric pressure of under 29.50 inches of mercury at sea level is considered low. At sea level, a normal barometer reading is between about 29.70 inches of mercury and 30.20... Star Gazing","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":409040,"ranking":15,"query_text":"inches of mercury meaning","passage_text":"InHg (inches of mercury): This is the pressure exerted by a one inch circular column of mercury, one inch tall, at gravity and 0Â°C (32Â°F). InHg are typically used barometric pressure. Torr: This is the pressure exerted by a one millimeter tall circle column of mercury. It was also knows a millimeter of mercury (mmHG).","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":1149325,"ranking":16,"query_text":"inches of mercury meaning","passage_text":"The mercury barometer's design gives rise to the expression of atmospheric pressure in inches: the pressure is quoted as the level of the mercury's height in the vertical column. 1 atmosphere is equivalent to about 29.9 inches of mercury.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":7668616,"ranking":17,"query_text":"inches of mercury meaning","passage_text":"Inch of mercury. Inch of mercury (inHg and Hg) is a unit of measurement for pressure. It is still used for barometric pressure in weather reports, refrigeration and aviation in the United States. It is the pressure exerted by a column of mercury of 1 inch (25.4 mm) in height at the standard acceleration of gravity. Conversion to metric units depends on the temperature of mercury, and hence its density; typical conversion factors are:","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":4270445,"ranking":18,"query_text":"inches of mercury meaning","passage_text":"This means if you have a pressure gauge reading 1 inch per mercury, it can be further split up into 25.4 millimeters of mercury. One advantage of mm\/hg is that it provides a high level of accuracy. A measurement of 15 mm\/hg is just 0.59 in\/hg, which is a rather arbitrary method to express pressure. The second advantage of using millimeters of mercury, is that it provides a solid range of integers to represent a relatively low pressure.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":804246,"ranking":19,"query_text":"inches of mercury meaning","passage_text":"You can view more details on each measurement unit: inch of mercury or pounds per square inch. The SI derived unit for pressure is the pascal. 1 pascal is equal to 0.000295299830714 inch of mercury, or 0.000145037738007 pounds per square inch. Note that rounding errors may occur, so always check the results. Use this page to learn how to convert between inches of mercury and pounds\/square inch.","bm25_label":"medium","relevance_label":0.0},{"query_id":1094460,"passage_id":6787103,"ranking":20,"query_text":"inches of mercury meaning","passage_text":"Air Pressure: A barometer is used to measure air pressure. The average air pressure on Earth is 29.92 inches of mercury (or 1,013 millibars). This is more than 100 times Mars' average of 0.224 inches of mercury (7.5 millibars).ir Pressure: A barometer is used to measure air pressure. The average air pressure on Earth is 29.92 inches of mercury (or 1,013 millibars). This is more than 100 times Mars' average of 0.224 inches of mercury (7.5 millibars).","bm25_label":"medium","relevance_label":0.0}]