[{"query_id":1094039,"passage_id":7703781,"ranking":1,"query_text":"is qgenda a software","passage_text":"QGenda is acquiring Peake Software Labs, Inc., also known as Tangier, and the combined company will maintain its existing locations and teams in Georgia and Maryland. To find out more, please visit: www.qgenda.com\/tangier-qgenda. About QGenda. QGenda is the #1 cloud-based, automated physician scheduling software. Since its launch in 2006, QGenda has grown to serve more than 2,100 customers in over 30 medical specialties across 5,000 hospitals.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703783,"ranking":2,"query_text":"is qgenda a software","passage_text":"QGenda, a cloud-based automated physician scheduling software has acquired Tangier, a provider of of emergency medicine, hospital medicine, and urgent care scheduling software. With the acquisition of Tangier, QGenda extends its leadership position and adds two decades of experience in emergency medicine, hospital medicine, and urgent care scheduling.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703779,"ranking":3,"query_text":"is qgenda a software","passage_text":"Now, physician scheduling software company QGenda will relocate from the Perimeter area to a 29-story Buckhead office tower, as it doubles its workforce. QGenda's web-based service helps hospitals keep staffing costs down through efficient physician scheduling. Hospitals must maintain a certain number of on-call physician specialists â\u0080\u0094 such as anesthesiologists, radiologists and cardiologists â\u0080\u0094 to ensure patients get care, QGenda CEO Greg Benoit said.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703778,"ranking":4,"query_text":"is qgenda a software","passage_text":"â\u0080\u009cQGenda is clearly a quantum leap forward in physician scheduling software. Since using QGenda, it has given me significantly more flexibility in scheduling my 17 person radiology group to its many tasks in many different locations.â\u0080\u009d Dr. Philip Oâ\u0080\u0099Sullivan South Shore Radiology","bm25_label":"high","relevance_label":1.0},{"query_id":1094039,"passage_id":7703780,"ranking":5,"query_text":"is qgenda a software","passage_text":"Qgenda.com is tracked by us since October, 2012. Over the time it has been ranked as high as 72 349 in the world, while most of its traffic comes from USA, where it reached as high as 13 810 position. It was owned by several entities, from Precision Software Inc. Two Ravinia Drive to QGenda Inc. of QGenda Inc., it was hosted by Amazon.com Inc., Amazon Technologies Inc. and others. While NETWORK SOLUTIONS LLC. was its first registrar, now it is moved to Network Solutions LLC.. Qgenda has a decent Google pagerank and bad results in terms of Yandex topical citation index.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703784,"ranking":6,"query_text":"is qgenda a software","passage_text":"A: Qgenda, Llc employs approximately 12 people at this location. Q: How much does Qgenda, Llc in Atlanta, GA make in annual revenue? A: The company generates an estimated $970,000 USD in annual sales. Q: What's the address for Qgenda, Llc? A: Qgenda, Llc is located at 3340 Peachtree St, STE1100, Atlanta, GA 30326.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703785,"ranking":7,"query_text":"is qgenda a software","passage_text":"The Software Consultant role begins with a hands on training period that will expose you to all aspects of the QGenda software, customer community, and every aspect of the implementation team. As a Software Consultant you will work with others to provide dynamic customer solutions and new client implementation strategies. The perfect candidate will be comfortable with facilitating daily technical training and support of our proprietary healthcare workforce management application to new and existing clients.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703782,"ranking":8,"query_text":"is qgenda a software","passage_text":"Slower but more flexible way to view the schedule using QGenda 1. Login to QGenda 2. From the home screen click â\u0080\u009cViewâ\u0080\u009d","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703786,"ranking":9,"query_text":"is qgenda a software","passage_text":"â\u0080\u009c[QGendaâ\u0080\u0099s software] automatically ensures the right doctors are scheduled at the right place, at the right time.â\u0080\u009d QGenda's software also frees up medical staff, who otherwise would need to do the scheduling, to provide patient care. Since launching in 2008, QGendaâ\u0080\u0099s revenue has doubled annually. The company which had revenue of $4 million last year, expects to hit $6 million-to-$8 million in sales this year.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7703777,"ranking":10,"query_text":"is qgenda a software","passage_text":"Welcome to qgenda.com homepage info - get ready to check QGenda best content for United States right away, or after learning these important things about qgenda.com We analyzed Qgenda.com page load time and found that the first response time was 12 ms and then it took 810 ms to load all DOM resources and completely render a web page.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":1388964,"ranking":11,"query_text":"is qgenda a software","passage_text":"Quick Answer. Types of computer applications include word processing software, database software, spreadsheet software, presentation software, multimedia software, enterprise software, information worker software, simulation software, educational software, content access software and software that enables the development or engineering of products.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":788084,"ranking":12,"query_text":"is qgenda a software","passage_text":"Words near software-engineering in the dictionary. 1  software engine. 2  software-engine. 3  software engineer. 4  software-engineer. 5  software-engineering. 6  Software Engineering Institute. 7  software-engineers. 8  software-engines. 9  software entropy. 10  software erosion.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":6822139,"ranking":13,"query_text":"is qgenda a software","passage_text":"Incoming search terms: 1  architecture software. 2  best architecture software. 3  architect software. 4  best home design software. 5  architectural design software. 6  architectural software. 7  best architect software. 8  best architectural software. 9  software for architects. 10  architecture design software.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":45900,"ranking":14,"query_text":"is qgenda a software","passage_text":"System software. System software, or systems software, is computer software designed to provide services to other software. Examples of system software include operating systems, computational science software, game engines, industrial automation, and software as a service applications.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7375137,"ranking":15,"query_text":"is qgenda a software","passage_text":"Support is always free. Some common spelling variations and terms that describe our company and software: Frazier Computing, Fraser Computing, Frazier software, Fraser software auto dealer software, car lot software, used car dealer software dealer management software, DMS, f&i software.upport is always free. Some common spelling variations and terms that describe our company and software: Frazier Computing, Fraser Computing, Frazier software, Fraser software auto dealer software, car lot software, used car dealer software dealer management software, DMS, f&i software.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7408028,"ranking":16,"query_text":"is qgenda a software","passage_text":"Refers to any software that is designed for sale to serve a commercial need. Commercial software is usually proprietary software, but in some instances it may be public-domain software. Top 5 Business Software Questions. 1. What is software? 2. What is tax software? 3. What is accounting software? 4. What is billing software? 5. What is email software?","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":788085,"ranking":17,"query_text":"is qgenda a software","passage_text":"Related Terms. 1  software. 2  software engineering. 3  C++ Software Engineer. 4  CASE-Computer Aided Software Engineering. 5  accounting software. 6  systems software. 7  call center CRM software. 8  forms software. 9  software piracy. 10  engine.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":7408031,"ranking":18,"query_text":"is qgenda a software","passage_text":"software-defined servers; COTS - commercial off-the-shelf; Software-Defined Everything - SDE; SDS - software-defined storage; tax software; SDN - software defined networking; SDE - software defined environment; counterfeit software; BSDI - Berkeley Software Design","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":3381644,"ranking":19,"query_text":"is qgenda a software","passage_text":"Related Terms. 1  software. 2  software engineering. 3  C++ Software Engineer. 4  CASE-Computer Aided Software Engineering. 5  accounting software. 6  systems software. 7  call center CRM software. 8  forms software. 9  software piracy. 10  engine. software engineer is a licensed professional engineer who is schooled and skilled in the application of engineering discipline to the creation of software. A software engineer is often confused with a programmer, but the two are vastly different disciplines.","bm25_label":"high","relevance_label":0.0},{"query_id":1094039,"passage_id":5756101,"ranking":20,"query_text":"is qgenda a software","passage_text":"Software Engineer Salary. Software Engineer salaries, Software Engineer benefits packages, Software Engineer bonuses, Software Engineer job descriptions, Software Engineer statistics and Software Engineer job openings. Please select a specific Software Engineer job from the list below for additional information or search Software Engineer salaries. Job Title.","bm25_label":"high","relevance_label":0.0}]