[{"query_id":1094991,"passage_id":7624610,"ranking":1,"query_text":"how tall is the ice wall in game of thrones","passage_text":"Hereâ\u0080\u0099s everything we know about the Wall in Game of Thrones, best known as the realmâ\u0080\u0099s long-standing first line of defense. What is the Wall in Game of Thrones? The Game of Thrones Wall is a 700-foot tall, 300-foot thick fortification that is 300 miles and spans Westerosâ\u0080\u0099 northern border â\u0080\u0094 from the Bay of Seals in the east to the Gorge in the west. The ice wall was originally built to defend the realm against the White Walkers, ice creatures who were created by the Children of the Forest in an effort to defend themselves against the First Men.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":5582834,"ranking":2,"query_text":"how tall is the ice wall in game of thrones","passage_text":"A Con of Fire and Ice will be the first worldwide Game of Thrones fan convention. The largest Game of Thrones fan site, Watchers on the Wall, will host the first worldwide Game of Thrones fan convention next year in Nashville, Tennessee.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":5582837,"ranking":3,"query_text":"how tall is the ice wall in game of thrones","passage_text":"A Con of Fire and Ice will be the first worldwide Game of Thrones fan convention. (Facebook\/A Con of Fire and Ice) The largest Game of Thrones fan site, Watchers on the Wall, will host the first worldwide Game of Thrones fan convention next year in Nashville, Tennessee. A Con of Ice and Fire will celebrate the highly-rated HBO show and George R.R. Martinâ\u0080\u0099s book series.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":7624604,"ranking":4,"query_text":"how tall is the ice wall in game of thrones","passage_text":"This Tiny Game of Thrones Detail May Confirm a Major Jon Snow Theory. The Game of Thrones Wall is a 700-foot tall, 300-foot thick fortification that is 300 miles and spans Westeros' northern border â\u0080\u0094 from the Bay of Seals in the east to the Gorge in the west.","bm25_label":"high","relevance_label":1.0},{"query_id":1094991,"passage_id":7624606,"ranking":5,"query_text":"how tall is the ice wall in game of thrones","passage_text":"Related. The Game of Thrones Wall is a 700-foot tall, 300-foot thick fortification that is 300 miles and spans Westeros' northern border â\u0080\u0094 from the Bay of Seals in the east to the Gorge in the west.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":6981148,"ranking":6,"query_text":"how tall is the ice wall in game of thrones","passage_text":"With the TV show diverging from the books, we speculate on how many seasons of the show are left. Game of Thrones season five is almost upon us, but how many more seasons of Game of Thrones do we have to look forward to? You probably know the Game of Thrones TV show is based on a series of books, The Song of Ice and Fire series.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":4352351,"ranking":7,"query_text":"how tall is the ice wall in game of thrones","passage_text":"GAME OF THRONES IRON THRONE TABLE LAMP NEW IN BOX #snov15-206. The Game of Thrones Table Lamp features a 7 tall Iron Throne replica on the lamp base, and the lamp stands 18.5 tall. Uses Max. 60W bulb (not included) UL cUL listed.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":6432985,"ranking":8,"query_text":"how tall is the ice wall in game of thrones","passage_text":"See also. 1  Beyond the Wall on A Wiki of Ice and Fire. 2  HBO Viewer's Guide. â\u0086\u0091  3 The North Remembers. â\u0086\u0091 4  HBO Behind-the-scenes featurette, Game of Thrones Season 3: Inside the Wildlings. â\u0086\u0091  The World of Ice and Fire preview.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":458855,"ranking":9,"query_text":"how tall is the ice wall in game of thrones","passage_text":"Image: HBO. A massive wall of ice protects the Seven Kingdoms from the dangers of the wintry north in HBOâ\u0080\u0099s hit series Game of Thrones. But in the real world, an ice structure standing at half the height of the Empire State Building would face more problems from physics than any wildlings or White Walkers lurking in the lands Beyond the Wall.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":2660039,"ranking":10,"query_text":"how tall is the ice wall in game of thrones","passage_text":"Game of Owns. The Game of Thrones \/ A Song of Ice and Fire podcast. Game Of Owns is a Thrones community standard, adventuring over 300 episodes through HBO's Game Of Thrones and George R.R. Martin's A Song of Ice and Fire. Join the podcast season by season, chapter by chapter, with visits from actors, writers, and producers of the HBO series.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":2315485,"ranking":11,"query_text":"how tall is the ice wall in game of thrones","passage_text":"Share. Today, new downloadable content was announced for the video game adaptation of Game of Thrones. The DLC, titled Beyond the Wall, adds an additional two hours of play according to the issued press release. Beyond the Wall explores the past of Mors Westfold and his early experiences with the Night's Watch. Players will travel, as you might expect, beyond the Wall and into Wildling territory, uncovering the origin story of Mors. Game of Thrones: Beyond the Wall is currently available for PC and Xbox 360. The PlayStation 3 version will be launched on the PlayStation Network in the weeks to come.. Ryan Clements writes for IGN. He's almost finished with the first book in the Song of Ice and Fire series. Follow him on Twitter at @PwamCider.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":2700461,"ranking":12,"query_text":"how tall is the ice wall in game of thrones","passage_text":"Game of Thrones (2014 video game) This article is about the 2014 graphic adventure. For the 2012 role-playing game, see Game of Thrones (2012 video game). For other Game of Thrones games, see Works based on A Song of Ice and Fire.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":4347859,"ranking":13,"query_text":"how tall is the ice wall in game of thrones","passage_text":"1 â\u0086\u0091 A Game of Thrones, Chapter 3, Daenerys I. â\u0086\u0091 2  A Storm of Swords, Map of Slaver's Bay. â\u0086\u0091 3  A Game of Thrones, Appendix. â\u0086\u0091 4  The Lands of Ice and Fire. â\u0086\u0091 5  A Game of Thrones, Chapter 34, Catelyn VI. â\u0086\u0091 6  A Game of Thrones, Chapter 20, Eddard IV. â\u0086\u0091 7  The World of Ice & Fire, The Reign of the Dragons: The Conquest.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":6363634,"ranking":14,"query_text":"how tall is the ice wall in game of thrones","passage_text":"How many pages is the Game of Thrones third part book? The third book in the A Song of Ice and Fire series, A Storm of Swords, is 1216 pages.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":2993383,"ranking":15,"query_text":"how tall is the ice wall in game of thrones","passage_text":"This article is about the TV series. For the novel in the series A Song of Ice and Fire, see A Game of Thrones. For other uses, see A Game of Thrones (disambiguation).","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":8318970,"ranking":16,"query_text":"how tall is the ice wall in game of thrones","passage_text":"The original content was at Night's Watch. The list of authors can be seen in the page history of Night's Watch. As with A Wiki of Ice and Fire-A Song of Ice and Fire & Game of Thrones, the content of Wikipedia is available under the Creative Commons Attribution-ShareAlike License.he Night's Watch is a military order dedicated to holding the Wall, the immense fortification on the northern border of the Seven Kingdoms, defending the realms of men from what lies beyond the Wall.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":4412106,"ranking":17,"query_text":"how tall is the ice wall in game of thrones","passage_text":"27 Locations Where Game of Thrones is Filmed â\u0080\u0093 Part 1. Winter is Comingâ\u0080¦ This is the slogan for the fantasy drama Game of Thrones. Game of Thrones is based on the book series A Song of Ice and Fire, by R.R. Martin. The first novel is called Game of Thrones so the whole TV series is having this name.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":7624608,"ranking":18,"query_text":"how tall is the ice wall in game of thrones","passage_text":"- thoughts of Jon Snow. â\u0086\u0091 1  A Game of Thrones, Chapter 21, Tyrion III. â\u0086\u0091 2  A Clash of Kings, Chapter 43, Jon V. â\u0086\u0091 3  A Game of Thrones, Chapter 48, Jon VI. â\u0086\u0091 4  So Spake Martin: Size of Westeros, April 17, 2008. â\u0086\u0091 5  The World of Ice & Fire, The Wall and Beyond: The Night's Watch. â\u0086\u0091 6  A Storm of Swords, Chapter 30, Jon IV.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":7624611,"ranking":19,"query_text":"how tall is the ice wall in game of thrones","passage_text":"â\u0086\u0091 1.0 1.1 1.2 1.3 1.4 1.5 A Game of Thrones, Chapter 21, Tyrion III. â\u0086\u0091 2.0 2.1 A Clash of Kings, Chapter 43, Jon V. â\u0086\u0091 3.0 3.1 3.2 A Game of Thrones, Chapter 48, Jon VI. â\u0086\u0091 So Spake Martin: Size of Westeros, April 17, 2008 â\u0086\u0091 5.0 5.1 5.2 5.3 5.4 5.5 The World of Ice & Fire, The Wall and Beyond: The Night's Watch.","bm25_label":"high","relevance_label":0.0},{"query_id":1094991,"passage_id":2137557,"ranking":20,"query_text":"how tall is the ice wall in game of thrones","passage_text":"For the novel in the series A Song of Ice and Fire, see A Game of Thrones. For other uses, see A Game of Thrones (disambiguation). Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss. It is an adaptation of A Song of Ice and Fire, George R. R. Martin's series of fantasy novels, the first of which is A Game of Thrones. It is filmed at Titanic Studios in Belfast, on location in the United Kingdom, and in Croatia, Iceland, Malta, Morocco, Spain, and the United States.","bm25_label":"high","relevance_label":0.0}]