[{"query_id":1094731,"passage_id":7645683,"ranking":1,"query_text":"hydrocodone price per pill","passage_text":"Best Answer: Around $2.00 - $3.00 per pill at low amounts. About $1.50 - $2.00 per pill when buying a bunch. That is for Lortab; I guess it would be about the same for Vicodin. Hydrocodone Street Value. Hydrocodone Street Price. This Site Might Help You.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":7645681,"ranking":2,"query_text":"hydrocodone price per pill","passage_text":"The retail price of hydrocodone is typically $1.5 or less per pill; the price will depend on the pharmacy that you buy it at. There is a possibility to obtain hydrocodone cheaper using the drugs.com discount card. Most stores accept it. With that coupon you can expect to pay the following price: Liquid form of acetaminophen\/hydrocodone: 1  $0.64 per unit of 108 mg â\u0080\u0093 2.5 mg\/5 mL. 2  $0.36 per unit of 217 mg â\u0080\u0093 5 mg\/10 mL.","bm25_label":"high","relevance_label":1.0},{"query_id":1094731,"passage_id":687315,"ranking":3,"query_text":"hydrocodone price per pill","passage_text":"This Site Might Help You. What is the street price for 10-325 hydrocodone apap (vicodin)? A local pharmacy was robbed and I am writing a story on it and i am calculating the apprx street price of the drugs they stole. I always buy 10 mg hydrocodone from Minneapolis MN for $6 per pill when i place a large order.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":8419529,"ranking":4,"query_text":"hydrocodone price per pill","passage_text":"Report Abuse. Well where I live which is Louisville KY the street price for an oxycodone 5mg is $3 per pill. For a 7.5mg its $4 and for a 10mg its $5.Oxycodone (percocet) is stronger that hydrocodone (lortab\/vicidan) so of you found the right person you could probally up the price a little.jogemommy Â· 7 years ago.eport Abuse. Well where I live which is Louisville KY the street price for an oxycodone 5mg is $3 per pill. For a 7.5mg its $4 and for a 10mg its $5.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":7326172,"ranking":5,"query_text":"hydrocodone price per pill","passage_text":"750 mg would KILL you. 5 mg of hydrocodone is a typical vicodin pill. 5 mg of hydrocone \/ 500 mg of acetiminaphen or whatever. They only make pills with hydrocodone in them up to 10 mg!!!","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":7326176,"ranking":6,"query_text":"hydrocodone price per pill","passage_text":"Update: ........ 750 mg would KILL you. 5 mg of hydrocodone is a typical vicodin pill. 5 mg of hydrocone \/ 500 mg of acetiminaphen or whatever. They only make pills with hydrocodone in them up to 10 mg!!!","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":2794338,"ranking":7,"query_text":"hydrocodone price per pill","passage_text":"A pill of 10 mg of hydrocodone was sold for the price of $4 in Tulsa, Oklahoma on October 26th, 2016, while one user bought it for $5 in Ohio on October 28th, 2016 and another one paid $10 in Philadelphia, Pennsylvania on October 30th, 2016.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":1848298,"ranking":8,"query_text":"hydrocodone price per pill","passage_text":"Dr. Alan Wartenberg Dr. Wartenberg. Ask a pharmacist: The 215 on a pill is likely to just be the manufacturer's code for that particular pill; it is not the dose. In general, oxycodone is about 50% more potent than hydrocodone. This means that a hydrocodone pill, in order to be the equivalent to an oxycodone 5 mg, will generally be at least 7.5 mg ...Read more.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":7326174,"ranking":9,"query_text":"hydrocodone price per pill","passage_text":"750 mg would KILL you. 5 mg of hydrocodone is a typical vicodin pill. 5 mg of hydrocone \/ 500 mg of acetiminaphen or whatever. They only make pills with hydrocodone in them up to 10 mg!!! Update 2: It was prescribed to me, I'm not using it recreationally.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":7326175,"ranking":10,"query_text":"hydrocodone price per pill","passage_text":"Update: ........ 750 mg would KILL you. 5 mg of hydrocodone is a typical vicodin pill. 5 mg of hydrocone \/ 500 mg of acetiminaphen or whatever. They only make pills with hydrocodone in them up to 10 mg!!! Update 2: It was prescribed to me, I'm not using it recreationally.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":8419533,"ranking":11,"query_text":"hydrocodone price per pill","passage_text":"Savings Tips. 1  FDA Update: The FDA has asked manufacturers to limit prescription acetaminophen products to 325 mg per dose. 2  Split a Higher Dosage Pill: Cut a higher-dosage pill in half to save 50% or more. 3  Coupon Notice: This drug is a controlled substance. 4  Cheaper Alternative: Less expensive drugs that work the same way may be available.ydrocodone \/ acetaminophen, lorcet. Hydrocodone \/ acetaminophen is an opioid \/ acetaminophen combination used to treat pain. Hydrocodone is an opiate and is considered a narcotic pain medicine. Acetaminophen is sold over the counter for pain and fever.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":3254101,"ranking":12,"query_text":"hydrocodone price per pill","passage_text":"Photos: Opioids: Addictive painkillers. Hydrocodone â\u0080\u0093 These pills are a more powerful form of codeine, called hydrocodone, and are often mixed with acetaminophen. Hydrocodone is the most frequently prescribed opioid painkiller, according to the U.S. Food and Drug Administration, and the most abused.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":5023213,"ranking":13,"query_text":"hydrocodone price per pill","passage_text":"Vicodin may contain 5 milligrams of hydrocodone and 325 milligrams of acetaminophen or as much as 10 milligrams of hydrocodone and 660 milligrams of acetaminophen. While hydrocodone is the addictive component of this pill, acetaminophen has resulted in serious liver damage at high dosages.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":4360902,"ranking":14,"query_text":"hydrocodone price per pill","passage_text":"How Hydrocodone Is Used. Hydrocodone is combined with acetaminophen (the active ingredient in Tylenol) or ibuprofen in brand names such as Vicodin, Norco and Lortab. The Food and Drug Administration has also approved a pure hydrocodone product known as Zohydro. Those abusing hydrocodone may crush up their pills and snort or inject the contents.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":1500681,"ranking":15,"query_text":"hydrocodone price per pill","passage_text":"Acetaminophen, aspirin, and other analgesics that are used in preparations with hydrocodone are called â\u0080\u009cpotentiators.â\u0080\u009d The addition of potentiators to hydrocodone pills can lessen the need for high amounts of the addictive opioid substance.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":560303,"ranking":16,"query_text":"hydrocodone price per pill","passage_text":"For example, hydrocodone detection time in urine is about 2-4 days (on the safe side) , while hydrocodone can be detected in the hair for up to 3 months after your last pill. Most commercial drug tests for hydrocodone, however, detect hydrocodone in the urine for 6-24 hours after last use.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":1919856,"ranking":17,"query_text":"hydrocodone price per pill","passage_text":"Hydrocodone begins to work within 10 to 20 minutes of swallowing the pill. Its pain-relieving effects last 4 to 8 hours. Hydrocodone has a half-life of 3 to 4 hours; thatâ\u0080\u0099s how long it takes the body to eliminate half of the drug from the bloodstream. It takes several half-lives to eliminate all the hydrocodone. A small fraction may still be present in the blood a day or so after taking one pill.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":47009,"ranking":18,"query_text":"hydrocodone price per pill","passage_text":"Hydrocodone addiction is seen in every age group, with the majority of cases occurring in women between the ages of 20 and 40. Young teens are quickly becoming addicted to the substance because of its ease of availability. It is also an affordable street drug, costing between $2 and $10 per pill.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":3751921,"ranking":19,"query_text":"hydrocodone price per pill","passage_text":"Vicodin is made of a combination of hydrocodone, a synthetic opiate, and acetaminophen, a non-steroidal pain reliever. Aside from the euphoric and addictive effects of hydrocodone, there is about half a gram of acetaminophen in each pill, and two to four grams of acetaminophen in a day can start to damage the liver.There is a range of effects from Vicodin.side from the euphoric and addictive effects of hydrocodone, there is about half a gram of acetaminophen in each pill, and two to four grams of acetaminophen in a day can start to damage the liver.","bm25_label":"high","relevance_label":0.0},{"query_id":1094731,"passage_id":6743556,"ranking":20,"query_text":"hydrocodone price per pill","passage_text":"Hydrocodone is often in pill form as a acetaminophen (Tylenol)\/low dose hydrocodone preperation. Do not drink after having taken even small doses of acetaminophen (tylonel) (found in almost all hydrocodone drug preperations) because it can cause moderate, severe or fatal liver damage.","bm25_label":"high","relevance_label":0.0}]