[{"query_id":1095012,"passage_id":7622856,"ranking":1,"query_text":"how tall is james hetfield","passage_text":"Find out how tall James Hetfield of metal band Metallica is! To help visualize his height, we've included a side by side comparison with other celebrities, s... Find out how tall James Hetfield of metal band Metallica is! To help visualize his height, we've included a side by side comparison with other celebrities, short and tall!","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7622850,"ranking":2,"query_text":"how tall is james hetfield","passage_text":"James Hetfield's height is 6 feet and 1 inch. That's 73 inches tall. Or in metric units, James Hetfield is 186 centimetres. That's 1 metre and 86 centimetres. James Hetfield is 15 centimetres (6 inches) taller than the average celebrity (the average is 171 centimetres, 5 feet 7 inches or 67 inches tall). James's Name Did you know that the name James was the 13th most popular boy's name in 2013 and that around 68 in every 10,000 baby boys were named James at their birth.","bm25_label":"high","relevance_label":1.0},{"query_id":1095012,"passage_id":7622849,"ranking":3,"query_text":"how tall is james hetfield","passage_text":"Find out how tall James Hetfield of metal band Metallica is! To help visualize his height, we've included a side by side comparison with other celebrities, s... Skip navigation","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7622854,"ranking":4,"query_text":"how tall is james hetfield","passage_text":"James Hetfield is 15 centimetres (6 inches) taller than the average celebrity (the average is 171 centimetres, 5 feet 7 inches or 67 inches tall). James's Name. Did you know that the name James was the 13th most popular boy's name in 2013 and that around 68 in every 10,000 baby boys were named James at their birth. People The Same Height As James Hetfield. There are 286 people the same height as James Hetfield: Jake Abel; Yolanda Adams; Clay Aiken; Claude Akins; Dean Ambrose; Stephen Amell ...","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7413178,"ranking":5,"query_text":"how tall is james hetfield","passage_text":"February 4, 2016, 6 months ago. news metallica heavy metal james hetfield. This week's installment of the hit TBS show American Dad featured Metallica frontman James Hetfield providing the voice of a water polo coach named... James Hetfield.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7413175,"ranking":6,"query_text":"how tall is james hetfield","passage_text":"METALLICA Frontman JAMES HETFIELD Voices Water Polo Coach JAMES HETFIELD On New Episode Of American Dad. This week's installment of the hit TBS show American Dad featured Metallica frontman James Hetfield providing the voice of a water polo coach named... James Hetfield. The character claims heâ\u0080\u0099s not the Metallica frontman even though he makes constant references to the band and some of Metallicaâ\u0080\u0099s songs are used in the episode.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7413176,"ranking":7,"query_text":"how tall is james hetfield","passage_text":"February 3, 2016 0 Comments. METALLICA frontman James Hetfield recently did voiceover work for the hit animated series American Dad. The show, which originated on Fox but now airs on TBS, featured Hetfield an as a water polo coach also named James Hetfield..","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":6195808,"ranking":8,"query_text":"how tall is james hetfield","passage_text":"Enter Sandman is track #3 on the album Metallica. It was written by Kirk Hammett;lars Ulrich;james Hetfield. Enter Sandman is track #3 on the album Metallica. It was written by Kirk Hammett;lars Ulrich;james Hetfield.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":2539135,"ranking":9,"query_text":"how tall is james hetfield","passage_text":"In the September of this year James Hetfield started his first year at Downey high school and befriended Ron Mcgovney who would latter become the first bassist in Metallica. In 1978 James Hetfield joined his first band Obsession with Jim Arnold, Rich and Ron Veloz.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7413172,"ranking":10,"query_text":"how tall is james hetfield","passage_text":"METALLICA frontman James Hetfield recently did voiceover work for the hit animated series American Dad. The running gag is that the coach claims he is not James Hetfield from METALLICA, even though he looks and sounds exactly like him, and makes constant references to the band.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7877070,"ranking":11,"query_text":"how tall is james hetfield","passage_text":"Metallica - James Hetfield Guitar Gear Rig and Equipment. James Hetfield does more than just provide the band Metallica with growling vocals - he is also the bands rythym guitarist. Let's checkout his gear. Let's see what guitar gear and equipment Metallica's James Hetfield's has been seen using in his guitar rig. James has uses a large amount of guitars. - ESP Explorers, including a black and chrome version. - He also has an ESP LTD 7-string guitar (coined The Goblin) and an ESP LTD F-300M.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":3410254,"ranking":12,"query_text":"how tall is james hetfield","passage_text":"Frontman James Hetfield and drummer Lars Ulrich strolled onto the stage early to explain the proceedings: If you don't know by now, Metallica is throwing a party, and you're all invited, said Hetfield.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":3639883,"ranking":13,"query_text":"how tall is james hetfield","passage_text":"James Hetfield has been the face and voice of Metallica since the very beginning. When fans think of Metallica, it's impossible not to hear Hetfield's signature growl ring through their ears.He embodies all that is mighty Metallica.ames Hetfield has been the face and voice of Metallica since the very beginning. When fans think of Metallica, it's impossible not to hear Hetfield's signature growl ring through their ears.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":3865455,"ranking":14,"query_text":"how tall is james hetfield","passage_text":"James Hetfield, a guitar player who would become the lead singer of Metallica, answered the advertisement. Later, Lars and James would have contact from another young aspiring guitar player seeking a band, Dave Mustaine. Ulrich, Hetfield, Mustaine, and bass player Ron McGovney began playing in the band.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7622857,"ranking":15,"query_text":"how tall is james hetfield","passage_text":"METALLICA's James Hetfield Performs with His 16-Year-Old Daughter For Charity. James Hetfield played #cooldad over the weekend, when he performed at Acoustic-4-A-Cure in San Francisco with his 16 year old daughter, Cali, who covered Crazy For You by Adele. The girl's got chops!","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":6647378,"ranking":16,"query_text":"how tall is james hetfield","passage_text":"Dave Grohl out-earned Metallica frontman James Hetfield and Guns N Roses has-been Axl Rose. Dave Grohl is worth $225 million meanwhile James Hetfield rakes in $175 Million and Axl Rose is worth $150 Million. None of those hold a candle to Gene Simmons, who pulls in a cool $300 million.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":6195803,"ranking":17,"query_text":"how tall is james hetfield","passage_text":"Enter Sandman was released as the first single from their eponymous fifth album, Metallica. The music was written by Kirk Hammett, James Hetfield and Lars Ulrich. Vocalist and rhythm guitarist Hetfield wrote the lyrics, which deal with the concept of a child's nightmares.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":6195806,"ranking":18,"query_text":"how tall is james hetfield","passage_text":"The Unforgiven. Enter Sandman was released as the first single from their eponymous fifth album, Metallica. The music was written by Kirk Hammett, James Hetfield and Lars Ulrich. Vocalist and rhythm guitarist Hetfield wrote the lyrics, which deal with the concept of a child's nightmares.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":33234,"ranking":19,"query_text":"how tall is james hetfield","passage_text":"The band Metallica was formed on October 15 1981 by James Hetfield and Lars Ulrich. Starting at the very beginning on February 10 1962 Cliff Burton was born. On November 18 of the same year Kirk Hammett was born. On March 4 1963 Jason Newstead was born. On August 3 James Hetfield was born and on December 26 Lars Ulrich was born. These are the main members in the band Metallica.","bm25_label":"high","relevance_label":0.0},{"query_id":1095012,"passage_id":7830980,"ranking":20,"query_text":"how tall is james hetfield","passage_text":"Metallica was formed in 1981 when vocalist\/guitarist James Hetfield responded to an advertisement posted by drummer Lars Ulrich in a local newspaper. The band's current line-up comprises founding members Hetfield and Ulrich, longtime lead guitarist Kirk Hammett and bassist Robert Trujillo.","bm25_label":"high","relevance_label":0.0}]