[{"query_id":1095542,"passage_id":7580351,"ranking":1,"query_text":"how much rain does phoenix get in a year","passage_text":"Just last week, more than 3.5 inches fell in some parts of Phoenix in what officials called a 100-year event. So, how much rain does Phoenix officially get each year? According to 120 years of data from the National Weather Service, Phoenix gets about 7.57 inches of rain annually. We've compiled all that data into one chart, and here are a few other things we learned: The most rain ever recorded in Phoenix in a single year was in 1905.","bm25_label":"high","relevance_label":1.0},{"query_id":1095542,"passage_id":6294859,"ranking":2,"query_text":"how much rain does phoenix get in a year","passage_text":"How much rain forest does a rain forest get each year... Well, I would say that a rain forest can't really get any rain forests in a year, but Tropical rain forests get about â\u0080¦ 200-600 cm of rain each year, and Temperate Rain forests get 200-400 cm of rain each year.","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":6883603,"ranking":3,"query_text":"how much rain does phoenix get in a year","passage_text":"How much rain does the Brazilian rainforest get per year? The Brazilian rainforest gets on average 95 inches of rain per year, where some years will get well over 110 inches and some years less than 85.","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":7580343,"ranking":4,"query_text":"how much rain does phoenix get in a year","passage_text":"Phoenix's wettest year since 2000 was 2008 (9.58 inches of rain) and the driest was 2002 (2.82 inches of rain). Annual Average Rain in Phoenix* from 1971 to 2000: 8.29 inches Annual Average Rain in Phoenix* from 2000 to 2015: 6.54 inches *measured at Phoenix Sky Harbor International Airport. Does Phoenix Have a Rainy Season? Yes, there are times during the year when it is more likely to rain than at other times.","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":5587851,"ranking":5,"query_text":"how much rain does phoenix get in a year","passage_text":"How much rain does london get per year? London is usually thought to be very rainy, but this is not completely true. The city receives about 24 inches per year.","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":5587852,"ranking":6,"query_text":"how much rain does phoenix get in a year","passage_text":"Answers.com Â® WikiAnswers Â® Categories Science Earth Sciences Atmospheric Sciences Meteorology and Weather Rain and Flooding How much rain does Washington state get per year? What would you like to do?","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":5421606,"ranking":7,"query_text":"how much rain does phoenix get in a year","passage_text":"How much rainfall does a desert get? A desert is defined as an area that receives on average less than10 inches (250 mm) of precipitation per year. Some desert areasreceive virtually no rain at all for years.","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":1322781,"ranking":8,"query_text":"how much rain does phoenix get in a year","passage_text":"How much does a Physician Assistant (PA) make in Phoenix, AZ? The average salary for a Physician Assistant (PA) in Phoenix is $92,795 per year. This is 2% above the national average for a Physician Assistant (PA) which is $91,146 per year. Show More...","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":3058253,"ranking":9,"query_text":"how much rain does phoenix get in a year","passage_text":"What's the Average Low in Waukegan? 37.8 Â°F: What's the Average Temperature in Waukegan? 47.3 Â°F: How Many Inches of Rain per year does Waukegan get ? 32.36 inches: How Many Rainy Days a year are there in Waukegan? N\/A: How Much Sunshine each year is there in Waukegan (in hours)? N\/A: How much, if any, snow falls each year in Waukegan? N\/A","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":8021174,"ranking":10,"query_text":"how much rain does phoenix get in a year","passage_text":"What's the Average Temperature in Saratoga Springs? 49.05 Â°F: How Many Inches of Rain per year does Saratoga Springs get ? 13.47 inches: How Many Rainy Days a year are there in Saratoga Springs? N\/A: How Much Sunshine each year is there in Saratoga Springs (in hours)? N\/A: How much, if any, snow falls each year in Saratoga Springs? 30 inches","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":5157468,"ranking":11,"query_text":"how much rain does phoenix get in a year","passage_text":"How much rain does Utah get a year? this is highly dependent on the area, but places in Utah see as little as 3 inches of precipitation a year (including snow fall), while others see as much as 70 (including sno â\u0080¦ w fall). 6 people found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":8035086,"ranking":12,"query_text":"how much rain does phoenix get in a year","passage_text":"What's the Average Low in Hachita? 43.6 Â°F: What's the Average Temperature in Hachita? 60.55 Â°F: How Many Inches of Rain per year does Hachita get ? 12.01 inches: How Many Rainy Days a year are there in Hachita? N\/A: How Much Sunshine each year is there in Hachita (in hours)? N\/A: How much, if any, snow falls each year in Hachita? 6 inches","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":4616676,"ranking":13,"query_text":"how much rain does phoenix get in a year","passage_text":"What's The Average High Temp in Denton? 76 Â°F: What's the Average Low in Denton? 53.7 Â°F: What's the Average Temperature in Denton? 64.85 Â°F: How Many Inches of Rain per year does Denton get ? 38.08 inches: How Many Rainy Days a year are there in Denton? N\/A: How Much Sunshine each year is there in Denton (in hours)? N\/A: How much, if any, snow falls each year in Denton? N\/A","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":6909332,"ranking":14,"query_text":"how much rain does phoenix get in a year","passage_text":"What's The Average High Temp in Bozeman? 57.1 Â°F: What's the Average Low in Bozeman? 30.8 Â°F: What's the Average Temperature in Bozeman? 43.95 Â°F: How Many Inches of Rain per year does Bozeman get ? 16.23 inches: How Many Rainy Days a year are there in Bozeman? N\/A: How Much Sunshine each year is there in Bozeman (in hours)? N\/A: How much, if any, snow falls each year in Bozeman? 50 inches","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":8091220,"ranking":15,"query_text":"how much rain does phoenix get in a year","passage_text":"What's The Average High Temp in Florida? 79.6 Â°F: What's the Average Low in Florida? 53 Â°F: What's the Average Temperature in Florida? 66.3 Â°F: How Many Inches of Rain per year does Florida get ? 64.02 inches: How Many Rainy Days a year are there in Florida? N\/A: How Much Sunshine each year is there in Florida (in hours)? N\/A: How much, if any, snow falls each year in Florida? N\/A","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":8507860,"ranking":16,"query_text":"how much rain does phoenix get in a year","passage_text":"What's The Average High Temp in Orderville? 67.1 Â°F: What's the Average Low in Orderville? 36.1 Â°F: What's the Average Temperature in Orderville? 51.6 Â°F: How Many Inches of Rain per year does Orderville get ? 16.76 inches: How Many Rainy Days a year are there in Orderville? N\/A: How Much Sunshine each year is there in Orderville (in hours)? N\/A: How much, if any, snow falls each year in Orderville?","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":8543994,"ranking":17,"query_text":"how much rain does phoenix get in a year","passage_text":"What's The Average High Temp in Orla? 82.7 Â°F: What's the Average Low in Orla? 49.4 Â°F: What's the Average Temperature in Orla? 66.05 Â°F: How Many Inches of Rain per year does Orla get ? 12.56 inches: How Many Rainy Days a year are there in Orla? N\/A: How Much Sunshine each year is there in Orla (in hours)? N\/A: How much, if any, snow falls each year in Orla? N\/A","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":67086,"ranking":18,"query_text":"how much rain does phoenix get in a year","passage_text":"Phoenix, Arizona. 1  Phoenix: Sunrise in the Phoenix area. 2  Phoenix: Phoenix skyline at sunset as seen from 9 miles east. 3  Phoenix: In all my years in Phoenix purple rain was a first... 4  Phoenix: Phoenix at 07: 5 00. Phoenix: The sky is NOT on fire, that's just how the clouds formed.  Phoenix: Phoenix 1  Sunset. Phoenix: Phoenix aerial, camelback mountain.","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":3058257,"ranking":19,"query_text":"how much rain does phoenix get in a year","passage_text":"What's The Average High Temp in Waukegan? 56.8 Â°F: What's the Average Low in Waukegan? 37.8 Â°F: What's the Average Temperature in Waukegan? 47.3 Â°F: How Many Inches of Rain per year does Waukegan get ? 32.36 inches: How Many Rainy Days a year are there in Waukegan? N\/A: How Much Sunshine each year is there in Waukegan (in hours)? N\/A","bm25_label":"high","relevance_label":0.0},{"query_id":1095542,"passage_id":7079026,"ranking":20,"query_text":"how much rain does phoenix get in a year","passage_text":"What's The Average High Temp in Burlington? 56 Â°F: What's the Average Low in Burlington? 35.7 Â°F: What's the Average Temperature in Burlington? 45.85 Â°F: How Many Inches of Rain per year does Burlington get ? 33.84 inches: How Many Rainy Days a year are there in Burlington? N\/A: How Much Sunshine each year is there in Burlington (in hours)? N\/A","bm25_label":"high","relevance_label":0.0}]