[{"query_id":1095278,"passage_id":7600257,"ranking":1,"query_text":"average temp in fort worth in march","passage_text":"The highest monthly average temperature in Fort Worth for August is 85 degrees. The lowest monthly average temperature in Fort Worth for December is 46 degrees. The most monthly precipitation in Fort Worth occurs in March with 4.3 inches. The air quality index in Fort Worth is 8% worse than the national average. The pollution index in Fort Worth is 91% better than the national average.","bm25_label":"high","relevance_label":1.0},{"query_id":1095278,"passage_id":5577222,"ranking":2,"query_text":"average temp in fort worth in march","passage_text":"El Paso averages 1.61 inches of precipitation in September. September Fort Worth Weather-In the month of September, Fort Worth has recorded a record high of 110 and, the typical high is 88. Fort Worth has experienced a record low temperature of 49 and, the average low is 69.eptember Amarillo Weather-Amarillo in September has recorded a record high temperature of 103 and, the daily high averages 82. Amarillo has recorded a record low temp of 30 and, the low temperature averages 56. Amarillo normally experiences 1.88 inches of precipitation in September.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":8157116,"ranking":3,"query_text":"average temp in fort worth in march","passage_text":"Average Temperatures for Dallas-Fort Worth. Dallas-Fort Worth's coldest month is January when the average temperature overnight is 34.0Â°F. In July, the warmest month, the average day time temperature rises to 95.4Â°F. Average Rainfall for Dallas-Fort Worth","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":8538809,"ranking":4,"query_text":"average temp in fort worth in march","passage_text":"Average Temperatures for Dallas-Fort Worth. Dallas-Fort Worth's coldest month is January when the average temperature overnight is 34.0Â°F. In July, the warmest month, the average day time temperature rises to 95.4Â°F. Average Rainfall for Dallas-Fort Worth.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":5739164,"ranking":5,"query_text":"average temp in fort worth in march","passage_text":"CityRating.com offers the average Dallas-Fort Worth temperature chart that displays the annual and monthly temperatures for Dallas-Fort Worth and dozens of other cities.verage temperature of Dallas-Fort Worth including average monthly and annual data.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":5739167,"ranking":6,"query_text":"average temp in fort worth in march","passage_text":"Average temperature of Dallas-Fort Worth including average monthly and annual data.verage temperature of Dallas-Fort Worth including average monthly and annual data.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":7600258,"ranking":7,"query_text":"average temp in fort worth in march","passage_text":"1 Compare Fort Worth, TX Weather To Other Cities. 2  Fort Worth air quality index & pollution index. 3  Fort Worth air quality information. 4  Fort Worth air quality information. 5  Average monthly Fort Worth temperature with heat index. 6  Fort Worth monthly precipitation with daily maximum. 7  Fort Worth monthly snow depth with daily maximum.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":3929877,"ranking":8,"query_text":"average temp in fort worth in march","passage_text":"Tempe was the location of US Airways Group's corporate headquarters until December 9, 2013, when US Airways and American Airlines merged to form American Airlines Group. The headquarters for the combined airline moved to American's headquarters in Fort Worth, Texas. Tempe is also the home of Arizona State University.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":407970,"ranking":9,"query_text":"average temp in fort worth in march","passage_text":"The average salary of an occupational therapy assistant working in Fort Worth, Texas is $76,710.he average salary of an occupational therapy assistant working in Fort Worth, Texas is $76,710.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":538807,"ranking":10,"query_text":"average temp in fort worth in march","passage_text":"The average sea temperature in and around Fort Lauderdale in March is 24Â°C (75Â°F). The weather in Fort Lauderdale in March is represented by Fort Lauderdale. Fort Lauderdale sunrise & sunset times for March 2018. Browse the sunrise & sunset times for Fort Lauderdale in March 2018.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":96361,"ranking":11,"query_text":"average temp in fort worth in march","passage_text":"There are miles from Houston to Fort Worth and miles by car. Houston and Fort Worth are far apart (by car). This is the best Houston, TX - Fort Worth, TX route. Rental cars in Houston, TX. Gas consumption and emissions. A car with an average MPG will need gallons of gas to cover the route between Houston, TX and Fort Worth, TX. The estimated cost of gas to go from Houston to Fort Worth is . During the route, an average car will release pounds of CO2 to the atmosphere. Your carbon footprint is pounds of CO2 per mile. US market average MPG used for calculations is 21.6 MPG.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":2949560,"ranking":12,"query_text":"average temp in fort worth in march","passage_text":"Average Temperatures for Dallas-Fort Worth. Dallas-Fort Worth's coldest month is January when the average temperature overnight is 34.0Â°F. In July, the warmest month, the average day time temperature rises to 95.4Â°F.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":5843478,"ranking":13,"query_text":"average temp in fort worth in march","passage_text":"Punta Cana. Partners with flight deals for Dallas\/Fort Worth International to Punta Cana 3. Deals on offer for Dallas\/Fort Worth International to Punta Cana 69. Cheapest flight for Dallas\/Fort Worth International to Punta Cana $559. Average flight price for Dallas\/Fort Worth International to Punta Cana $2062. Dallas\/Fort Worth International to Punta Cana 2014 miles.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":7215791,"ranking":14,"query_text":"average temp in fort worth in march","passage_text":"On March 28, 2000, the â\u0080\u009cFort Worth Tornadoâ\u0080\u009d impacted Dallas's neighbor Fort Worth's downtown, and a tornado in Arlington, Texas also occurred that day damaging some homes. That day was the Metroplex's most damaging tornado outbreak since the 1957 event.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":8292882,"ranking":15,"query_text":"average temp in fort worth in march","passage_text":"1 The price of coffee in Tempe is 8.2% higher than the national average. 2  Honolulu, HI is the most expensive city for coffee at $7.79. 3  Fort Lauderdale, FL is the least expensive city for coffee at $2.99. The price of coffee in Tempe is 8.2% higher than the national average. 2  Honolulu, HI is the most expensive city for coffee at $7.79. 3  Fort Lauderdale, FL is the least expensive city for coffee at $2.99.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":7677300,"ranking":16,"query_text":"average temp in fort worth in march","passage_text":"Employees in Fort Worth, TX have a longer average commute time than the national average of 25.2 minutes. 1.8% of the workforce in Fort Worth, TX have super commutes in excess of 90 minutes. That is lower than the national average of 2.8%.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":6306370,"ranking":17,"query_text":"average temp in fort worth in march","passage_text":"How much does a Paralegal make in Dallas-Fort Worth, TX? The average salary for a Paralegal is $52,185 in Dallas-Fort Worth, TX. Salaries estimates are based on 245 salaries submitted anonymously to Glassdoor by Paralegal employees in Dallas-Fort Worth, TX.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":6462986,"ranking":18,"query_text":"average temp in fort worth in march","passage_text":"Climate for Dallas-Fort Worth, Texas. Dallas-Fort Worth's coldest month is January when the average temperature overnight is 34.0Â°F. In July, the warmest month, the average day time temperature rises to 95.4Â°F.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":1335605,"ranking":19,"query_text":"average temp in fort worth in march","passage_text":"How much does a Wellness Coordinator make in Dallas-Fort Worth, TX? The average salary for a Wellness Coordinator is $40,380 in Dallas-Fort Worth, TX. Salary estimates are based on salaries submitted anonymously to Glassdoor by Wellness Coordinator employees in Dallas-Fort Worth, TX.","bm25_label":"high","relevance_label":0.0},{"query_id":1095278,"passage_id":2299208,"ranking":20,"query_text":"average temp in fort worth in march","passage_text":"Time Usage: Fort Worth, Texas does utilize Daylight Saving Time. Daylight Saving Start Date: Fort Worth, Texas starts Daylight Saving Time on Sunday March 11, 2018 at 2:00 AM local time. Daylight Saving End Date: Fort Worth, Texas ends Daylight Saving Time on Sunday November 4, 2018 at 2:00 AM local time.","bm25_label":"high","relevance_label":0.0}]