[{"query_id":1096830,"passage_id":6773522,"ranking":1,"query_text":"how many people die yearly from cars","passage_text":"How many people die every year by car crashes?   In the United States an average of 41,975 people die each year related to car accidents, that's an average of 115 per day.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":7465444,"ranking":2,"query_text":"how many people die yearly from cars","passage_text":"How Many People Die in Car Accidents Per Year? Over 30,000 people will die in the United States every year because of car accidents. However, an estimated 35,900 people will die within one year of their car accident. This could be due to any number of factors, including medical error or failing to seek proper medical attention.","bm25_label":"high","relevance_label":1.0},{"query_id":1096830,"passage_id":366841,"ranking":3,"query_text":"how many people die yearly from cars","passage_text":"How many people die from alcohol related car accidents in the us each year? Answer:     In 2005, there were 16,885 alcohol related car accident fatalities out of a total of 43,443 car accident fatalities (39%).","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":6828364,"ranking":4,"query_text":"how many people die yearly from cars","passage_text":"How Many people die in car accidents? More than 32,000 people die in automobile accidents every year. In 2013, there we 3,000 fatal accidents in the state of California. Deaths per fatal accident. Most fatal car accidents produce only a single death. The 32,719 nationwide deaths in 2013 resulted from 30,057 motor vehicle crashes.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":282695,"ranking":5,"query_text":"how many people die yearly from cars","passage_text":"how many people die in car crashes? car accident fatalities by type year? what is the total number of car crash deaths each year? what day is more likely to get in a car accident? percent of car deaths that involved a drunk driver at the wheel?","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":5739895,"ranking":6,"query_text":"how many people die yearly from cars","passage_text":"How do people die in car accidents even with all of the safety mechanisms? How many car accidents has Ingress caused? What percentage of automobile accidents involve another car? For the last 25 years, since seatbelt laws, about 10 people per day (3600 per year) have died in car accidents in the UK. Apart from tragedies... General Motors Safety Woes (March 2014): How will GM compensate all the families of those who were killed in crashed caused by faulty ignition...","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":8090190,"ranking":7,"query_text":"how many people die yearly from cars","passage_text":"Deaths in new zealand attributable to second hand smoke ash. The facts tobacco, lung cancer, and secondhand smoke. Those numbers came from a but how many innocent people do cars kill? Hundreds of 28 sep 2012 americans die smoking without even lighting up cigarette?","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":4914390,"ranking":8,"query_text":"how many people die yearly from cars","passage_text":"Car Crashes Kill 40,000 in U.S. Every Year. Imagine a plane full of people crashing, killing everyone on board, every single day. Thatâ\u0080\u0099s how many people die on Americaâ\u0080\u0099s roads daily, says the Insurance Institute for Highway Safety.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":7470542,"ranking":9,"query_text":"how many people die yearly from cars","passage_text":"How many, if any, people die from the flu vaccine each year? I know 35,000 die from the flu or complications of the flu. I got my flu shot yesterday and my boss is giving me a ration of crap over it. I wonder how many actually die from the vaccine or complications from getting the vaccine. Follow.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":1786263,"ranking":10,"query_text":"how many people die yearly from cars","passage_text":"In Australia, 12,000 people die of cancer every year. Skin cancer is a large part of that number. For Japan, over 336,000 people die in that country from cancer and most of these have lung cancer. In Pakistan, 85,000 die of cancer. In Brazil, over 25,000 die from this disease yearly. The killer disease we call cancer strikes around the world and is getting stronger by the day.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":268066,"ranking":11,"query_text":"how many people die yearly from cars","passage_text":"Car Accident Cause And Effect. life can be gone. what is a car accident, its an undesirable or unfortunate happening that occurs unintentionally and usually... results in harm, injury, damage, or loss. Millions of people die from car accidents and many have long term injuies from accidents.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":8238276,"ranking":12,"query_text":"how many people die yearly from cars","passage_text":"Health organizations now use the ______________, a tool to ______________________. A. DALY, judge the total impact of the disease rather than only measuring how many people die. B. DALY, judge the total impact of how many people die. C. Morbidity Measure, judge the total impact of the disease rather than only measuring how many people. die.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":5527835,"ranking":13,"query_text":"how many people die yearly from cars","passage_text":"How many, if any, people die from the flu vaccine each year? I know 35,000 die from the flu or complications of the flu. I got my flu shot yesterday and my boss is giving me a ration of crap over it. I wonder how many actually die from the vaccine or complications from getting the vaccine. Follow. 7 answers 7.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":2690626,"ranking":14,"query_text":"how many people die yearly from cars","passage_text":"Fox News. Car Crashes Kill 40,000 in U.S. Every Year. Imagine a plane full of people crashing, killing everyone on board, every single day. Thatâ\u0080\u0099s how many people die on Americaâ\u0080\u0099s roads daily, says the Insurance Institute for Highway Safety.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":6535741,"ranking":15,"query_text":"how many people die yearly from cars","passage_text":"Car Accident Statistics With the increasing number of cars on the roads of the US each year, car accidents have unfortunately become a very common sight. Many people die as a result of car accidents, with many more receiving serious injuries.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":7468099,"ranking":16,"query_text":"how many people die yearly from cars","passage_text":"Ever wonder how many people die from smoking? The number is shocking. The Centers for Disease Control and Prevention (CDC) reports that each year more than 6 million people die from smoking and tobacco use worldwide.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":5031451,"ranking":17,"query_text":"how many people die yearly from cars","passage_text":"How many people die from heart attacks everyday? According to PBS's Mysterious Human Heart (2007), approximately 3000 people per day die of myocardial infarction aka heart attack in the USA.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":6382525,"ranking":18,"query_text":"how many people die yearly from cars","passage_text":"WebMD experts and contributors provide answers to: how many people die each year from obesity","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":8412365,"ranking":19,"query_text":"how many people die yearly from cars","passage_text":"So, how many people die every year from drunk deaths? Actually the number is quite high. According to the statistics from the National Highway Traffic Safety Administration 40 percent of total traffic deaths are due to drunk driving. In 2006, an estimated 17,941 people died due to alcohol-related vehicle accidents. Although people are aware that it is wrong and illegal to drink and drive, they still get behind the wheel of their cars while being drunk.","bm25_label":"high","relevance_label":0.0},{"query_id":1096830,"passage_id":268065,"ranking":20,"query_text":"how many people die yearly from cars","passage_text":"Car Accident Cause And Effect Essays and Research Papers. life can be gone. what is a car accident, its an undesirable or unfortunate happening that occurs unintentionally and usually... results in harm, injury, damage, or loss. Millions of people die from car accidents and many have long term injuies from accidents.","bm25_label":"high","relevance_label":0.0}]