[{"query_id":1096823,"passage_id":7466157,"ranking":1,"query_text":"how many people died in the parkland school shooting","passage_text":"The school shooting in Florida has become one of the most deadly gun attacks in US history What happened in Parkland, Florida and how many died in the school shooting? Suspect and former student, Nikolas Cruz, wearing a gas mask and carrying smoke grenades, went on a rampage at his former school killing at least 17 people and injuring dozens more.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7466152,"ranking":2,"query_text":"how many people died in the parkland school shooting","passage_text":"At Least 17 People Have Died Following A Shooting At A High School In Parkland, Florida #Breaking News #Florida Andrew Husband 02.14.18 21 hours ago 59 Comments","bm25_label":"high","relevance_label":1.0},{"query_id":1096823,"passage_id":8413926,"ranking":3,"query_text":"how many people died in the parkland school shooting","passage_text":"A tragedy unfolded today at Stoneman Douglas High School in Broward County, Florida. A school shooting left as many as 20 to 50 people injured. Itâ\u0080\u0099s not clear yet exactly how many people were injured and how many people died, but reports are indicating that as many as seven people may have died in the school shooting and at least 14 were injured.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7610829,"ranking":4,"query_text":"how many people died in the parkland school shooting","passage_text":"PARKLAND, Fla. - A sheriff says 17 people have died in the shooting attack on a South Florida high school. Sheriff Scott Israel of Broward County says the 19-year-old suspect is in custody and that investigators are beginning to dissect what happened in the attack Wednesday at Marjory Stoneman Douglas High School in Parkland. >>","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7232001,"ranking":5,"query_text":"how many people died in the parkland school shooting","passage_text":"Seventeen people were confirmed dead as the United States endured another horrifying school shooting at the hands of a teenage gunman armed with an AR-15 assault rifle. Twelve people died inside Marjory Stoneman Douglas high school in Parkland, Florida.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":8229292,"ranking":6,"query_text":"how many people died in the parkland school shooting","passage_text":"FATAL MASS SHOOTING AT PARKLAND, FLORIDA HIGH SCHOOL Funeral held for Florida school shooting victim | 0:49 A funeral was held in Parkland, Fla., on Sunday for Jaime Guttenberg, 14, who was killed in last week's school shooting.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":8091798,"ranking":7,"query_text":"how many people died in the parkland school shooting","passage_text":"FATAL MASS SHOOTING AT PARKLAND, FLORIDA HIGH SCHOOL Florida Shooting Survivors Protest NRA | 1:51 Dozens of students and parents from Marjory Stoneman Douglas High School convened at a park near the Parkland school.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7151037,"ranking":8,"query_text":"how many people died in the parkland school shooting","passage_text":"PARKLAND, Fla. -- President Donald Trump and first lady Melania Trump, aiming to honor the victims of Wednesday's school shooting in Parkland, Florida, visited Broward Health North Hospital on Friday, the hospital where many of the victims were treated.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":2507497,"ranking":9,"query_text":"how many people died in the parkland school shooting","passage_text":"A shooting at Marjory Stoneman Douglas High School in Parkland, Florida, left at least 17 people dead and 15 wounded on Feb. 14, officials said. The shooting suspect, who was identified as 19-year-old Nikolaus Cruz, had been expelled for disciplinary reasons.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":2691273,"ranking":10,"query_text":"how many people died in the parkland school shooting","passage_text":"Who Is Nicolas De Jesus Cruz, Alleged Gunman In Florida School Shooting? >> Related: Photos: Remembering Parkland Florida school shooting victims â\u0080\u009cThe family took him in.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7232000,"ranking":11,"query_text":"how many people died in the parkland school shooting","passage_text":"FATAL MASS SHOOTING AT PARKLAND, FLORIDA HIGH SCHOOL Florida school shooting suspect back in court | 2:44 Nikolas Cruz, the man accused of shooting and killing 17 at a Florida high school was back in court Monday for a status hearing.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":6932246,"ranking":12,"query_text":"how many people died in the parkland school shooting","passage_text":"Nikolas Cruz, charged in the shooting at Marjory Stoneman Douglas High School in Parkland, Florida, talked a lot about guns and his troubled past, students say. Nikolas Cruz, charged in the shooting at Marjory Stoneman Douglas High School in Parkland, Florida, talked a lot about guns and his troubled past, students say.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":2507489,"ranking":13,"query_text":"how many people died in the parkland school shooting","passage_text":"The school shooting at Marjory Stoneman Douglas High School in Parkland, Florida, now ranks among the most deadly mass shootings in American history. With at least 17 dead, the Valentine's Day shooting is worse than the Virginia Tech and Columbine shootings.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7151036,"ranking":14,"query_text":"how many people died in the parkland school shooting","passage_text":"President Donald Trump and first lady Melania Trump, aiming to honor the victims of Wednesday's school shooting in Parkland, Florida, visited Broward Health North Hospital on Friday, the hospital where many of the victims were treated.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":4491669,"ranking":15,"query_text":"how many people died in the parkland school shooting","passage_text":"The shooter inside the club is dead, Orlando Police said on the department's official Twitter page. It was not immediately clear how the shooter died, or how many people were wounded in the shooting. Police described it as a mass casualty... The shooter inside the club is dead, Orlando Police said on the department's official Twitter page. It was not immediately clear how the shooter died, or how many people were wounded in the shooting. Police described it as a mass casualty situation.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7170776,"ranking":16,"query_text":"how many people died in the parkland school shooting","passage_text":"CGTN shared CGTN America's video. Â· 5 hrs Â· CGTN's Nitza Soledad Perez talked to people that knew and loved Peter Wang, who was gunned down in the school shooting at Marjory Stoneman High School in Parkland, Florida on Feb. 14, 2018.","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":2507495,"ranking":17,"query_text":"how many people died in the parkland school shooting","passage_text":"FATAL MASS SHOOTING AT PARKLAND, FLORIDA HIGH SCHOOL Florida school shooting suspect back in court | 2:44. Nikolas Cruz, the man accused of shooting and killing 17 at a Florida high school was back in court Monday for a status hearing. (Feb. 19) AP","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":2691272,"ranking":18,"query_text":"how many people died in the parkland school shooting","passage_text":"Florida school shooting suspect named as Nicolas Cruz Law enforcement officials have named the suspect from Wednesday& s school shooting in Parkland, Flor... - KERO 23ABC News - an hour ago","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":8229289,"ranking":19,"query_text":"how many people died in the parkland school shooting","passage_text":"Students running from scene of school shooting in Parkland, Florida - Duration: 0:40. KATC 8,483 views. New","bm25_label":"high","relevance_label":0.0},{"query_id":1096823,"passage_id":7151030,"ranking":20,"query_text":"how many people died in the parkland school shooting","passage_text":"DEERFIELD BEACH, Fla. (CNN) - President Donald Trump and first lady Melania Trump, aiming to honor the victims of Wednesday's school shooting in Parkland, Florida, visited Broward Health North Hospital on Friday, the hospital where many of the victims were treated.","bm25_label":"high","relevance_label":0.0}]