[{"query_id":1096911,"passage_id":7457675,"ranking":1,"query_text":"average income for a flight engineer","passage_text":"What is the Average Salary of a Flight Engineer? In 2014, the U.S. Bureau of Labor Statistics (BLS) reported that airline pilots, copilots, and flight engineers earn an average yearly salary of $118,140.","bm25_label":"high","relevance_label":1.0},{"query_id":1096911,"passage_id":7457676,"ranking":2,"query_text":"average income for a flight engineer","passage_text":"From millions of real job salary data. 1 Flight Engineer salary data. Average Flight Engineer salary is $52,922 Detailed Flight Engineer starting salary, median salary, pay scale, bonus data report Register & Know how much $ you can earn | Sign In","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":2096119,"ranking":3,"query_text":"average income for a flight engineer","passage_text":"An Airline Pilot, Copilot, or Flight Engineer earns an average salary of $101,853 per year. Experience strongly influences pay for this job.n Airline Pilot, Copilot, or Flight Engineer earns an average salary of $101,853 per year. Experience strongly influences pay for this job.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":1364224,"ranking":4,"query_text":"average income for a flight engineer","passage_text":"Average Salary For Airline Pilot, Copilot, or Flight Engineer at Delta Air Lines Inc Employer. Job Overview: Airline Pilot, Copilot, or Flight Engineer at Delta Air Lines Inc Employer.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":1280972,"ranking":5,"query_text":"average income for a flight engineer","passage_text":"The average pay for an Airline Pilot, Copilot, or Flight Engineer is R396,629 per year.Most people with this job move on to other positions after 20 years in this career. Experience strongly influences salary for this job.he average pay for an Airline Pilot, Copilot, or Flight Engineer is R396,629 per year.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":5630994,"ranking":6,"query_text":"average income for a flight engineer","passage_text":"Malaysia. For example the average income of a Project Manager in Malaysia is around 100,000 MYR. The median income for Software Engineer or Developer is around 60,000 MYR per year. Average income of Mechanical Engineer is around 72,000 MYR per year.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":2378664,"ranking":7,"query_text":"average income for a flight engineer","passage_text":"Salary Overview. The average salary of the environmental engineer is dependant on several factors which include the industry in which they are employed and the geographical location of their employment. Overall, the top ten percent of environmental engineers have an average income in excess of $115,750 per year.The bottom ten percent of environment engineers have an average income of $47,660 per year and the middle ten percent have a median salary of $77.040 per year.*.verall, the top ten percent of environmental engineers have an average income in excess of $115,750 per year. The bottom ten percent of environment engineers have an average income of $47,660 per year and the middle ten percent have a median salary of $77.040 per year.*.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":1280973,"ranking":8,"query_text":"average income for a flight engineer","passage_text":"(South Africa). The average pay for an Airline Pilot, Copilot, or Flight Engineer is R396,629 per year. Most people with this job move on to other positions after 20 years in this career. Experience strongly influences salary for this job.he average pay for an Airline Pilot, Copilot, or Flight Engineer is R396,629 per year.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":623535,"ranking":9,"query_text":"average income for a flight engineer","passage_text":"Flight Instructor Salary. The average pay for a Flight Instructor is $69,395 per year. Experience strongly influences income for this job. $30,440 - $105,782.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":6329062,"ranking":10,"query_text":"average income for a flight engineer","passage_text":"Nationwide, the average annual income for a steel erector is $44,000. The average annual income for pre-engineered steel erectors is $35,000.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":4324992,"ranking":11,"query_text":"average income for a flight engineer","passage_text":"Airline Pilot, Copilot, or Flight Engineer Salary. The average salary for an Airline Pilot, Copilot, or Flight Engineer is $101,339 per year. Experience strongly influences pay for this job. A skill in Captain is associated with high pay for this job. $35,813 - $203,269.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":5630992,"ranking":12,"query_text":"average income for a flight engineer","passage_text":"For example the average income of a Project Manager in Malaysia is around 100,000 MYR. The median income for Software Engineer or Developer is around 60,000 MYR per year. Average income of Mechanical Engineer is around 72,000 MYR per year. These data are from various statistics published on the Internet.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":2114776,"ranking":13,"query_text":"average income for a flight engineer","passage_text":"An Airline Pilot, Copilot, or Flight Engineer can get salaries between 88000 - 132000 based on experience and education levels. Airline Pilots, Copilots, and Flight Engineers get salaries of One Hundred Sixteen Thousand One Hundred dollars yearly. Airline Pilots, Copilots, and Flight Engineers obtain the highest salaries in Florida, where they earn an average salary rate of just about $148940. People working these jobs make the highest salary in Transportation and Warehousing, which has average compensation of $133440.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":5630993,"ranking":14,"query_text":"average income for a flight engineer","passage_text":"Malaysia. For example the average income of a Project Manager in Malaysia is around 100,000 MYR. The median income for Software Engineer or Developer is around 60,000 MYR per year. Average income of Mechanical Engineer is around 72,000 MYR per year. These data are from various statistics published on the Internet.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":441237,"ranking":15,"query_text":"average income for a flight engineer","passage_text":"Nuclear Engineer Salary. (United States). The average pay for a Nuclear Engineer is $79,803 per year. A skill in Systems Engineering is associated with high pay for this job. Experience has a moderate effect on income for this job.he average pay for a Nuclear Engineer is $79,803 per year. A skill in Systems Engineering is associated with high pay for this job. Experience has a moderate effect on income for this job.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":107580,"ranking":16,"query_text":"average income for a flight engineer","passage_text":"Airline Pilot, Copilot, or Flight Engineer Salary. The average salary for an Airline Pilot, Copilot, or Flight Engineer is $101,339 per year. Experience strongly influences pay for this job. A skill in Captain is associated with high pay for this job. $35,813 - $203,269. (Median) $36K.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":1212934,"ranking":17,"query_text":"average income for a flight engineer","passage_text":"SUMMARY. India. Annual average income for software engineer\/developer in India is around 650,000 INR per year and average income for more experienced senior software developer is around 900,000 INR or more.Data from the end of year 2011.UMMARY. India. Annual average income for software engineer\/developer in India is around 650,000 INR per year and average income for more experienced senior software developer is around 900,000 INR or more.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":5840669,"ranking":18,"query_text":"average income for a flight engineer","passage_text":"Nuclear Engineer Salary. (United States). The average pay for a Nuclear Engineer is $79,803 per year. A skill in Systems Engineering is associated with high pay for this job. Experience has a moderate effect on income for this job.United States). The average pay for a Nuclear Engineer is $79,803 per year. A skill in Systems Engineering is associated with high pay for this job. Experience has a moderate effect on income for this job.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":94140,"ranking":19,"query_text":"average income for a flight engineer","passage_text":"India. Annual average income for software engineer\/developer in India is around 650,000 INR per year and average income for more experienced senior software developer is around 900,000 INR or more. Data from the end of year 2011.ndia. Annual average income for software engineer\/developer in India is around 650,000 INR per year and average income for more experienced senior software developer is around 900,000 INR or more. Data from the end of year 2011.","bm25_label":"high","relevance_label":0.0},{"query_id":1096911,"passage_id":2724848,"ranking":20,"query_text":"average income for a flight engineer","passage_text":"Civil engineers with doctorate degrees start their first jobs with an average annual income of $58,000. Entry-level civil engineers typically report to a more experienced engineer.Because they work for someone already licensed by the state, they don't need a license themselves.ivil engineers with doctorate degrees start their first jobs with an average annual income of $58,000. Entry-level civil engineers typically report to a more experienced engineer.","bm25_label":"high","relevance_label":0.0}]