[{"query_id":1096257,"passage_id":7519779,"ranking":1,"query_text":"how much does a audit senior make","passage_text":"Tag Archives: how much do audit senior managers make Audit Senior Manager Salary By State If youâ\u0080\u0099ve worked your way up to the position of an Audit Senior Manager then you should be concerned with how much youâ\u0080\u0099re being paid.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":6373475,"ranking":2,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Examiner make in Seattle?The average Senior Examiner salary is $75,935. In Seattle, a Senior Examiner can make $65,379, which is 13.9% lower than the national median. Filter by location to see Senior Examiner salaries in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":8257212,"ranking":3,"query_text":"how much does a audit senior make","passage_text":"{ seoText: <b>How much does a Senior Administrative Assistant make in Seattle?<\/b>The average Senior Administrative Assistant salary is $47,641. In Seattle, a Senior Administrative Assistant can make $51,181, which is 7.4% higher than the national median.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":8480196,"ranking":4,"query_text":"how much does a audit senior make","passage_text":"{ seoText: <b>How much does a Senior Internal Auditor make in Seattle?<\/b>The average Senior Internal Auditor salary is $83,423. In Seattle, a Senior Internal Auditor can make $80,442, which is 3.6% lower than the national median.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":3487847,"ranking":5,"query_text":"how much does a audit senior make","passage_text":"Audit Senior Manager Salary By State. If youâ\u0080\u0099ve worked your way up to the position of an Audit Senior Manager then you should be concerned with how much youâ\u0080\u0099re being paid. Audit Managers can get paid a wide range of salaries depending on if they live in one of the highest paying states for their field.Different states can pay significantly different wages to Audit Senior Managers depending on if they are in a high demand area for the skills of an Audit Manager.ur state by state breakdown allows you to see which state is best to get a job as an Audit Senior Manager. The salary information provided below is off of real-world job listings for Audit Senior Manager and the pay offered for those jobs. We source Indeed, Simply Hired, PayScale and GlassDoor.com.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":7519784,"ranking":6,"query_text":"how much does a audit senior make","passage_text":"How much does a Audit Manager make? The national average salary for a Audit Manager is $96,416 in United States. Filter by location to see Audit Manager salaries in your area. Salary estimates are based on 4,776 salaries submitted anonymously to Glassdoor by Audit Manager employees. Salaries for Related Job Titles","bm25_label":"high","relevance_label":1.0},{"query_id":1096257,"passage_id":3210155,"ranking":7,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Producer make? The average Senior Producer salary is $107,637. Filter by location to see Senior Producer salaries in your area. Salary estimates are based on 777 salaries submitted anonymously to Glassdoor by Senior Producer employees.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":5697849,"ranking":8,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Auditor make? The average Senior Auditor salary is $76,339. Filter by location to see Senior Auditor salaries in your area. Salary estimates are based on 12,524 salaries submitted anonymously to Glassdoor by Senior Auditor employees.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":4877504,"ranking":9,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Marketing Specialist make in Seattle?The average Senior Marketing Specialist salary is $73,795. In Seattle, a Senior Marketing Specialist can make $70,611, which is 4.3% lower than the national median. Filter by location to see Senior Marketing Specialist salaries in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":6409059,"ranking":10,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Process Engineer make in Seattle?The average Senior Process Engineer salary is $105,611. In Seattle, a Senior Process Engineer can make $108,026, which is 2.3% higher than the national median. Filter by location to see Senior Process Engineer salaries in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":8480197,"ranking":11,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Internal Auditor make in Seattle?The average Senior Internal Auditor salary is $83,423. In Seattle, a Senior Internal Auditor can make $80,442, which is 3.6% lower than the national median. Filter by location to see Senior Internal Auditor salaries in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":8714519,"ranking":12,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Benefits Specialist make in Seattle?The average Senior Benefits Specialist salary is $54,127. In Seattle, a Senior Benefits Specialist can make $64,546, which is 19.2% higher than the national median. Filter by location to see Senior Benefits Specialist salaries in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":7908444,"ranking":13,"query_text":"how much does a audit senior make","passage_text":"Deloitte Audit Senior Salaries. The typical Deloitte Audit Senior salary is $70,135. Audit Senior salaries at Deloitte can range from $49,784-$103,090. This estimate is based upon 1,441 Deloitte Audit Senior salary reports provided by employees. See all Audit Senior salaries to learn how this stacks up in the market.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":8468586,"ranking":14,"query_text":"how much does a audit senior make","passage_text":"As a senior software engineer, what can I do to make the jump Into management? If every company wants to hire senior software engineers, where do all these senior software engineers get their head start? How much does a senior software engineer make at Google? What is a Senior Software Engineer supposed to know?","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":4391696,"ranking":15,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Proposal Analyst make? These Glassdoor salary estimates are based on 19 reports of salaries, bonuses, wages, and hourly pay, submitted anonymously to Glassdoor by Senior Proposal Analyst employees.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":7520610,"ranking":16,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Associate make in Chandler, AZ? The average salary for a Senior Associate is $66,287 in Chandler, AZ. Salaries estimates based on 317 salaries submitted anonymously to Glassdoor by Senior Associate employees in Chandler, AZ. *Estimated Range","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":8468585,"ranking":17,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Software Engineer make?The average $112,394 salary is . Filter by location to see Senior Software Engineer salaries in your area. Salary estimates are based on Senior Software Engineer salaries submitted anonymously to Glassdoor by employees.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":4516477,"ranking":18,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Project Manager make? The average Senior Project Manager salary is $104,645. Filter by location to see Senior Project Manager salaries in your area. Salary estimates are based on 11,262 salaries submitted anonymously to Glassdoor by Senior Project Manager employees.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":4830070,"ranking":19,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Project Engineer make? The average Senior Project Engineer salary is $94,657. Filter by location to see Senior Project Engineer salaries in your area. Salary estimates are based on 2,120 salaries submitted anonymously to Glassdoor by Senior Project Engineer employees.","bm25_label":"high","relevance_label":0.0},{"query_id":1096257,"passage_id":5573129,"ranking":20,"query_text":"how much does a audit senior make","passage_text":"How much does a Senior Project Manager make? The average Senior Project Manager salary is $104,359. Filter by location to see Senior Project Manager salaries in your area. Salary estimates are based on 482 salaries submitted anonymously to Glassdoor by Senior Project Manager employees.","bm25_label":"high","relevance_label":0.0}]