[{"query_id":1096855,"passage_id":7462962,"ranking":1,"query_text":"how many pages is the coquette","passage_text":"The Coquette and The Boarding School , Hannah Webster Foster, Jul 14, 2011, Fiction, 356 pages. Hannah Webster Foster based The Coquette on the true story of Elizabeth Whitman, an unmarried. woman who died in childbirth in New England. Fictionalizing Whitman's experiences.","bm25_label":"high","relevance_label":1.0},{"query_id":1096855,"passage_id":7462954,"ranking":2,"query_text":"how many pages is the coquette","passage_text":"Themes that Run â\u0080\u009cTrueâ\u0080\u009d in The Coquette by Jessica Wolfer Revised by Erica Scott. As this book was based off of the true story of the actual circumstances of Elizabeth Whitmanâ\u0080\u0099s seduction and death, The Coquette (published in 1797) has many themes that held relevant to the issues facing woman of that time. The book was published as a teaching tool for women.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002653,"ranking":3,"query_text":"how many pages is the coquette","passage_text":"The Coquette. by Hannah Webster Foster. The Coquette Study Guide. Hannah Webster Foster wrote and published The Coquette under the pseudonym of A Lady of Massachusetts in 1797. The book, an epistolary novel (told through letters), became one of the most popular novels of the 18th century.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":8364917,"ranking":4,"query_text":"how many pages is the coquette","passage_text":"Under a first-look deal with ABC Studios, Coquette is currently producing Cougar Town with ABC for TBS. Other Coquette Productions include: Daisy Does America for TBS; Dirt for F\/X, Tripaholics for The Travel Channel and Celebrity Name Game for syndication. Additionally, Coquette has sold projects\/filmed pilots for UPN, FOX, CBS, HBO, Lifetime, MTV and Comedy Central.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":7462957,"ranking":5,"query_text":"how many pages is the coquette","passage_text":"Coquette (film) Coquette is a 1929 American Pre-Code drama film, starring Mary Pickford. The film was a box office success. For her role, Pickford won the second Academy Award for Best Actress.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002651,"ranking":6,"query_text":"how many pages is the coquette","passage_text":"For the Mexican film, see Coquette (1949 film). Coquette is a 1929 American Pre-Code drama film, starring Mary Pickford. The film was a box office success. For her role, Pickford won the second Academy Award for Best Actress.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":7462958,"ranking":7,"query_text":"how many pages is the coquette","passage_text":"Incidents in the Life of a Slave Girl (Dover Thrift Editions) Paperback. The Coquette: or, The History of Eliza Wharton (Dover Thrift Editions) Paperback. Charlotte Temple (Early American Women Writers) Paperback. The Power of Sympathy and the Coquette (Penguin Classics) Paperback.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":7462961,"ranking":8,"query_text":"how many pages is the coquette","passage_text":"Some may say the coquette is a tease, who cares more for herself than others, but it is this selfishness which draws people to her. Men are challenged by the coquette's independence, desiring to be the one to enslave herâ\u0080¦whilst it's far more likely he will become the victim.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002656,"ranking":9,"query_text":"how many pages is the coquette","passage_text":"I know the wrong, and yet the wrong pursue! - Hanna W. Foster, The Coquette (88) William Hill Brown's The Power of Sympathy (1789), Susanna Rowson's Charlotte Temple (1791), and Hannah Foster's The Coquette, are all examples of American novels concerned with sentiment, seduction and sorrow.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002648,"ranking":10,"query_text":"how many pages is the coquette","passage_text":"The Coquette was written as a book to teach others. The teaching has been portrayed through the many experiences that Eliza and the ones she loves go through during a time period where feelings for others were often disregarded when it came to marriage.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002649,"ranking":11,"query_text":"how many pages is the coquette","passage_text":"The Coquette. The Coquette tells the much-publicized story of the seduction and death of Elizabeth Whitman, a poet from Hartford, Connecticut. Written as a series of letters--between the heroine and her friends and lovers--it describes her long, tortuous courtship by two men, neither of whom perfectly suits her.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002655,"ranking":12,"query_text":"how many pages is the coquette","passage_text":"The themes in The Coquette seem to add to the bookâ\u0080\u0099s plot. They tie in the feelings of Eliza and family together and the themes run deep, adding emotion to the story line. The experiences that Eliza and her friends and family go through in this story unravel many lessons that are included within the books themes.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":5403117,"ranking":13,"query_text":"how many pages is the coquette","passage_text":"How many pages is 500 words? 1.1 pages How many pages is 600 words? 1.3 pages How many pages is 750 words? 1.8 pages How many pages is 800 words? 1.8 pages How many pages is 1000 words? 2.2 pages How many pages is 1200 words? 2.7 pages How many pages is 1500 words? 3.3 pages","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":4090752,"ranking":14,"query_text":"how many pages is the coquette","passage_text":"The Power of Sympathy and The Coquette 2 out of 5 based on 0 ratings. 1 reviews.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":6425227,"ranking":15,"query_text":"how many pages is the coquette","passage_text":"How many words is 1 page? 450 words How many words is 2 page? 900 words How many words is 3 page? 1350 words How many words is 4 page? 1800 words How many words is 5 page? 2250 words How many words is 6 page? 2700 words How many words is 7 page? 3150 words How many words is 8 page? 3600 words How many words is 10 page? 4500 words How many words is 12 page? 5400 words How many words is 15 page? 6750 words","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":5688922,"ranking":16,"query_text":"how many pages is the coquette","passage_text":"In the teens and early twenties, many Effanbee dolls were composition copies of popular German bisque head dolls, like Grumpy, who was produced in several sizes and variations. The doll at left is Baby Grumpy. Coquette is another copy of a German bisque doll. The same doll was also sold as Naughty Marietta.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":7462960,"ranking":17,"query_text":"how many pages is the coquette","passage_text":"As is evident by the end of the story, The Coquette is a commentary on societyâ\u0080\u0099s assignments, expectations, and perceptions of the woman and her role in Colonial America. This in and of itself is not ground breaking.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":7462963,"ranking":18,"query_text":"how many pages is the coquette","passage_text":"the coquette; or, the history of eliza wharton; a novel; founded on fact. by a lady of massachusetts. [hannah webster foster] boston: printed by samuel etheridge, for e. larkin, no. 47, cornhill. 1797.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002652,"ranking":19,"query_text":"how many pages is the coquette","passage_text":"Eliza Wharton (as Whitman is called in the novel) wavers between Major Sanfo The Coquette tells the much-publicized story of the seduction and death of Elizabeth Whitman, a poet from Hartford, Connecticut.","bm25_label":"high","relevance_label":0.0},{"query_id":1096855,"passage_id":3002654,"ranking":20,"query_text":"how many pages is the coquette","passage_text":"From the Back Cover. The Coquette, one of the two 'best-selling' American novels of the 18th century, tells the much-publicized story of the seduction and death of Elizabeth Whitman, a poet from Hartford, Connecticut.","bm25_label":"high","relevance_label":0.0}]