[{"query_id":1096211,"passage_id":7990872,"ranking":1,"query_text":"how much does a paddle boat","passage_text":"How Does Paddle Wheel Boats Work. Paddle-wheel boats, which are typified by 19th-century paddle-powered steamships, are a unique historical form of marine transportation. Their method of propulsion is what makes them stand out, with momentum provided by a rotating drum fitted with paddleboards.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7523960,"ranking":2,"query_text":"how much does a paddle boat","passage_text":"On average, a brand new paddle boat is going to cost anywhere from $400 to as much as $1,200. For example, at Dickâ\u0080\u0099s Sporting Goods, their paddle boats range anywhere from $400 to as much as $1,200. Walmart, on the other hand, has a variety of paddle boats that range anywhere from $350 to as much as $1,200.","bm25_label":"high","relevance_label":1.0},{"query_id":1096211,"passage_id":7990880,"ranking":3,"query_text":"how much does a paddle boat","passage_text":"Paddle boats are easy to use and are fun for the whole family. Many people are happy somebody built the paddle boat for their family to use but have no idea how paddle boats work. A paddle boat is a watercraft powered by the people who are pedaling.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7990879,"ranking":4,"query_text":"how much does a paddle boat","passage_text":"Many people are happy somebody built the paddle boat for their family to use but have no idea how paddle boats work. 1  A paddle boat is a watercraft powered by the people who are pedaling. The paddle boat is steered right or left depending on the amount of pressure on the left or right pedals.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7990877,"ranking":5,"query_text":"how much does a paddle boat","passage_text":"Many people are happy somebody built the paddle boat for their family to use but have no idea how paddle boats work. 1  A paddle boat is a watercraft powered by the people who are pedaling. 2  A paddle boat is a watercraft driven by a wheel with large, flat surfaces extending perpendicularly from the center of the wheel.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":2643578,"ranking":6,"query_text":"how much does a paddle boat","passage_text":"All paddle boats are designed to have a maximum speed. This maximum speed is usually only a couple miles per hour, which makes the paddle boat safe for the whole family. When you reach the maximum speed, it no longer matters how fast you pump the pedals. You will not make the paddle boat go faster.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7523964,"ranking":7,"query_text":"how much does a paddle boat","passage_text":"A common instruction when you are learning to paddle is to plant your paddle like you are putting it into concrete and pull the boat to the paddle. Fortunately, water is not concrete, but the fact that it isn't does cause some problems. When you pull on your paddle it starts to move the water.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7876882,"ranking":8,"query_text":"how much does a paddle boat","passage_text":"Boat insurance covers you in the event of a loss or damage to your boat. It covers most watercraft with motors, including fishing boats, pontoon boats, paddle boats, leisure crafts and yachts. Boat insurance does not usually cover canoes, kayaks or personal watercrafts (PWCs).","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7506924,"ranking":9,"query_text":"how much does a paddle boat","passage_text":"What Is Boat Insurance? Boat insurance covers you in the event of a loss or damage to your boat. It covers most watercraft with motors, including fishing boats, pontoon boats, paddle boats, leisure crafts and yachts. Boat insurance does not usually cover canoes, kayaks or personal watercrafts (PWCs).","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7990874,"ranking":10,"query_text":"how much does a paddle boat","passage_text":"What is the homophone for a paddle to move a boat through the water? What is the cost of renting a paddle boat at como park? In 2011, the paddle boats are $17\/hour, cash only. 4 people can fit in a boat, and all life jackets are included. There must be at least one adult (18+) in the boat.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":2380155,"ranking":11,"query_text":"how much does a paddle boat","passage_text":"Join Fontana Sports employee, Jaci Hausman who has been paddling solo for 40 years as she shares how to unload, carry and load your boat as well as some basic on the water paddling instruction. Free Shipping is available on most orders over $99 to the Continental U.S., but does not apply to some oversized items. Orders under $99 are subject to the following shipping rates: Shipping Rates: USPS Priority: $7.95.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":2643580,"ranking":12,"query_text":"how much does a paddle boat","passage_text":"1 You will not make the paddle boat go faster.  Paddle boats are designed in a safe way to let a family have nearly complete control of the vessel. The boat is so simply designed it makes a family feel like they are safe and in control of the watercraft. This is the beauty of the paddle boat. It is safe and fun.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":3899529,"ranking":13,"query_text":"how much does a paddle boat","passage_text":"Paddle boats, as opposed to oar boats, are run by everyone in the raft. Each person has a paddle, and the working as a team, the group maneuvers the boat down the river. Paddle boats are primarily run without frames, although for overnight trips a frame can be mounted in the middle of the raft to carry equipment.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":2643577,"ranking":14,"query_text":"how much does a paddle boat","passage_text":"How to Make a Toy Paddle Boat. by Liska Myers | Jul 23, 2014 | DIY Toys, Seasonal, Summer, Wooden Toys | 1 comment. For a while, Budster has been enjoying a book about a little tugboat, and summer seemed like a perfect time to give him his first boat, so we got some wood cutouts together and made him a toy paddle boat.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":5234797,"ranking":15,"query_text":"how much does a paddle boat","passage_text":"Steamboats. In 1807, Robert Fulton launched the world's first steamboat. It could move a boat against the current in a river by a large paddle wheel that turned in the water. The paddle wheel attached to the back of the boat was powered by a steam engine aboard the boat.teamboats. In 1807, Robert Fulton launched the world's first steamboat. It could move a boat against the current in a river by a large paddle wheel that turned in the water. The paddle wheel attached to the back of the boat was powered by a steam engine aboard the boat.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":7523963,"ranking":16,"query_text":"how much does a paddle boat","passage_text":"Pedal Boats; Fishing Boats; Dinghies; Accessories. Canoe Accessories; Dinghy Accessories; Fishing Boat Accessories; Paddleboard Accessories; Pedal Boat Accessories; Kayak Accessories. Bali 6 Paddle; Kayak Paddles; Parts","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":5891368,"ranking":17,"query_text":"how much does a paddle boat","passage_text":"Niedrige Preise, Riesen-Auswahl und kostenlose Lieferung ab nur â\u0082¬ 20. How much does the deadliest catch get paid. How much does a deckhand make like those. How much does discovery channel pay the.s greenhorn chris from the wizard on. $75,000 per boat for the Time Bandit, Northwestern, Cornelia Marie, and the Wizard. And $25,000 for the chase camera boats like the Sea Star.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":6527824,"ranking":18,"query_text":"how much does a paddle boat","passage_text":"Still, tandem boats are more versatile. It's easier for one person to paddle a tandem than it is to cram two adult paddlers into a solo pack canoe. That can be done, of course, but solo boats are best when paddledyou guessed itsolo. skilled paddler can paddle most tandem canoes or kayaks soloyou can buy solo seats to put in many tandem boats, in factbut there's always a price to pay. Tandem boats are designed to be paddled by two (or more) paddlers. When paddled solo, they can be sluggish and unresponsive.","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":3702461,"ranking":19,"query_text":"how much does a paddle boat","passage_text":"Freeman Lake park is a huge park in the middle of E-town. Nice looking park, but besides being a place to walk or paddle boat, there is not much to do there. The park is huge so there should be basketball courts, soccer fields, paddle boards for rent, volley ball courts and other outdoor activities to do. They dont even...","bm25_label":"high","relevance_label":0.0},{"query_id":1096211,"passage_id":3899531,"ranking":20,"query_text":"how much does a paddle boat","passage_text":"Oar Rafts and Paddle Rafts. A convenient way of classifying rafts is in terms of how they are powered: by oars or by paddles. In an oar boat, one person takes the oars and runs the rapids, making it a good choice for families. The oars are normally mounted to a solid frame lashed to the top of the raft's tubes.","bm25_label":"high","relevance_label":0.0}]