[{"query_id":1096943,"passage_id":3458025,"ranking":1,"query_text":"how many miles across is montana","passage_text":"How many miles wide ACROSS are the Outer Banks? kgb answers Â» Local & Lookup Â» Travel Info Â» How far is...(distances) Â» How many miles wide ACROSS are the Outer Banks? The Outer Banks is a mile wide and a hundred miles long.. It is 120 miles across.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":5995692,"ranking":2,"query_text":"how many miles across is montana","passage_text":"How Long Does It Take? The 69 mile long Beartooth Highway, which runs between Red Lodge, Montana and Cooke City, Montana takes anywhere from 2 to 3 hours for the typical visitor. This of course depends ultimately on how many times you stop to take in the view and take photos.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":1145369,"ranking":3,"query_text":"how many miles across is montana","passage_text":"Looking across the Dubois Badlands to Ramshorn Peak and the Absaroka Range. Yellowstone River and the far west side of the Absaroka Mountains in Paradise Valley Montana. The Absaroka Mountain Range is a sub-range on the eastern side of the Rocky Mountains stretching for about 150 miles across the Montana-Wyoming border.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":8543662,"ranking":4,"query_text":"how many miles across is montana","passage_text":"Harlem Montana. Like many of the Montana towns that seem to have been named by spinning a globe, Harlem, Montana, sits on the railroad. In this case, it is the Hi-Line, the BNSF railroad line that parallels US Highway 2 across northern Montana. Harlem sits across the Milk River from Fort Belknap, just outside of the Fort Belknap Indian Reservation.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":6494791,"ranking":5,"query_text":"how many miles across is montana","passage_text":"Vehicle: 2007 Honda Element EX 4dr SUV AWD (2.4L 4cyl 5M). I had this car for three years and about 32,000 miles, drove it across the country and in Montana for a year. The drive is good, not remarkable.ehicle: 2007 Honda Element EX 4dr SUV AWD (2.4L 4cyl 5M). I had this car for three years and about 32,000 miles, drove it across the country and in Montana for a year. The drive is good, not remarkable.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":2887606,"ranking":6,"query_text":"how many miles across is montana","passage_text":"Rocky Mountains. The Rocky Mountains form the longest mountain range in North America and the second longest range in the world. They stretch 3,000 miles north-to-south from New Mexico, across the United States to Montana, and well into Canada.he Rocky Mountains form the longest mountain range in North America and the second longest range in the world. They stretch 3,000 miles north-to-south from New Mexico, across the United States to Montana, and well into Canada.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":5884125,"ranking":7,"query_text":"how many miles across is montana","passage_text":"The sizes of the 50 states in square miles. (Read across row for state rank in each category.) Rank State Total sq miles State Land sq miles State Water sq miles; 1: Alaska: 656,424: Alaska: 570,374: Alaska: 86,051: 2: Texas: 268,601: Texas: 261,914: Michigan: 40,001: 3: California: 163,707: California: 155,973: Wisconsin: 11,190: 4: Montana: 147,046: Montana: 145,556: Louisiana: 8,277: 5: New Mexico: 121,598","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":3691421,"ranking":8,"query_text":"how many miles across is montana","passage_text":"What states are in the Rocky mountain region? Idaho, Montana, Wyoming, Nevada, Utah, and Colorado. How many states make up the Rocky Mountain regions? The Rockies extends over 3,000 miles and runs through 6 states:  Montana, Idaho, Wyoming, Utah, Colorado, and New Mexico. The  Rockies also run through 2 Canadian provinces:â\u0080¦ British Columbia and  Alberta.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":4257621,"ranking":9,"query_text":"how many miles across is montana","passage_text":"When the Minuteman III retires, the silos and launch facilities at Malmstrom Air Force Base in Montana, which oversees 150 nuclear ICBMs scattered across a 13,800 square miles, will have been buried for 70 years.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":4948866,"ranking":10,"query_text":"how many miles across is montana","passage_text":"Quick Answer. The Missouri River begins near Three Forks, Montana, and runs until it merges with the Mississippi River near St. Louis, Missouri. The Missouri River stretches out across 2,341 miles. Continue Reading.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":2192528,"ranking":11,"query_text":"how many miles across is montana","passage_text":"Glendive, Montana. Glendive is a city in and the county seat of Dawson County, Montana, United States. Glendive was established by the Northern Pacific Railway when they built the transcontinental railroad across the northern tier of the western United States from Minnesota to the Pacific Coast. The town was the headquarters for the Yellowstone Division that encompassed 875 route miles; 546 in main line and 328 in branches with the main routes from Mandan, North Dakota, to Billings, Montana, and from Billings to L","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":3962731,"ranking":12,"query_text":"how many miles across is montana","passage_text":"Rocky Mountains. The Rocky Mountains form the longest mountain range in North America and the second longest range in the world. They stretch 3,000 miles north-to-south from New Mexico, across the United States to Montana, and well into Canada.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":5771684,"ranking":13,"query_text":"how many miles across is montana","passage_text":"1 The average miles per gallon (MPG) 2  The gas tank size (how many gallons it will hold) 3  How many miles youâ\u0080\u0099ll travel (donâ\u0080\u0099t forget to account for alternate routes or pit stops along the way)  The average fuel price per gallon (keep in mind that fuel prices vary across the country)","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":3326768,"ranking":14,"query_text":"how many miles across is montana","passage_text":"How many miles across is Tennessee from east to west? On I-40 from NC border near Pigeon Forge to the AR border at Memphis, its about 450-455 miles. However, I-40 doesn't go exactly east west (towards Memphis it's northeast\/southâ\u0080¦west), so on the same latitude across, Tennessee is about 420-430 miles.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":5038400,"ranking":15,"query_text":"how many miles across is montana","passage_text":"Location: Wyoming, Idaho, and Montana. Established: March 1, 1872. Size: 2,221,766 acres. Yellowstone is a geological smoking gun that illustrates how violent the Earth can be. One event overshadows all others: Some 640,000 years ago, an area many miles square at what is now the center of the park suddenly exploded.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":3591965,"ranking":16,"query_text":"how many miles across is montana","passage_text":"Since the Montana animals are prolific in number, hunting is something that you can consider doing if that piques your interest. Hunting isn't for everyone, and many people choose to casually observe the Montana animals as opposed to tracking them. As for the Montana animals that you can see during your visit, the list is a long one. Horses, bears, deer, elk, moose, wolves, porcupines, and bats are among the mammals that you can expect to come across when looking for Montana wildlife.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":4171761,"ranking":17,"query_text":"how many miles across is montana","passage_text":"A ferocious wildfire had swallowed up many homes as it spread across more than 49 square miles of mountain and desert east of Los Angeles. Exactly how many, however, and to whom they belonged, remained uncertain.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":4703011,"ranking":18,"query_text":"how many miles across is montana","passage_text":"From across a freezing Montana battlefield on October 5, 1877, Chief Joseph of the Nez Perce rode into the camp of U.S. Army Colonel Nelson Miles and surrendered his rifle. â\u0080\u0098I am tired,â\u0080\u0099 he said. â\u0080\u0098My heart is sick and sad.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":1774812,"ranking":19,"query_text":"how many miles across is montana","passage_text":"255,000 acres. The oil, real estate, and ranching family bought 60,000-acre Dana Ranch in Montana earlier this year. Lay folks like to hear land measured in acres or square miles, but the Killiam prefer animal units â\u0080\u0094 the measure of how many cows an area can graze. Chalk up 3,000 animal units to the Dana Ranch.","bm25_label":"medium","relevance_label":0.0},{"query_id":1096943,"passage_id":5801751,"ranking":20,"query_text":"how many miles across is montana","passage_text":"Location: Wyoming, Idaho, and Montana. Established: March 1, 1872. Size: 2,221,766 acres. Yellowstone is a geological smoking gun that illustrates how violent the Earth can be. One event overshadows all others: Some 640,000 years ago, an area many miles square at what is now the center of the park suddenly exploded. In minutes the landscape was devastated.","bm25_label":"medium","relevance_label":0.0}]