[{"query_id":1097135,"passage_id":7438804,"ranking":1,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"Related Chevy Cruze Questions. What is the miles per gallon on the Chevy Cruze 2011? The 2011 Chevy Cruze gets 28 miles per gallon in the city, and 42 on the highway. ! How many gallons of gas does the 2011 Chevy Cruze hold? The 2011 Chevy Cruze has a 1.8 Liter engine that holds 18.1 gallons of gas. How many miles per gallon does a Chevy Cruze get? The Cruze LS gets 26 MPG city and 36 highway, The Cruze LT and LTZ get 36 MPG,... What is the max speed of a new 2012 manual Chevy Cruze? The top speed of the 2012 Chevrolet Cruz is 124 miles per hour. It has an MSRP... What is the miles per gallon on a Chevy Chevette","bm25_label":"high","relevance_label":1.0},{"query_id":1097135,"passage_id":4712990,"ranking":2,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"\/ what is the gas tank size of 1999 chevy tahoe 4wd 5.7 engine, how many gallon of gas will it hold? what is the gas tank size of 1999 chevy tahoe 4wd 5.7 engine, how many gallon of gas will it hold? what is the gas tank size of 1999 chevy tahoe 4wd 5.7 engine, how many gallon of gas will it hold? 2 Answers. Hello, It holds 30 gallons.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":7438803,"ranking":3,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"Topics: Science â\u0080º Math â\u0080º Chevy Cruze, Chevrolet, Automotive, Capacity & Volume. GREGORY BURKE. The 2012 Chevrolet Cruze LT and LTZ offer 36 MPG on the highway. The gas tank holds up to 15.6 gallons of fuel.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":6444468,"ranking":4,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"What size gas tank does my cruze have? We leased a 2013 chevy cruze its a basic car no extras came with onstar for six months free. Its a six cylinder car. What size gas tank does this car have and how much gas will it hold?","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":8257621,"ranking":5,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"Answers.com Â® WikiAnswers Â® Categories Cars & Vehicles American Cars Chevrolet Chevy Vans Chevy Astro How many gallons of gas does a Chevy 3500 express van holds? What would you like to do? Flag","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":8257620,"ranking":6,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"how many gallons of gas does my 1998 astro van hold? 4 answers. Been trying to figure out how big my gas tank is. Guessing might be 23 gallons. how many gallons of gas does my 1998 chevy astro van hold 1 answer. how many gallons will my 1993 van hold 1 answer I want to plan a road trip. I need to know how much gas my 1993 astro van holds so that I can anticipate how much money it will cost. I am driving one way, 333 miles.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":4219088,"ranking":7,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"Oil Change Interval Welcome to Chevy Cruze Forum : Chevrolet Cruze Forums â\u0080\u0093 General discussion forum for Chevy Cruze Welcome to Chevy Cruze Forum : Chevrolet Cruze Forums - a website dedicated to all things Chevy Cruze. You are currently viewing our forum as a guest, which gives you limited access to view most discussions and access our other features.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":8831563,"ranking":8,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"About Chevy Cruze Tires. The Chevy Cruze's 4-cylinder engine isn't the most powerful in the class, but this small compact car has a smooth ride, precise steering, and good fuel economy.e cooperate only with the best tire brands like Achilles, Bridgestone, BFGoodrich, and many others. All you need is to choose your Chevy Cruze tire size (16''-20''), type (all season\/winter\/summer), and subtype (including eco and all terrain).","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":3808223,"ranking":9,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"The actual range will vary depending on temperature, terrain, and driving style. After that the gas engine will kick in and allow the car to be driven an additional 344 miles on a full tank (9.3 gallons) of gas. [ad#post_ad-left-1-1]Q: How many miles per gallon will the Chevy Volt get? A: A bit of a trick question.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":5024362,"ranking":10,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"Related Questions. gas type with 2014 chevy cruze Lt Turbo 4 answers hi i just bought the 2014 cruze lt turbo1.4. it doesnt say LT1 or Lt2 so i am unsure Some paperwork says diesel some says regular gas but under the hood is a sticker that reads gasoline this has co...","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":5792144,"ranking":11,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"how many gallons in a tank of gas 1 answer. What is the gas mileage for a 2002 blazer with the 4.3 4+4 4 speed automatic 3 answers I have a 2002 blazer and want to know what the average GAS mileage is. is the gas tank steel or plastic 2 answers. How big is the gas tank in a 2004 chevy LL 1 answer Gas tank.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":8831565,"ranking":12,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"2012 Chevy Cruze Models. 1  2012 Chevy Cruze DIESEL Tires. 2  2012 Chevy Cruze ECO Tires. 3  2012 Chevy Cruze LS Tires. 4  2012 Chevy Cruze LT Tires.ince tires are the only thing that holds your vehicle on the road, they are an important aspect of safe driving. So, if your summer tires that you took off last year are all worn out,... $77.00 - $132.00 (ea). ACCELERAÂ® PHI-R. (0 reviews). # 22178366. PHI-R Summer \/ Performance Tires by AcceleraÂ®.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":548269,"ranking":13,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"Chevy Cruze Brakes, Rotors & Pads. Engineered for high-performance and spirited driving, our Chevy Cruze brakes are perfect for your subcompact hatchback. Your new Cruze brake rotors & pads are custom manufactured for a perfect replacement of your factory pads and rotors. Large diameter discs associated with these Chevy Cruze big brake kits enhance braking leverage.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":5658144,"ranking":14,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"how many gallons of gas does my 1998 chevy astro van hold 1 answer. I want to plan a road trip. I need to know how much gas my 1993 astro van holds so that I can anticipate how much money it will cost. I am driving one way, 333 miles. Gas roughly is $2.46 per gallo...","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":2817738,"ranking":15,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"How many miles per gallon does the 1993 Chevy Suburban get? The 1993 Chevy Suburban gets 11 miles per gallon when driving in the city. This model gets 16 miles per gallon on the highway.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":4722599,"ranking":16,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"Chevrolet partners with Roadtrippers.com on diesel Cruze 03\/31\/17. Judge allows Chevy Cruze Diesel emissions lawsuit to proceed 02\/15\/17. 2017 Chevrolet Cruze Diesel Sedan rated at 52mpg highway 02\/13\/17. GM expects Chevy Cruze Diesel to surpass 50 mpg 01\/10\/17.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":6885107,"ranking":17,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"You may also like... â\u0080\u0098 1 Car And Driverâ\u0080\u0099 Milks The New Chevy Cruze Diesel For 70 MPG. 2  Chevrolet Cruze Enthusiasts Descend On Lordstown Plant For Event. 3  2018 Chevy Cruze Gets New Exterior Color, Diesel Hatchback Model And More.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":6142652,"ranking":18,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"How many miles per gallon does 1998 Chevy Malibu get? A Chevy Malibu that was made in 1998 will get between 20 and 32  miles per gallon. The car will get around 23 country miles and 32  highway miles per gallon.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":6071084,"ranking":19,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"The redesigned 2016 Chevy Cruze Sedan will be getting a new sibling in the form of the 2017 Chevrolet Cruze Hatchback.","bm25_label":"high","relevance_label":0.0},{"query_id":1097135,"passage_id":1928197,"ranking":20,"query_text":"how many gallons of gas in a chevy cruze","passage_text":"If roominess is important to you, then the Malibu will probably come out on top. The Malibu offers more interior volume and more legroom for your passengers in the back. The cargo capacity of the Chevy Malibu is 16.3 cubic feet compared to the 15.0 cubic feet of the Chevy Cruze. 2015 Chevy Cruze.","bm25_label":"high","relevance_label":0.0}]