[{"query_id":1097100,"passage_id":7442259,"ranking":1,"query_text":"how many grams of fiber does applesauce have","passage_text":"Fiber in Applesauce. A 1-cup serving of unsweetened applesauce contains 2.7 grams of fiber, and the same serving of sweetened applesauce contains 3 grams of fiber. Any food with 2.5 to 4.9 grams of fiber per serving is considered a good source of fiber, according to the Colorado State University Extension. If you are counting calories, unsweetened applesauce, with 102 calories per serving, makes a better choice than the sweetened applesauce with 167 calories per serving.","bm25_label":"high","relevance_label":1.0},{"query_id":1097100,"passage_id":4083965,"ranking":2,"query_text":"how many grams of fiber does applesauce have","passage_text":"With 2.7 grams per cup, applesauce qualifies as a good source of fiber. While a 1-cup serving of unfortified applesauce provides slightly more potassium than a small apple, ounce for ounce, applesauce is lower in fiber, vitamin C and potassium than raw, whole apples.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":7442263,"ranking":3,"query_text":"how many grams of fiber does applesauce have","passage_text":"Women between the ages of 19 and 50 need 25 grams of fiber a day, and over the age of 51 need 21 grams of fiber a day, according to intake recommendations set by the Institute of Medicine. Uses for Applesauce. Applesauce makes a great snack choice, but there are a number of ways you can add it to your diet and increase your fiber intake.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":7414184,"ranking":4,"query_text":"how many grams of fiber does applesauce have","passage_text":"Carbs in Applesauce. The favorite choice for the term Applesauce is 1 snack size Applesauce Unsweetened which has about 13 grams of carbohydrate. The total carbohyrate, sugar, fiber and estimated net carbs (non-fiber carbs) for a variety of types and serving sizes of Applesauce is shown below.View other nutritional values (such as Calories or Fats) using the filter below:he total carbohyrate, sugar, fiber and estimated net carbs (non-fiber carbs) for a variety of types and serving sizes of Applesauce is shown below. View other nutritional values (such as Calories or Fats) using the filter below:","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":7414183,"ranking":5,"query_text":"how many grams of fiber does applesauce have","passage_text":"The favorite choice for the term Applesauce is 1 snack size Applesauce Unsweetened which has about 13 grams of carbohydrate.The total carbohyrate, sugar, fiber and estimated net carbs (non-fiber carbs) for a variety of types and serving sizes of Applesauce is shown below.View other nutritional values (such as Calories or Fats) using the filter below:he total carbohyrate, sugar, fiber and estimated net carbs (non-fiber carbs) for a variety of types and serving sizes of Applesauce is shown below. View other nutritional values (such as Calories or Fats) using the filter below:","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":1749167,"ranking":6,"query_text":"how many grams of fiber does applesauce have","passage_text":"How many calories does rice have? Full Answer An ear of sweet corn has just 0.5 gram of fat with less than 0.1 gram of saturated fat, and it boasts just 3 milligrams of sodium. It has 14.1 grams of carbohydrates and 1.3 grams of dietary fiber, which both translate to approximately 5 percent of a person's recommended daily intake.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":5530710,"ranking":7,"query_text":"how many grams of fiber does applesauce have","passage_text":"How many calories does pea soup have? The calories in pea soup will vary depending on whether or not it has been prepared with meat, such as ham or bacon. Generally speaking, one cup of pea soup contains around 185 calories, 4 grams fat, 27 grams carbohydrate, 4 grams fiber, 11 grams protein, and 965 mg sodium.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":3700408,"ranking":8,"query_text":"how many grams of fiber does applesauce have","passage_text":"RE: How many calories does a gram of carbohydrate have?How many calories does a gram of fat have? Source(s): calories gram carbohydrate havehow calories gram fat have: https:\/\/knowledge.im\/?s=calories+gram+ca...","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":7442258,"ranking":9,"query_text":"how many grams of fiber does applesauce have","passage_text":"Unsweetened Applesauce Giant Eagle 1\/2 cup 50.0 calories 13.0 grams carbs 0 grams fat 0 grams protein 2.0 grams fiber 0 mg cholesterol 0 grams saturated fat 10.0 mg sodium 0 grams sugar 0 grams trans fat","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":7413217,"ranking":10,"query_text":"how many grams of fiber does applesauce have","passage_text":"Common Questions About Peas. How many calories does pea soup have? The calories in pea soup will vary depending on whether or not it has been prepared with meat, such as ham or bacon. Generally speaking, one cup of pea soup contains around 185 calories, 4 grams fat, 27 grams carbohydrate, 4 grams fiber, 11 grams protein, and 965 mg sodium.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":504411,"ranking":11,"query_text":"how many grams of fiber does applesauce have","passage_text":"If you have constipation, a high-fiber diet can help. Try to eat 20 to 35 grams of fiber each day. Use food labels to tell how many grams of fiber are in foods you eat. The foods that have the most fiber are grains (especially bran), whole-grain breads and cereals, fruits, and vegetables.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":7442262,"ranking":12,"query_text":"how many grams of fiber does applesauce have","passage_text":"Fiber Content. A cup serving of unsweetened applesauce provides about 100 calories and 2.7 grams of fiber, or 11 percent of the daily value. Itâ\u0080\u0099s an especially good source of soluble fiber, the type that dissolves into a gel-like substance and helps maintain healthy blood sugar and cholesterol levels.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":5481819,"ranking":13,"query_text":"how many grams of fiber does applesauce have","passage_text":"In studies to date, LDL cholesterol can decrease by at most 18 percent by consuming roughly 30 grams of soluble fiber daily. The other type of fiber, insoluble fiber, is also in many healthy foods. While this type of fiber also appears to have many health benefits, it does not lower cholesterol levels.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":5860026,"ranking":14,"query_text":"how many grams of fiber does applesauce have","passage_text":"Fiber. Apples are rich in fiber, which is a type of carbohydrate, but fiber does not convert into glucose and does not have calories. A medium, 3-inch apple provides about 4.5 total grams of fiber, which is separate from the total grams of carbohydrates.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":6709775,"ranking":15,"query_text":"how many grams of fiber does applesauce have","passage_text":"How Many Carbohydrates in a Sweet Potato. Whatâ\u0080\u0099s amazing about sweet potatoes is that they have high fiber content. Technically, you can subtract the grams of fiber from the total amount of carbohydrates to get an idea of the net grams of carbohydrates that we use for energy.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":2158473,"ranking":16,"query_text":"how many grams of fiber does applesauce have","passage_text":"Apples are rich in fiber, which is a type of carbohydrate, but fiber does not convert into glucose and does not have calories. A medium, 3-inch apple provides about 4.5 total grams of fiber, which is separate from the total grams of carbohydrates.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":3260404,"ranking":17,"query_text":"how many grams of fiber does applesauce have","passage_text":"3. A 1-tablespoon serving of whole flaxseed contains a respectable 3 grams of fiber, both soluble and insoluble, and just 3 grams of carb -- but note that it does have 55 calories. How to incorporate flaxseed into your diabetes diet.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":1113169,"ranking":18,"query_text":"how many grams of fiber does applesauce have","passage_text":"How many grams of fiber is high fiber? A specific food is considered to be high in fiber if it contains 5 or more grams of fiber. The FDA recommends a daily intake of 20-30 grams of fiber (See FDA Webpage), so a hiâ\u0080¦gh fiber diet would constitute anything in the upper portion of that range.","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":1110461,"ranking":19,"query_text":"how many grams of fiber does applesauce have","passage_text":"How many grams of sugar does one big mac from Mcdonalds have? A Big Mac from McDonald's has 9 grams of sugar. It also contains 1040 milligrams... How many grams of sugar does McDonald's holiday pie have? the McDonald's Holiday Pie has 260 calories, and a whopping 150 mg of sodium,...","bm25_label":"high","relevance_label":0.0},{"query_id":1097100,"passage_id":246635,"ranking":20,"query_text":"how many grams of fiber does applesauce have","passage_text":"It is also called roughage, bulk, or unavailable carbohydrate. Fiber is provided through eating whole grains, fruit, and vegetables. To figure out how much fiber your child (age 3 - 18) needs, take the child's age and add 5. The sum is the number of grams of fiber your child should have each day. For example, for a 3-year-old child: 3 + 5 = 8 grams of fiber. What a high fiber diet does:","bm25_label":"high","relevance_label":0.0}]