[{"query_id":1097492,"passage_id":7409865,"ranking":1,"query_text":"average cost of stomach staple","passage_text":"The cost of a stomach stapling surgery may be high, but it may be covered by insurance. Cost of Stomach Stapling The cost of a stomach stapling surgery varies depending on several factors including the location, the fess of the surgeon, the time spent in the hospital and the type of anesthetic used.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":7409862,"ranking":2,"query_text":"average cost of stomach staple","passage_text":"Cost of Stomach Stapling. The cost of a stomach stapling surgery varies depending on several factors including the location, the fess of the surgeon, the time spent in the hospital and the type of anesthetic used. The costs of the surgery may vary between $ 17,000 and $50,000. The cost covers the administration of the anesthetic, the surgery, the fees of the surgeon, the hospital stay, the banding supplies and periodical checkups. Insurance Coverage. Stomach stapling is typically recommended only after other weight loss methods have failed.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":7409861,"ranking":3,"query_text":"average cost of stomach staple","passage_text":"The cost of stomach stapling will greatly depend on the type of surgical method, anesthesia fees, professional fees of the surgeon and medical team who are part of the surgical procedure (e.g., nurses and anesthesiologist), surgical location, post-surgical diagnosis and care, as well as the administrative costs and the like. The stomach stapling procedure generally costs as much as $20,000 to $55,000. It would be advisable to explore and research the total cost of stomach stapling, to compare prices for it varies from institution to institution and from place to place, and to determine if this kind of surgical procedure fits oneâ\u0080\u0099s budget. References:","bm25_label":"high","relevance_label":1.0},{"query_id":1097492,"passage_id":7409859,"ranking":4,"query_text":"average cost of stomach staple","passage_text":"During stomach stapling surgery, the surgeon will fit a band, similar to an adjustable band but without the adjustment capabilities, on the topmost portion of the personâ\u0080\u0099s stomach and use staples to staple the stomach in order to create a small pouch to hold food.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":1708160,"ranking":5,"query_text":"average cost of stomach staple","passage_text":"The types of gastrectomy procedures include: Partial gastrectomy is the removal of part of the stomach. Your doctor attaches your small intestine to the remaining healthy part of the stomach. Total gastrectomy is the removal of the entire stomach.Your doctor attaches the small intestine to the esophagus.Sleeve gastrectomy (also called vertical sleeve gastrectomy and stomach stapling) is the removal of a large part of the stomach to help with weight loss.Your doctor uses staples to create a smaller stomach and attaches the small intestine to the remaining stomach.1  Previous. 2  1.leeve gastrectomy (also called vertical sleeve gastrectomy and stomach stapling) is the removal of a large part of the stomach to help with weight loss. Your doctor uses staples to create a smaller stomach and attaches the small intestine to the remaining stomach. 1  Previous. 2  1.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":3139696,"ranking":6,"query_text":"average cost of stomach staple","passage_text":"The surgeon divides the stomach into a large portion and a much smaller one. Then, in a process sometimes called  stomach stapling ,â\u0080\u009d the small part of the stomach is sewn or stapled together to make a pouch, which can hold only a cup or so of food. With such a small stomach, people feel full quickly and eat less.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":7409863,"ranking":7,"query_text":"average cost of stomach staple","passage_text":"What is Stomach Stapling? Stomach stapling, a type of restrictive surgery, is a form of bariatric surgery (weight loss surgery) because it reduces the size of a personâ\u0080\u0099s stomach and leads to the restriction of the amount of food intake. It is a major form of surgical procedure that most obese people undergo.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":1666196,"ranking":8,"query_text":"average cost of stomach staple","passage_text":"Bananas, a major consumer staple item in the produce department, cost an average of 99 cents per pound at Whole Foods compared to about 70 to 80 cents a pound at competitors. Peanut butter, another major staple, cost almost twice as much at Whole Foods as at Safeway, $2.69 versus $1.79 for a 16-ounce jar.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":4461874,"ranking":9,"query_text":"average cost of stomach staple","passage_text":"Gastric bypass is a surgery that can help adults and some adolescents who are very obese (morbidly obese) lose weight. It involves attaching the stomach directly to the middle of the small intestine. This reduces the amount of calories and nutrients that are absorbed by the body. Gastric bypass surgery usually includes a stomach stapling procedure. Stomach stapling reduces the size of your stomach and the amount of food you can eat at one time.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":8483821,"ranking":10,"query_text":"average cost of stomach staple","passage_text":"There are several risks and complications of gastric sleeve surgery: 1  Leaking of the sleeve. The operation requires stapling inside the stomach, and there is always a chance that the staples wont hold, resulting in a leak. 2  Blood clots. 3  Weight may be regained over time, because the stomach can stretch.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":7322584,"ranking":11,"query_text":"average cost of stomach staple","passage_text":"Toast is an easy to digest food that may be a staple of a bland diet. Toast is often a staple of a bland diet. One reason for this is that it tends to be easy for the stomach and gut to digest.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":6152354,"ranking":12,"query_text":"average cost of stomach staple","passage_text":"5. 1. The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents.A person can visit the local shop of staples.. 0. The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents. Check out the official site of staples.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":7406092,"ranking":13,"query_text":"average cost of stomach staple","passage_text":"0. The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents.A person can visit the local shop of staples.. 1. The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents. A person can visit the local shop of staples.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":7406093,"ranking":14,"query_text":"average cost of stomach staple","passage_text":"5. 1. The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents. A person can visit the local shop of staples.. 1. The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents. A person can visit the local shop of staples.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":3730969,"ranking":15,"query_text":"average cost of stomach staple","passage_text":"Staplers are used to close both internal and skin wounds. Skin staples are usually applied using a disposable stapler, and removed with a specialized staple remover. Staplers are also used in vertical banded gastroplasty surgery (popularly known as stomach stapling).","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":321566,"ranking":16,"query_text":"average cost of stomach staple","passage_text":"The cost to print at staples varies from place to place .the.... The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents . A person can visit the local shop of staples.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":6368056,"ranking":17,"query_text":"average cost of stomach staple","passage_text":"There are several risks and complications of gastric sleeve surgery: 1  Leaking of the sleeve. 2  The operation requires stapling inside the stomach, and there is always a chance that the staples won t hold, resulting in a leak.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":3711255,"ranking":18,"query_text":"average cost of stomach staple","passage_text":"The average cost of feeding a family breakfast is 11.7 per cent higher today than it was one year ago, with the price of some staple items rising by over 40 per cent.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":6809950,"ranking":19,"query_text":"average cost of stomach staple","passage_text":"The cost to print at staples varies from place to place .the.... 6. 0. The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents.","bm25_label":"high","relevance_label":0.0},{"query_id":1097492,"passage_id":321567,"ranking":20,"query_text":"average cost of stomach staple","passage_text":"The cost to print at staples varies from place to place .The cost to print also depends on the size and quality of print. Normally the cost to print at staples in 10 to 15 cents . Check out the official site of staples .","bm25_label":"high","relevance_label":0.0}]