[{"query_id":1098044,"passage_id":7368552,"ranking":1,"query_text":"how long for chlorine to leave water","passage_text":"How long does it take for chlorine to dissipate from a gallon of tap water? How long does it take for chlorine to dissipate from a gallon of tap water? (self.askscience)","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":7368554,"ranking":2,"query_text":"how long for chlorine to leave water","passage_text":"It is commonly said that before you use tap water for plants, you must leave the tap water out in a glass to let the chlorine evaporate. Well, what is really happening here? Is chlorine in the left out tap water evaporating, or is it another process? How does the chlorine leave (if it actually does) the tap water?","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":8023099,"ranking":3,"query_text":"how long for chlorine to leave water","passage_text":"1) Ozone is over times faster to purify water. 2) Unlike chlorine, ozone leaves no harmful chlorinated by-products in the water, ozone quickly reverts back to pure oxygen if unused. 3) Chemical water treatment leaves long-term chemical effects on the environment, some of which are negative. Ozone does not.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":5628298,"ranking":4,"query_text":"how long for chlorine to leave water","passage_text":"When chlorine is added to water, another dissociation occurs. When we add Cl2 (chlorine) + H2O (water), we get a reaction which leaves us with HOCl (hypochlorous acid) + HCl (hydrochloric acid). How much of each is created is dependent on water temperature, cyanuric acid level and especially the water pH level. Hypochlorous acid is the active, killing form of chlorine.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":4792493,"ranking":5,"query_text":"how long for chlorine to leave water","passage_text":"When chlorine is added to water, another dissociation occurs. When we add Cl2 (chlorine) + H2O (water), we get a reaction which leaves us with HOCl (hypochlorous acid) + HCl (hydrochloric acid). How much of each is created is dependent on water temperature, cyanuric acid level and especially on water pH.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":5803536,"ranking":6,"query_text":"how long for chlorine to leave water","passage_text":"Sprinkle some chlorine bleach on the affected areas and leave it for some time to take effect. Then scrub it clean with a cloth and wash the entire surface with soap water to get rid of the mold. Tough and long lasting, chlorine bleach also fight the damp mold smell and is perfect for mold removal in bathrooms.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":3184527,"ranking":7,"query_text":"how long for chlorine to leave water","passage_text":"Chlorine used in tap water is non-volatile, so letting it sit out will only evaporate water. The chlorine will remain in the liquid water, leaving a solution that is actually MORE concentrated with chlorine compounds that can harm plants.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":7064962,"ranking":8,"query_text":"how long for chlorine to leave water","passage_text":"Chlorine is a disinfectant which is added to tap water in the United States. Chlorine can leave organic material like trihalomethanes and haloacetic acids in the water. The level of chlorine found is small, 1L of chlorinated water gives 0.2 mg of chlorine, which has not been found to cause any health problems.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":2648613,"ranking":9,"query_text":"how long for chlorine to leave water","passage_text":"When we add Cl2 (chlorine) + H2O (water), we get a reaction which leaves us with HOCl (hypochlorous acid) + HCl (hydrochloric acid). How much of each is created is dependent on water temperature, and especially on water pH. Hypochlorous acid is the active, killing form of chlorine.This is what does the real sanitizing work in your pool water. The chlorine molecule or ion kills microorganisms by slashing through the cell walls and destroying the inner enzymes, structures and processes.n its elemental state chlorine exists as a gas. Gas is available for swimming pool sanitation. It is very cheap, and is the purest form of chlorine with no binders or carriers. The percentage of available chlorine is 100%.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":6676324,"ranking":10,"query_text":"how long for chlorine to leave water","passage_text":"Peace Lilies also exhibit a sensitivity to chlorine in the water, and leaf tips and edges will turn brown in response. If your water supply is heavily chlorinated, leave a container of water sit out on the countertop overnight. Most of the chlorine will dissipate. Use that water for your Peace Lily.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":4657416,"ranking":11,"query_text":"how long for chlorine to leave water","passage_text":"The sum of these fourcompounds is referred to as TotalT rihalomethanes (TTHMs).Why and how are THMs formed?When chlorine is added to water with organicmaterial, such as algae, river weeds, and decay-ing leaves, THMs are formed.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":4164189,"ranking":12,"query_text":"how long for chlorine to leave water","passage_text":"Chloramine is a combination of chlorine and ammonia. When your municipal water supply uses Chloramine, you want to use a water conditioner which removes both chlorine and ammonia. Many of the water conditioners on the market ONLY remove the chlorine from your tap water leaving the harmful ammonia in your pond water.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":7368551,"ranking":13,"query_text":"how long for chlorine to leave water","passage_text":"Chlorine used in tap water is non-volatile, so letting it sit out will only evaporate water. The chlorine will remain in the liquid water, leaving a solution that is actually MORE concentrated with chlorine compounds that can harm plants. Edit: If your tap water is chlorinated instead of chloraminated, evaporation of the chlorine occurs when any two chloride ions collide with enough kinetic energy to form Cl2(g), dissipating into the air.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":5379686,"ranking":14,"query_text":"how long for chlorine to leave water","passage_text":"Re: How long should a 3 chlorine puck last? How long the tablet takes to dissolve all depends on how much water is passing over the tablet to erode it away. Tablets will last longer in a floater than they would in a skimmer basket or a tablet feeder.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":3252935,"ranking":15,"query_text":"how long for chlorine to leave water","passage_text":"Chlorine is produced by the electrolysis of salt water. When electricity is passed through 2NaCl (salt) and 2H20 (water), the atoms dissociate into Cl2 (chlorine) + 2NaOH (sodium Hydroxide) + H2 (Hydrogen). When using a salt chlorine generator on a pool, the pool chlorine is created by the salt cell, a stack of electrically charged plates. When power is applied to these cells, and salty water is pumped through the cell, chlorine is created instantly as the water leaves the salt cell and is pumped into the pool.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":4792490,"ranking":16,"query_text":"how long for chlorine to leave water","passage_text":"When using a salt chlorine generator on a pool, the pool chlorine is created by the salt cell, a stack of electrically charged plates. When power is applied to these cells, and salty water is pumped through the cell, chlorine is created instantly as the water leaves the salt cell and is pumped into the pool.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":6952407,"ranking":17,"query_text":"how long for chlorine to leave water","passage_text":"Clean your brick with a solution of chlorine bleach if you have mildew or mold problems. Mix chlorine bleach with water in a large bucket, using equal proportions. Pour the solution into a pump type garden sprayer, and pump it up. Wet a section of wall (or patio, if cleaning pavers) with a water hose. Spray the bleach solution on the surface, beginning at the top, on a wall, soaking it thoroughly. Allow the bleach solution to react with the stains for a few minutes, but do not leave it long enough for it to begin to dry.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":7699789,"ranking":18,"query_text":"how long for chlorine to leave water","passage_text":"After the applicable retention period, the heavily chlorinated water shall be flushed from the. main until the chlorine concentration in the water leaving the main is no higher than that. generally prevailing in that section of the distribution system, or less than 1 mg\/1.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":2648616,"ranking":19,"query_text":"how long for chlorine to leave water","passage_text":"Chlorine Addition Flow Chart. When chlorine is added to water, some of the chlorine reacts first with inorganic and organic materials and metals in the water and is not available for disinfection (this is called the chlorine demand of the water).he goal of dosage testing is to determine how much chlorine (sodium hypochlorite solution) to add to water that will be used for drinking to maintain free chlorine in the water for the average time of storage of water in the household (typically 4-24 hours).","bm25_label":"medium","relevance_label":0.0},{"query_id":1098044,"passage_id":4605527,"ranking":20,"query_text":"how long for chlorine to leave water","passage_text":"How long does water take to leave the stomach? I drank a lot of water like 15 minutes ago and I know it's best to exercise on an empty stomach. How long will the water take to leave my stomach so I can exercise?","bm25_label":"medium","relevance_label":0.0}]