[{"query_id":1098010,"passage_id":3064290,"ranking":1,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard is on the verge of signing with LA Galaxy GETTY IMAGES. Steven Gerrard has admitted that if Liverpool offered him a new contract last summer he would not be bringing an end to his long association with the club at the end of this season.teven Gerrard is on the verge of signing with LA Galaxy GETTY IMAGES. Steven Gerrard has admitted that if Liverpool offered him a new contract last summer he would not be bringing an end to his long association with the club at the end of this season.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6435476,"ranking":2,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"John Powell. Visit: Steven Gerrard with fellow Liverpool players at Alder Hey last Christmas. Liverpool star Steven Gerrard has donated half a million pounds raised from his testimonial match to a children's hospital.The Reds captain has been made a founding partner of the Alder Hey Childrenâ\u0080\u0099s Charity after the donation, which will help buy vital equipment.isit: Steven Gerrard with fellow Liverpool players at Alder Hey last Christmas. Liverpool star Steven Gerrard has donated half a million pounds raised from his testimonial match to a children's hospital.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":3064289,"ranking":3,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard is leaving Liverpool. Liverpool captain Steven Gerrard confirms plans to quit the club at the end of this season. Steven Gerrard has decided to bring the curtain down on a glittering career with Liverpool by announcing he will leave the club at the end of the season.Liverpool bloggers Steven Kelly and David Usher give their reaction to the news and ponder life after the iconic captain.iverpool captain Steven Gerrard confirms plans to quit the club at the end of this season. Steven Gerrard has decided to bring the curtain down on a glittering career with Liverpool by announcing he will leave the club at the end of the season.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":7372120,"ranking":4,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard has been with Liverpool for  11 years and he has as of October 19th, 2009 played 341 games and scored 74 goals.","bm25_label":"high","relevance_label":1.0},{"query_id":1098010,"passage_id":3064287,"ranking":5,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Liverpool great to leave Merseyside club â\u0080\u0093 Liverpool's talismanic midfielder, Steven Gerrard has announced he will leave the club at the end of the season after 17 years.iverpool great to leave Merseyside club â\u0080\u0093 Liverpool's talismanic midfielder, Steven Gerrard has announced he will leave the club at the end of the season after 17 years.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6435470,"ranking":6,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"How much does steven gerrard get paid a week. Steven Gerrard is reported to earn up to GBP 100,000 per week, which equates to GBP 5.2 million per year.He signed for Liverpool on August 01, 1998.ow much does steven gerrard get paid a week. Steven Gerrard is reported to earn up to GBP 100,000 per week, which equates to GBP 5.2 million per year.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":3064293,"ranking":7,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard has admitted that his decision to leave Liverpool at the end of the season when his contract expires was the toughest decision of his life.teven Gerrard has admitted that his decision to leave Liverpool at the end of the season when his contract expires was the toughest decision of his life.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":3064288,"ranking":8,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"The man speaks. Steven Gerrard has confirmed that he is to leave Liverpool at the end of the season, but he will not be retiring. Explaining his decision, Gerrard said: This has been the toughest decision of my life and one which both me and my family have agonised over for a good deal of time.iverpool captain Steven Gerrard is today set to announce that he will be leaving the club this summer. The Reds skipper will run down his contract with the Anfield club, and is already free to negotiate a Bosman deal with overseas clubs.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":3064285,"ranking":9,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Gerrard's career statistics Analysis:The making of Gerrard Feature:Where will he go? Background:History of the saga Steven Gerrard has told Liverpool he wants to leave Anfield after turning down a new 100,000-a-week contract.eports from Anfield suggest the club will not allow Gerrard to leave until he has submitted a formal transfer request. Gerrard delivered the news to Liverpool chief executive Rick Parry via his agent, Struan Marshall. And Parry reflected: The club has to be bigger than any individual.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":7372122,"ranking":10,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard. Steven George Gerrard (born 30 May 1980) is a retired English footballer, who currently manages the Liverpool U18s side. Gerrard spent the vast majority of his career at Liverpool F.C. since making his professional debut in 1998 and is widely regarded as one of the finest players to have played for the Anfield club. He was made Liverpool captain in 2003 by Gerard Houllier and held the armband for 12 years.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":3064292,"ranking":11,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Liverpool Captain Steven Gerrard lifts the European Cup in Istanbul in 2005 in the Champions League Final against AC Milan. Photo by Colin Lane. Steven Gerrard will announce on Friday that he is leaving Liverpool when his contract expires at the end of the season.The 34-year-old midfielder, who has devoted his entire glittering career to his boyhood club, has taken the agonising decision to cut his ties with the Reds and move abroad.hoto by Colin Lane. Steven Gerrard will announce on Friday that he is leaving Liverpool when his contract expires at the end of the season. The 34-year-old midfielder, who has devoted his entire glittering career to his boyhood club, has taken the agonising decision to cut his ties with the Reds and move abroad.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":7372114,"ranking":12,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven George Gerrard (born 30 May 1980) is a retired English footballer, who currently manages the Liverpool U18s side. Gerrard spent the vast majority of his career at Liverpool F.C. since...","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6435474,"ranking":13,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"About Steven Gerrard. English footballer, Steven George Gerrard has a net worth of $60 million. He plays for and captains Premier League club Liverpool. He also has 90 caps for the England national team.In January 2012, Gerrard signed a contract that will keep him at Liverpool for the rest of his playing days.The team captain will then take on an ambassadorial role for the club. The new deal is likely to keep his earnings at their previous level of Â£140,000 a week.n January 2012, Gerrard signed a contract that will keep him at Liverpool for the rest of his playing days. The team captain will then take on an ambassadorial role for the club. The new deal is likely to keep his earnings at their previous level of Â£140,000 a week.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6682393,"ranking":14,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard's Liverpool future looking increasingly uncertain with club unwilling to extend his current Â£140,000-a-week wages. 1  Steven Gerrard came on as a substitute in 1-0 win over Stoke City. 2  The 34-year-old's future at Liverpool becoming increasingly uncertain.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6682392,"ranking":15,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard has earned his net worth through his career playing Central mid-fielder\/second striker, as well as captain of the Premier League club Liverpool. He has often played the position as right winger as well. He was born in Whiston, Merseyside, England. Steven Gerrard's annual salary is $13 million.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6435478,"ranking":16,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"MLS expert Sean Wheelock believes that Steven Gerrard is headed for the Los Angeles Galaxy, after the midfielder revelead he'd be leaving Liverpool at the end of the season. Departing Liverpool star Steven Gerrard will join the LA Galaxy on an 18-month contract, a source close to the deal told ESPN FC's Jeff Carlisle.The defending Major League Soccer champions will add the midfielder after the Premier League season ends on a pro-rated deal worth $6 million (3.9 million pounds) a year.LS expert Sean Wheelock believes that Steven Gerrard is headed for the Los Angeles Galaxy, after the midfielder revelead he'd be leaving Liverpool at the end of the season. Departing Liverpool star Steven Gerrard will join the LA Galaxy on an 18-month contract, a source close to the deal told ESPN FC's Jeff Carlisle.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":3064284,"ranking":17,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"5 photos: Liverpool great to leave Merseyside club. Liverpool great to leave Merseyside club â\u0080\u0093 Gerrard has been at the heart of the action at Anfield ever since he made his first team debut debut in 1998.The 34-year-old (center), seen here during a Champions League match against Ludogorets in September, said Friday he will carry on playing but not in the Premier League.iverpool great to leave Merseyside club â\u0080\u0093 Liverpool's talismanic midfielder, Steven Gerrard has announced he will leave the club at the end of the season after 17 years.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6435472,"ranking":18,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"How much money does steven gerrard earn a week at liverpool f.c? Liverpool and England captain Steven Gerrard is thought to earn around Â£140,000 a week, and is believed to have a fortune of Â£15 million.He supplemented his income from advertising Persil, for which he earned Â£1.5 million, Pringles and Lucozade.e also earns Â£1 million a year from Adidas for wearing their boots and TV adverts. He lives in an eight bedroom mansion with his wife Alex Curran and their two children. Gerrard says that he hopes to continue playing for Liverpool beyond his current contract, which runs until the end of next season.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":3064286,"ranking":19,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Liverpool great to leave Merseyside club â\u0080\u0093 Gerrard has put in dozens of match-winning performances for Liverpool down the years and often on the biggest stages. Here he can be seen belting home a last-minute equalizer in the 2006 FA Cup final against West Ham.iverpool great to leave Merseyside club â\u0080\u0093 Liverpool's talismanic midfielder, Steven Gerrard has announced he will leave the club at the end of the season after 17 years.","bm25_label":"high","relevance_label":0.0},{"query_id":1098010,"passage_id":6682395,"ranking":20,"query_text":"how long has steven gerrard been with liverpool for","passage_text":"Steven Gerrard is an English footballer and is the captain of the  Liverpool Football team and plays on the England football team  also.","bm25_label":"high","relevance_label":0.0}]