[{"query_id":1098806,"passage_id":3363335,"ranking":1,"query_text":"how is the pancreas attached to the intestines?","passage_text":"1 the stomach, or remaining part thereof, is attached to the small intestine. 2  the tail of the pancreas is attached to the end of the small intestine.  the shortened remainder of the bile duct is attached to the small intestine.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":2196140,"ranking":2,"query_text":"how is the pancreas attached to the intestines?","passage_text":"In a pancreas transplant, the donor pancreas is attached to the small intestine with a portion of the donor's small intestine. Once the new donor pancreas is in place, it replaces the function of the diseases pancreas by releasing insulin and other enzymes into the gastrointestinal tract.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":3363337,"ranking":3,"query_text":"how is the pancreas attached to the intestines?","passage_text":"After this is completed, the surgeon must reconstruct what remains: 1  the stomach, or remaining part thereof, is attached to the small intestine. 2  the tail of the pancreas is attached to the end of the small intestine.  the shortened remainder of the bile duct is attached to the small intestine.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":3363334,"ranking":4,"query_text":"how is the pancreas attached to the intestines?","passage_text":"After this is completed, the surgeon must reconstruct what remains: 1  the stomach, or remaining part thereof, is attached to the small intestine.  the tail of the pancreas is attached to the end of the small intestine.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":6190586,"ranking":5,"query_text":"how is the pancreas attached to the intestines?","passage_text":"noun (plural mesenteries). A fold of the peritoneum which attaches the stomach, small intestine, pancreas, spleen, and other organs to the posterior wall of the abdomen. Example sentences. 1  For these studies, an incision was made in the abdomen, and the mesentery and small intestine were exteriorized. fold of the peritoneum which attaches the stomach, small intestine, pancreas, spleen, and other organs to the posterior wall of the abdomen. Example sentences. 1  For these studies, an incision was made in the abdomen, and the mesentery and small intestine were exteriorized.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":2928524,"ranking":6,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The pancreas produces digestive enzymes that digest __________. A small, slender structure that is attached to the large intestine and is dominated by lymphoid nodules is the __________. The reflex that occurs in the large intestine and promotes the movement of feces toward the anus is the __________.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":8425593,"ranking":7,"query_text":"how is the pancreas attached to the intestines?","passage_text":"organs closely attached to the abdominopelvic wall by the parietal peritoneum; includes the kidneys, adrenal glands, pancreas, parts of the intestines and the urinary bladder.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":3744942,"ranking":8,"query_text":"how is the pancreas attached to the intestines?","passage_text":"Hollow abdominal organs include the stomach, the small intestine, and the colon with its attached appendix. Organs such as the liver, its attached gallbladder, and the pancreas function in close association with the digestive tract and communicate with it via ducts.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":1504138,"ranking":9,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The pancreas is a small structure located near the stomach and attached to the wall of the small intestine. The pancreas has two major functions. It produces hormones to aid in the maintenance of a proper blood sugar (glucose) level. The hormones are secreted into the bloodstream. It also produces important enzymes to aid in the digestion of protein and fats (lipids). These enzymes travel from the pancreas to the small intestine through a small tube called the pancreatic duct. Hormonal or endocrine function (insulin and glucagon)","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":2928525,"ranking":10,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The pancreas produces digestive enzymes that digest __________. carbohydrates, lipids, proteins, and nucleic acids. 15. A small, slender structure that is attached to the large intestine and is dominated by lymphoid nodules is the __________.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":2686749,"ranking":11,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The pancreas is located behind your stomach and attached via ducts to both the gall bladder and the small intestines. Comprised of exocrine tissues and endocrine tissues, the pancreas is an important organ for two reasons: It both regulates blood sugar levels within the body and aids in the digestion of food.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":8387983,"ranking":12,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The pancreas is a 6-inch long organ located behind the stomach in the back of the abdomen. It is spongy and shaped somewhat like a fish, extended horizontally across the abdomen. The head of the pancreas is on the right side of the abdomen where the stomach is attached to the first part of the small intestine (the duodenum). The tail of the pancreas - its narrowest part - extends to the left side of the abdomen next to the spleen. The pancreas contains exocrine and endocrine glands that create pancreatic juices, hormones, and insulin.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":3688113,"ranking":13,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The second cause of side stitch is probably the most common. It's a stretching of the ligaments attached to the liver, pancreas, stomach, and intestines. These ligaments are put under stress when you walk vigorously. The bouncing action causes them to stretch, thereby causing pain.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":8391324,"ranking":14,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The pancreas is a large gland behind the stomach and next to the small intestine. The pancreas does two main things: 1  It releases powerful digestive enzymes into the small intestine to aid the digestion of food. 2  It releases the hormones insulin and glucagon into the bloodstream. 3  These hormones help the body control how it uses food for energy.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":1683208,"ranking":15,"query_text":"how is the pancreas attached to the intestines?","passage_text":"In this article. The pancreas is a large gland behind the stomach and next to the small intestine. The pancreas does two main things: 1  It releases powerful digestive enzymes into the small intestine to aid the digestion of food. 2  It releases the hormones insulin and glucagon into the bloodstream. 3  These hormones help the body control how it uses food for energy.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":59926,"ranking":16,"query_text":"how is the pancreas attached to the intestines?","passage_text":"In this article. The pancreas is a large gland behind the stomach and next to the small intestine. The pancreas does two main things: 1  It releases powerful digestive enzymes into the small intestine to aid the digestion of food.n this article. The pancreas is a large gland behind the stomach and next to the small intestine. The pancreas does two main things: 1  It releases powerful digestive enzymes into the small intestine to aid the digestion of food.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":3652755,"ranking":17,"query_text":"how is the pancreas attached to the intestines?","passage_text":"Best Answer: RIGHT UPPER QUADRANT: Liver, right kidney, colon, pancreas, gallbladder, large intestine. LEFT UPPER QUADRANT: Liver, spleen, left kidney, stomach, colon, pancreas, large intestine. MIDLINE: Aorta, pancreas, small intestine, bladder, spine. RIGHT LOWER QUADRANT:","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":6625227,"ranking":18,"query_text":"how is the pancreas attached to the intestines?","passage_text":"Pancreatitis is an inflammation of the pancreas. The pancreas is a large gland behind the stomach and close to the duodenum. The duodenum is the upper part of the small intestine. The pancreas secretes digestive enzymes into the small intestine through a tube called the pancreatic duct.","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":262012,"ranking":19,"query_text":"how is the pancreas attached to the intestines?","passage_text":"In the abdominal cavity upper quadrant is the spleen,Left kidney,stomach,most of the pancreas ,part of the colon and part of the small intestines the lower left quadrant is mo â\u0080¦ re of the colon,and more of the Small Intestines.   If you are talking about the outside of your hip (where you can feel the hip-bone knot), that bone is called the Greater Trochanter, an area where muscles attach â\u0080¦ that twist the leg both in and out...","bm25_label":"medium","relevance_label":0.0},{"query_id":1098806,"passage_id":1757977,"ranking":20,"query_text":"how is the pancreas attached to the intestines?","passage_text":"The pancreas is a large gland behind the stomach and next to the small intestine. It releases powerful digestive enzymes into the small intestine to aid the digestion of food. It releases the hormones insulin and glucagon into the bloodstream. These hormones help the body control how it uses food for energy.","bm25_label":"medium","relevance_label":0.0}]