[{"query_id":1099670,"passage_id":6492050,"ranking":1,"query_text":"how big can leopard tortoises get","passage_text":"How to Care for a Leopard Tortoise. The Leopard Tortoise, officially known as African Leopard Tortoise (Geochelone Pardalis) can grow to about 2 feet (0.6 m) long and can weigh up to 70 lbs with proper care (and good genes).They make wonderful pets and may live up to 80 years if kept healthy throughout their lives.he Leopard Tortoise, officially known as African Leopard Tortoise (Geochelone Pardalis) can grow to about 2 feet (0.6 m) long and can weigh up to 70 lbs with proper care (and good genes).","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":7236809,"ranking":2,"query_text":"how big can leopard tortoises get","passage_text":"Leopard tortoises get their name from the markings on their plastron that resemble the large cat with the same name. These markings make the leopard tortoise an attractive pet but one should consider more than just the looks of this large tortoise before deciding to care for one. Names for Leopard Tortoises","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":7236803,"ranking":3,"query_text":"how big can leopard tortoises get","passage_text":"Names for Leopard Tortoises. Size of Leopard Tortoises. On average, leopard tortoises reach about 10-18 inches long (with some subspecies growing to be up to 30 inches long) and weigh in at about 40-50 pounds (although some can weigh up to 70 pounds). The leopard tortoise is the second largest tortoise that is native to Africa (with the African spurred tortoise\/sulcata tortoise being the largest). Life Span of Leopard Tortoises Leopard tortoises live 50-100 years in the wild making them a pet that will most likely outlive you. Feeding Leopard Tortoises","bm25_label":"high","relevance_label":1.0},{"query_id":1099670,"passage_id":7236807,"ranking":4,"query_text":"how big can leopard tortoises get","passage_text":"1 Leopard Tortoise Availability. 2  Leopard Tortoise Size. 3  Leopard Tortoise Life Span. 4  Leopard Tortoise Caging. 5  Leopard Tortoise Lighting and Temperature. 6  Leopard Tortoise Food. 7  Leopard Tortoise Water. 8  Leopard Tortoise Handling and Temperament. 9  Breeding Leopard Tortoises and Egg Incubation.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":6388943,"ranking":5,"query_text":"how big can leopard tortoises get","passage_text":"Safari guides can help you find Africaâ\u0080\u0099s Big Five: lion, leopard, water buffalo, rhinoceros, and elephant. This tortoise lives in the savannas of Africa â\u0080\u0093 just like real leopards. Idiom(s)","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":7236812,"ranking":6,"query_text":"how big can leopard tortoises get","passage_text":"Leopard Tortoise Life Span. Leopard tortoises live between 50 and 100 years in the wild. Leopard Tortoise Caging. The preferred setup for adult leopard tortoises is outdoors. However, if you live in a climate too cold for such an enclosure, you may house the tortoise indoors. A pair of leopard tortoises can be kept in a 10 foot by 10 foot pen. The walls should be at least 18 inches high and may be made of wood, block or other material that prevents the tortoise from seeing through the wall.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":3644257,"ranking":7,"query_text":"how big can leopard tortoises get","passage_text":"The preferred setup for adult leopard tortoises is outdoors. However, if you live in a climate too cold for such an enclosure, you may house the tortoise indoors. A pair of leopard tortoises can be kept in a 10 foot by 10 foot pen.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":3211273,"ranking":8,"query_text":"how big can leopard tortoises get","passage_text":"Eggs laid by leopard tortoises in the more northerly parts of the range are not laid in a state of diapause and can be immediately placed in an incubator for development to begin. It can take five to 14 months for them to hatch.n 2000, importation of leopard tortoises into the U.S. was banned, due to the possibility of heartwater disease making its way to the U.S. on a leopard tortoise. It was feared that the tortoises may spread the African tick harboring the disease and infect the U.S. cattle, goat and sheep industry.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":2905363,"ranking":9,"query_text":"how big can leopard tortoises get","passage_text":"Overfeeding is a problem with this species in captivity. FEEDING LEOPARD AND SULCATA TORTOISES. For large savannah species, such as Geochelone sulcata (African spurred tortoise) or Geochelone pardalis (Leopard tortoise), grasses and hays are a critical dietary component.Aldabra and Galapagos tortoises also do extremely well on this type of diet.verfeeding is a problem with this species in captivity. FEEDING LEOPARD AND SULCATA TORTOISES. For large savannah species, such as Geochelone sulcata (African spurred tortoise) or Geochelone pardalis (Leopard tortoise), grasses and hays are a critical dietary component.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":8787191,"ranking":10,"query_text":"how big can leopard tortoises get","passage_text":"I believe leopard tortoises are somewhat similar, although the coloring is much different and leopard tortoises are the 5th largest tortoises in the world. Actually, none, s â\u0080¦ orry. Desert Tortoises are all too often carriers of Mycoplasma Agassizii and other tortoise species have no built in defense against that. believe leopard tortoises are somewhat similar, although the coloring is much different and leopard tortoises are the 5th largest tortoises in the world. Actually, none, s â\u0080¦ orry. Desert Tortoises are all too often carriers of Mycoplasma Agassizii and other tortoise species have no built in defense against that.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":2417753,"ranking":11,"query_text":"how big can leopard tortoises get","passage_text":"Table of Contents. 1  Leopard Gecko Introduction. 2  Leopard Gecko History. 3  How Big Do Leopard Geckos Get.  How to Tell How Old A Leopard Gecko 1  Is. How Long Do Leopard Geckos Live.  Leopard Geckos As 1  Pets. Finding the Sex of A Leopard 2  Gecko. Interesting Leopard Gecko  Facts.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":6457678,"ranking":12,"query_text":"how big can leopard tortoises get","passage_text":"How big does a desert tortoise get? The desert tortoise can weigh between 8 to 15 pounds and attain a length ranging from 9 inches to 15 inches.he desert tortoise can weigh between 8 to 15 pounds and attain a length ranging from 9 inches to 15 inches.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":6499766,"ranking":13,"query_text":"how big can leopard tortoises get","passage_text":"Add your answer. How big do tortoises get? 10 pionts for best answer!? my dad said that if i come up with the money i would get to get a tortoise. i want a russian tortoise or a red footed tortoise. i have a few questions that i really need answered. how much are they and where could i get them for cheaper?","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":4013681,"ranking":14,"query_text":"how big can leopard tortoises get","passage_text":"The Sulcata and Leopard Tortoise. The Sulcata and Leopard Tortoise. The African Tortoise site was created to provide a knowledge base for Sulcata and Leopard Tortoises keepers. The focus of this site, is to create a better understanding of these unique and often misunderstood animals. This information was amassed from experienced breeders and keepers and published references. This site is continuously updated. Check back often.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":7236810,"ranking":15,"query_text":"how big can leopard tortoises get","passage_text":"Leopard Tortoise (Stigmochelys [Geochelone] pardalis) The leopard tortoise is the second largest tortoise native to Africa. Only the African spurred tortoise is larger. Two subspecies are generally recognized. Stigmochelys pardalis babcocki is the most common species in the pet trade.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":7236811,"ranking":16,"query_text":"how big can leopard tortoises get","passage_text":"Bare ground is also required because tortoises dig in the dirt to lay eggs. Some rolling terrain is recommended. Leopard tortoises often bask on slopes to maximize sun exposure or dig into slopes to lay eggs. Adult leopard tortoises can be housed indoors in a stock tank, plastic pool or large tub. Although a pair of adult leopard tortoises could be maintained in an enclosure measuring 6 feet long, 4 feet wide and 1.5 feet tall, larger areas allow more time between cleaning and changing substrates.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":6499769,"ranking":17,"query_text":"how big can leopard tortoises get","passage_text":"This Site Might Help You. RE: how big do tortoises get? 10 pionts for best answer!? my dad said that if i come up with the money i would get to get a tortoise. i want a russian tortoise or a red footed tortoise. i have a few questions that i really need answered.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":6499771,"ranking":18,"query_text":"how big can leopard tortoises get","passage_text":"This Site Might Help You. how big do tortoises get? 10 pionts for best answer!? my dad said that if i come up with the money i would get to get a tortoise. i want a russian tortoise or a red footed tortoise. i have a few questions that i really need answered.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":195461,"ranking":19,"query_text":"how big can leopard tortoises get","passage_text":"1 Contribution. I believe leopard tortoises are somewhat similar, although the coloring is much different and leopard tortoises are the 5th largest tortoises in the world. Actually, none, sâ\u0080¦orry. Desert Tortoises are all too often carriers of Mycoplasma Agassizii and other tortoise species have no built in defense against that.","bm25_label":"high","relevance_label":0.0},{"query_id":1099670,"passage_id":3211278,"ranking":20,"query_text":"how big can leopard tortoises get","passage_text":"It is assumed that leopard tortoise eggs are temperature-sex determinate. This means that the incubation temperature of the eggs will determine the sex of the hatchlings. In many tortoise species, females are produced at the high end of the incubation temperature scale and males at the low end.I am not aware of any studies done with leopard tortoises, so I can't recommend a specific temperature to produce all females or all males.n 2000, importation of leopard tortoises into the U.S. was banned, due to the possibility of heartwater disease making its way to the U.S. on a leopard tortoise. It was feared that the tortoises may spread the African tick harboring the disease and infect the U.S. cattle, goat and sheep industry.","bm25_label":"high","relevance_label":0.0}]