[{"query_id":1099985,"passage_id":7204452,"ranking":1,"query_text":"heroic realism","passage_text":"His desire to be heroic is the poster's successful goal for its viewer. Heroic realism tricks people into feeling that glamorous sense of heroism and adrenaline to do something awe-inspiring for the country.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7204445,"ranking":2,"query_text":"heroic realism","passage_text":"Its characteristics are realism and the depiction of figures as ideal types or symbols, often with explicit rejection of modernism in art . Heroic realism is a term which has sometimes been used to describe art used as propaganda. Examples include the Socialist realism style associated with Communist regimes, and sometimes the similar art style associated with Fascism.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7204447,"ranking":3,"query_text":"heroic realism","passage_text":"Facebook Twitter Google+ LinkedIn Heroic realism is a term which has sometimes been used to describe art used as propaganda. Examples include the Socialist realism style associated with Communist regimes, and the very similar art style associated with Fascism.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7985849,"ranking":4,"query_text":"heroic realism","passage_text":"Social Realism, also known as Socio-Realism, is an artistic movement, expressed in the visual and other realist arts, which depicts social and racial injustice, economic hardship, through unvarnished pictures of life's struggles; often depicting working class activities as heroic. [1]","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7204446,"ranking":5,"query_text":"heroic realism","passage_text":"Heroic realism. is a term which has sometimes been used to describe art used as propaganda. Examples include the Socialist realism style associated with Communist regimes, and the very similar art style associated with Fascism. Its characteristics are realism and the depiction of figures as ideal types or symbols, often with explicit rejection of modernism in art (as â\u0080\u009cbourgeoisâ\u0080\u009d or â\u0080\u009cdegenerateâ\u0080\u009d).","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":8030929,"ranking":6,"query_text":"heroic realism","passage_text":"Verism is the artistic preference of contemporary everyday subject matter instead of the heroic or legendary in art and literature; it is a form of realism. The word comes from Latin verus.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7204448,"ranking":7,"query_text":"heroic realism","passage_text":"Heroic Realism is an art motif that is generally used as a propaganda strategy. It is popularly and efficiently used by communist\/socialist governments in order to control and sway the mentality of their people through emotional visual cues.","bm25_label":"high","relevance_label":1.0},{"query_id":1099985,"passage_id":7204450,"ranking":8,"query_text":"heroic realism","passage_text":"Heroic realism was also used during the Spanish Civil War, and Western democracies have used the style to promote their aims in times of war. Source: en.wikipedia.org Categorized: Art History, News","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7204451,"ranking":9,"query_text":"heroic realism","passage_text":"#6: Heroic Realism In Chapter 14 the material begins to delve more into the aspects of pictorial modernism. The event of the World War II greatly affected the usage of posters as vital tools of graphic communication.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":8030936,"ranking":10,"query_text":"heroic realism","passage_text":"Wiktionary(0.00 \/ 0 votes)Rate this definition: 1  verism(Noun) Presenting common, everyday subjects, specifically eschewing the heroic or legendary. 2  verism(Noun) A movement in the late 19th century, related to realism.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7204449,"ranking":11,"query_text":"heroic realism","passage_text":"Wednesday, November 7, 2012. #6: Heroic Realism. In Chapter 14 the material begins to delve more into the aspects of pictorial modernism. The event of the World War II greatly affected the usage of posters as vital tools of graphic communication.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":5443681,"ranking":12,"query_text":"heroic realism","passage_text":"Though Flemish artists of the 17th century had depicted peasants at work, Millet was the first painter to endow rural life with a dignity and monumentality that transcend realism, making the peasant an almost heroic figure. He became somewhat of a symbol to younger artists, to whom he gave help and encouragement.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7204444,"ranking":13,"query_text":"heroic realism","passage_text":"Heroic Realism is timeless; in this present age, aspects of it are still heavily used. For example, U.S. army commercials that showcase the galvanizing and benevolent acts of those in the army as cool, proud, and adventurous inspire many young people to join because they want to be respected, admired, and be apart of protecting the country as a hero.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7027320,"ranking":14,"query_text":"heroic realism","passage_text":"realism Meaning & Synonyms. What does realism mean? What is another word for realism? List of Alternate Words & Synonyms of realism. Meaning of realism with usage examples.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":2717423,"ranking":15,"query_text":"heroic realism","passage_text":"See words that rhyme with realism Thesaurus: All synonyms and antonyms for realism Spanish Central: Translation of realism Nglish: Translation of realism for Spanish speakers Britannica English: Translation of realism for Arabic speakers Britannica.com: Encyclopedia article about realism","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":6822102,"ranking":16,"query_text":"heroic realism","passage_text":"Anti-realism is defined in opposition to realism, and so it is natural to ask first what realism is and to arrive at a characterization of anti-realism on this basis. Sometimes, however, the positions put forward as competitors to realism provide us with clues as to what realism involves.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":4657022,"ranking":17,"query_text":"heroic realism","passage_text":"The term magical realism, as opposed to magic realism, first emerged in the 1955 essay Magical Realism in Spanish American Fiction by critic Angel Flores to refer to writing that combines aspects of magic realism and marvelous realism.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":6766514,"ranking":18,"query_text":"heroic realism","passage_text":"heroics definition, meaning, English dictionary, synonym, see also 'heroic age',heroic couplet',heroic stanza',heroic tenor', Reverso dictionary, English definition, English vocabulary","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":2406894,"ranking":19,"query_text":"heroic realism","passage_text":"Examples of realism in a sentence. 1  He has a sense of realism about what can be done to improve the economy. 2  The realism of her dream was alarming. 3  the stark realism of the play.","bm25_label":"high","relevance_label":0.0},{"query_id":1099985,"passage_id":7985850,"ranking":20,"query_text":"heroic realism","passage_text":"See also. 1  American realism. 2  Gabriel Bracho, exponent of the social realism artistic movement in Venezuela. 3  Kitchen sink realism. 4  Naturalism (art) 5  Realism.","bm25_label":"high","relevance_label":0.0}]