[{"query_id":1100094,"passage_id":7193391,"ranking":1,"query_text":"hassan amjad","passage_text":"The overall average patient rating of Dr. Hassan Amjad is Great. Dr. Hassan Amjad has been rated by 7 patients. From those 7 patients 3 of those left a comment along with their rating. The overall rating for Dr. Hassan Amjad is 4.4 of 5.0 stars.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":7193390,"ranking":2,"query_text":"hassan amjad","passage_text":"Visit Dr. Hassan Amjad, an internist & oncologist in Beckley, WV. Are you Dr. Amjad? Sign up for MD.com.","bm25_label":"high","relevance_label":1.0},{"query_id":1100094,"passage_id":7193388,"ranking":3,"query_text":"hassan amjad","passage_text":"About Dr. Hassan Amjad Dr. Hassan Amjad, MD, BS, FACP, FCCP, MBBS is a Doctor primarily located in Beckley, WV, with another office in Oak Hill, WV. He has 47 years of experience. His specialties include Hematology and Oncology, Internal Medicine and Pulmonary Disease.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":7193394,"ranking":4,"query_text":"hassan amjad","passage_text":"Dr. Hassan Amjad is an internist in Beckley, WV. He is trained to treat & diagnose an extensive range of diseases & illnesses in adult patients.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":7193389,"ranking":5,"query_text":"hassan amjad","passage_text":"Internal Medicine An internist in Beckley, WV, Dr. Hassan Amjad specializes in the primary care of adults through diagnosis and treatment of cross-system illnesses that may affect multiple organic systems. Dr. Amjad may also refer patients to specialists when medically needed.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":7193392,"ranking":6,"query_text":"hassan amjad","passage_text":"Specialties. 1  Internal Medicine An internist in Beckley, WV, Dr. Hassan Amjad specializes in the primary care of adults through diagnosis and treatment of cross-system illnesses that may affect multiple organic systems. 2  Oncology As an oncologist, Dr. Amjad is trained to diagnose and treat all types and forms of cancer.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":7193393,"ranking":7,"query_text":"hassan amjad","passage_text":"Dr. Hassan Amjad is Board Certified in 4 specialties See the board certifications this doctor has received. Board certifications provide confidence that this doctor meets the nationally recognized standards for education, knowledge and experience.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":652374,"ranking":8,"query_text":"hassan amjad","passage_text":"Arabic Meaning: The name Amjad is an Arabic baby name. In Arabic the meaning of the name Amjad is: More gratifying. Muslim Meaning: The name Amjad is a Muslim baby name.In Muslim the meaning of the name Amjad is: Most glorious.Noble.n Arabic the meaning of the name Amjad is: More gratifying. Muslim Meaning: The name Amjad is a Muslim baby name. In Muslim the meaning of the name Amjad is: Most glorious. Noble.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":652379,"ranking":9,"query_text":"hassan amjad","passage_text":"[ 2 syll. a-mjad, am-j- ad ] The baby boy name Amjad is pronounced as aa-MJHaa-D â\u0080 . Amjad is used mostly in Arabic and Urdu. Its language of origin is Arabic.The meaning of Amjad is greater glory. The Arabic Amgad, the name Amjaad, and the Arabic Amjed are derivatives of Amjad. Amjad is uncommon as a baby boy name.It is not in the top 1000 names.mjad is used mostly in Arabic and Urdu. Its language of origin is Arabic. The meaning of Amjad is greater glory. The Arabic Amgad, the name Amjaad, and the Arabic Amjed are derivatives of Amjad. Amjad is uncommon as a baby boy name. It is not in the top 1000 names.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":652377,"ranking":10,"query_text":"hassan amjad","passage_text":"Name Amjad generally means Most excellent or Glorious, is of Iranian (Persian), Arabian, Indian origin, Name Amjad is a Masculine (or Boy) name.Person with name Amjad are mainly Muslim by religion. Name Amjad belongs to rashi Mesh (Aries) with dominant planet Mars (Mangal) .Find qualities of Aries (Mesh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Amjad or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Mesh (Aries) with other zodiac signs.ame Amjad belongs to rashi Mesh (Aries) with dominant planet Mars (Mangal) . Find qualities of Aries (Mesh) or Find Numerology, Lucky number, lucky days, lucky color, Auspicious stones for Amjad or Find Chinese zodiac sign or Birthstone for your birthday or Find compatibility of Mesh (Aries) with other zodiac signs.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":2277106,"ranking":11,"query_text":"hassan amjad","passage_text":"In many cases, though, they end up naming their kids as their own parents. like: Fadi(first name) Amjad(fatherâ\u0080\u0099s name) would call his kid: Amjad (first name)Fadi (fatherâ\u0080\u0099s name) Amjad(grand fatherâ\u0080\u0099s name) By the way, we name adjective names.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":652375,"ranking":12,"query_text":"hassan amjad","passage_text":"Amjad \/am-jad\/ [2 sylls.] as a boys' name is of Arabic origin, and the meaning of Amjad is greater glory.mjad is an uncommonly occurring first name for men but a very prominent last name for both adults and children (#63141 out of 150436, Top 42%). (2000 U.S. Census).","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":2856033,"ranking":13,"query_text":"hassan amjad","passage_text":"Arabic Meaning: The name Hassan is an Arabic baby name. In Arabic the meaning of the name Hassan is: Handsome. American Meaning: The name Hassan is an American baby name.In American the meaning of the name Hassan is: Handsome.Muslim Meaning: The name Hassan is a Muslim baby name.In Muslim the meaning of the name Hassan is: Handsome.he name Hassan is an American baby name. In American the meaning of the name Hassan is: Handsome. Muslim Meaning: The name Hassan is a Muslim baby name. In Muslim the meaning of the name Hassan is: Handsome.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":2422614,"ranking":14,"query_text":"hassan amjad","passage_text":"22 Sep, 2012 Bollywood, Featured 16,867 views 0. Akshara Hassan is beautiful sister of Shruti Hassan. Here are some exclusive childhood photos of Akshara Hassan with her sister Shruti Hassan and her father Kamal Hassan. Akshara Hassan with her father Kamal Hassan.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":2422608,"ranking":15,"query_text":"hassan amjad","passage_text":"Akshara Hassan Shruti Hassanâ\u0080\u0099s Sister Rare Photos. Akshara Hassan is beautiful sister of Shruti Hassan. Here are some exclusive childhood photos of Akshara Hassan with her sister Shruti Hassan and her father Kamal Hassan.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":7193387,"ranking":16,"query_text":"hassan amjad","passage_text":"Dr. Amjad may employ a variety of diagnostic tests such as biopsies, imaging tests, endoscopic tests and laboratory tests. He may offer treatment techniques such as chemotherapy or radiotherapy to combat the spread of cancer. Dr. Amjad may also provide emotional and palliative care, ensuring patients experience the highest quality of life possible.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":947014,"ranking":17,"query_text":"hassan amjad","passage_text":"A LEADING TEXTILE CLOTH PROCESSING UNIT. Saeed Fabrics Private Limited was established in 1984 in Faisalabad city, the Manchester of Pakistan. Mr.Shiekh Muhammad Amjad made the first chief executive officer of the company. With the efforts of Mr.Sheikh Muhammad Amjad had shown a high growth, and increased its capacity and market share considerably in last three decades.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":652380,"ranking":18,"query_text":"hassan amjad","passage_text":"Find Amjad meaning and definition at Hamariweb.com name dictionary a Best place to find your accurate name meanings in Urdu. Amjad name reviews, Origin, gender, rating an many more about Amjad.mjad nam merey mother ne rakha, Hussain mery Nana ne rakha, Naz mery teacher ne rakha. very attractive. Aoa,my techr nam is AMJAD MUSHTAQ,he is so cute n kind heartd persn,he is so nice.sincer n honest wd me,i like hr prsnalty,n hr cmpny,GOD bless him.Amjad is good nam.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":652383,"ranking":19,"query_text":"hassan amjad","passage_text":"Amjad nam merey mother ne rakha, Hussain mery Nana ne rakha, Naz mery teacher ne rakha. very attractive. Aoa,my techr nam is AMJAD MUSHTAQ,he is so cute n kind heartd persn,he is so nice.sincer n honest wd me,i like hr prsnalty,n hr cmpny,GOD bless him.Amjad is good nam.My teacher name is AMJAD MUSHTAQ,he is vry nice person.mjad nam merey mother ne rakha, Hussain mery Nana ne rakha, Naz mery teacher ne rakha. very attractive. Aoa,my techr nam is AMJAD MUSHTAQ,he is so cute n kind heartd persn,he is so nice.sincer n honest wd me,i like hr prsnalty,n hr cmpny,GOD bless him.Amjad is good nam.","bm25_label":"high","relevance_label":0.0},{"query_id":1100094,"passage_id":6916511,"ranking":20,"query_text":"hassan amjad","passage_text":"When is Hassan Rouhani's birthday? Hassan Rouhani was born on the 12th of November 1948, which was a Friday. Hassan Rouhani will be turning 70 in only 280 days from today. How old is Hassan Rouhani? Hassan Rouhani is 69 years old. To be more precise, the current age as of right now is 25287 days, 21 hours, 2 minutes and 15 seconds. What is Hassan Rouhani's zodiac sign?","bm25_label":"high","relevance_label":0.0}]