[{"query_id":1100687,"passage_id":6568117,"ranking":1,"query_text":"apartment cost in phoenix az","passage_text":"Distance from Scottsdale, AZ to Phoenix, AZ. There are miles from Scottsdale to Phoenix and miles by car. Scottsdale and Phoenix are far apart (by car). This is the best Scottsdale, AZ-Phoenix, AZ route.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":8541589,"ranking":2,"query_text":"apartment cost in phoenix az","passage_text":"Distance from Phoenix, AZ to Scottsdale, AZ. There are miles from Phoenix to Scottsdale and miles by car. Phoenix and Scottsdale are far apart (by car). This is the best Phoenix, AZ-Scottsdale, AZ route.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":1674319,"ranking":3,"query_text":"apartment cost in phoenix az","passage_text":"There are miles from Phoenix to Peoria and miles by car. Phoenix and Peoria are far apart (by car). This is the best Phoenix, AZ-Peoria, AZ route.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":6493071,"ranking":4,"query_text":"apartment cost in phoenix az","passage_text":"Distance from Reno, NV to Phoenix, AZ. There are miles from Reno to Phoenix and miles by car. Reno and Phoenix are far apart (by car). This is the best Reno, NV-Phoenix, AZ route.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":6634206,"ranking":5,"query_text":"apartment cost in phoenix az","passage_text":"Distance from Phoenix, AZ to Denver, CO. There are miles from Phoenix to Denver and miles by car. Phoenix and Denver are far apart (by car). This is the best Phoenix, AZ-Denver, CO route.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":7134310,"ranking":6,"query_text":"apartment cost in phoenix az","passage_text":"Official Phoenix apartments for rent. See photos, current prices, floor plans, and details for 5,076 apartments in Phoenix, AZ.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":7134314,"ranking":7,"query_text":"apartment cost in phoenix az","passage_text":"So, call us at 1-888-328-0192 to rent Phoenix apartments! Here are the Siegel Suites apartments for rent in Phoenix, Arizona: Siegel Suites Phoenix Apartments 1241 North 53rd Avenue Phoenix, AZ","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":8660424,"ranking":8,"query_text":"apartment cost in phoenix az","passage_text":"The gas prices for the cost to drive from Phoenix, AZ to Tecumseh, OK Has been Galculated: 15 this month. The gas prices for the cost to drive from Laveen, AZ to Phoenix, AZ Has been Galculated: 14 this month. The gas prices for the cost to drive from Phoenix, AZ to Flagstaff, AZ Has been Galculated: 14 this month.The gas prices for the cost to drive from Mesa, AZ to CA Brm Zip, CA Has been Galculated: 13 this month. The gas prices for the cost to drive from Phoenix, AZ to Scottsdale, AZ Has been Galculated: 13 this month.he gas prices for the cost to drive from Phoenix, AZ to Tecumseh, OK Has been Galculated: 15 this month. The gas prices for the cost to drive from Laveen, AZ to Phoenix, AZ Has been Galculated: 14 this month. The gas prices for the cost to drive from Phoenix, AZ to Flagstaff, AZ Has been Galculated: 14 this month.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":3935093,"ranking":9,"query_text":"apartment cost in phoenix az","passage_text":"As of June 2017, average apartment rent within the city of of Phoenix, AZ is $1064. One bedroom apartments in Phoenix rent for $936 a month on average and two bedroom apartment rents average $1139. See our listings of Phoenix Apartments.","bm25_label":"high","relevance_label":1.0},{"query_id":1100687,"passage_id":4224397,"ranking":10,"query_text":"apartment cost in phoenix az","passage_text":"More trip calculations. 1  driving time from Prescott, AZ to Phoenix, AZ. 2  cost of driving from Prescott, AZ to Phoenix, AZ. 3  reverse drive distance from Phoenix, AZ to Prescott, AZ. 4  halfway between Prescott, AZ and Phoenix, AZ. 5  hotels near Phoenix, AZ. 6  flight distance from Prescott, AZ to Phoenix, AZ.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":3935092,"ranking":11,"query_text":"apartment cost in phoenix az","passage_text":"Apartments for Rent in Phoenix, AZ . You searched for apartments in Phoenix, AZ. Let Apartments.com help you find the perfect rental near you. Click to view any of these 7,419 available rental units in Phoenix to see photos, reviews, floor plans and verified information about schools, neighborhoods, unit availability and more.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":5509006,"ranking":12,"query_text":"apartment cost in phoenix az","passage_text":"Las Vegas and Phoenix are far apart (by car). This is the best Las Vegas, NV-Phoenix, AZ route.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":6493074,"ranking":13,"query_text":"apartment cost in phoenix az","passage_text":"Distance from Reno, NV to Phoenix, AZ. There are miles from Reno to Phoenix and miles by car. Reno and Phoenix are far apart (by car).","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":8500215,"ranking":14,"query_text":"apartment cost in phoenix az","passage_text":"The cost of living is 36% lower in Phoenix, AZ. Housing costs 61% less in Phoenix, AZ hide details -.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":8660428,"ranking":15,"query_text":"apartment cost in phoenix az","passage_text":"The gas prices for the cost to drive from Phoenix, AZ to Denver, CO Has been Galculated: 46 this month. The gas prices for the cost to drive from Tucson, AZ to San Diego, CA Has been Galculated: 39 this month. The gas prices for the cost to drive from Phoenix, AZ to Seattle, WA Has been Galculated: 35 this month.he gas prices for the cost to drive from Phoenix, AZ to Tecumseh, OK Has been Galculated: 15 this month. The gas prices for the cost to drive from Laveen, AZ to Phoenix, AZ Has been Galculated: 14 this month. The gas prices for the cost to drive from Phoenix, AZ to Flagstaff, AZ Has been Galculated: 14 this month.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":8660423,"ranking":16,"query_text":"apartment cost in phoenix az","passage_text":"The gas prices for the cost to drive from Chandler, AZ to Phoenix, AZ Has been Galculated: 16 this month. The gas prices for the cost to drive from Tucson, AZ to Tucson, AZ Has been Galculated: 16 this month. The gas prices for the cost to drive from Oro Valley, AZ to Dana Point, CA Has been Galculated: 15 this month.he gas prices for the cost to drive from Phoenix, AZ to Tecumseh, OK Has been Galculated: 15 this month. The gas prices for the cost to drive from Laveen, AZ to Phoenix, AZ Has been Galculated: 14 this month. The gas prices for the cost to drive from Phoenix, AZ to Flagstaff, AZ Has been Galculated: 14 this month.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":5163863,"ranking":17,"query_text":"apartment cost in phoenix az","passage_text":"There are miles from Phoenix to San Antonio and miles by car. Phoenix and San Antonio are far apart (by car). This is the best Phoenix, AZ-San Antonio, TX route.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":695939,"ranking":18,"query_text":"apartment cost in phoenix az","passage_text":"More trip calculations. 1  driving distance from Phoenix, AZ to Durango, CO. 2  cost to drive from Phoenix, AZ to Durango, CO. 3  reverse driving time from Durango, CO to Phoenix, AZ. 4  halfway between Phoenix, AZ and Durango, CO. 5  places to stop from Phoenix, AZ to Durango, CO.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":3807461,"ranking":19,"query_text":"apartment cost in phoenix az","passage_text":"More trip calculations. 1  driving time from Phoenix, AZ to San Francisco, CA. 2  cost of driving from Phoenix, AZ to San Francisco, CA. 3  reverse drive distance from San Francisco, CA to Phoenix, AZ. 4  halfway between Phoenix, AZ and San Francisco, CA.","bm25_label":"high","relevance_label":0.0},{"query_id":1100687,"passage_id":2963366,"ranking":20,"query_text":"apartment cost in phoenix az","passage_text":"Phoenix Average Rent. As of August 2015, average apartment rent within 10 miles of Phoenix, AZ is $1074. One bedroom apartments in Phoenix rent for $878 a month on average and two bedroom apartment rents average $1116.See our listings of Phoenix Apartments.he average apartment rent over the prior 6 months in Phoenix has increased by $78 (7.8%). One bedroom units have increased by $84 (10.6%) and two bedroom apartments have increased by $60 (5.7%).","bm25_label":"high","relevance_label":0.0}]