[{"query_id":1100486,"passage_id":7153498,"ranking":1,"query_text":"foods that belong in the crisper","passage_text":"Should milk go in the side door? What foods actually belong in the crisper? And what are you supposed to do with the potpourri of condiment bottles, tubes and jars encroaching on everything else ... Skip to main content.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":7153489,"ranking":2,"query_text":"foods that belong in the crisper","passage_text":"Should milk go in the side door? What foods actually belong in the crisper? And what are you supposed to do with the potpourri of condiment bottles, tubes and jars encroaching on everything else stored within the cool confines of your refrigerator?","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":2580305,"ranking":3,"query_text":"foods that belong in the crisper","passage_text":"Comprehensive nutrition resource for Crispers Thai Chicken Flatbread. Learn about the number of calories and nutritional and diet information for Crispers Thai Chicken Flatbread. This is part of our comprehensive database of 40,000 foods including foods from hundreds of popular restaurants and thousands of brands.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":4121344,"ranking":4,"query_text":"foods that belong in the crisper","passage_text":"Now there is an amazing way to stop the sticking and say goodbye to burned food! Hereâ\u0080\u0099s introducing the Gotham Steel Crisper Tray, a new non-stick baking rack designed to fry food right in the oven! With the Gotham Steel Crisper Tray in your kitchen there will be no more sticky mess and no more burned food!","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":4121345,"ranking":5,"query_text":"foods that belong in the crisper","passage_text":"What is the Gotham Steel Crisper Tray? The Gotham Steel Crisper Tray is a new product on the market that enables you to â\u0080\u009cfryâ\u0080\u009d food without the frying mechanism. The device makes it easier for you to enjoy crispy and delicious food, without any oil, butters, fat, or grease.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":4121347,"ranking":6,"query_text":"foods that belong in the crisper","passage_text":"Copper Crisper is a crisping fryer that works in the oven. Read our Copper Crisper review plus additional product information. Copper Crisper is a crisping tray which allows you to make fried foods in the oven. The official product website is getcoppercrisper.com, which was registered in May 2016. The screen capture below shows the how the official website looked in July 2016.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":4121340,"ranking":7,"query_text":"foods that belong in the crisper","passage_text":"About Copper Crisper. Copper Crisper is a crisping tray which allows you to make fried foods in the oven. The official product website is getcoppercrisper.com, which was registered in May 2016. The screen capture below shows the how the official website looked in July 2016. Elevated mesh tray lets heat circulate. No need to turn food.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":3522880,"ranking":8,"query_text":"foods that belong in the crisper","passage_text":"Eggplants belong to the nightshade family of vegetables, which also includes tomatoes, sweet peppers and potatoes. They grow in a manner much like tomatoes, hanging from the vines of a plant that grows several feet in height.lace uncut and unwashed eggplant in a plastic bag and store in the refrigerator crisper where it will keep for a few days. If it is too large for the crisper, do not try to force it in; this will damage the skin and cause the eggplant to spoil and decay. Instead, place it on a shelf within the refrigerator.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":7153492,"ranking":9,"query_text":"foods that belong in the crisper","passage_text":"If you have high- and low-humidity settings (usually a simple toggle, or a small vent with a sliding door) on your crisper drawers, you can tailor the settings to match the type of produce you're keeping. If you don't have any controls on your drawers, it's still a crisper drawerâ\u0080\u0094it's just by default a high-humidity crisper. Most of the humidity inside a crisper is supplied by the produce itself, said Greg Evans, Director of Program Management for Food Preservation at Electrolux. The humidity setting refers to the amount of space in the drawers left open to airflow.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":5208042,"ranking":10,"query_text":"foods that belong in the crisper","passage_text":"Citrus fruit prefers even less moisture â\u0080\u0093 you can store oranges, lemons and grapefruit in a basket outside of the crispers in the main part of your refrigerator. Besides controlling humidity, crispers also offer the opportunity to separate foods that donâ\u0080\u0099t play well together.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":4121341,"ranking":11,"query_text":"foods that belong in the crisper","passage_text":"Great for all food. The Gotham Steel Crisper Tray is great fried chicken, bacon, mozzarella sticks, fish and chips, pigs in a blanket and so much more! Healthier cooking. Gotham Steel Crisper Tray requires no oil or butter so you consume less calories and less fat.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":8386780,"ranking":12,"query_text":"foods that belong in the crisper","passage_text":"Refrigerators have been around for decades! They should really spend more time reading about them on the internet.. Wouldn't want that. So here's a quick guide to crisper drawer food preservation, what you should store inside andâ\u0080\u0094more importantlyâ\u0080\u0094where. Fancy crisper drawer in the Liebherr CS1360...","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":3627369,"ranking":13,"query_text":"foods that belong in the crisper","passage_text":"Snickers Crispers Fun Size, 10.61 oz (300.8 g) Snickers Crispers Fun Size, 10.61 oz (300.8 g) FREE: You canâ\u0080\u0099t exercise your way out of a bad diet. FoodFacts shows you how to. change the way you eat, by showing you what's in the food you're eating.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":7923148,"ranking":14,"query_text":"foods that belong in the crisper","passage_text":"LG top-freezer refrigerators are packed with innovations from top to bottom. Discover all the state-of-the-art features including: Innovative crispers: With humidity-controlled crisper drawers and features like the full-width Glide Nâ\u0080\u0099 Serve Pantry Drawer, itâ\u0080\u0099s never been easier to keep all of your food organized and fresh.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":8386777,"ranking":15,"query_text":"foods that belong in the crisper","passage_text":"Join Our Newsletter. Most refrigerators feature one or two interior drawers called crisper drawers. The purpose of these drawers is to have a place inside the fridge that regulates humidity in addition to temperature. Store fruits, vegetables and meats in the drawers, and set the crisper setting -- ranging from high to low -- based on the contents of the drawer to maintain the freshness of the food items.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":4803453,"ranking":16,"query_text":"foods that belong in the crisper","passage_text":"While most pinot grigio's tend to be lighter bodied and crisper. Pinot Grigio is more of a quaffing wine that goes well with some cheeses, seafood and other lighter bodied foods. Chardonnay on the other hand can go with fuller bodied food like grilled chicken, pork, cream sauces, heavier cheese.hile most pinot grigio's tend to be lighter bodied and crisper. Pinot Grigio is more of a quaffing wine that goes well with some cheeses, seafood and other lighter bodied foods. Chardonnay on the other hand can go with fuller bodied food like grilled chicken, pork, cream sauces, heavier cheese.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":3522878,"ranking":17,"query_text":"foods that belong in the crisper","passage_text":"Eggplant, or aubergine as it is called in France, is a vegetable long prized for its beauty as well as its unique taste and texture. Eggplants belong to the plant family of Solanaceae, also commonly known as nightshades, and are kin to the tomato, bell pepper and potato.Eggplants grow in a manner much like tomatoes, hanging from the vines of a plant that grows several feet in height.lace uncut and unwashed eggplant in a plastic bag and store in the refrigerator crisper where it will keep for a few days. If it is too large for the crisper, do not try to force it in; this will damage the skin and cause the eggplant to spoil and decay. Instead, place it on a shelf within the refrigerator.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":4229411,"ranking":18,"query_text":"foods that belong in the crisper","passage_text":"Never store milk in the door of the refrigerator because this is the warmest part. Use crisper or vegetable drawers to store fruits and vegetables. These drawers are designed to preserve these foods at varying levels of humidity and make them last longer.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":3585426,"ranking":19,"query_text":"foods that belong in the crisper","passage_text":"Side by Side has abundant space for your favorite fresh and frozen foods. Large glass shelves a deli drawer humidity control crisper and adjustable door bins provide flexible organization for fresh foods. Built-in freezer door bins wire shelves and ... More + Product Details Close.","bm25_label":"medium","relevance_label":0.0},{"query_id":1100486,"passage_id":3273876,"ranking":20,"query_text":"foods that belong in the crisper","passage_text":"How long can a pie be left unrefrigerated? Power Outage? Hereâ\u0080\u0099s What to Do with All That Food in the Fridge; Proper Handling Of Produce In The Crisper(s) Proper Refrigeration Placement Of Raw Meat, Chicken, And Fish; Six Tips for Extending the Shelf Life of Foods; What Can and Can't Go In The Fridge Door; Other Tips. Microwave Cooking","bm25_label":"medium","relevance_label":0.0}]