[{"query_id":1100070,"passage_id":7195708,"ranking":1,"query_text":"head turner meaning","passage_text":"head-trip; head-turner; head-turners; head unit; head-up; head-up display; head-up-display; head-up-displays","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":7195712,"ranking":2,"query_text":"head turner meaning","passage_text":"head-to-wind; head tone; head trip; head-trip; head-turner; head-turners; head unit; head-up; head-up display; head-up-display","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":7195717,"ranking":3,"query_text":"head turner meaning","passage_text":"â\u0080\u0098For the moment the strutting ostriches are proving to be head-turners, especially in the case of children.â\u0080\u0099 â\u0080\u0098The car is a real head-turner, and will be available in bright colours to attract even more looks.â\u0080\u0099 â\u0080\u0098It's quite a head-turner and certainly draws a lot of amused smiles.â\u0080\u0099 â\u0080\u0098She was a voluptuous blonde bombshell, a head-turner who forged a career in movies and television.â\u0080\u0099 â\u0080\u0098If there's a bit of the extrovert in you, this could be your opportunity to be a real head-turner.â\u0080\u0099","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":7195709,"ranking":4,"query_text":"head turner meaning","passage_text":"Turner's syndrome; Turner, Ted; head-over-heels; Nathaniel Turner; t-ete-a-t-ete","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":7195711,"ranking":5,"query_text":"head turner meaning","passage_text":"head-turner (plural head-turners) Someone or something that catches the eye, the looks of whom\/which causes people to look much. Translations","bm25_label":"high","relevance_label":1.0},{"query_id":1100070,"passage_id":7195710,"ranking":6,"query_text":"head turner meaning","passage_text":"head-turner definition: Noun (plural head-turners) 1. Someone or something that catches the eye, the looks of whom\/which causes people to look much....","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":7195713,"ranking":7,"query_text":"head turner meaning","passage_text":"Retrieved from https:\/\/en.wiktionary.org\/w\/index.php?title=head-turner&oldid=43815256","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":7195714,"ranking":8,"query_text":"head turner meaning","passage_text":"Synonyms for head turner at Thesaurus.com with free online thesaurus, antonyms, and definitions. Dictionary and Word of the Day.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":3697714,"ranking":9,"query_text":"head turner meaning","passage_text":"Turner \/turn-er\/ [2 sylls.] as a boys' name is of Middle English origin, and the meaning of Turner is wood-worker .Occupational name. Turning was a term for the use of a lathe, which was used in the 16th and 17th centuries for decorations on furniture. Painter JMW Turner. Kreatif forms: Turnerry, Turter.urner \/turn-er\/ [2 sylls.] as a boys' name is of Middle English origin, and the meaning of Turner is wood-worker .","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":3612976,"ranking":10,"query_text":"head turner meaning","passage_text":"Product Description. Stylish, fun and affordable. For families looking to hit the water in reliable and affordable style, the VX Deluxe is a certified head-turner. New for 2012, the highly-comfortable precision-stitched three-person saddle sits atop a stunning all-new metallic deck.or families looking to hit the water in reliable and affordable style, the VX Deluxe is a certified head-turner.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":1058463,"ranking":11,"query_text":"head turner meaning","passage_text":"Jump with Rope Turners. 1  1. Choose a longer rope. This rope should be long enough to easily go over the head of the jumper or jumpers while the turners stand a comfortable distance apart. 2  2. Jump after standing between the turners. Face one of them and place the rope to the right or left of your feet. 3  3. Run into the turning rope.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":7195716,"ranking":12,"query_text":"head turner meaning","passage_text":"(plural head-turners) Someone or something that catches the eye, the looks of whom\/which causes people to look much.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":3697717,"ranking":13,"query_text":"head turner meaning","passage_text":"If you are conducting some Turner family history research then you can view the Turner coat of arms and the name meaning and origin of the name as well as the meaning of symbols below.URNER. The name Turner in Ireland was brought to the country by settlers from both England and Scotland as early as the fifteenth century. Ulster was the main settlement point. It is also an abbreviation of the Scottish name Macinturner, or Mac and Tuirneir in Gaelic.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":5075830,"ranking":14,"query_text":"head turner meaning","passage_text":"Sylvester Turner, Mayor. Mayor Sylvester Turner serves as the Executive Officer of the City. As the City's chief administrator and official representative, the Mayor is responsible for the general management of the City and for seeing that all laws and ordinances are enforced. Administrative duties include the appointments, with Council approval, of department heads and persons serving on advisory boards.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":3928272,"ranking":15,"query_text":"head turner meaning","passage_text":"Owner of CNN. CNN is technically owned by Turner Broadcasting System, Inc. (TBS). This means that, unsurprisingly, CNN is owned by Ted Turner, who of course founded and owns the collection of cable networks. Today TBS owns many channels domestically and internationally, along with many popular websites (such as SI.com, NBA.com, etc.). Ted Turner. Turner is the man behind TBS and thus CNN.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":2450218,"ranking":16,"query_text":"head turner meaning","passage_text":"Potential photos and documents for Elmo Turner. Top record matches for Elmo Turner. Surname meaning for Turner. English and Scottish: occupational name for a maker of objects of wood, metal, or bone by turning on a lathe, from Anglo-Norman French torner (Old French tornier, Latin tornarius, a derivative of tornus â\u0080\u0098latheâ\u0080\u0099).","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":5500250,"ranking":17,"query_text":"head turner meaning","passage_text":"In the spring of 1997, Gerald Turner met with SMUâ\u0080\u0099s head of development, Bill Lively, to discuss the biggest fundraising campaign in the schoolâ\u0080\u0099s history, a five-year effort they hoped would net $300 million. â\u0080\u009cEither you are going to succeed at this,â\u0080\u009d Turner told Lively, â\u0080\u009cor both you and I are going to croak at the finish line.â\u0080\u009d.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":2181107,"ranking":18,"query_text":"head turner meaning","passage_text":"Turner is a name that came to England in the 11th century wave of migration that was set off by the Norman Conquest of 1066. Turner is a name for a lathe worker. The surname Turner was originally derived from the Old French verb tourneour, meaning to turn on a lathe. Such a craftsman would have fashioned basically cylindrical objects out of wood, metal, and bone.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":3697713,"ranking":19,"query_text":"head turner meaning","passage_text":"Turner is the 28th-most common surname in the United Kingdom. Early recordings of this surname include Ralph le Turner in the late 12th century. The earliest recorded spelling of this family name dates from 1180 for Warner le Turnur.he origin of the name comes from Old French Le meaning The and etourneau meaning starling, thus giving us LeTourneau (pronounced le turner). Over time the Le or L' was dropped and in nearly all cases the spelling of the remaining tourneau became Anglicised.","bm25_label":"high","relevance_label":0.0},{"query_id":1100070,"passage_id":3891200,"ranking":20,"query_text":"head turner meaning","passage_text":"Comedian Ralphie May is headed toward divorce. The Girth Of A Nation comic's wife Lahna Turner has filed for divorce after 10 years of marriage, according to TMZ.","bm25_label":"high","relevance_label":0.0}]