[{"query_id":1101714,"passage_id":396944,"ranking":1,"query_text":"definition, nepotism","passage_text":"Definition of nepotism in the AudioEnglish.org Dictionary. Meaning of nepotism. What does nepotism mean? Proper usage and pronunciation (in phonetic transcription) of the word nepotism. Information about nepotism in the AudioEnglish.org dictionary, synonyms and antonyms.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":5956720,"ranking":2,"query_text":"definition, nepotism","passage_text":"Nepotism Definition. Simply put, the definition of nepotism is favoring relatives. Nepotism in the workplace occurs when employers favor relatives in making employment decisions, with little to no regard for anything but kinship.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":2383437,"ranking":3,"query_text":"definition, nepotism","passage_text":"Define nepotism. nepotism synonyms, nepotism pronunciation, nepotism translation, English dictionary definition of nepotism. n. Favoritism shown or patronage granted to relatives, as in business. nepâ\u0080²oÂ·tist n. nepâ\u0080²oÂ·tisâ\u0080²tic , nepâ\u0080²oÂ·tisâ\u0080²tiÂ·cal adj. n favouritism shown to relatives...","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":1233814,"ranking":4,"query_text":"definition, nepotism","passage_text":"Nepotism definition, patronage bestowed or favoritism shown on the basis of family relationship, as in business and politics: She was accused of nepotism when she made her nephew an officer of the firm. Origin of nepotism.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":808396,"ranking":5,"query_text":"definition, nepotism","passage_text":"Freebase(3.00 \/ 1 vote)Rate this definition: Nepotism. Nepotism is favoritism granted to relatives regardless of merit. The word nepotism is from the Latin word nepos, nepotis, from which modern Romanian nepot and Italian nipote and Catalan nebot, nephew or grandchild are also descended.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":7640854,"ranking":6,"query_text":"definition, nepotism","passage_text":"Anti-nepotism definition, patronage bestowed or favoritism shown on the basis of family relationship, as in business and politics: She was accused of nepotism when she made her nephew an officer of the firm. Origin of nepotism. Italian.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":396939,"ranking":7,"query_text":"definition, nepotism","passage_text":"Nepotism Law and Legal Definition. In the business world, nepotism is the practice of showing favoritism toward one's family members or friends in economic or employment terms. For example, granting favors or jobs to friends and relatives, without regard to merit, is a form of nepotism.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":396942,"ranking":8,"query_text":"definition, nepotism","passage_text":"Nepotism Law and Legal Definition In the business world, nepotism is the practice of showing favoritism toward one's family members or friends in economic or employment terms. For example, granting favors or jobs to friends and relatives, without regard to merit, is a form of nepotism.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":396946,"ranking":9,"query_text":"definition, nepotism","passage_text":"nepotism definition, meaning, what is nepotism: the act of using your power or influence to get good jobs or unfair advantages forâ\u0080¦. Learn more.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":808397,"ranking":10,"query_text":"definition, nepotism","passage_text":"Freebase(3.00 \/ 1 vote)Rate this definition: Nepotism is favoritism granted to relatives regardless of merit. The word nepotism is from the Latin word nepos, nepotis, from which modern Romanian nepot and Italian nipote and Catalan nebot, nephew or grandchild are also descended.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":7640856,"ranking":11,"query_text":"definition, nepotism","passage_text":"Definition of nepotism - the practice among those with power or influence of favouring relatives or friends, especially by giving them jobs Definition of nepotism - the practice among those with power or influence of favouring relatives or friends, especially by giving them jobs dictionary thesaurus","bm25_label":"high","relevance_label":1.0},{"query_id":1101714,"passage_id":7640858,"ranking":12,"query_text":"definition, nepotism","passage_text":"Anti-nepotism definition, patronage bestowed or favoritism shown on the basis of family relationship, as in business and politics: She was accused of nepotism when she made her nephew an officer of the firm. See more.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":3165005,"ranking":13,"query_text":"definition, nepotism","passage_text":"Nepotism is defined as: patronage bestowed or favoritism shown on the basis of family relationship, as in business and politics.. Technically, the opposite of nepotism wouldâ\u0080¦ be anti-nepotism or an anti-nepotism policy..","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":1595275,"ranking":14,"query_text":"definition, nepotism","passage_text":"Nepotism is defined as: patronage bestowed or favoritism shown on the basis of family relationship, as in business and politics. Technically, the opposite of nepotism would â\u0080¦ be anti-nepotism or an anti-nepotism policy. Although not an absolute opposite, the word meritocracy is defined as A system in which advancement is based on individual ability or achievement. which is sufficiently contrasting to the meaning of nepotism.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":2383440,"ranking":15,"query_text":"definition, nepotism","passage_text":"Example sentences containing 'nepotism'. There is no room for nepotism or favouritism. Times, Sunday Times (2015)Opponents accuse him of corruption and nepotism. Times, Sunday Times (2010)Many people think this is negative because they confuse nepotism with corruption.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":396948,"ranking":16,"query_text":"definition, nepotism","passage_text":"Dictionary entry overview: What does nepotism mean? â\u0080¢ NEPOTISM (noun) The noun NEPOTISM has 1 sense: 1. favoritism shown to relatives or close friends by those in power (as by giving them jobs) Familiarity information: NEPOTISM used as a noun is very rare.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":7278249,"ranking":17,"query_text":"definition, nepotism","passage_text":"Corruption we all know does not yield to easy definition, thus writersâ\u0080\u0099 definitions have been. varied and divergent. Akinseye (2000) attempts at describing it as â\u0080\u0098mother of all crimesâ\u0080\u0099 and. identifies four forms of corruption as bribery, prebendalism, graft and nepotism.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":7411710,"ranking":18,"query_text":"definition, nepotism","passage_text":"There are many differences between nepotism and cronyism and the main difference between nepotism and cronyism is that nepotism means granting favoritism or assignments of close family member to any position either it is in politics, entertainment, business or religion.","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":1233812,"ranking":19,"query_text":"definition, nepotism","passage_text":"Nepotism can't be abolished in total, as it is a deep rooted problem that has been around since civilisation began. Nepotism: A recipe for disaster Nepotism takes a big share of employment in state facilities and institutions to such a degree that qualified people are prevented from jobs given to unqualified applicants. Legal Affairs minister says 'no' to nepotism in government hiring","bm25_label":"high","relevance_label":0.0},{"query_id":1101714,"passage_id":808395,"ranking":20,"query_text":"definition, nepotism","passage_text":"nepotism (countable and uncountable, plural nepotisms) The favoring of relatives or personal friends because of their relationship rather than because of their abilities. Nepotism can get you very far in the world if you've got the right connections.â\u0080\u008e.","bm25_label":"high","relevance_label":0.0}]