[{"query_id":1101670,"passage_id":7682611,"ranking":1,"query_text":"dennis franz where does he live","passage_text":"Dennis Franz is 73 years old and was born on 10\/28\/1944. Currently, he lives in Santa Barbara, CA; and previously lived in los angeles, CA and coeur d alene, ID. Sometimes Dennis goes by various nicknames including Dennis Franz Schalachta, Dennis F Schlachta, Franz Schlachta Dennis, Franz S Dennis, Denn S Franz, Dennis Franz Schlachta, Dennis F Franz. His political affiliation is currently a registered Republican Party.","bm25_label":"high","relevance_label":1.0},{"query_id":1101670,"passage_id":7682613,"ranking":2,"query_text":"dennis franz where does he live","passage_text":"Genres. 1  Dennis Franz on Howdy Doody, the first television show he became aware of as a child. 2  Cop\/Detective\/Mystery Series Dennis Franz on bringing authenticity to his role on N.Y.P.D. 3  Sports Dennis Franz on working on Bay City Blues.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":7682610,"ranking":3,"query_text":"dennis franz where does he live","passage_text":"Highlights. 1  Dennis Franz on the positive traits of his character, Andy Sipowicz. 2  Dennis Franz on his character, Andy Sipowicz on NYPD Blue; on the writing on the show. 3  Dennis Franz on the final episode of NYPD Blue. 4  Dennis Franz on the legacy of NYPD Blue. 5  Dennis Franz on the legacy of Hill Street Blues.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":1888841,"ranking":4,"query_text":"dennis franz where does he live","passage_text":"Dennis Franz. Learn More About Dennis Franz at Celebrity Nooz. BIRTH DATE: October 28, 1944, Maywood, Illinois. CLAIM TO FAME: He is best known for his role as Andy Sipowicz, a hard boiled police detective in the television series NYPD Blue. FAMILY LIFE: He has been married to Joanie Zeck since 1995.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":1888839,"ranking":5,"query_text":"dennis franz where does he live","passage_text":"Dennis Franz. Born October 28th, 1944, Chicago native Dennis Franz (originally Dennis Schlachta) spent 11 months in an airborne division during the Vietnam War. Afterwards, Franz became a postman -- and, by his own admission, not a very good one.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":1888835,"ranking":6,"query_text":"dennis franz where does he live","passage_text":"Dennis Franz. Biography: Born October 28th, 1944, Chicago native Dennis Franz (originally Dennis Schlachta) spent 11 months in an airborne division during the Vietnam War. Afterwards, Franz became a postman -- and, by his own admission, not a very good one.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":2339071,"ranking":7,"query_text":"dennis franz where does he live","passage_text":"Date of Birth: October 28, 1944. Ethnicity: German, possibly some Polish. Dennis Franz is an American actor. He starred on the television series NYPD Blue. His father, Franz Ferdinand Schlachta, was German, born in Wattenshield. His mother, Elenore\/Eleanor (Mueller), was born in Illinois, of German descent.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":1888837,"ranking":8,"query_text":"dennis franz where does he live","passage_text":"Died: Jan 1, 0001. Biography: Born October 28th, 1944, Chicago native Dennis Franz (originally Dennis Schlachta) spent 11 months in an airborne division during the Vietnam War. Afterwards, Franz became a postman -- and, by his own admission, not a very good one.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":5368444,"ranking":9,"query_text":"dennis franz where does he live","passage_text":"Steven Bochco's crime drama brought a new gravitas to the small screen with its gritty portrayal of New York cops whose personal lives are as complicated as their cases, especially when it comes to cantankerous Det. Andy Sipowicz (Dennis Franz).","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":7487488,"ranking":10,"query_text":"dennis franz where does he live","passage_text":"The term magical realism was coined around 1924 or 1925 by a German art critic named Franz Roh what he called magical realism was simply painting where real forms are combined in a way that does not conform to daily reality. In fact, what Franz Roh calls magical realism is simply Expressionist painting.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":3723168,"ranking":11,"query_text":"dennis franz where does he live","passage_text":"One of Cranston's competitors for the award was Rylance for his performance in Richard III. With his fourth Emmy Award victory for his performance on Breaking Bad (2008), he tied the record of Dennis Franz (NYPD Blue (1993)) for the most wins in the category Outstanding Actor in a Drama Series.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":1888843,"ranking":12,"query_text":"dennis franz where does he live","passage_text":"Dennis Franz Schlachta (\/frÉ\u0091Ë\u0090nz\/; born October 28, 1944), known professionally as Dennis Franz, is an American actor best known for his role as hard-boiled NYPD Detective Andy Sipowicz in the ABC television series NYPD Blue (1993â\u0080\u00932005), a role that earned him a Golden Globe Award, three Screen Actors Guild Awards and four Primetime Emmy Awards.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":1379136,"ranking":13,"query_text":"dennis franz where does he live","passage_text":"This is very easily explained. The term magical realism was coined around 1924 or 1925 by a German art critic named Franz Roh what he called magical realism was simply painting where real forms are combined in a way that does not conform to daily reality.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":7682606,"ranking":14,"query_text":"dennis franz where does he live","passage_text":"Some may have bought the home for its groves of avocado trees, but Dennis Franz, best known for his roles on â\u0080\u009cNYPD Blueâ\u0080\u009d and â\u0080\u009cHill Street Blues,â\u0080\u009d bought their Santa Barbara estate because he and his wife saw â\u0080\u009ctremendous potentialâ\u0080\u009d in the avocado farm home, said listing agent Randy Solakian [...]","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":5368447,"ranking":15,"query_text":"dennis franz where does he live","passage_text":"David Caruso had guest starred in two episodes and during the 3rd season, Dennis Franz guest starred as Det. Sal Benedetto in 5 episodes and was killed off in his last appearance. Franz officially joined the cast in that show's 6th season as Lt. Norman Buntz and stayed with the show until it ended.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":8574651,"ranking":16,"query_text":"dennis franz where does he live","passage_text":"Denny's is known for always being open, serving breakfast, lunch, dinner, and dessert around the clock. Unlike many other restaurant chains, Denny's does not close on holidays or nights, except where required by law.Many of their restaurants are located in proximity to freeway exits, bars, and in service areas.Denny's started franchising in 1963, and most Denny's restaurants are now franchisee-owned.nlike many other restaurant chains, Denny's does not close on holidays or nights, except where required by law. Many of their restaurants are located in proximity to freeway exits, bars, and in service areas. Denny's started franchising in 1963, and most Denny's restaurants are now franchisee-owned.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":3538671,"ranking":17,"query_text":"dennis franz where does he live","passage_text":"But not the incorrigible Dennis. Suffering from terminal prostate cancer, he is vowing to cap the amount Victoria gets in his will and, what's more, to deny her any hope of contesting it. As the 73-year-old lies dying, he also wants her to move out of the beachside compound where they had once lived in harmony.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":2196165,"ranking":18,"query_text":"dennis franz where does he live","passage_text":"Welcome to the official site of Dennis Weaver. Dennis Weaver as Buck James, a short-lived series where Dennisâ\u0080\u0099 character was loosely based on Dr. James Red Duke, a very well known trauma surgeon who also ran a working ranch. Dennis Weaver.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":6627562,"ranking":19,"query_text":"dennis franz where does he live","passage_text":"Dennis Collins net worth: Dennis Collins is an American entrepreneur who has a net worth of $30 million. Dennis Collins Dennis Collins net worth: Dennis Collins is an American entrepreneur who has a net worth of $30 million. Dennis Collins is based in Wylie, Texas, where he runs Collins Brothers Jeep. He has owned Collins Brothers Jeep for 29 years. They specialize in Jeep restoration and Jeep conversion projects. They only do the Wrangler series and CJ series Jeeps.","bm25_label":"high","relevance_label":0.0},{"query_id":1101670,"passage_id":7682604,"ranking":20,"query_text":"dennis franz where does he live","passage_text":"Some may have bought the home for its groves of avocado trees, but Dennis Franz, best known for his roles on â\u0080\u009cNYPD Blueâ\u0080\u009d and â\u0080\u009cHill Street Blues,â\u0080\u009d bought their Santa Barbara estate because he and his wife saw â\u0080\u009ctremendous potentialâ\u0080\u009d in the avocado farm home, said listing agent Randy Solakian of Coldwell Banker Previews International, who shares the ...","bm25_label":"high","relevance_label":0.0}]