[{"query_id":1101296,"passage_id":7994495,"ranking":1,"query_text":"do david tate shoes run true to size","passage_text":"David Tate does it again! Loved the shoes. David Tate is a favorite of mine because he makes beautiful shoes in my very large size 13 woman's foot. It's difficult to find good quality, beautiful foot ware that fits properly and David Tate never disappoints.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":7994494,"ranking":2,"query_text":"do david tate shoes run true to size","passage_text":"David Tate Women's Tan Snakeskin Print Bow Trim Leather Ballet Flat Shoes Sz 8.5 These gorgeous David Tate leather ballets flats have a snakeskin texture with a slight sheen and a bow trim on the rounded toes. Women's size 8.5.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":7994487,"ranking":3,"query_text":"do david tate shoes run true to size","passage_text":"David Tate Leather Flats - Nadine is rated 4.0 out of 5 by 1. Rated 4 out of 5 by princessq from Run Big This is a new brand for me, and the quality is very high. I needed closed toed white shoes in a wide width for work. I am a true 8W (Clarks, Isaac, others.) These are 1\/2 size large, which for me means that my heels slip out, and I got a blister.","bm25_label":"high","relevance_label":1.0},{"query_id":1101296,"passage_id":4068054,"ranking":4,"query_text":"do david tate shoes run true to size","passage_text":"About David Tate. Tate Shoe Company was founded by four brothers from a family of traditional shoemakers. They followed in the footsteps of their father who served in executive positions with several international shoe manufacturing companies in the post-war era of the 1950s.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":4068055,"ranking":5,"query_text":"do david tate shoes run true to size","passage_text":"About David Tate. Posted February 22, 2015 by. Tate Shoe Company was founded by four brothers from a family of traditional shoemakers. They followed in the footsteps of their father who served in executive positions with several international shoe manufacturing companies in the post-war era of the 1950s.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":105892,"ranking":6,"query_text":"do david tate shoes run true to size","passage_text":"Sometimes the patent leather shoes can run small so you would be okay to get a 1\/2-size up but it isn't necessary; depends on your comfort level. Boots also run true to size. Yes, I have found that Revas and other Tory Burch shoe styles fit true to size. Sometimes the patent leather shoes can run small so you would be okay to get a 1\/2-size up but it isn't necessary; depends on your comfort level. Boots also run true to size. Yes, I have found that Revas and other Tory Burch shoe styles fit true to size.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":3022856,"ranking":7,"query_text":"do david tate shoes run true to size","passage_text":"Shoes For Crews footwear tries to maintain consistent sizing for all of our different styles, and our sizes generally run true to U.S. sizing standards. If your shoes do not fit, don't worry - you are covered by our Satisfaction Guarantee! All available sizes will be displayed in the Select Size drop-down menu.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":6570418,"ranking":8,"query_text":"do david tate shoes run true to size","passage_text":"Pigalle 85 runs TRUE to size or slightly SMALL to size. Pigalle 100 runs TRUE to size. Pigalle 120 and Pigalle Plato 120\/140 run VERY large to size (go down by 1 full size) CL is recently changing their system for many shoes, so beware of their famous VPs which now run LARGE to size (was previously TRUE to size).","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":8759621,"ranking":9,"query_text":"do david tate shoes run true to size","passage_text":"Answer Wiki. Your toes should never hit the end of a running shoe. There should be at least a thumb's width of space between your big toe and the end of the shoe. Depending on the fit of the shoe (some run small, others are more true to size) you should usually buy a half size up from your normal shoe size.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":513378,"ranking":10,"query_text":"do david tate shoes run true to size","passage_text":"SAS sandals are comfortable enough to hike in. To answer the original question . . Tevas run true to size. I wear a 6 to 6 1\/2 in everything from sandals to dress shoes to running shoes to hiking boots; have several pair of Tevas and all are size 6.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":1434699,"ranking":11,"query_text":"do david tate shoes run true to size","passage_text":"Running Shoes: How to Choose. Most running shoes feel comfortable when you're standing in a shoe store, but the true test comes several miles into your run. You'll soon realize that the ideal shoe has more to do with your running style and the shape of your foot than it does with the logo stitched on the side. Choosing the running shoes that will fit you best is easy: Determine the type of running you do and your running style.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":1173179,"ranking":12,"query_text":"do david tate shoes run true to size","passage_text":"David Hasselhoff weighs 193 lbs (87 kg). What is David Hasselhoffâ\u0080\u0099s shoe size? David Hasselhoffâ\u0080\u0099s shoe size is 12 US (45 EU). What is David Hasselhoffâ\u0080\u0099s zodiac sign? David Hasselhoffâ\u0080\u0099s zodiac sign is Cancer. When was David Hasselhoff born? David Hasselhoffâ\u0080\u0099s birthday is on July 17, 1952. Where was David Hasselhoff born? David Hasselhoff was born in Baltimore, Maryland, USA. American actor, David Hasselhoffâ\u0080\u0099s real name is David Michael Hasselhoff. Photo credit: Baywatch (TV series), 1989-2001 Â© NBC, First-run syndication\/Â© Moviestore collection Ltd Alamy.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":3498583,"ranking":13,"query_text":"do david tate shoes run true to size","passage_text":"Most running shoes feel comfortable when you're standing in a shoe store, but the true test comes several miles into your run. You'll soon realize that the ideal shoe has more to do with your running style and the shape of your foot than it does with the logo stitched on the side.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":7994496,"ranking":14,"query_text":"do david tate shoes run true to size","passage_text":"For men ordering womenâ\u0080\u0099s sized shoes order 1 Â½ sizes up (menâ\u0080\u0099s size 8 = womenâ\u0080\u0099s size 9 Â½). If a style is not running true to size, we will provide a fit recommendation. A properly fitted shoe should have approximately Â½ to Â¾ of an inch of space from the end of your toe to the end of the shoe. Heel Height Guidelines. Heel heights are measured on the middle of the heel as shown here. Heel heights are also determined by the size of the shoe.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":2233666,"ranking":15,"query_text":"do david tate shoes run true to size","passage_text":"Great Buy! I am a true size 8 but I usually have to go up a half size in Keen because they run a little bit smaller than usual except for in the Newport H2's I wear a size 8 and they fit perfectly. These shoes are way comfortable and you could walk in them for hours. am a true size 8 but I usually have to go up a half size in Keen because they run a little bit smaller than usual except for in the Newport H2's I wear a size 8 and they fit perfectly. These shoes are way comfortable and you could walk in them for hours.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":8548662,"ranking":16,"query_text":"do david tate shoes run true to size","passage_text":"1 30% - If i am a size 6.5 in woman`s nike running shoe what size would i be in a grade school nike running shoe? 2  29% - Nike air lite high shoe size gs 6 is what size in womens? 3  25% - How can i find the size of a shoe that doesn t have any size marking? how do you determine the size of a shoe when it is not marked? 24% - I have a female friend that wear a 7 in a half and a size 8 in shoes what size would be a shoe size for her in grade schoo for a size 8 a?","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":6277886,"ranking":17,"query_text":"do david tate shoes run true to size","passage_text":"If you've never had a running gait analysis done, go to a running specialty store, where they can do one and recommend the right running shoes for you. You also need to make sure you're wearing the right size shoes -- you should get shoes that are at least half a size bigger than your street shoe size. Your feet swell when you run so it's good to have some extra room in the toe box to avoid black toenails and blisters. Also see: How to Find the Right Running Shoes.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":6709073,"ranking":18,"query_text":"do david tate shoes run true to size","passage_text":"Related: mens running shoes size 9.5 mens running shoes size 10 mens running pants mens nike shoes size 9 mens new running shoes size 9.ens running shoes size 9. Follow mens running shoes size 9 to get e-mail alerts and updates on your eBay Feed. Unfollow mens running shoes size 9 to stop getting updates on your eBay Feed.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":613866,"ranking":19,"query_text":"do david tate shoes run true to size","passage_text":"Best Answer: Almost all current Asics (A6) running shoes run a 1\/2 size smaller than your normal shoe size.Hence, if you now wear a size 10 shoe you should get a size 10.5 A6 running shoe. Source(s): Dave Â· 8 years ago.ating Newest Oldest. Best Answer: Almost all current Asics (A6) running shoes run a 1\/2 size smaller than your normal shoe size. Hence, if you now wear a size 10 shoe you should get a size 10.5 A6 running shoe.","bm25_label":"high","relevance_label":0.0},{"query_id":1101296,"passage_id":613869,"ranking":20,"query_text":"do david tate shoes run true to size","passage_text":"Rating Newest Oldest. Best Answer: Almost all current Asics (A6) running shoes run a 1\/2 size smaller than your normal shoe size. Hence, if you now wear a size 10 shoe you should get a size 10.5 A6 running shoe.Source(s): Dave Â· 8 years ago.ating Newest Oldest. Best Answer: Almost all current Asics (A6) running shoes run a 1\/2 size smaller than your normal shoe size. Hence, if you now wear a size 10 shoe you should get a size 10.5 A6 running shoe.","bm25_label":"high","relevance_label":0.0}]