[{"query_id":1101761,"passage_id":5273659,"ranking":1,"query_text":"zarxio what is this medication use","passage_text":"The recommended starting dosage of Zarxio is 5 mcg\/kg\/day, administered as a single daily subcutaneous injection, by short intravenous infusion (15 to 30 minutes), or by continuous intravenous infusion. Zarxio may interact with other drugs. Tell your doctor all medications and supplements you use.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":1025512,"ranking":2,"query_text":"zarxio what is this medication use","passage_text":"First Biosimilar Approved in US: Filgrastim-sndz (Zarxio) The product approved is the recombinant colony-stimulating factor filgrastim-sndz (Zarxio, Sandoz\/Novartis), which has several clinical uses, including aiding recovery from neutropenia in cancer patients undergoing chemotherapy.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":5273668,"ranking":3,"query_text":"zarxio what is this medication use","passage_text":"Biosimilars land in the US as Sandoz launches Zarxio. By Dan Stanton+Dan Stanton, 03-Sep-2015. Sandoz has launched Zarxio, the first biosimilar in the US, despite a last ditch effort to block the copycat version of Neupogen by Amgen. Sandoz, a subsidiary of Swiss Biopharma Novartis, received US Food and Drug Administration (FDA) approval for Zarxio - its copycat version of Amgenâ\u0080\u0099s Neupogen - in March . The product is, as of today, available in the US, becoming the first biosimilar to be launched in the worldâ\u0080\u0099s largest market.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":5273662,"ranking":4,"query_text":"zarxio what is this medication use","passage_text":"The digital press release with multimedia content can be accessed here: Holzkirchen, September 3, 2015 - Sandoz, a Novartis company, announced today that Zarxio(TM) (filgrastim-sndz) is now available in the United States. Zarxio is the first biosimilar approved by the US Food and Drug Administration (FDA) and the first to launch in the US.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":5273667,"ranking":5,"query_text":"zarxio what is this medication use","passage_text":"FDA Approves Zarxio. Zarxio is the first biosimilar to be approved in the United States. The United States Food and Drug Administration (FDA) has approved Zarxio (filgrastim-sndz), a leukocyte growth factor biosimilar to the reference product Neupogen. It is indicated for the treatment of neutropenia associated with chemotherapy and all other indications included in the reference product's label.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":7599028,"ranking":6,"query_text":"zarxio what is this medication use","passage_text":"The Food and Drug Administration has approved the first so-called biosimilar drug for use in the United States, paving the way for less expensive alternatives to an entire class of complex and costly drugs. The drug, called Zarxio, produced by Sandoz, is used to help prevent infections in cancer patients receiving chemotherapy. It is a close copy of an existing medication called Neupogen, made by Amgen.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":7926716,"ranking":7,"query_text":"zarxio what is this medication use","passage_text":"Our Zarxio (filgrastim-sndz) Side Effects Drug Center provides a comprehensive view of available drug information on the potential side effects when taking this medication. This is not a complete list of side effects and others may occur. Call your doctor for medical advice about side effects.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":7926718,"ranking":8,"query_text":"zarxio what is this medication use","passage_text":"DRUG DESCRIPTION. ZARXIO (filgrastim-sndz) is a 175 amino acid human granulocyte colony-stimulating factor (G-CSF) manufactured by recombinant DNA technology. ZARXIO is produced by Escherichia coli (E coli) bacteria into which has been inserted the human granulocyte colony-stimulating factor gene. ZARXIO has a molecular weight of 18â\u0080\u009a800 daltons.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":7599025,"ranking":9,"query_text":"zarxio what is this medication use","passage_text":"Granix; Neupogen; Zarxio. Brand Names: Canada. Grastofil; Neupogen. What is this drug used for? It is used to lower the chance of getting an infection in people with bone marrow problems caused by chemo. It is used to raise the number of white blood cells in certain patients. It is used in patients who have been exposed to certain doses of radiation. It may be given to your child for other reasons.","bm25_label":"high","relevance_label":1.0},{"query_id":1101761,"passage_id":1025514,"ranking":10,"query_text":"zarxio what is this medication use","passage_text":"Approves Zarxio, Its First Biosimilar Drug. Biosimilar drugs, which could replace some costly remedies, being made at a Novartis plant. The Food and Drug Administration has approved the first so-called biosimilar drug for use in the United States, paving the way for less expensive alternatives to an entire class of complex and costly drugs. The drug, called Zarxio, produced by Sandoz, is used to help prevent infections in cancer patients receiving chemotherapy.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":7599026,"ranking":11,"query_text":"zarxio what is this medication use","passage_text":"Zarxio is given by intravenous (IV) infusion or injection under the skin by a doctor or nurse. Your doctor may also decide that you can give yourself Zarxio injections under the skin at home or your caregiver can give you the injections.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":5273664,"ranking":12,"query_text":"zarxio what is this medication use","passage_text":"This content is copyright protected. Sandoz has launched Zarxio, the first biosimilar in the US, despite a last ditch effort to block the copycat version of Neupogen by Amgen.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":7599031,"ranking":13,"query_text":"zarxio what is this medication use","passage_text":"Tell your healthcare provider about all prescription, over-the-counter, and herbal medications you are taking before beginning treatment with Zarxio. Also, talk to your healthcare provider about your complete medical history, especially if you have a sickle cell disorder, if you have a problem with your kidneys, if you are receiving radiation therapy, or if you are allergic to latex.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":5273663,"ranking":14,"query_text":"zarxio what is this medication use","passage_text":"As to the cost, he said the WAC (Wholesale Acquisition Cost) for a Zarxio 300 mcg\/0.5 mL prefilled syringe is $275.66 (â\u0082¬245), and $438.98 for Zarxio 480 mcg\/0.8 mL. Equivalent dosage forms and strengths of Neupogen cost $324.30 and $516.45, respectively, according to an Amgen spokesperson.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":5273666,"ranking":15,"query_text":"zarxio what is this medication use","passage_text":"Sandoz understands the importance of providing comprehensive patient support services in the oncology setting. With the launch of Zarxio, Sandoz is also proud to offer Sandoz One SourceTM a patient services center, providing support that connects the patient to the information and resources they need. The launch follows the FDA approval of Zarxio on March 6, 2015.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":1025511,"ranking":16,"query_text":"zarxio what is this medication use","passage_text":"First Biosimilar Approved in US: Filgrastim-sndz (Zarxio) The first biosimilar product in the United States has been approved by the US Food and Drug Administration, in a move described by the agency's director, Janet Woodcock, as a significant milestone..","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":7926711,"ranking":17,"query_text":"zarxio what is this medication use","passage_text":"ZARXIO helps you fight infection. ZARXIO is a man-made form of granulocyte colony-stimulating factor (G-CSF) called filgrastim. G-CSF is a natural substance produced by the body. The purpose of G-CSF is to stimulate the growth of neutrophils, a type of white blood cell important in the bodyâ\u0080\u0099s fight against infection.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":1236021,"ranking":18,"query_text":"zarxio what is this medication use","passage_text":"Trade Names: NeupogenÂ®, GranixÂ®, ZarxioÂ® Other Names: G-CSF, granulocyte-colony stimulating factor. Chemocare.com uses generic names in all descriptions of drugs. Neupogen, Granix and Zarxio are trade names for filgrastim. Granulocyte - colony stimulating factor (G-CSF) is another name for filgrastim. In some cases, health care professionals may use the trade name Neupogen, Granix or Zarxio when referring to the generic drug name filgrastim. Drug type: Filgrastim is a biologic response modifier. It is classified as a colony stimulating factor and a hematopoietic agent.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":4344503,"ranking":19,"query_text":"zarxio what is this medication use","passage_text":"The analytical pair-wise comparisons of ZARXIO, US-licensed Neupogen, and EU-approved Neupogen met the pre-specified criteria for analytical similarity and established a scientific bridge to justify the relevance of the PK\/PD data generated using EU-approved Neupogen.","bm25_label":"high","relevance_label":0.0},{"query_id":1101761,"passage_id":4344497,"ranking":20,"query_text":"zarxio what is this medication use","passage_text":"There were four pharmacokinetic (PK) and pharmacodynamic (PD) studies that evaluated subcutaneous (SC) doses of 1-10 mcg\/kg in healthy subjects to evaluate the PK and PD similarity of ZARXIO with US-licensed Neupogen or EU-approved Neupogen.","bm25_label":"high","relevance_label":0.0}]