[{"query_id":1101172,"passage_id":7086809,"ranking":1,"query_text":"does sabic have locations in canada?","passage_text":"Overview Sabic Innovative Plastics Canada Inc is a private plastics materials and basic shape company in Calgary, Canada. The company is located at 1440 Aviation Pk Ne Suite 103. The organization has 8 other locations. Number of Employees A typical plastics materials and basic shape company has between 11 and 103 employees, meaning that Sabic Innovative Plastics Canada Inc, with a reported 10 employees, is one of the smaller employers in the industry.","bm25_label":"high","relevance_label":1.0},{"query_id":1101172,"passage_id":7086801,"ranking":2,"query_text":"does sabic have locations in canada?","passage_text":"How much do SABIC employees make in Mount Vernon, IN? Glassdoor has salaries, wages, tips, bonuses, and hourly pay submitted anonymously by 76 SABIC employees in Mount Vernon, IN. SABIC in Mount Vernon Salaries","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":426091,"ranking":3,"query_text":"does sabic have locations in canada?","passage_text":"The three major types of industries in the country are manufacturing, services, and natural resources. The largest manufacturing sector in the country is the automotive industry.Canada is one of the largest exporters of automobile equipment and goods due to its position within NAFTA. Leading equipment manufacturers and global automakers operate in Canada, among which General Motors, Toyota, and Ford.entral Canada is a major petroleum-refining region on the North American continent and the largest Canadian chemicals cluster. Many of the leading chemical companies have production facilities in the country, including Shell Chemicals, Dow Chemical, Sabic, INEOS, and others.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":7086802,"ranking":4,"query_text":"does sabic have locations in canada?","passage_text":"SABIC is a Saudi diversified manufacturing company, active in chemicals and intermediates, industrial polymers, fertilizers, and metals. It is the largest public company in Saudi Arabia, as listed in Tadawul, but the Saudi government still owns 70% of its shares. SABIC is also the largest listed company in the Middle East. Private shareholders are from Saudi Arabia and other countries of the six-nation Gulf Cooperation Council. SABIC was the world's fourth largest chemical producer in 2013. It i","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":7086806,"ranking":5,"query_text":"does sabic have locations in canada?","passage_text":"â\u0080\u009cSabic uses Anthem Blue Cross Blue Shield, and has two different plans depending on how much you want to spend per week, and out of pocket for medical...â\u0080\u009d See All See All Explore SABIC Salaries","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":2926927,"ranking":6,"query_text":"does sabic have locations in canada?","passage_text":"NorylÂ® is a trade name for Sabic Plastics (formerly GE Plastics) for their Modified PPO (Modified PolyPhenyleneOxide). Sabic is the world leader in engineering and mechanical plastic resins. This resin is a remarkably versatile material. PPO exhibits unusually low moisture absorption and great machinability.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":4439012,"ranking":7,"query_text":"does sabic have locations in canada?","passage_text":"Gerrit-Jan Bekink, Technical Marketing Engineer, HDPE, at Sabic said: Sabic HDPE B526OULS - ULS stands for Ultra Long Shelf-life - is a high-purity grade that features good organoleptic properties that are especially important when using in-bottle sterilisation, where the packaging as well as the product are subjected to tough thermal and mechanical conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":7928256,"ranking":8,"query_text":"does sabic have locations in canada?","passage_text":"What time does GNC open in Canada. Opening hours of branches GNC in Canada. GNC Locator. GNC contacts.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":8176197,"ranking":9,"query_text":"does sabic have locations in canada?","passage_text":"What time does Wendy's close in Canada. Opening hours of branches Wendy's in Canada. Wendy's Locator. Wendy's contacts.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":7086804,"ranking":10,"query_text":"does sabic have locations in canada?","passage_text":"SABIC is also the largest listed company in the Middle East.[3] Private shareholders are from Saudi Arabia and other countries of the six-nation Gulf Cooperation Council (GCC).","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":3023363,"ranking":11,"query_text":"does sabic have locations in canada?","passage_text":"What time does Toys r us open in Canada. Opening hours of branches Toys r us in Canada. Toys r us Locator. Toys r us contacts.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":7086808,"ranking":12,"query_text":"does sabic have locations in canada?","passage_text":"SABIC Reviews.  1 Idiots running the show in do not even have a clue where to take this company (in 11 reviews)  2  clueless about what Is really going on with some divisions (in 8 reviews)  3 bureaucracy management , no , you feel lost inside a huge company , much politics, (in 7 reviews)","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":8170205,"ranking":13,"query_text":"does sabic have locations in canada?","passage_text":"While heated structures have little to fear from frost action, this does not mean that the depth of their foundations should be decreased. A foundation located below the frost line will also, in most parts of Canada be in a region of uniform soil moisture content throughout the year.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":5830581,"ranking":14,"query_text":"does sabic have locations in canada?","passage_text":"SABIC is a chemical producing company in Saudi Arabia and is the biggest company in the Middle East. The company is currently the biggest producer of polycarbonate and granular urea and is the second largest producer of ethylene glycol in the world.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":4518802,"ranking":15,"query_text":"does sabic have locations in canada?","passage_text":"Four of the five Great Lakes border Canada: Lake Erie, Lake Huron, Lake Ontario and Lake Superior. Lake Michigan is the only one that does not border Canada; it is located completely within U.S. borders.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":3285395,"ranking":16,"query_text":"does sabic have locations in canada?","passage_text":"No, Canada does not have a death tax or an estate inheritance tax. In Canada, no inheritance tax is levied on the beneficiaries; the estate pays any tax that is owed to the government.o, Canada does not have a death tax or an estate inheritance tax. In Canada, no inheritance tax is levied on the beneficiaries; the estate pays any tax that is owed to the government.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":8642318,"ranking":17,"query_text":"does sabic have locations in canada?","passage_text":"Where Does It Come From ... The meaning of this stone comes from the location in which it was first found, as it was named after Labrador in Canada. It is also found in Finland, Greenland, Scandinavia, Russia, Italy, Madagascar, Mexico and the USA.here Does It Come From ... The meaning of this stone comes from the location in which it was first found, as it was named after Labrador in Canada. It is also found in Finland, Greenland, Scandinavia, Russia, Italy, Madagascar, Mexico and the USA.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":1260036,"ranking":18,"query_text":"does sabic have locations in canada?","passage_text":"FDM, FDM Technology, ABS-M30 and FDM ylon 1 are trademarks of Stratasys Inc. LTEM â\u0084¢ is a registered trademark of SABIC or afË\u009cliates. All other trademarks belong to their respective owners.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":7566689,"ranking":19,"query_text":"does sabic have locations in canada?","passage_text":"This Examination does NOT test on state, provincial, Ministry of Health, local, or institutional policy. The SOCRA Certification Examination is offered in various locations throughout the U.S. and Canada, as well as at some international locations.","bm25_label":"high","relevance_label":0.0},{"query_id":1101172,"passage_id":2975312,"ranking":20,"query_text":"does sabic have locations in canada?","passage_text":"Four of the five Great Lakes border Canada: Lake Erie, Lake Huron, Lake Ontario and Lake Superior. Lake Michigan is the only one that does not border Canada; it is located completely within U.S. borders. Keep Learning.","bm25_label":"high","relevance_label":0.0}]