[{"query_id":1101394,"passage_id":7907216,"ranking":1,"query_text":"different types of thumb surgery","passage_text":"Home > Living With Arthritis > Treatments > Joint Surgery > Types > Other > Thumb Surgery Options Surgery for Thumb Arthritis Experts explain five surgical treatment options for thumb arthritis.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7931136,"ranking":2,"query_text":"different types of thumb surgery","passage_text":"One type of surgery is called a thumb carpometacarpal (CMC) joint. arthroplasty. This surgery is done to relieve pain in your thumb and wrist. and give you movement of the thumb. It is often done as an outpatient. surgery. About the surgery. The doctor will make a small cut called an incision at your wrist.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":4010367,"ranking":3,"query_text":"different types of thumb surgery","passage_text":"But on the flip side, both types of surgery for trigger finger are relatively simple procedures that can usually be done on an outpatient basis. There are two main types of trigger finger or thumb surgery: open and percutaneous. Both of these procedures involve the doctor â\u0080\u009creleasing,â\u0080\u009d or splitting the A1 pulley through which the tendon is having trouble passing. The difference between these trigger finger surgeries is how the doctor goes about doing so.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7907214,"ranking":4,"query_text":"different types of thumb surgery","passage_text":"If left untreated, the finger has a chance of becoming permanently stuck in a bent position. But on the flip side, both types of surgery for trigger finger are relatively simple procedures that can usually be done on an outpatient basis. There are two main types of trigger finger or thumb surgery: open and percutaneous. Both of these procedures involve the doctor â\u0080\u009creleasing,â\u0080\u009d or splitting the A1 pulley through which the tendon is having trouble passing. The difference between these trigger finger surgeries is how the doctor goes about doing so.","bm25_label":"high","relevance_label":1.0},{"query_id":1101394,"passage_id":7907220,"ranking":5,"query_text":"different types of thumb surgery","passage_text":"Common Types of Hand Surgery Basal Joint Arthritis Surgery Arthritis of the basal joint (at the base of the thumb) is quite common, especially in women over 40 or individuals with past injuries in the area.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":336692,"ranking":6,"query_text":"different types of thumb surgery","passage_text":"Common types of hand surgery include carpal tunnel or trigger finger release, Dupuytrenâ\u0080\u0099s contracture fasciectomy, tendon repair, ganglion removal, knuckle (MCP joint) replacement and thumb joint surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7907221,"ranking":7,"query_text":"different types of thumb surgery","passage_text":"This complex surgery requires advanced microsurgery and may require multiple surgeries in the most serious cases. Common Types of Hand Surgery Basal Joint Arthritis Surgery. Arthritis of the basal joint (at the base of the thumb) is quite common, especially in women over 40 or individuals with past injuries in the area.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7133247,"ranking":8,"query_text":"different types of thumb surgery","passage_text":"Comments. 1  The knuckle at the end of my thumb, near the thumb nail, is catching. I had carpal tunnel surgery on that hand in March of this year. 2  Carla: This is most likely a trigger thumb. It can happen after carpal tunnel surgery from some extra swelling left over from the surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":4907809,"ranking":9,"query_text":"different types of thumb surgery","passage_text":"An iliostomy is similar to a colostomy; however, they are two different type surgeries. The difference between the two is that the colostomy diverts the colon to the stoma and an ileostomy diverts the ileum to the stoma. This type of surgery is classified as a bowel diversion surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7811019,"ranking":10,"query_text":"different types of thumb surgery","passage_text":"Lung cancer. Surgery. Your type of surgery depends on where in the lung your cancer is, how big it is and your general health. Types of surgery. Read about the different types of surgery for lung cancer. Preparing for surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7900057,"ranking":11,"query_text":"different types of thumb surgery","passage_text":"There are several different types of hernias that occur in different parts of the body, including inguinal, femoral, epigastric, hiatal and incisional hernias. While the typical treatment for each of these types of hernias involves surgery, different types and techniques of surgery are used for the various hernia types.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":2256898,"ranking":12,"query_text":"different types of thumb surgery","passage_text":"The thenar eminence is a term given to a muscle group located in the thumb as well as on the palm of the hand. The primary function of the muscle group is to allow for the different types of muscle movements performed by the thumb.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7758277,"ranking":13,"query_text":"different types of thumb surgery","passage_text":"There are several different types of weight loss surgery, each with its own advantages and disadvantages. Learn about your weight loss surgery options. There are several different types of weight loss surgery, each with its own advantages and disadvantages.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":336698,"ranking":14,"query_text":"different types of thumb surgery","passage_text":"Your hand therapist will also give you exercises, which youâ\u0080\u0099ll need to do for several months to get movement back and to strengthen the thumb before it feels comfortable. What are the common types of wrist surgery?","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":6819441,"ranking":15,"query_text":"different types of thumb surgery","passage_text":"Different types of orthopedic foot surgery is available for treating the different types of bunions like osteotomy, exostectomy, arthroplasty, arthrodesis, etc. The choice of the orthopedic foot surgery depends on the surgeon who is performing the operation and the condition of the patient who is undergoing the surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":3161423,"ranking":16,"query_text":"different types of thumb surgery","passage_text":"Trigger Thumb Surgery. Before you consider surgery, try some of the conservative treatment options, because itâ\u0080\u0099s estimated that 85% of trigger thumb cases can be cured without surgery. However, for those severe cases trigger thumb surgery is a fantastic option with almost 100% of people cured. The likely first step will be a round or two of steroid injections from your doctor. If the steroid injections do not solve your problem there are two likely surgical options:","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7432909,"ranking":17,"query_text":"different types of thumb surgery","passage_text":"There are two fundamentally different types of laser eye surgery: PRK and LASIK. Under these two categories, there are several different flavors or modifications of each type.For example, LASEK (with an E) is a newer type of PRK.here are two fundamentally different types of laser eye surgery: PRK and LASIK. Under these two categories, there are several different flavors or modifications of each type.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":7432910,"ranking":18,"query_text":"different types of thumb surgery","passage_text":"These 10 animal facts will amaze you. There are two fundamentally different types of laser eye surgery: PRK and LASIK. Under these two categories, there are several different flavors or modifications of each type. For example, LASEK (with an E) is a newer type of PRK.here are two fundamentally different types of laser eye surgery: PRK and LASIK. Under these two categories, there are several different flavors or modifications of each type.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":5038222,"ranking":19,"query_text":"different types of thumb surgery","passage_text":"An operative cure for Polydactyly differs on the basis of the type of the condition that one suffers from. If an individual is affected by the Preaxial form, a single thumb can be reconstructed from two split (duplicated) thumbs. The method of creation of a single thumb involves reconstruction of: 1  Skin. 2  Tendons. 3  Joints.","bm25_label":"high","relevance_label":0.0},{"query_id":1101394,"passage_id":5530823,"ranking":20,"query_text":"different types of thumb surgery","passage_text":"Definition of Laser surgery. Laser surgery: A type of surgery that uses the cutting power of a laser beam to make bloodless cuts in tissue or remove a surface lesion such as a skin tumor. There are a number of different types of lasers that differ in emitted light wavelengths and power ranges and in their ability to clot, cut, or vaporize tissue.","bm25_label":"high","relevance_label":0.0}]