[{"query_id":112718,"passage_id":7391920,"ranking":1,"query_text":"crew fort worth application","passage_text":"Welcome to CREW Fort Worth. CREW Fort Worth is a non-profit organization of commercial real estate professionals affiliated nationally through membership in the CREW Network, providing opportunities for networking, education, leadership development and civic\/philanthropic involvement.","bm25_label":"high","relevance_label":1.0},{"query_id":112718,"passage_id":7391921,"ranking":2,"query_text":"crew fort worth application","passage_text":"Officially formed in 1985, the CREW Fort Worth association has been dedicated to providing a networking and socializing forum for real estate professional women in Fort Worth and surrounding areas.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":6117895,"ranking":3,"query_text":"crew fort worth application","passage_text":"Application Submittal Forms. The USACE Fort Worth Regulatory Branch has released application submittal forms for Individual Permits and some of the most commonly used Nationwide Permits (NWPs) in the Fort Worth District. Future planning includes the development of application forms for the rest of the Fort Worth District applicable NWPs and Regional General Permits (RGPs).","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":956181,"ranking":4,"query_text":"crew fort worth application","passage_text":"Meet the Founding Members | Common Desk - Fort Worth Every new coworking space needs a crew of stellar members to set the stage for its community. Allow us to introduce you to our founding crew.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":6378025,"ranking":5,"query_text":"crew fort worth application","passage_text":"Electrical Contractor Registration. Applicants for a Fort Worth Electrical Contractor Registration shall hold a valid Fort Worth electrical contractor's license or a State of Texas electrical contractor's license or State of Texas electrical sign contractor's license.echanical Contractor Registration. Applicants for a Fort Worth Mechanical Contractor Registration shall hold a valid Fort Worth mechanical refrigeration and air conditioning contractor's license or a State of Texas air conditioning and refrigeration license with proper endorsements.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":6378029,"ranking":6,"query_text":"crew fort worth application","passage_text":"Mechanical Contractor Registration. Applicants for a Fort Worth Mechanical Contractor Registration shall hold a valid Fort Worth mechanical refrigeration and air conditioning contractor's license or a State of Texas air conditioning and refrigeration license with proper endorsements.echanical Contractor Registration. Applicants for a Fort Worth Mechanical Contractor Registration shall hold a valid Fort Worth mechanical refrigeration and air conditioning contractor's license or a State of Texas air conditioning and refrigeration license with proper endorsements.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":6494134,"ranking":7,"query_text":"crew fort worth application","passage_text":"In February 2012, Spirit Airlines established a crew and maintenance base at McCarran International Airport in Las Vegas, Nevada. On December 1, 2012, the airline opened a flight attendant and pilot crew base at Dallas-Fort Worth International Airport.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":1500480,"ranking":8,"query_text":"crew fort worth application","passage_text":"Fort Worth Passport - Where to Apply for a Passport in Fort Worth, Tx. 1  There are several Fort Worth passport application acceptance facilities where American citizens can submit applications for new passports. The passport offices in Fort Worth can receive requests for both routine processing in 6 to 8 weeks or expedited service in 2 to 3 weeks. Urgent processing in two weeks or less can be obtained through the nearest regional agency or a registered passport expediter.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":6378024,"ranking":9,"query_text":"crew fort worth application","passage_text":"Plumbing Contractor Registration. Applicants for a Fort Worth Plumbing Contractor Registration shall hold a valid State of Texas Master Plumber License or Texas Board of Irrigator License when required by the State of Texas or the City of Fort Worth Plumbing Code.echanical Contractor Registration. Applicants for a Fort Worth Mechanical Contractor Registration shall hold a valid Fort Worth mechanical refrigeration and air conditioning contractor's license or a State of Texas air conditioning and refrigeration license with proper endorsements.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":1500479,"ranking":10,"query_text":"crew fort worth application","passage_text":"FORT WORTH, TX â\u0080\u0093 Beginning October 1, Fort Worth Post Offices that accept passport applications will do so by appointment. Downtown Station, located at 251. The Passport Acceptance office located at the Jack D. Watson Post Office, 4600 Mark IV Pkwy, Fort Worth, TX will continue to accept walk-ins. Hours of service for that office are: Monday thru Friday, 8:00AM-3:00PM, closed for lunch from 1:00PM-2:00PM.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":1500483,"ranking":11,"query_text":"crew fort worth application","passage_text":"Jack D Watson Window Unit USPS Passport Office at 4600 Mark IV Parkway, Fort Worth TX. See Jack D Watson Window Unit USPS Passport Office in Fort Worth TX address, hours, phone number, and services. Passport offices provide information on passports, such as passport applications, forms, renewals, and expedite services. Jack D Watson Window Unit USPS Passport Office at 4600 Mark IV Parkway, Fort Worth TX.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":8293188,"ranking":12,"query_text":"crew fort worth application","passage_text":"FORT WORTH BOAT CLUB EAGLE MOUNTAIN LAKE 32Â° 53' 34.7437N \/ 97Â° 29' 14.514W. Thank you for your interest in the Fort Worth Boat Club. Admission to the Fort Worth Boat Club is member sponsored. The proposing member should request a new member packet on your behalf from the Club office. In addition to the Application for Membership, this packet contains information on the process and the proposerâ\u0080\u0099s responsibilities, the steps in the process, and a current schedule of membership fees.","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":8062064,"ranking":13,"query_text":"crew fort worth application","passage_text":"Education, Academic centers, Diplomas & Certificates, Process Improvement, Physician, Medicine Consultants, medicine, Fort Worth, Emergency Medicine Consultants, Emergency Departments, Education Fort Worth, Academic centers Fort Worth, Diplomas & Certificates Fort Worth, Process Improvement Fort Worth, Physician Fort Worth, Medicine Consultants Fort Worth, medicine Fort Worth, Fort Worth Fort Worth, Emergency Medicine Consultants Fort Worth, Emergency Departments Fort Worth","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":2123376,"ranking":14,"query_text":"crew fort worth application","passage_text":"Arlington Bedford Benbrook Burleson Colleyville Euless Forest Hill Fort Worth - Central Fort Worth - East Fort Worth - NE Fort Worth - North Fort Worth - NW Fort Worth - SE Fort Worth - South Fort Worth - SW Fort Worth - West Grapevine Haltom City Hurst Keller Mansfield North Richland Hills Southlake Watauga White Settlement [More Cities]","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":5336508,"ranking":15,"query_text":"crew fort worth application","passage_text":"Tagged : Fort Worth lacking substitute teachers fort worth tx , Fort Worth needs substitute teachers fort worth tx , Fort Worth officials having problems with substitute te , Fort Worth officials may change policies with requireme , Fort Worth officials reviews policies on requirements o , Fort Worth substitute teachers , pyramid substitute program ...","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":46994,"ranking":16,"query_text":"crew fort worth application","passage_text":"Quick Search for Gas Prices Find the lowest gas prices in these areas: Arlington Bedford Benbrook Burleson Colleyville Euless Forest Hill Fort Worth - Central Fort Worth - East Fort Worth - NE Fort Worth - North Fort Worth - NW Fort Worth - SE Fort Worth - South Fort Worth - SW Fort Worth - West Grapevine Haltom City Hurst Keller Mansfield North Richland Hills Southlake Watauga White Settlement [More Cities]","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":8803663,"ranking":17,"query_text":"crew fort worth application","passage_text":"reverse drive distance from Fort Worth, TX to Dallas, TX; halfway between Dallas, TX and Fort Worth, TX; hotels near Fort Worth, TX; flight distance from Dallas, TX to Fort Worth, TX; flight time from Dallas, TX to Fort Worth, TX; fly or drive from Dallas, TX to Fort Worth, TX; airports near Fort Worth, TX; airlines flying to Fort Worth, TX; time difference between Dallas, TX and Fort Worth, TX","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":8818686,"ranking":18,"query_text":"crew fort worth application","passage_text":"Includes Perfect Dental - Fort Worth Reviews, maps & directions to Perfect Dental - Fort Worth in Fort Worth and more from Yahoo US Local Find Perfect Dental - Fort Worth in Fort Worth with Address, Phone number from Yahoo US Local. Includes Perfect Dental - Fort Worth Reviews, maps & directions to Perfect Dental - Fort Worth in Fort Worth and more from Yahoo US Local","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":2563685,"ranking":19,"query_text":"crew fort worth application","passage_text":"Explore Fort Worth Independent School District Salaries See Fort Worth Independent School District Hourly Pay, Fort Worth Independent School District Bonuses, or check out salaries for Fort Worth Independent School District Contractor. Fort Worth Independent School District Salaries by Location. Fort Worth, TX; Fort Stockton, TX","bm25_label":"high","relevance_label":0.0},{"query_id":112718,"passage_id":6137099,"ranking":20,"query_text":"crew fort worth application","passage_text":"halfway between San Antonio, TX and Fort Worth, TX; hotels near Fort Worth, TX; flight distance from San Antonio, TX to Fort Worth, TX; flight time from San Antonio, TX to Fort Worth, TX; fly or drive from San Antonio, TX to Fort Worth, TX; airports near Fort Worth, TX; airlines flying to Fort Worth, TX; time difference between San Antonio, TX and Fort Worth, TX","bm25_label":"high","relevance_label":0.0}]