[{"query_id":113826,"passage_id":7983501,"ranking":1,"query_text":"current fad diet","passage_text":"According to the US News and World Report, there are a few fad weight loss diets that rise above the rest. As we ring in the new year, new fad diets emerge and others fade away. Topping the list of fad diets of 2015 is Weight Watchers, which is currently the most widely-adopted weight loss diet in the country. Aside from the big WW, here are the top fad diets of 2015.","bm25_label":"high","relevance_label":1.0},{"query_id":113826,"passage_id":675065,"ranking":2,"query_text":"current fad diet","passage_text":"Fad Diets. 1  A fad diet is a diet that promises quick weight loss through what is usually an unhealthy and unbalanced diet. 2  Fad diets are targeted at people who want to lose weight quickly without exercise. 3  Some fad diets claim that they make you lose fat, but itâ\u0080\u0099s really water weight youâ\u0080\u0099re losing.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":8092325,"ranking":3,"query_text":"current fad diet","passage_text":"Final Thoughts on Dangers of Fad Diets Fad diets are usually very restrictive, unsustainable, unlikely to teach you any lasting healthy habits and possibly even dangerous. Fad diet examples include DASH, Atkins, Paleo, Gluten-Free, Zone and South Beach diets.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":2051180,"ranking":4,"query_text":"current fad diet","passage_text":"A fad diet is a diet that promises quick weight loss through what is usually an unhealthy and unbalanced diet. Fad diets are targeted at people who want to lose weight quickly without exercise. Some fad diets claim that they make you lose fat, but itâ\u0080\u0099s really water weight youâ\u0080\u0099re losing. Fad diets that are restricted to certain foods may work, but most are boring or unappealing. This can make them difficult to follow on a long-term basis.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":675072,"ranking":5,"query_text":"current fad diet","passage_text":"A fad diet is a diet that promises quick weight loss through what is usually an unhealthy and unbalanced diet. Fad diets are targeted at people who want to lose weight quickly without exercise. Some fad diets claim that they make you lose fat, but itâ\u0080\u0099s really water weight youâ\u0080\u0099re losing.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":5060368,"ranking":6,"query_text":"current fad diet","passage_text":"Special points of interest: Fad diets can lead to quick weight loss. Fad diets can also lead to quick weight re-gain.Fad diets are real-ly low calorie di-ets. Fad diets can lead to nutrient defi-ciencies. The safest way to lose weight is to follow USDA Food Patterns.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":5060369,"ranking":7,"query_text":"current fad diet","passage_text":"Low fat and very low fat diets Low carbohydrate, high fat diets Page 2 Fad Diets Defined Most fad diets lead to weight loss because they are low in calories. Low fat diets use a lot of grains products in their menus.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":8092327,"ranking":8,"query_text":"current fad diet","passage_text":"Beware of fad diets Experts have known for decades that extended crash diets can be dangerous -- especially when the diets become a fad. In the late 1970s, an osteopath named Robert Linn published The Last Chance Diet, a best seller that advocated a miraculous liquid protein diet.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":2237040,"ranking":9,"query_text":"current fad diet","passage_text":"Anybody can have Histamine Intolerance, but you are at higher risk if you eat a GAPS diet, low-carb diet, enjoy gourmet foods, or have been swept up in the current fermented foods fad, because histamine is found lurking primarily in aged, fermented, cured, cultured, and smoked foods.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":886500,"ranking":10,"query_text":"current fad diet","passage_text":"Fad diets promote quick weight loss by following a specific set of guidelines, which differ depending on the diet plan. Some fad diets endorse specific foods to be eaten while others claim certain foods need to be avoided.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":8037770,"ranking":11,"query_text":"current fad diet","passage_text":"Diet Topc Weight-Loss Diets | Diets | MedlinePlus Many people follow diets to lose weight. Some diets are fad Diet Topc Weight-Loss Diets | Diets | MedlinePlus Many people follow diets to lose weight. Some diets are fad or crash diets that rarely lead to long term weight loss. Learn about what works. more info...","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":979033,"ranking":12,"query_text":"current fad diet","passage_text":"The Mayo Clinic diet (fad diet) is a popular diet that was neither created by nor endorsed by the Mayo Clinic, an internationally respected medical research facility headquartered in Rochester, Minnesota. The fad diet promises a weight loss of 10 pounds (4.5kilo-grams) for the person who follows the plan for 12 days.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":979040,"ranking":13,"query_text":"current fad diet","passage_text":"Over the years, variations of the fad diet have focused on grapefruit, meat, or eggs, according to the Mayo Clinic. Furthermore, the Mayo Clinic fad diet could be the inspiration for the Atkins diet. That plan named for cardiologist Robert Atkins was first described in his 1972 book, Dr. Atkinsâ\u0080\u0099 Diet Revolution.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":6017949,"ranking":14,"query_text":"current fad diet","passage_text":"The Lose Weight Diet is simple because it isn't based on a gimmick or a fad. Like I said, it is the anti-fad diet plan. It cuts right to the chase and eliminates all of the unnecessary tasks most commercial weight loss diet plans require you to do.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":5786078,"ranking":15,"query_text":"current fad diet","passage_text":"Not So Fast: Understanding the Science of Cleansing and Fasting Diets May Help Everyone. It is common knowledge that what you eat impacts your weight. To connect the two, Americans have followed the fads from the 1970's low-fat\/high carbohydrate diets to the current low carb\/high protein caveman and paleolithic trends.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":1675370,"ranking":16,"query_text":"current fad diet","passage_text":"It is important to look for a plan that includes strategies for maintaining weight loss. There is nothing worse than regaining the weight that took you an enormous amount of hard work and patience to lose. Most popular diets are considered fad diets. There is no clear definition for what constitutes a fad diet.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":5060367,"ranking":17,"query_text":"current fad diet","passage_text":"From Wikipedia, the free encyclopedia. The phrases fad diet and food fad originally referred to idiosyncratic diets and eating patterns that promote short-term weight loss, usually with no concern for long-term weight maintenance, and enjoy temporary popularity.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":979038,"ranking":18,"query_text":"current fad diet","passage_text":"What is the unofficial â\u0080\u009cMayo Clinic Dietâ\u0080\u009d? What was supposedly the Mayo Clinic Diet is a fad or crash diet. It is based around grapefruit, lots of salad and protein, and little carbohydrates. Weight loss was supposed to be in the region of 50-55 pounds in 10 weeks. This is a copy of the fad diet â\u0080\u0093 and it IS NOT RECOMMENDED.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":8805089,"ranking":19,"query_text":"current fad diet","passage_text":"The Trim Healthy Mama Plan aims to help you quit fad diets for good, with an easy-to-follow dieting philosophy that doesnâ\u0080\u0099t ban a single food group. The Trim Healthy Mama Plan aims to help you quit fad diets for good, with an easy-to-follow dieting philosophy that doesnâ\u0080\u0099t ban a single food group.","bm25_label":"high","relevance_label":0.0},{"query_id":113826,"passage_id":94657,"ranking":20,"query_text":"current fad diet","passage_text":"1 Most fad diets require you to cut out a major food group, such as carbs. The most important part of a healthy diet is making sure that you are eating a well-rounded meal plan that includes all nutrients. Avoid diets that require you to cut out food groups.  Some fad diets can make you sick.","bm25_label":"high","relevance_label":0.0}]