[{"query_id":115365,"passage_id":7529569,"ranking":1,"query_text":"danny phantom the ultimate enemy game","passage_text":"Play Game Boy Advance Games Online Through Your Browser. Play Danny Phantom â\u0080\u0093 The Ultimate Enemy Online. Loading... GBA, OTHERS Danny Phantom, Danny Phantom - The Ultimate Enemy, Giocare Danny Phantom - The Ultimate Enemy Online, Jogar Danny Phantom - The Ultimate Enemy Online, Jugar Danny Phantom - The Ultimate Enemy Online, The Ultimate Enemy. permalink.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":7529565,"ranking":2,"query_text":"danny phantom the ultimate enemy game","passage_text":"Danny Phantom: The Ultimate Enemy is a video game for the Game Boy Advance console. The game itself is based on an episode of the television series Danny Phantom which is titled The Ultimate Enemy..","bm25_label":"high","relevance_label":1.0},{"query_id":115365,"passage_id":7529570,"ranking":3,"query_text":"danny phantom the ultimate enemy game","passage_text":"Danny Phantom The Ultimate Enemy is a Fighting game on GaHe.Com. You can play Danny Phantom The Ultimate Enemy in your browser for free. Create your monster and fight it against other Danny Phantom monsters.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":7529564,"ranking":4,"query_text":"danny phantom the ultimate enemy game","passage_text":"Play Danny Phantom - The Ultimate Enemy (Nintendo Game Boy Advance) online. Danny Phantom - The Ultimate Enemy is a Nintendo Game Boy Advance game that you can play online for free on Game-Oldies. Just press the PLAY NOW button and follow instructions.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":7529567,"ranking":5,"query_text":"danny phantom the ultimate enemy game","passage_text":"Danny Phantom Ultimate Enemy is a game that has been added on 2015-09-02 20:00:00 and we invite you to play right now because it was played 675 times. Danny Phantom Ultimate Enemy was added in Danny Phantom Games and seems to have 3\/5 stars obtained at the vote from each member that have been played this game.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":7529562,"ranking":6,"query_text":"danny phantom the ultimate enemy game","passage_text":"Name: Danny Phantom Ultimate Enemy. Description: Danny Phantom Ultimate Enemy is a new super game that we think you will enjoy the most on our site because this new character that you will meet is a super hero that can peform different things while he is some sort of a phantom.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":7529568,"ranking":7,"query_text":"danny phantom the ultimate enemy game","passage_text":"Nicktoons Unite! Danny Phantom: The Ultimate Enemy is a video game for the Game Boy Advance console. The player takes control of Danny Phantom on his adventure to save Amity Park from his greatest enemy, Dan Phantom, who is his alternate future self ten years from the present.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":4895554,"ranking":8,"query_text":"danny phantom the ultimate enemy game","passage_text":"There have been two video games released for the series. Danny Phantom: The Ultimate Enemy (for the Game Boy Advance) was made to promote the then upcoming special The Ultimate Enemy with the main gameplay consisting of events from the TV movie. It is a 2D platformer and was released in Sept. 8, 2005.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":7529571,"ranking":9,"query_text":"danny phantom the ultimate enemy game","passage_text":"The Ultimate Enemy is the second Danny Phantom TV movie, consisting of episodes twenty-eight and twenty-nine. Danny and his friends get caught up in a time-traveling adventure, where they discover a future in which Amity Park is destroyed, and the world's most powerful and evil ghost is Danny's own future self!","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":6313317,"ranking":10,"query_text":"danny phantom the ultimate enemy game","passage_text":"Dark Danny Phantom (also known as Dan Phantom; voiced by Eric Roberts) is a villain created by the fusion of the ghost-halves of Danny Phantom (the show's protagonist) and Vlad Plasmius (his arch-enemy) in an alternative timeline.ani Phantom (AnnaSophia Robb \/ Daniella Monet) is an imperfect clone of Danny Phantom, created by Vlad as a stepping stone to the perfect Danny clone. Dani is also called Danny's cousin.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":4895555,"ranking":11,"query_text":"danny phantom the ultimate enemy game","passage_text":"Although Danny is at odds with his other enemies, including Vlad, Dan Phantom is a whole other story. Dan is, or at least was, Danny's future self, but the direct causes that lead to Danny turning into Dan were averted thanks to Clockwork's intervention.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":4895550,"ranking":12,"query_text":"danny phantom the ultimate enemy game","passage_text":"Daniel Danny Fenton AKA Danny Phantom, is the half-human\/half-ghost, and the main protagonist of the television show series, Danny Phantom.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":5334285,"ranking":13,"query_text":"danny phantom the ultimate enemy game","passage_text":"Box Ghost in Ultimate Enemy. Box Ghost is one of the ghosts who helped Danny save Christmas in . The Fright Before Christmas . He later makes another appearance in Secret Weapons, where he traps Tucker and Sam and fights Danny.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":2798632,"ranking":14,"query_text":"danny phantom the ultimate enemy game","passage_text":"Last episode. Voice. Daniel Danny Fenton, also known by his alias Danny Phantom, is the half-human\/half-ghost protagonist of the television series Danny Phantom. As the ghostly superhero Danny Phantom, he protects the citizens of Amity Park from the dangerous ghosts of the Ghost Zone.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":2798633,"ranking":15,"query_text":"danny phantom the ultimate enemy game","passage_text":"Ezequiel Serrano (Spanish dub) Daniel Danny Fenton, also known by his alias Danny Phantom, is the half-human\/half-ghost protagonist of the television series Danny Phantom. As the ghostly superhero Danny Phantom, he protects the citizens of Amity Park from the dangerous ghosts of the Ghost Zone.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":6313315,"ranking":16,"query_text":"danny phantom the ultimate enemy game","passage_text":"This is a list of cartoon characters from the Nickelodeon animated television series Danny Phantom. The series centers on young Danny Fenton and his coming-of-age story as a half ghost superhero to the town of Amity Park.ani Phantom (AnnaSophia Robb \/ Daniella Monet) is an imperfect clone of Danny Phantom, created by Vlad as a stepping stone to the perfect Danny clone. Dani is also called Danny's cousin.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":6313319,"ranking":17,"query_text":"danny phantom the ultimate enemy game","passage_text":"David Kaufman the guy who does the voice of Danny phantom he is really nice. Category. License.avid Kaufman the guy who does the voice of Danny phantom he is really nice. Category. License.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":4899672,"ranking":18,"query_text":"danny phantom the ultimate enemy game","passage_text":"Danielle Dani Phantom is a younger, female version of Danny Phantom, created accidentally by his archenemy, Vlad Masters when trying to clone Danny Phantom. Vlad, desperately lonely despite his wealth, conducted a series of experiments with the aim of creating the perfect half-ghost son for himself.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":4899676,"ranking":19,"query_text":"danny phantom the ultimate enemy game","passage_text":"Danielle Dani Phantom is a younger, female version of Danny Phantom, created accidentally by his archenemy, Vlad Masters when trying to clone Danny Phantom. History. Vlad, desperately lonely despite his wealth, conducted a series of experiments with the aim of creating the perfect half-ghost son for himself.","bm25_label":"high","relevance_label":0.0},{"query_id":115365,"passage_id":6313316,"ranking":20,"query_text":"danny phantom the ultimate enemy game","passage_text":"David Kaufman the guy who does the voice of Danny phantom he is really nice. 1  People & Blogs. 2  Standard YouTube License.avid Kaufman the guy who does the voice of Danny phantom he is really nice. Category. License.","bm25_label":"high","relevance_label":0.0}]