[{"query_id":116455,"passage_id":7370288,"ranking":1,"query_text":"deep listening definition","passage_text":"Deep Listening Skills Deep Listening Skills are at the core of all therapeutic change work. Without good listening skills aÃ\u0082 client will not FEEL heard, and this feeling of being heard is vital. We all know people who appear to listen, but we always know whether this is genuine. So a therapistÃ\u0082 must have, or develop, deep listening skills and showing that theyÃ\u0082 have listened.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370290,"ranking":2,"query_text":"deep listening definition","passage_text":"deep listening as a way of being in the world, she writes and practices Deep Listening within the. context of performance arts. In the arts, she points to improvisation, creativity and healing as. additional areas that Deep Listening can be used to deepen oneâ\u0080\u0099s practice.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370295,"ranking":3,"query_text":"deep listening definition","passage_text":"deep listening as â\u0080\u009clistening, from a deep, receptive, and caring place in oneself, to deeper and. often subtler levels of meaning and intention in the other person. It is listening that is generous, empathic, supportive, accurate, and trustingâ\u0080\u009d (p.","bm25_label":"high","relevance_label":1.0},{"query_id":116455,"passage_id":7370296,"ranking":4,"query_text":"deep listening definition","passage_text":"Deep Listening Skills. Deep Listening Skills are at the core of all therapeutic change work. Without good listening skills aÃ\u0082 client will not FEEL heard, and this feeling of being heard is vital. We all know people who appear to listen, but we always know whether this is genuine.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370289,"ranking":5,"query_text":"deep listening definition","passage_text":"Techniques > Listening > Depth of listening False listening | Initial listening | Selective listening | Partial listening | Full listening | Deep listening | See also There are several different types of listening, based on how deeply you are listening to the other person.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370291,"ranking":6,"query_text":"deep listening definition","passage_text":"Deep listening Beyond the intensity of full listening, you can also reach into a form of listening that not only hears what is said but also seeks to understand the whole person behind the words. In deep listening, you listen between the lines of what is said, hearing the emotion, watching the body language, detecting needs and goals, identifying preferences and biases, perceiving beliefs and values, and so on.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":580881,"ranking":7,"query_text":"deep listening definition","passage_text":"How to listen to lung sounds As he places the stethoscope on your back, the doctor says, Take a deep breath. As an RT who has listened to the lung sounds of over 10,000 patients, I will tell you that having a patient take in a deep breath is not the ideal way to listen to lung sounds.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":4113204,"ranking":8,"query_text":"deep listening definition","passage_text":"Types of listening. Here are six types of listening, starting with basic discrimination of sounds and ending in deep communication. Discriminative listening. Discriminative listening is the most basic type of listening, whereby the difference between difference sounds is identified.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":4654407,"ranking":9,"query_text":"deep listening definition","passage_text":"Types of listening. Here are six types of listening, starting with basic discrimination of sounds and. ending in deep communication. Discriminative listening. Discriminative listening is the most basic type of listening, whereby the difference. between difference sounds is identified.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370294,"ranking":10,"query_text":"deep listening definition","passage_text":"Depth of listening. Techniques > Listening > Depth of listening. False listening | Initial listening | Selective listening | Partial listening | Full listening | Deep listening | See also. There are several different types of listening, based on how deeply you are listening to the other person. If you can identify these, then you can choose which you want to use.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370293,"ranking":11,"query_text":"deep listening definition","passage_text":"Deep listening. Beyond the intensity of full listening, you can also reach into a form of listening that not only hears what is said but also seeks to understand the whole person behind the words.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":4866292,"ranking":12,"query_text":"deep listening definition","passage_text":"Techniques > Listening > Types of listening. Discriminative | Comprehension | Critical | Biased | Evaluative | Appreciative | Sympathetic | Empathetic | Therapeutic | Dialogic | Relationship | See also. Here are six types of listening, starting with basic discrimination of sounds and ending in deep communication.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7680615,"ranking":13,"query_text":"deep listening definition","passage_text":"Most of the time listening is something we do on autopilot. By using the 4 levels of listening, you can start to identify what level you are currently listening at, and take a step up to the next level. People LOVE to be listened to. The more you are able to use deep listening in your relationship and in your life, the better your relationships will get.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":580873,"ranking":14,"query_text":"deep listening definition","passage_text":"How to listen to lung sounds. As he places the stethoscope on your back, the doctor says, Take a deep breath.. As an RT who has listened to the lung sounds of over 10,000 patients, I will tell you that having a patient take in a deep breath is not the ideal way to listen to lung sounds. Ideally, you want the patient to breath normal. The reason is you want to hear what a patent's lungs sound like when he is breathing normal.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":4113202,"ranking":15,"query_text":"deep listening definition","passage_text":"Types of listening. Techniques > Listening > Types of listening. Discriminative | Comprehension | Critical | Biased | Evaluative | Appreciative | Sympathetic | Empathetic | Therapeutic | Dialogic | Relationship | See also. Here are six types of listening, starting with basic discrimination of sounds and ending in deep communication. Discriminative listening is the most basic type of listening, whereby the difference between difference sounds is identified. If you cannot hear differences, then you cannot make sense of the meaning that is expressed by such differences.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370297,"ranking":16,"query_text":"deep listening definition","passage_text":"deep listening, the aspect of being â\u0080\u009cguided by this dance of awareness and attunement with self and other, pausing between what is known and what is not known, and listening deeply from that still place that exists between self and other.â\u0080\u009d (p. 257).","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":5575544,"ranking":17,"query_text":"deep listening definition","passage_text":"The Definition of Empathic Listening. Empathic listening is defined as: a way of listening and responding to another person that improves mutual understanding and trust. It enabling the listener to receive and accurately interpret the speakerâ\u0080\u0099s message, and then provide an appropriate response. It is also called active listening or reflective listening.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":7370292,"ranking":18,"query_text":"deep listening definition","passage_text":"Understanding Deep Listening. Much of the research and articles available to date use different terms that speak to the. same phenomena and practice of listening deeply to oneâ\u0080\u0099s self, others, and world in order to. change or deepen oneâ\u0080\u0099s understanding and way of being in the world.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":5935368,"ranking":19,"query_text":"deep listening definition","passage_text":"Definitions for hearer. Here are all the possible meanings and translations of the word hearer. Princeton's WordNet(0.00 \/ 0 votes)Rate this definition: hearer, listener, auditor, attender(noun) someone who listens attentively.","bm25_label":"high","relevance_label":0.0},{"query_id":116455,"passage_id":6906550,"ranking":20,"query_text":"deep listening definition","passage_text":"Personally, I think the worship leader shouldâ\u0080\u0099ve omitted the â\u0080\u0098toâ\u0080\u0099 out, so that itâ\u0080\u0099s: Deep cries out, Deep cries out to You. Deep cries out, Deep cries out to You. We cry out, We cry out to You, Jesus! Try listening to the song again and let me know your thoughts.","bm25_label":"high","relevance_label":0.0}]