[{"query_id":117113,"passage_id":3921462,"ranking":1,"query_text":"define abraham lincoln during civil war","passage_text":"A New Birth of Freedom: Reconstruction During the Civil War. The Civil War, in the words of President Abraham Lincoln, brought to America a new birth of freedom. And during the war began the nation's efforts to come to terms with the destruction of slavery and to define the meaning of freedom.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":5016239,"ranking":2,"query_text":"define abraham lincoln during civil war","passage_text":"Feature Essay. Abraham Lincoln before the Presidency. James Davis. Illinois College, Jacksonville. From April of 1861 to April of 1865, President Abraham Lincoln led the United States through its terrible Civil War. During the war, Lincoln's leadership helped preserve the Union and emancipate over three million slaves. His ideas defined important goals of the war and inspired the war-weary public.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":2438135,"ranking":3,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln before the Presidency. James Davis. Illinois College, Jacksonville. From April of 1861 to April of 1865, President Abraham Lincoln led the United States through its terrible Civil War.During the war, Lincoln's leadership helped preserve the Union and emancipate over three million slaves.His ideas defined important goals of the war and inspired the war-weary public.ames Davis. Illinois College, Jacksonville. From April of 1861 to April of 1865, President Abraham Lincoln led the United States through its terrible Civil War. During the war, Lincoln's leadership helped preserve the Union and emancipate over three million slaves.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":3764455,"ranking":4,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln and the Telegraph. Interest in Technology Helped Lincoln Command the Military During the Civil War. History & Culture. President Abraham Lincoln used the telegraph extensively during the Civil War, and was known to spend many hours in a small telegraph office set up in the War Department building near the White House.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":7567209,"ranking":5,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln and the American Civil War - definition of Abraham Lincoln and the American Civil War by The Free Dictionary. http:\/\/www.thefreedictionary.com\/Abraham+Lincoln+and+the+American+Civil+War.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":5039882,"ranking":6,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln. Abraham Lincoln was the president of the United States during the Civil War. He wanted a stronger federal government and was against slavery. It was his election that triggered the southern states leaving and the Civil War. He was determined that the country remain united.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":7567214,"ranking":7,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln - 16th President of the United States; saved the Union during the American Civil War and emancipated the slaves; was assassinated by Booth (1809-1865) Lincoln, President Abraham Lincoln, President Lincoln.","bm25_label":"high","relevance_label":1.0},{"query_id":117113,"passage_id":775620,"ranking":8,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln A Charismatic Leader Essays and Research Papers. Abraham Lincoln A Charismatic Leader ABRAHAM LINCOLN A TRUE LEADER By: Isaac Noble Who Is Abraham Lincoln ï\u0082\u009e... Abraham Lincoln was the 16th republican president during the Civil War. He Showed INTEGRITY ï\u0082\u009e Abraham Lincoln showed a lot of integrity throughout his career.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":3144270,"ranking":9,"query_text":"define abraham lincoln during civil war","passage_text":"LINCOLN'S ABUSE OF POWER DURING THE AMERICAN CIVIL WAR. By. Brian Pulito. When one considers all that occurred during the very turbulent period of the American Civil War, President Abraham Lincoln is usually considered to be a hero.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":3799777,"ranking":10,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln was President of the United States of America during the Civil War. Jefferson Davis wa President of the Confederate States of America during the Civil War. Edit","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":2263638,"ranking":11,"query_text":"define abraham lincoln during civil war","passage_text":"James Davis. Illinois College, Jacksonville. From April of 1861 to April of 1865, President Abraham Lincoln led the United States through its terrible Civil War. During the war, Lincoln's leadership helped preserve the Union and emancipate over three million slaves. His ideas defined important goals of the war and inspired the war-weary public.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":66973,"ranking":12,"query_text":"define abraham lincoln during civil war","passage_text":"Noun. 1. Lincoln - 16th President of the United States; saved the Union during the American Civil War and emancipated the slaves; was assassinated by Booth (1809-1865). Abraham Lincoln, President Abraham Lincoln, President Lincoln.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":6733469,"ranking":13,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincoln before the Presidency. James Davis. Illinois College, Jacksonville. From April of 1861 to April of 1865, President Abraham Lincoln led the United States through its terrible Civil War.During the war, Lincoln's leadership helped preserve the Union and emancipate over three million slaves.His ideas defined important goals of the war and inspired the war-weary public.braham Lincoln before the Presidency. James Davis. Illinois College, Jacksonville. From April of 1861 to April of 1865, President Abraham Lincoln led the United States through its terrible Civil War.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":6632804,"ranking":14,"query_text":"define abraham lincoln during civil war","passage_text":"Journey through the life of Abraham Lincoln, the 16th U.S. president, on Biography.com. Learn more about his roles in the Civil War and the Great Emancipation. Abraham Lincoln was the 16th president of the United States. He preserved the Union during the U.S. Civil War and brought about the emancipation of slaves.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":5980820,"ranking":15,"query_text":"define abraham lincoln during civil war","passage_text":"During the American Civil War, President Abraham Lincoln issued the Emancipation Proclamation on September 22, 1862, with an effective date of January 1, 1863.uring the American Civil War, President Abraham Lincoln issued the Emancipation Proclamation on September 22, 1862, with an effective date of January 1, 1863.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":5395543,"ranking":16,"query_text":"define abraham lincoln during civil war","passage_text":"Lead Story. Lincoln delivers Gettysburg Address. On November 19, 1863, at the dedication of a military cemetery at Gettysburg, Pennsylvania, during the American Civil War, President Abraham Lincoln delivers one of the most memorable speeches in American history.ead Story. Lincoln delivers Gettysburg Address. On November 19, 1863, at the dedication of a military cemetery at Gettysburg, Pennsylvania, during the American Civil War, President Abraham Lincoln delivers one of the most memorable speeches in American history.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":5953568,"ranking":17,"query_text":"define abraham lincoln during civil war","passage_text":"Abraham Lincolnâ\u0080\u0099s Two Vice Presidents. Posted by: admin in Civil War People. Abraham Lincoln was had an astute political mind. This was amply demonstrated when during the course of the American Civil War, he chose to select a new Vice President for his second term.For Abraham Lincoln â\u0080\u0098s first term, he chose as Vice President Hannibal Hamlin.Hamlin was chosen for political reasons both because he could deliver votes from the nascent Republican party in the Northeast and his ardent stance against slavery.osted by: admin in Civil War People. Abraham Lincoln was had an astute political mind. This was amply demonstrated when during the course of the American Civil War, he chose to select a new Vice President for his second term.","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":1503179,"ranking":18,"query_text":"define abraham lincoln during civil war","passage_text":"Conclusion In conclusion, civil war is both a need and a want... Abraham Lincoln And Civl War America. Jennifer Hubbard History 161 April 14, 2007 Abraham Lincoln and Civil War America By William E. Gienapp Abraham Lincoln was born on February 12,1807, in...","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":5275890,"ranking":19,"query_text":"define abraham lincoln during civil war","passage_text":"Who the commanded the union army during the civil war? The Commander In Chief of the Union army during the Civil War was President Abraham Lincoln; the ranking general in the field was Ulysses S. Grant. Edit Share to:","bm25_label":"high","relevance_label":0.0},{"query_id":117113,"passage_id":3192372,"ranking":20,"query_text":"define abraham lincoln during civil war","passage_text":"The president of the US during the Civil War was Abraham Lincoln. For most of the war it was Abraham Lincoln (1809-1865), who proclaimed that the conflict was ultimately intended to preserve the Union of the United States. Actual hostilities began a month after his inauguration, on April 12, 1861.","bm25_label":"high","relevance_label":0.0}]