[{"query_id":134861,"passage_id":7036156,"ranking":1,"query_text":"definition of galvanized conduit","passage_text":"A conduit made form galvanized steel tubing is commonly referred as a rigid conduit. The thickness of a galvanized rigid conduit protects the electrical wiring from being hit and allows it to be threaded. Galvanized rigid conduits are used by electricians in commercial and industrial applications. conduit made form galvanized steel tubing is commonly referred as a rigid conduit. The thickness of a galvanized rigid conduit protects the electrical wiring from being hit and allows it to be threaded. Galvanized rigid conduits are used by electricians in commercial and industrial applications.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":7036154,"ranking":2,"query_text":"definition of galvanized conduit","passage_text":"Conduits: Electrical Metallic Tubing (EMT). Another example of rigid electrical conduit is the EMT, also known as Electrical Metallic Tubing. An EMT conduit is made of steel; in some cases aluminum is also used, cheaper than a galvanized rigid conduit and lighter than a GR conduit. conduit made form galvanized steel tubing is commonly referred as a rigid conduit. The thickness of a galvanized rigid conduit protects the electrical wiring from being hit and allows it to be threaded. Galvanized rigid conduits are used by electricians in commercial and industrial applications.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":3987716,"ranking":3,"query_text":"definition of galvanized conduit","passage_text":"Galvanized Rigid Steel Conduit (GRC, RMC) is the heaviest weight and thickest wall of electrical conduits. Allied Tube & ConduitÂ®â\u0080\u0099s Galvanized Rigid Steel Conduit is hot-dip galvanized for corrosion resistance and is considered non-combustible. Galvanized Rigid Steel Conduit (GRC, RMC) can be used indoors, outdoors, underground, concealed or exposed.","bm25_label":"high","relevance_label":1.0},{"query_id":134861,"passage_id":3987721,"ranking":4,"query_text":"definition of galvanized conduit","passage_text":"These include rigid aluminum, galvanized steel, IMC. (intermediate metal conduit) and nonmetallic conduit, as. well as conduit fittings, conduit bodies and boxes in. aluminum, galvanized steel and PVC. Individual product. lines must be manufactured to conform to the standards. set forth by Underwriters Laboratories, in order to qualify.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":1983816,"ranking":5,"query_text":"definition of galvanized conduit","passage_text":"The National Electrical CodeÂ® (NEC) Â® uses the acronym â\u0080\u009cRMCâ\u0080\u009d which includes rigid steel conduit, rigid aluminum conduit, stainless steel conduit and red brass conduit. The acronym â\u0080\u009cGRCâ\u0080\u009d â\u0080\u0093 galvanized rigid conduit â\u0080\u0093 is also frequently used. The UL Standards refer to â\u0080\u009cElectrical Rigid Metal Conduit â\u0080\u0093 Steelâ\u0080\u009d or â\u0080\u009cERMC-S. In the following FAQs, we use the term â\u0080\u009cGalvanized Steel RMCâ\u0080\u009d when we need to be specific about the properties or requirements of rigid steel conduit that is galvanized.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":4415237,"ranking":6,"query_text":"definition of galvanized conduit","passage_text":"A conduit made form galvanized steel tubing is commonly referred as a rigid conduit. The thickness of a galvanized rigid conduit protects the electrical wiring from being hit and allows it to be threaded.Galvanized rigid conduits are used by electricians in commercial and industrial applications.onduits: Aluminum Conduits. An aluminum conduit is a rigid conduit commonly used in commercial and industrial applications. Aluminum conduits are used to prevent corrosion and are the preferred conduit used in areas where large amounts of water and corrosion-prone areas.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":626771,"ranking":7,"query_text":"definition of galvanized conduit","passage_text":"Hot dipped galvanized\/electrical gi conduit pipe specification\/cable conduit\/flexible conduit price with great price.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":6807525,"ranking":8,"query_text":"definition of galvanized conduit","passage_text":"Galvanized Rigid Conduit Couplings. Picomaâ\u0080\u0099s galvanized rigid conduit couplings are available in trade sizes Â½ inch to 6 inches. Our galvanized rigid conduit couplings comply with the following standards: CSA C22.2 No. 45.07, to which it is Certified. They also comply with ANSI C80.1, federal specification WW-C-581 class 1 type A and UL-6 to which it is Listed.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":4415239,"ranking":9,"query_text":"definition of galvanized conduit","passage_text":"Rigid metal conduit (RMC) is a thick-walled threaded tubing, usually made of coated steel, stainless steel or aluminum. Galvanized rigid conduit (GRC) is galvanized steel tubing, with a tubing wall that is thick enough to allow it to be threaded.Its common applications are in commercial and industrial construction.ost conduit is rigid, but flexible conduit is used for some purposes. Conduit is generally installed by electricians at the site of installation of electrical equipment.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":1188614,"ranking":10,"query_text":"definition of galvanized conduit","passage_text":"â\u0080¢ Intermediate metallic conduit (IMC), which has a thicker galvanized wall, making it suitable for. outdoor applications. â\u0080¢ Galvanized rigid conduit (GRC), which is thickest and offers the most protection for the wires inside, but is more expensive and requires threaded fittings.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":2032813,"ranking":11,"query_text":"definition of galvanized conduit","passage_text":"Examples are electrical metallic tubing (EMT), which is lightweight and easy to install; intermediate metallic conduit (IMC), which has a thicker, galvanized wall, making it suitable for outdoor applications; and galvanized rigid conduit (GRC), which is thickest and offers the most protection.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":626773,"ranking":12,"query_text":"definition of galvanized conduit","passage_text":"20mm , 25mm Galvanized BS4568 Conduit Pipe , Steel Electrical Conduit GI Tube. Description: BS4568 CONDUIT with a integral coupling and a protection cap. TOPELE BRAND BS4568 CONDUIT Protect insulated electrical conductors and cables.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":6807531,"ranking":13,"query_text":"definition of galvanized conduit","passage_text":"For those applications that need more protection, Allied Tube & ConduitÂ® has Galvanized Rigid Steel Conduit (GRC, RMC). Allied Tube & ConduitÂ® makes standard Galvanized Rigid Steel Conduit (GRC, RMC) and the patented labor-savings Rigid Kwik-CoupleÂ® alternative.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":573059,"ranking":14,"query_text":"definition of galvanized conduit","passage_text":"Can you weld galvanized steel? I&#39;m trying to put together a small structure using galvanized steel electrical conduit (3\/4&quot;) and I can&#39;t seem to find a T-junction conduit coupler anywhere. I&#39;m wondering if I could weld the tubing together, but I&#39;m not sure if I can weld galvanized steel.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":3147054,"ranking":15,"query_text":"definition of galvanized conduit","passage_text":"Contact Our Conduit Division. Western Tube & Conduit Corporation is the leading producer of steel tubing, both black and galvanized, for all of the western United States. Additionally, they are one of the leading major national conduit manufacturers. Conduit is essentially a tube or trough that is used for protecting electric wiring.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":62348,"ranking":16,"query_text":"definition of galvanized conduit","passage_text":"1\/2 Inch EMT Conduit, Material: Hot-Galvanized Steel, Length: 10 feet, Color: Metallic. 3\/4 Inch EMT Conduit, Material: Hot-Galvanized Steel, Length: 10 feet, Color: Metallic. Channel - Elongated Holes on Back, Height: 1-5\/8, Width: 1-5\/8, Material: Steel, Finish: Pre-Galvanized, Gauge: 12, Length: 10 feet. Color: Silver.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":863432,"ranking":17,"query_text":"definition of galvanized conduit","passage_text":"From measuring to marking to cutting, conduit bending is truly one of the fundamental tasks for an electrician. Conduit bending is truly one of the fundamental tasks of the electrical construction industry. Whether EMT, galvanized rigid steel conduit, or intermediate conduit, you will need to bend it. Bends will be required as part of your installation.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":626766,"ranking":18,"query_text":"definition of galvanized conduit","passage_text":"Conduit Pipe Products, a member of The Phoenix Forge Group, is a leading supplier of electrical conduit fittings. Conduit Pipe Products manufactures conduit nipples, elbows and couplings in galvanized steel, aluminum, and stainless grades at its facility in West Jefferson, Ohio. These products serve many applications including the construction, food processing, and dairy industries.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":2681429,"ranking":19,"query_text":"definition of galvanized conduit","passage_text":"RMC is the heaviest-weight and thickest-wall steel conduit. Where galvanized by the hot-dip process, it has a coating of zinc on both the inside and outside. Electro-galvanized RMC has a coating of zinc on the exterior only, with approved corrosion resistant organic coatings on the interior.teel conduit has been in use as a â\u0080\u009craceway systemâ\u0080\u009d for electrical conductors since the early 1900s. The wall thickness and strength of steel make metal conduit the wiring method recognized as providing the most mechanical protection to the enclosed conductors.","bm25_label":"high","relevance_label":0.0},{"query_id":134861,"passage_id":4415240,"ranking":20,"query_text":"definition of galvanized conduit","passage_text":"Conduits: Electrical Metallic Tubing (EMT). Another example of rigid electrical conduit is the EMT, also known as Electrical Metallic Tubing. An EMT conduit is made of steel; in some cases aluminum is also used, cheaper than a galvanized rigid conduit and lighter than a GR conduit.onduits: Aluminum Conduits. An aluminum conduit is a rigid conduit commonly used in commercial and industrial applications. Aluminum conduits are used to prevent corrosion and are the preferred conduit used in areas where large amounts of water and corrosion-prone areas.","bm25_label":"high","relevance_label":0.0}]