[{"query_id":135465,"passage_id":3748637,"ranking":1,"query_text":"definition of indica","passage_text":"The indica dominant Mountain Mist weed is the result of crossing Skunk with a Himalayan indica. The outcome is a dedicated outdoor strain that has been specifically bred for growing in a cooler climate or higher altitude.he fragrance of Mountain Mist marijuana is a combination of a skunky and earthy musk, which when lit has a hint of sweet candy. Although the stone is not overpowering, it will definitely slow things down for a while, coming on quick and lasting a couple of hours.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":7791829,"ranking":2,"query_text":"definition of indica","passage_text":"Here are a few of the most popular medical marijuana strains to try based on the conditions they treat. Cancer: Arizonan Western Light Purp (indica\/sativa), Cinderella 99 (sativa\/indica) Chronic Pain: Afghani #1 (pure indica or indica\/sativa), Big Bud (indica\/sativa)","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":2839774,"ranking":3,"query_text":"definition of indica","passage_text":"Each of these main type of â\u0080\u009cstrainsâ\u0080\u009d can help you for different reasons. Therefore this new section regarding which marijuana strain has the best effect on my illness or condition has been created. Pain Relief â\u0080\u0093 Marijuana as a whole can have a positive effect for pain relief but some strains are better than others. The marijuana strain phenotype that best works for pain of any kind is Indica. Indica normally provides a deeper narcotic sensation than Sativa. Youâ\u0080\u0099ll definitely feel a strong body sensation and in many cases will want to rest or sleep. This makes Indica the perfect strain for any type of pain relief.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":8651532,"ranking":4,"query_text":"definition of indica","passage_text":"Ask almost any cannabis consumer to compare the indica Bubba Kush to a Sour Diesel sativa, and most will say there is a definite difference in effect. Take a look at how thousands of Leafly visitors have described the two:","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":887101,"ranking":5,"query_text":"definition of indica","passage_text":"Hybrid Marijuana Plants. Marijuana strains range from pure sativas to pure indicas and hybrid strains consisting of both indica and sativa (30% indica â\u0080\u0093 70% sativa, 50% â\u0080\u0093 50% combinations, 80% indica â\u0080\u0093 20% sativa).","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":1586749,"ranking":6,"query_text":"definition of indica","passage_text":"Marijuana strains range from pure sativas to pure indicas. Hybrid strains consist of both indica and sativa (30% indica â\u0080\u0093 70% sativa, 50% â\u0080\u0093 50% combinations, 80% indica â\u0080\u0093 20% sativa). Certain strains can better treat specific illnesses. Indica dominant marijuana strains tend to have a strong sweet or sour odor (ex.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":1586747,"ranking":7,"query_text":"definition of indica","passage_text":"Hybrid Marijuana Plants. Marijuana strains range from pure sativas to pure indicas and hybrid strains consisting of both indica and sativa (30% indica â\u0080\u0093 70% sativa, 50% â\u0080\u0093 50% combinations, 80% indica â\u0080\u0093 20% sativa). Because Sativa and Indica buds have very different medicinal benefits and effects, certain strains can be targeted to better treat specific illnesses.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":4705492,"ranking":8,"query_text":"definition of indica","passage_text":"If a sativa is like a strong cup of coffee, an indica is like a sleeping pill. Great for people who struggle to get to sleep, indicas produce very sedative effects. Indica smokers often feel sleepy, relaxed, and have a strong desire to eat. Indicas also have a distinct skunky odor.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":3705750,"ranking":9,"query_text":"definition of indica","passage_text":"THC: 15% - 20%, CBD: 1%. 1  Green Poison is an indica dominant hybrid (70% indica\/30% sativa) strain with unknown genetics due to breeder secrecy. 2  Green Poison is an indica dominant hybrid (70% indica\/30% sativa) strain with unknown genetics due to breeder secrecy. This dangerously tasty bud packs a powerful punch of heavy indica effects disguised in a sweet little package.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":7344701,"ranking":10,"query_text":"definition of indica","passage_text":"Indica vs Sativa. Indica and sativa are both strains of the cannabis weed, also known as marijuana. Typically, it is used as a psychoactive drug in its dried herbal form. Cannabis has got three known species which are sativa, indica and ruderalis. In this article weâ\u0080\u0099ll look at the contrasts between the sativa and indica species of the cannabis weed. Sativa plants are just as different in appearance from the Indicas as they are in the chemical composition of the leaves.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":5333700,"ranking":11,"query_text":"definition of indica","passage_text":"Cannabis Indica, Hybrid Cannabis, Marijuana Strains | Tags: cannabis indica, dna genetics, indica, kush, los angeles, ocean grown, og kush, OG Kush seeds, original gangster, sfv.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":2059381,"ranking":12,"query_text":"definition of indica","passage_text":"Sativa vs. Indica: Physical Appearance. While both of these plants have green leaves for the most part, Indica is a bit darker than sativa. Indica also has broader and fuller leaves. Indica plants usually grow short and wide, between 2-4 feet tall, making it better and easier for indoor growing.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":7482306,"ranking":13,"query_text":"definition of indica","passage_text":"Morphology â\u0080\u0093 indica and sativa plants have differences in appearance. Flowering time â\u0080\u0093 sativa plants have a longer maturation cycle than indica plants. Yields â\u0080\u0093 Indica strains tend to produce heavier yields than sativa strains. Flavor â\u0080\u0093 Indica and sativa strains tend to have different flavor profiles.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":967410,"ranking":14,"query_text":"definition of indica","passage_text":"G13 â\u0080\u0093 Indica. A pure indica strain with some mild sativa-like cerebral effects. Users report a long-lasting, relaxing high that doesnâ\u0080\u0099t put them down and out for the rest of the day. G13 is a very potent indica strain, thought to be the product of some of the very finest indica strains from around the world.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":1234670,"ranking":15,"query_text":"definition of indica","passage_text":"Ask almost any cannabis consumer to compare the indica Bubba Kush to a Sour Diesel sativa, and most will say there is a definite difference in effect. Our expectations certainly play a role in how we experience any given strain, but this consistency is not insignificant.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":2302673,"ranking":16,"query_text":"definition of indica","passage_text":"Ask almost any cannabis connoisseur to compare the indica Bubba Kush to a Sour Diesel sativa, and most will say there is a definite difference in effect. Our expectations certainly play a role in how we experience any given strain, but this consistency is not insignificant.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":1094503,"ranking":17,"query_text":"definition of indica","passage_text":"(Photo: kindgreenbuds.com). Indica and Sativa are the two major types of cannabis. They are believed to have unique appearances and effects. Because of their different effects, marijuana sold in stores is often labelled as indica or sativa.Many believe Cannabis indica and Cannabis sativa are different species.But due to a lack of research, there is some debate over the accuracy of this naming system. For example, some believe cannabis only has one species, with indica and sativa being subspecies instead.hey are believed to have unique appearances and effects. Because of their different effects, marijuana sold in stores is often labelled as indica or sativa. Many believe Cannabis indica and Cannabis sativa are different species.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":7902510,"ranking":18,"query_text":"definition of indica","passage_text":"Indica. Indica is a Finnish pop rock group founded in 2001. Jani Jalonen of Sony Music became interested in the group, and a recording contract was signed 2003. Indica's first album, Ikuinen virta was released in 2004. It has since sold platinum in Finland. Indica supported Nightwish during their Scandinavian tour 2007 in which they performed English versions of their songs.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":887095,"ranking":19,"query_text":"definition of indica","passage_text":"Indica and Sativa Marijuana: The Biggest Differences Between The Two Cannabis Plants Sativa and Indica cannabis leaves side-by-side. Indica and Sativa are the two major types of cannabis plants. They can be mixed together to create hybrid strains.","bm25_label":"medium","relevance_label":0.0},{"query_id":135465,"passage_id":4705486,"ranking":20,"query_text":"definition of indica","passage_text":"Difference Between Indica and Sativa. Indica and sativa are both strains of the cannabis weed, also known as marijuana. Typically, it is used as a psychoactive drug in its dried herbal form. Cannabis has got three known species which are sativa, indica and ruderalis.","bm25_label":"medium","relevance_label":0.0}]