[{"query_id":135516,"passage_id":715235,"ranking":1,"query_text":"definition of infraction","passage_text":"Learn More about infraction. Dictionary: Definition of infraction Spanish Central: Translation of infraction Nglish: Translation of infraction for Spanish speakers Britannica English: Translation of infraction for Arabic speakers.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":2313806,"ranking":2,"query_text":"definition of infraction","passage_text":"An infraction or a misdemeanor. A misdemeanor, is a lesser criminal act. Misdemeanors are punished much less... What is worse a misdemeanor or infraction Infraction & misdemeanor are the same. In fact, the definition of infraction is:...","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":3026261,"ranking":3,"query_text":"definition of infraction","passage_text":"Civil infractions: A civil infraction is a minor violation. Many traffic violations are civil infractions, such as speeding, failure to signal, etc. The punishment for a civil infraction is usually a fine, there is no jail time. Simple possession of less than an ounce of marijuana is a civil infraction. Felonies: The following definition applies only in Massachusetts courts, the Federal courts may use a different definition.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":710157,"ranking":4,"query_text":"definition of infraction","passage_text":"The definition of an infraction is a violation of the law that is less serious than a misdemeanor, or is a violation of rules you are supposed to follow. An example of an infraction is when you are speeding and given a traffic ticket. infraction. infraction.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":1535990,"ranking":5,"query_text":"definition of infraction","passage_text":"Legal Definition of an Infraction in California Law. Infractions are punishable by a maximum $250 fine.2 They do not subject an offender to incarceration or to being placed on probation under California's probation laws.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":7321859,"ranking":6,"query_text":"definition of infraction","passage_text":"Wiktionary (0.00 \/ 0 votes) Rate this definition: infraction (Noun). A minor offence, petty crime. infraction (Noun). a violation; breach. infraction (Noun). A major violation of rules which leads to a penalty, if detected by the referee. Origin: From infractio, from infractum, past participle of infringere, from + .","bm25_label":"high","relevance_label":1.0},{"query_id":135516,"passage_id":5452062,"ranking":7,"query_text":"definition of infraction","passage_text":"When you break school rules about gum chewing, you commit an infraction. An infraction is a petty crime or a minor breaking of rules. When you think of the word infraction, think that your offence has just crossed the line into wrong. Something like a parking ticket is an infraction. When you commit an infraction, you're not knee deep in wrong, you've just dipped your toe into wrong to see what it feels like. A misdemeanor is a more serious crime such as theft, and murder is considered a felony, the most serious of crimes. Definitions of infraction.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":6290537,"ranking":8,"query_text":"definition of infraction","passage_text":"violation-Legal Definition. n. 1  A breaking of the law; an infraction; a transgression. 2  The act of breaching the law; contravening a duty or right.3  An offense against the public welfare.iolation-Legal Definition. n. 1  A breaking of the law; an infraction; a transgression. 2  The act of breaching the law; contravening a duty or right.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":1134346,"ranking":9,"query_text":"definition of infraction","passage_text":"noun. The definition of a misdemeanor is a criminal offense more serious than an infraction and less serious than a felony.Federal criminal law classifies a misdemeanor as one in which the maximum punishment in terms of jail time is less than one year.oun. The definition of a misdemeanor is a criminal offense more serious than an infraction and less serious than a felony.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":4137480,"ranking":10,"query_text":"definition of infraction","passage_text":"Traffic laws are typically broken up into two categories; an infraction and a violation. An infraction is not considered a crime and the penalty is usually a fine. Most traffic tickets, such as non-moving violations and non-dangerous moving violations are considered infractions. A violation is more severe although the definition varies in each state. It is usually considered a crime and more serious violations may be classified as misdemeanor or felony traffic violations.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":8072735,"ranking":11,"query_text":"definition of infraction","passage_text":"Definition of breach. 1 : infraction or violation of a law, obligation, tie, or standard a breach of trust sued them for breach of contract.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":3079588,"ranking":12,"query_text":"definition of infraction","passage_text":"Definition of breach. 1  1 : infraction or violation of a law, obligation, tie, or standard a breach of trust sued them for breach of contract.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":715238,"ranking":13,"query_text":"definition of infraction","passage_text":"Word forms: infractions. countable noun. An infraction of a rule or law is an instance of breaking it. ...an infraction of school rules. ...parents of kids who committed minor infractions.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":7484250,"ranking":14,"query_text":"definition of infraction","passage_text":"What is the difference between civil infractions, misdemeanors and felonies? Civil infractions: A civil infraction is a minor violation. Many traffic violations are civil infractions, such as speeding, failure to signal, etc. The punishment for a civil infraction is usually a fine, there is no jail time.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":1535985,"ranking":15,"query_text":"definition of infraction","passage_text":"Legal Definition of an Infraction in California Law. The California criminal justice system classifies crimes into three categories: felonies (the most serious crimes, punishable by imprisonment in the California state prison, or sometimes, even death),","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":437539,"ranking":16,"query_text":"definition of infraction","passage_text":"ex post facto law definition A law that makes illegal an act that was legal when committed, increases the penalties for an infraction after it has been committed, or changes the rules of evidence to make conviction easier.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":349852,"ranking":17,"query_text":"definition of infraction","passage_text":"An infraction is a minor offense. Most infractions are written on a ticket form but infractions can also be filed by the prosecutor on a complaint document. An infraction is usually punishable by a fine and if the fine is paid, there is no jail time.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":5458068,"ranking":18,"query_text":"definition of infraction","passage_text":"Also found in: Dictionary, Thesaurus, Medical, Financial, Wikipedia. Infraction. Violation or infringement; breach of a statute, contract, or obligation. The term infraction is frequently used in reference to the violation of a particular statute for which the penalty is minor, such as a parking infraction. infraction. INFRACTION. The breach of a law or agreement; the violation of a compact.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":1003614,"ranking":19,"query_text":"definition of infraction","passage_text":"Definition: The MDR or Manifestation Determination Review is a meeting which must take place within ten days of a behavior infraction that would cause a student to be removed from their current placement in a public school for more than 10 days.efinition: The MDR or Manifestation Determination Review is a meeting which must take place within ten days of a behavior infraction that would cause a student to be removed from their current placement in a public school for more than 10 days.","bm25_label":"high","relevance_label":0.0},{"query_id":135516,"passage_id":715232,"ranking":20,"query_text":"definition of infraction","passage_text":"Example Sentences for infraction. It was considered as an act of despotism and vengeance; as the first infraction of the promises made to the nation. The first infraction of our agreement was on the main-lower-topsail. But any infraction of these rituals is sure to bring terrific punishment.","bm25_label":"high","relevance_label":0.0}]