[{"query_id":139767,"passage_id":6541329,"ranking":1,"query_text":"definition quint","passage_text":"Definition of quint - (in piquet) a sequence of five cards of the same suit. A run of ace, king, queen, jack, and ten is a quint major and one of jack, Definition of quint - (in piquet) a sequence of five cards of the same suit. A run of ace, king, queen, jack, and ten is a quint major and one of jack, dictionary","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":614243,"ranking":2,"query_text":"definition quint","passage_text":"If you want the definition of bro, discover a Quint. by Karina Kramp Report definition; The Quint Truck is actually a Pumper Truck and a Ladder Truck. Quint suggests five and this truck features five primary things: 1. a pump, 2. liquid tank, 3. hose pipe, 4. floor ladders, and 5. an aerial ladder. by Daniel Report definition","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":614251,"ranking":3,"query_text":"definition quint","passage_text":"(jamaican slang)it way to squeeze the inner vaginal muscles ie kegel exercise but especially while having sex by Roseanne Ziolkowski Report definition. Derevating from 5th or quintuple. Quint is a pretty chill guy, constantly there for their friends, and heis only a straight up bro. Quint's often cannot inform you when their phone is damaged, consequently, you don't know if your lax exercise sessions are cancelled or not. If you want the definition of bro, discover a Quint. by Karina Kramp Report definition","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":7387366,"ranking":4,"query_text":"definition quint","passage_text":"Derevating from the 5th or quintuple. Quint is a pretty chill guy, always there for his friends, and he's just a straight up bro. Quint's usually don't tell you when their phone is broken, therefore, you don't know if your lax workouts are cancelled or not. If you need the definition of bro, find a Quint.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":614244,"ranking":5,"query_text":"definition quint","passage_text":"Derevating from the 5th or quintuple. Quint is a pretty chill guy, always there for his friends, and he's just a straight up bro. Quint's usually don't tell you when their phone is broken, therefore, you don't know if your lax workouts are cancelled or not. If you need the definition of bro, find a Quint. Dude!","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":614247,"ranking":6,"query_text":"definition quint","passage_text":"The name Quint is of English origin. The meaning of Quint is fifth. Quint is generally used as a boy's name. It consists of 5 letters and 1 syllable and is pronounced Quint.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":2810872,"ranking":7,"query_text":"definition quint","passage_text":"Brody finally convinces a devastated Vaughn to hire Quint. Quint, Brody and Hooper set out on Quint's boat, the Orca, to hunt the shark. While Brody lays down a chum line, Quint waits for an opportunity to hook the shark. Without warning, it appears behind the boat.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":3612340,"ranking":8,"query_text":"definition quint","passage_text":"Quint, Brody and Hooper set out on Quint's boat, the Orca, to hunt the shark. While Brody lays down a chum line, Quint waits for an opportunity to hook the shark. Without warning, it appears behind the boat. Quint estimates its length at 25 feet (7.6 m).","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":6511169,"ranking":9,"query_text":"definition quint","passage_text":"Definition of TRENT. 1. river 150 miles (241 kilometers) Canada in SE Ontario flowing from Kawartha Lakes through Rice Lake into Lake Ontario (Bay of Quinte).2. river 170 miles (274 kilometers) cen England flowing NNE & uniting with Ouse River to form the Humber.efinition of TRENT. 1. river 150 miles (241 kilometers) Canada in SE Ontario flowing from Kawartha Lakes through Rice Lake into Lake Ontario (Bay of Quinte). 2.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":614242,"ranking":10,"query_text":"definition quint","passage_text":"Shortly after kidnapping Quint, Wily reprogrammed him to be yet another one of his Megaman Killing robots. Quint made his grand debut in Mega Man II for the Game Boy. Quint's master weapon is the Sakugarne.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":2490345,"ranking":11,"query_text":"definition quint","passage_text":"Trenton, Ontario. Trenton (2001 population 19,374) is a community in Southern Ontario in the municipality of Quinte West, Ontario, Canada. Located on the Bay of Quinte, it is the main population centre in Quinte West, and is one of the largest freestanding[clarification needed] unincorporated communities in the province.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":6541325,"ranking":12,"query_text":"definition quint","passage_text":"Home British & World English quint. 1(in piquet) a sequence of five cards of the same suit. A run of ace, king, queen, jack, and ten is a quint major and one of jack, ten, nine, eight, and seven a quint minor. 2North American.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":1627845,"ranking":13,"query_text":"definition quint","passage_text":"For each number prefix, write its definition, and find as many words as you can that begin with that prefix. The prefixes are: bi-, centi-, dec-, deci-, hexa-, milli-, mono-, multi-, nona-, penta-, poly-, quadra-, quint-, tri-, uni-.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":614248,"ranking":14,"query_text":"definition quint","passage_text":"1 quintessential by Helene Inouye Report definition. ( 2 jamaican slang)it way to squeeze the inner vaginal muscles ie kegel exercise but especially while having sex by Roseanne Ziolkowski Report definition. 3  Derevating from 5th or quintuple. 4  The Quint Truck is actually a Pumper Truck and a Ladder Truck.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":7387367,"ranking":15,"query_text":"definition quint","passage_text":"Palm Beach County Fire-Rescue Quint 57, stationed in suburban Boca Raton, Florida. This unit was manufactured by Ferrara Fire Apparatus. This is an example of a typical US quint setup. Palm Beach County Fire-Rescue Quint 29, stationed in Royal Palm Beach, Florida.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":7387361,"ranking":16,"query_text":"definition quint","passage_text":"A quintuple combination pumper or quint is a fire service apparatus that serves the dual purpose of an engine and a ladder truck. The name quint is derived from the Latin prefix quinque-, meaning five, and refers to the five functions that a quint provides: pump, water tank, fire hose, aerial device, and ground ladders.","bm25_label":"high","relevance_label":1.0},{"query_id":139767,"passage_id":7885292,"ranking":17,"query_text":"definition quint","passage_text":"Chuck Cunningham Syndrome: Chester disappears without explanation in season 9, as does Miss Kitty in season 20. Quint Asper vanishes without a word in season 10 Quint's leaving without mention was finally averted in season 12, when Festus says their current blacksmith is the best they've had since Quint left.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":2508676,"ranking":18,"query_text":"definition quint","passage_text":"In Jaws the character Quint was the boat captain, was played by Robert Shaw & Roy Scheider played Chief Martin Brody. Captain Quint - played by actor Robert Shaw. Login or Sign Up to answer this question.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":2490347,"ranking":19,"query_text":"definition quint","passage_text":"Trenton is a community in Southern Ontario in the municipality of Quinte West, Ontario, Canada. Located on the Bay of Quinte, it is the starting point for the Trent-Severn Waterway, which continues northwest to Peterborough and eventually Port Severn on Georgian Bay.","bm25_label":"high","relevance_label":0.0},{"query_id":139767,"passage_id":614246,"ranking":20,"query_text":"definition quint","passage_text":"Megaman from future who was simply kidnapped and cut back into the 12 months of 20XX by Dr. Wily. Shortly after kidnapping Quint, Wily reprogrammed him is yet another one of his true Megaman Killing robots.Quint made his grand debut in Mega Man II for Game Boy. by Mason Moffatt Report definition. quintessential by Helene Inouye Report definition.","bm25_label":"high","relevance_label":0.0}]