[{"query_id":140161,"passage_id":7747873,"ranking":1,"query_text":"definition wedgie","passage_text":"Look up wedgie, atomic wedgie, or melvin in Wiktionary, the free dictionary.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":7747876,"ranking":2,"query_text":"definition wedgie","passage_text":"A wedgie occurs when a person's nether underwear or other garments are wedged between the buttocks. While a wedgie can be created naturally, the term is usually associated with a prank or as a form of bullying. When a person is on the receiving end of a wedgie, his or her underwear is forcibly pulled up by a second person.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":4125711,"ranking":3,"query_text":"definition wedgie","passage_text":"How to Avoid Thong Wedgies. When it comes to a thong, less fabric means less chance of getting wedgies, right? Well, the jury is outâ\u0080\u0093but there are some practical steps you can take to avoid thong wedgies while enjoying the comfort and freedom afforded by thong style underwear. Read on to learn more. Size your thong correctly before you buy it.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":7747874,"ranking":4,"query_text":"definition wedgie","passage_text":"a wedgie is a punishment for tighty-whitey wearers like me their are many kinds of wedgies but the most simple is yanking the underwear up from behind. this is real account of what happened to me a few weeks ago.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":7747870,"ranking":5,"query_text":"definition wedgie","passage_text":"Wedgie. When a person grabs another persons boxers while they are still wearing them and painfully pulls them up as hard as they can. I was given a wedgie by my friends and my boxers were pulled over my head.","bm25_label":"high","relevance_label":1.0},{"query_id":140161,"passage_id":596979,"ranking":6,"query_text":"definition wedgie","passage_text":"There just jealous that we have the balls to wear comfortable underwear so they give us wedgies! I'm 14 in 8th grade, i get made fun of all the time for wearing tighty whities. I get wedgies all the time every day.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":6444880,"ranking":7,"query_text":"definition wedgie","passage_text":"Words near atomic volume in the dictionary. 1  atomic theory. 2  atomic-theory. 3  atomic-time. 4  atomic veteran. 5  atomic volume. 6  atomic-weapon. 7  atomic-weapons. 8  atomic-wedgie. 9  atomic-wedgies. 10  atomic-weight.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":7747877,"ranking":8,"query_text":"definition wedgie","passage_text":"Wedgies, especially when performed on males, can be dangerous, potentially causing testicular or scrotal damage. An incident in 2004 involving a ten-year-old boy required reattachment of a testicle to the scrotum. On the January 9, 2014 multiple news sources reported the first confirmed death by atomic wedgie.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":596974,"ranking":9,"query_text":"definition wedgie","passage_text":"What nerds like me wear. boxer-wearers usually bully anyone caught wearing tighty whities a wedgie. They are good for support, and hold in that part of the body, but you are usually picked on for wearing them, i.e. wedgies, swirlies, pantsed, beat up, called names like nerd, loser ect..","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":1489226,"ranking":10,"query_text":"definition wedgie","passage_text":"'Big Nate: A Good Old-Fashioned Wedgie' Is On Shelves And Underwear By The GoComics Team","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":596972,"ranking":11,"query_text":"definition wedgie","passage_text":"tighty whities. What nerds like me wear. boxer-wearers usually bully anyone caught wearing tighty whities a wedgie. They are good for support, and hold in that part of the body, but you are usually picked on for wearing them, i.e. wedgies, swirlies, pantsed, beat up, called names like nerd, loser ect..","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":596973,"ranking":12,"query_text":"definition wedgie","passage_text":"3. tighty whities. What nerds like me wear. boxer-wearers usually bully anyone caught wearing tighty whities a wedgie. They are good for support, and hold in that part of the body, but you are usually picked on for wearing them, i.e. wedgies, swirlies, pantsed, beat up, called names like nerd, loser ect..","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":7747872,"ranking":13,"query_text":"definition wedgie","passage_text":"1. the state of having one's underpants or shorts caught between one's buttocks (esp in the phrase give someone a wedgie).","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":2972446,"ranking":14,"query_text":"definition wedgie","passage_text":"The dumbest, oddest, and craziest answers ever said on various game shows. Footage credit: Stupid Gameshow Answers and Atomic Wedgie. 1  Comedy.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":7747875,"ranking":15,"query_text":"definition wedgie","passage_text":"Wedgies are commonly featured in popular works, either as a form of low comedy or as a behaviour representative of bullying. In such works, briefs are usually the type of underpants that are worn by the victim.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":1489234,"ranking":16,"query_text":"definition wedgie","passage_text":"Nate Wright has the answer: a good old-fashioned wedgie! The whole gang from P.S. 38 is back for more hijinks, hilarity, and underwear hoisting in this new collection of Big Nate comics.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":2899270,"ranking":17,"query_text":"definition wedgie","passage_text":"We serve the best: 1  Hand-tossed and gourmet pizzas. 2  Strombolis. 3  Hoagies. 4  Wedgie sandwiches. 5  Wings and appetizers. 6  Salads. 7  Bread sticks and sides.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":3192206,"ranking":18,"query_text":"definition wedgie","passage_text":"Wedge (footwear) Wedge boots, wedgies, or lifties are shoes and boots with a sole in the form of a wedge, such that one piece of material, normally rubber, serves as both the sole and the heel. This design dates back to ancient Greece.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":8678528,"ranking":19,"query_text":"definition wedgie","passage_text":"Wedged-heeled sandals. Wedge boots, wedgies or lifties are shoes and boots with a sole in the form of a wedge so that one piece of material, normally rubber, serves as both the sole and the heel. The design dates back to ancient Greece.","bm25_label":"high","relevance_label":0.0},{"query_id":140161,"passage_id":5676512,"ranking":20,"query_text":"definition wedgie","passage_text":"A wedgie (sometimes also known as a gotchie or grundy or melvin) is any one of a variety of pranks involving pulling the victim's underwear up so that it wedges between the buttocks and may even be performed to the extent that the victim's underpants are torn off.","bm25_label":"high","relevance_label":0.0}]