[{"query_id":140367,"passage_id":7977280,"ranking":1,"query_text":"degenerate matter is formed when","passage_text":"Metallic hydrogen is a common form of degenerate matter. Degenerate matter is a bizarre form of exotic matter created in the cores of massive stars. There is a large amount of degenerate matter in Jupiter's core. View slideshow of images above","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7977283,"ranking":2,"query_text":"degenerate matter is formed when","passage_text":"How is neutron degenerate matter created? Neutron degenerate matter forms when the core of a massive star stops producing energy and collapses under the force of gravity while the outer portions are blasted away i â\u0080¦ n a supernova explosion.","bm25_label":"high","relevance_label":1.0},{"query_id":140367,"passage_id":154565,"ranking":3,"query_text":"degenerate matter is formed when","passage_text":"degeneration. deterioration; change from a higher to a lower form, especially change of tissue to a lower or less functionally active form. When there is chemical change of the tissue itself it is true degeneration; when the change consists in the deposit of abnormal matter in the tissues, it is infiltration.apetoretinal degeneration degeneration of the pigmented layer of the retina. transneuronal degeneration atrophy of certain neurons after interruption of afferent axons or death of other neurons to which they send their efferent output.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7977282,"ranking":4,"query_text":"degenerate matter is formed when","passage_text":"Degenerate matter is extremely dense matter with characteristics governed by quantum mechanics. One of the notable traits is that temperature and pressure are independent of one another. Two forms of matter known to exist are electron degenerate matter, which comprises white dwarfs, and neutron degenerate matter, which comprises neutron stars.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7360894,"ranking":5,"query_text":"degenerate matter is formed when","passage_text":"degeneration with increased mucin which can be epithelial or mesenchymal in origin. mucous degeneration. degeneration with accumulation of mucus in epithelial tissues. Called also myxomatous degeneration.deterioration; change from a higher to a lower form, especially change of tissue to a lower or less functionally active form. When there is chemical change of the tissue itself it is true degeneration; when the change consists in the deposit of abnormal matter in the tissues, it is infiltration.eripheral chorioretinal degeneration See paving-stone degeneration. peripheral cystoid degeneration A degenerative process in the peripheral retina that occurs almost universally in the elderly. It consists of numerous, discrete cystic spaces in the outer plexiform or inner nuclear layer presenting a frothy appearance.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":6237487,"ranking":6,"query_text":"degenerate matter is formed when","passage_text":"deterioration; change from a higher to a lower form, especially change of tissue to a lower or less functionally active form. When there is chemical change of the tissue itself it is true degeneration; when the change consists in the deposit of abnormal matter in the tissues, it is infiltration.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7977285,"ranking":7,"query_text":"degenerate matter is formed when","passage_text":"Degenerate matter is a form of exotic matter that's created in the cores of massive stars. It's unique in that its pressure is...","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":3641166,"ranking":8,"query_text":"degenerate matter is formed when","passage_text":"Metallic hydrogen is a state of hydrogen which results when it is sufficiently compressed and undergoes a phase transition (from one phase or state of matter to another); it is an illustration of degenerate matter (degenerate matter is matter which has such extraordinarily high density).","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":6237486,"ranking":9,"query_text":"degenerate matter is formed when","passage_text":"When there is chemical change of the tissue itself, it is true degeneration; when the change consists in the deposit of abnormal matter in the tissues, it is infiltration. adj., adj degenÂ´erative. caseous degeneration caseation (def. 2).","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":902611,"ranking":10,"query_text":"degenerate matter is formed when","passage_text":"When damage occurs to white matter, immune responses can lead to inflammation in the CNS, along with loss of myelin. The degeneration of white matter can be seen in a MRI and used to diagnose leukodystrophy. Leukodystrophy is characterized by specific symptoms including decreased motor function, muscle rigidity, and eventually degeneration of sight and hearing.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7977279,"ranking":11,"query_text":"degenerate matter is formed when","passage_text":"The most extreme form of degenerate matter, strange matter, is thought to exist in quark stars, stars with a mass somewhere between neutron stars and black holes, in which the constituent quarks of neutrons decouple and a quark soup is created.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":184401,"ranking":12,"query_text":"degenerate matter is formed when","passage_text":"When damage occurs to white matter, immune responses can lead to inflammation in the CNS, along with loss of myelin. The degeneration of white matter can be seen in a MRI and used to diagnose leukodystrophy.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7648380,"ranking":13,"query_text":"degenerate matter is formed when","passage_text":"Symptoms of White Matter Brain Disease. White matter brain disease results in the degeneration of white matter, which creates a large portion of the brain. The primary form of white matter brain disease is multiple sclerosis, which results in the destruction of the myelin sheath. In multiple sclerosis, there is defective formation or maintenance of the myelin because of dysfunction of the oligodendrocytes, a type of glial cell.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":2910528,"ranking":14,"query_text":"degenerate matter is formed when","passage_text":"The leukodystrophies are caused by imperfect growth or development of the myelin sheath, the fatty covering that acts as an insulator around nerve fibers. When damage occurs to white matter, immune responses can lead to inflammation in the CNS, along with loss of myelin. The degeneration of white matter can be seen in a MRI and used to diagnose leukodystrophy. Leukodystrophy is characterized by specific symptoms including decreased motor function, muscle rigidity, and eventually degeneration of sight and hearing.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7977287,"ranking":15,"query_text":"degenerate matter is formed when","passage_text":"Degenerate matter is a bizarre form of exotic matter created in the cores of massive stars, where atoms or even subatomic particles are packed so closely that the primary source of pressure is no longer thermal but quantum - dictated by limitations set by the Pauli exclusion principle, which asserts that no two particles can occupy the same quantum ...","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":7977286,"ranking":16,"query_text":"degenerate matter is formed when","passage_text":"Degenerate matter is a bizarre form of exotic matter created in the cores of massive stars, where atoms or even subatomic particles are packed so closely that the primary source of pressure is no longer thermal but quantum - dictated by limitations set by the Pauli exclusion principle, which asserts that no two particles can occupy the same quantum state.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":2238599,"ranking":17,"query_text":"degenerate matter is formed when","passage_text":"State of matter. In physics, a state of matter is one of the distinct forms in which matter can exist. Four states of matter are observable in everyday life: solid, liquid, gas, and plasma. Many other states are known to exist, such as glass or liquid crystal, and some only exist under extreme conditions, such as Boseâ\u0080\u0093Einstein condensates, neutron-degenerate matter, and quark-gluon plasma, which only occur, respectively, in situations of extreme cold, extreme density, and extremely high-energy. Some other ...","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":8046016,"ranking":18,"query_text":"degenerate matter is formed when","passage_text":"In physics, a state of matter is one of the distinct forms in which matter can exist. Four states of matter are observable in everyday life: solid, liquid, gas, and plasma. Many other states are known to exist, such as glass or liquid crystal, and some only exist under extreme conditions, such as Boseâ\u0080\u0093Einstein condensates, neutron-degenerate matter, and quark-gluon plasma, which only occur, respectively, in situations of extreme cold, extreme density, and extremely high-energy. Some other ...","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":5551466,"ranking":19,"query_text":"degenerate matter is formed when","passage_text":"Macular Degeneration. There are two major forms of macular degeneration: atrophic (dry) and exudative (wet). 90% of all macular degeneration is the dry form, but 90% of all legal blindness from macular degeneration is due to wet macular degeneration.","bm25_label":"high","relevance_label":0.0},{"query_id":140367,"passage_id":2910524,"ranking":20,"query_text":"degenerate matter is formed when","passage_text":"Leukodystrophy is one of a group of disorders characterized by degeneration of the white matter in the brain.","bm25_label":"high","relevance_label":0.0}]