[{"query_id":142039,"passage_id":7374759,"ranking":1,"query_text":"description of how early pregnancy bloating feels","passage_text":"Bloating In Early Pregnancy. Facts About Bloating in Early Pregnancy. Bloating in early pregnancy is uncomfortable and it feels unsightly. Of course, you know the feeling that comes along with your monthly menstruation, so in early pregnancy bloating is no stranger.","bm25_label":"high","relevance_label":1.0},{"query_id":142039,"passage_id":1829968,"ranking":2,"query_text":"description of how early pregnancy bloating feels","passage_text":"1 The flood of hormones in your body in early pregnancy can make you unusually emotional and weepy. Mood swings also are common.  Bloating. Hormonal changes during early pregnancy can cause you to feel bloated, similar to how you might feel at the start of a menstrual period.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":1829967,"ranking":3,"query_text":"description of how early pregnancy bloating feels","passage_text":"1 The flood of hormones in your body in early pregnancy can make you unusually emotional and weepy. Mood swings also are common. 2  Bloating. Hormonal changes during early pregnancy can cause you to feel bloated, similar to how you might feel at the start of a menstrual period.  Light spotting.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":7410988,"ranking":4,"query_text":"description of how early pregnancy bloating feels","passage_text":"Other less obvious signs and symptoms of pregnancy that you might experience during the first trimester include: Moodiness. The flood of hormones in your body in early pregnancy can make you unusually emotional and weepy. Mood swings also are common. Bloating. Hormonal changes during early pregnancy can cause you to feel bloated, similar to how you might feel at the start of a menstrual period. Light spotting.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":456507,"ranking":5,"query_text":"description of how early pregnancy bloating feels","passage_text":"1 Hormonal changes during early pregnancy can cause you to feel bloated, similar to how you might feel at the start of a menstrual period.  Light spotting. Sometimes a small amount of light spotting is one of the first signs of pregnancy.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":6332395,"ranking":6,"query_text":"description of how early pregnancy bloating feels","passage_text":"Bloating is one of the common symptoms of pregnancy that many women experience. It is a condition of excess gas in the body that makes you feel uncomfortable . You may experience frequent bloating in early pregnancy, but as you get closer towards the end of pregnancy, you may feel less bloated.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":6332389,"ranking":7,"query_text":"description of how early pregnancy bloating feels","passage_text":"Every person on the planet will have some gas and this is natural. Experts say that average person passes gas around 15 times daily and it is still considered normal to do so 40 times in one day. To answer the question, yes bloating is an early sign of pregnancy. Sometimes it can be hard to distinguish early pregnancy bloating and pre-period bloating, but most women do in fact feel bloated early on during their pregnancy.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":6332390,"ranking":8,"query_text":"description of how early pregnancy bloating feels","passage_text":"Though early pregnancy bloating is hard to differentiate from pre-period bloating, it is something you may feel at the beginning of pregnancy. The heavy feeling is not because of the baby, but due to the progesterone hormone that alters the digestion by passing the nutrients to your baby through the bloodstream.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":1984928,"ranking":9,"query_text":"description of how early pregnancy bloating feels","passage_text":"Most pregnancy tests will be positive by the time a woman has missed her period. Other early signs of pregnancy include fatigue, feeling bloated, frequent urination, mood swings, nausea, and tender or swollen breasts. Not all women have all of these symptoms, but it is common to have at least one of them.ost pregnancy tests will be positive by the time a woman has missed her period. Other early signs of pregnancy include fatigue, feeling bloated, frequent urination, mood swings, nausea, and tender or swollen breasts. Not all women have all of these symptoms, but it is common to have at least one of them.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":6937610,"ranking":10,"query_text":"description of how early pregnancy bloating feels","passage_text":"Discover what's in store for you during pregnancy, from symptoms you'll be feeling and what to put on your to-do list to when y... Pregnancy symptoms: Top 11 early signs of pregnancy. You might be pregnant if you have early symptoms of pregnancy, such as nausea, fatigue, light bleeding, sore breasts, bloating,...","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":8811152,"ranking":11,"query_text":"description of how early pregnancy bloating feels","passage_text":"Some women start to show very early in their pregnancies. If you have been pregnant before, your uterus and abdominal muscles may be more relaxed. Your pregnant belly may seem to â\u0080\u009cpop outâ\u0080\u009d right away. At eight weeks your uterus is about the size of a tennis ball. It is normally the size of a lemon. This is not a remarkable change in size but it may cause your clothes to feel a little snugger. During early pregnancy, you may feel bloated, similar to how you feel right before your period starts.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":6806721,"ranking":12,"query_text":"description of how early pregnancy bloating feels","passage_text":"Similar to symptoms of a menstrual period, bloating may occur during early pregnancy. This may be due to hormone changes, which can also slow your digestive system down. You may feel constipated and blocked as a result. Constipation can also increase feelings of abdominal bloating.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":8563205,"ranking":13,"query_text":"description of how early pregnancy bloating feels","passage_text":"Find out how home pregnancy tests work and how soon you can take one. Pregnancy symptoms: Top 11 early signs of pregnancy You might be pregnant if you have early symptoms of pregnancy, such as nausea, fatigue, light bleeding, sore breasts, bloating,...","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":4033692,"ranking":14,"query_text":"description of how early pregnancy bloating feels","passage_text":"1 Hormonal changes during early pregnancy can cause you to feel bloated, similar to how you might feel at the start of a menstrual period.  Light spotting. Sometimes a small amount of light spotting is one of the first signs of pregnancy. Known as implantation bleeding, it happens when the fertilized egg attaches to the lining of the uterus â\u0080\u0094 about 10 to 14 days after conception. Implantation bleeding occurs around the time of a menstrual period.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":1280646,"ranking":15,"query_text":"description of how early pregnancy bloating feels","passage_text":"Are gas and bloating early signs of pregnancy? As mentioned above, the high pregnancy hormone levels begin to relax the digestive tract muscles from the early weeks of pregnancy, making gas and bloating two of the earliest pregnancy symptoms [6]. Foods likely to cause gas and bloating while pregnant.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":1156430,"ranking":16,"query_text":"description of how early pregnancy bloating feels","passage_text":"During pregnancy, the cervix tends to be softer, while a non-pregnant cervix will be firmer to the touch. This is due to the increase of blood flow during early pregnancy. The additional blood flow causes the cervix to become bloated and softer, so it feels more pliable to the touch.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":6937614,"ranking":17,"query_text":"description of how early pregnancy bloating feels","passage_text":"Pregnancy symptoms: Top 11 early signs of pregnancy You might be pregnant if you have early symptoms of pregnancy, such as nausea, fatigue, light bleeding, sore breasts, bloating,... Video playlist: 6 common pregnancy symptoms Learn how to get relief from common pregnancy symptoms such as constipation, heartburn, and frequent urination.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":2344726,"ranking":18,"query_text":"description of how early pregnancy bloating feels","passage_text":"A new home pregnancy test offers a fascinating piece of information â\u0080\u0093 not just whether you're pregnant, but how many week... Pregnancy symptoms: Top 11 early signs of pregnancy. You might be pregnant if you have early symptoms of pregnancy, such as nausea, fatigue, light bleeding, sore breasts, bloating,...","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":5844311,"ranking":19,"query_text":"description of how early pregnancy bloating feels","passage_text":"While others can't yet detect your pregnancy, by 5 weeks pregnant you may start feeling pregnant. If you have given birth previously you might notice your abdomen looks slightly larger than usual. This is largely the result of bloating. The uterus doesn't rise out of the pelvis until roughly 14 weeks pregnant but many women start experiencing bloating during early pregnancy. You may find your belly looks more poofy at the end of the day than early in the morning. Some women mistake this early pregnancy sign as a premenstrual sign.","bm25_label":"high","relevance_label":0.0},{"query_id":142039,"passage_id":5539679,"ranking":20,"query_text":"description of how early pregnancy bloating feels","passage_text":"Many women experience bloating, mild cramping and slight backache as a pre-menstrual physical symptom, and the same thing happens in early pregnancy as the uterus grows. Many women worry when they feel mild cramping, tugging and pulling in the early weeks after conception.","bm25_label":"high","relevance_label":0.0}]