[{"query_id":142782,"passage_id":7495372,"ranking":1,"query_text":"diabetes medication farxiga","passage_text":"FARXIGA is indicated as an adjunct to diet and exercise to improve glycemic control in adults with type 2 diabetes mellitus. FARXIGA is not recommended for patients with type 1 diabetes mellitus or for the treatment of diabetic ketoacidosis. Please read US Full Prescribing Information and Medication Guide for FARXIGA.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":8415801,"ranking":2,"query_text":"diabetes medication farxiga","passage_text":"FARXIGA works with the body to flush sugar away in urine. In a clinical trial of adults with type 2 diabetes, FARXIGA 10 mg was shown to remove approximately 70 grams of sugar in the urine per day at the end of a 12-week period. FARXIGA is part of a class of type 2 diabetes medications called SGLT2 (sodium-glucose cotransporter 2) inhibitors.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":733108,"ranking":3,"query_text":"diabetes medication farxiga","passage_text":"What is Farxiga? Farxiga (dapagliflozin) is an oral diabetes medicine that helps control blood sugar levels. Dapagliflozin works by helping the kidneys get rid of glucose from your bloodstream. Farxiga is used together with diet and exercise to treat type 2 diabetes. Farxiga is not for treating type 1 diabetes. You should not use Farxiga if you have severe kidney disease, if you are on dialysis, or if you have diabetic ketoacidosis. Farxiga is not for treating type 1 diabetes.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":7495377,"ranking":4,"query_text":"diabetes medication farxiga","passage_text":"What is Farxiga? Farxiga (dapagliflozin) is an oral diabetes medicine that helps control blood sugar levels. Dapagliflozin works by helping the kidneys get rid of glucose from your bloodstream. Farxiga is used together with diet and exercise to treat type 2 diabetes. Farxiga is not for treating type 1 diabetes.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":2598556,"ranking":5,"query_text":"diabetes medication farxiga","passage_text":"Farxiga (dapagliflozin) is an oral diabetes medicine that helps control blood sugar levels. Dapagliflozin works by helping the kidneys get rid of glucose from your bloodstream. Farxiga is used together with diet and exercise to treat type 2 diabetes. Farxiga is not for treating type 1 diabetes.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":8415803,"ranking":6,"query_text":"diabetes medication farxiga","passage_text":"FARXIGA is a once-daily pill, taken in the morning, with or without food. FARXIGA should not be used to treat people with type 1 diabetes or diabetic ketoacidosis (increased ketones in your blood or urine). Do not take FARXIGA if you have severe kidney problems or are on dialysis. Your healthcare provider should do blood tests to check how well your kidneys are working before and during your treatment with FARXIGA. Do not take FARXIGA if you: Are allergic to dapagliflozin or any of the ingredients in FARXIGA.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":7495371,"ranking":7,"query_text":"diabetes medication farxiga","passage_text":"FARXIGA is a prescription medicine used along with diet and exercise to lower blood sugar in adults with type 2 diabetes. FARXIGA should not be used to treat people with type 1 diabetes or diabetic ketoacidosis (increased ketones in your blood or urine). CLOSE.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":4292220,"ranking":8,"query_text":"diabetes medication farxiga","passage_text":"Jardiance is an oral medication used to improve glycemia (blood glucose) control in patients with type 2 diabetes. Jardiance is a sodium-glucose cotransporter (SGLT2) inhibitor. It is similar to canagliflozin (Invokana) and dapagliflozin (Farxiga).","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":7495374,"ranking":9,"query_text":"diabetes medication farxiga","passage_text":"FARXIGA is not recommended for patients with type 1 diabetes mellitus or for the treatment of diabetic ketoacidosis. FARXIGA is not indicated for weight loss or the treatment of hypertension. *Up to 7-lb. weight reduction was reported in clinical trials. *Up to 7-lb. weight reduction was reported in clinical trials.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":7495370,"ranking":10,"query_text":"diabetes medication farxiga","passage_text":"The agency just approved a new diabetes medication that doesn't noticeably improve health but may in fact be linked to cancer. It's called Farxiga (Dapagliflozin) and it will be available--and probably widely advertised--very soon. The good news is that the drug lowers blood sugar, which is a major symptom of type 2 diabetes. However, lowering blood sugar is not necessarily a way to improve health.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":2292924,"ranking":11,"query_text":"diabetes medication farxiga","passage_text":"A total of 182 subjects with type 2 diabetes were evaluated on the change in total body weight (TBW) and were treated with a combination of Farxiga 10 mg with metformin or placebo with metformin. 1  After 24 weeks, the Farxiga group had an average weight reduction of -2.96 kg versus -0.88 kg in the placebo group. After 102 weeks, the Farxiga group had an average weight reduction of -5.43 kg versus -2.12 kg in the placebo group.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":7495369,"ranking":12,"query_text":"diabetes medication farxiga","passage_text":"Last reviewed on RxList 11\/18\/2016. Farxiga (dapagliflozin) is a sodium-glucose co-transporter 2 (SGLT2) inhibitor used as an adjunct to diet and exercise to improve glycemic control in adults with type 2 diabetes mellitus. Common side effects of Farxiga include: yeast infections of the vagina or penis, urinary tract infections,","bm25_label":"high","relevance_label":1.0},{"query_id":142782,"passage_id":4620608,"ranking":13,"query_text":"diabetes medication farxiga","passage_text":"NewsFDA Approves Farxiga to Treat Type 2 Diabetes. This article was updated to include U.S. Food & Drug Administration warnings for ketoacidosis and kidney injury. The U.S. Food and Drug Administration in early January approved a new pill from Bristol-Meyers Squibb Co. and AstraZeneca to treat Type 2 diabetes after previously rejecting the drug. FDA officials last week announced Farxiga (dapaglifozin) can now be marketed and sold in the U.S. Itâ\u0080\u0099s the agencyâ\u0080\u0099s first new approval in 2014.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":863082,"ranking":14,"query_text":"diabetes medication farxiga","passage_text":"In May 2015 the FDA had announced it was investigating a association between Farxiga, Jardiance, and Invokana with diabetic ketoacidosis (DKA), ketoacidosis, or ketosis. See: â\u0080\u009cFDA Drug Safety Communication: FDA warns that SGLT2 inhibitors for diabetes may result in a serious condition of too much acid in the bloodâ\u0080\u009d.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":2598550,"ranking":15,"query_text":"diabetes medication farxiga","passage_text":"To make sure Farxiga is safe for you, tell your doctor if you have: 1  kidney disease; 2  a history of bladder cancer; 3  liver disease; 4  congestive heart failure; 5  low blood pressure; 6  high cholesterol levels. 7  if you use insulin or take other oral diabetes medications; 8  if you are on a low salt diet; or. 9  if you take blood pressure medicine.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":4620610,"ranking":16,"query_text":"diabetes medication farxiga","passage_text":"This medicine can cause positive results with certain lab tests for glucose (sugar) in the urine. Tell any doctor who treats you that you are using Farxiga. Farxiga is only part of a treatment program that may also include diet, exercise, weight control, regular blood sugar testing, and special medical care.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":1277506,"ranking":17,"query_text":"diabetes medication farxiga","passage_text":"Canagliflozin (Invokana) and dapagliflozin (Farxiga) are SGLT2 inhibitors that have recently been approved by the FDA to treat type 2 diabetes. Because they increase glucose levels in the urine, side effects can include urinary tract and yeast infections.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":863078,"ranking":18,"query_text":"diabetes medication farxiga","passage_text":"From that email alert we get this: Health Canada initiated a safety review for the prescription diabetes drugs [Forxiga \/ Farxiga (dapagliflozin)] and [Invokana (canagliflozin)] and the risk of ketoacidosis, a serious condition that leads to high levels of blood acids called ketonesâ\u0080¦.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":3110252,"ranking":19,"query_text":"diabetes medication farxiga","passage_text":"The U.S. Food and Drug Administration released a safety communication informing the public of stronger kidney injury warning labels on SGLT2 inhibitors that treat Type 2 diabetes, including J&Jâ\u0080\u0099s Invokana\/Invokamet (Canagliflozin) and Farxiga\/Xigduo XR.","bm25_label":"high","relevance_label":0.0},{"query_id":142782,"passage_id":7495376,"ranking":20,"query_text":"diabetes medication farxiga","passage_text":"Based on the findings of the companies making and selling Farxiga, FDA scientists concluded that the drug might stimulate bladder cancer in patients already at risk. The fear is that patients take diabetes drugs for years, and the longer someone takes this drug, the greater their risk of cancer.","bm25_label":"high","relevance_label":0.0}]