[{"query_id":149853,"passage_id":4498871,"ranking":1,"query_text":"different kinds of spruce trees","passage_text":"I need help in deciding on Norway Spruce or White Spruce. I plan to plant two rows of evergreen trees to buffer the front yard from the semi busy road. Because of the deer issue, I seem to be left with spruce trees as the only options.hite Spruce comes cheaper by 1\/3 than Norway Spruce, other than that, I don't know what's the difference between these two kinds of spruces and would appreciate any input in helping me making the choice.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":4016934,"ranking":2,"query_text":"different kinds of spruce trees","passage_text":"conifer; coniferous tree (any gymnospermous tree or shrub bearing cones) Meronyms (substance of spruce): spruce (light soft moderately strong wood of spruce trees; used especially for timbers and millwork) Hyponyms (each of the following is a kind of spruce): Picea obovata; Siberian spruce (tall spruce of northern Europe and Asia; resembles Norway spruce)","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":7385217,"ranking":3,"query_text":"different kinds of spruce trees","passage_text":"Spruce Tree Scientific Name, Picea. Spruce trees are cone bearing trees and can therefore be classified as coniferous. Other coniferous trees include pine trees, Douglas Fir trees, redwood trees and cedar trees. Spruce Tree Types: List of Different Type of Spruce. Bird's Nest Spruce, dwarf variety of Norway Spruce.","bm25_label":"high","relevance_label":1.0},{"query_id":149853,"passage_id":6302495,"ranking":4,"query_text":"different kinds of spruce trees","passage_text":"Description: Douglas-fir trees, which are also called red firs, Oregon pines, and Douglas spruce, are neither true fir trees nor pines nor spruces! The scientific genus name Pseudotsuga means â\u0080\u009cfalse hemlock,â\u0080\u009d alluding to another kind of tree that Douglas-firs are similar too.escription: Douglas-fir trees, which are also called red firs, Oregon pines, and Douglas spruce, are neither true fir trees nor pines nor spruces! The scientific genus name Pseudotsuga means â\u0080\u009cfalse hemlock,â\u0080\u009d alluding to another kind of tree that Douglas-firs are similar too.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":5863434,"ranking":5,"query_text":"different kinds of spruce trees","passage_text":"In particular, spruce and pine trees show needle browning and dieback. Spruce trees have small needles arranged along the stem. Pine trees have needles in bundles of two, three, or five along the stem. Spruce trees are experiencing three different diseases, each with slightly different symptoms and treatment.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":7258384,"ranking":6,"query_text":"different kinds of spruce trees","passage_text":"A variety of plants and trees grow on a mountain. Trees are plentiful on a mountain and include pine, maple, and spruce. Other kinds of mountainous plants are laurel, dais â\u0080¦ ies, and ferns.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":5546877,"ranking":7,"query_text":"different kinds of spruce trees","passage_text":"EVERGREEN TREE TYPES. In botany, an evergreen tree type or plant is a plant that has leaves in all seasons. This contrasts with deciduous tree type or plants, which completely lose their foliage during the winter or dry season. There are many different kinds of evergreen plants, both trees and shrubs. Evergreens include: most species of conifers (e.g., hemlock trees, blue spruce tree , red cedar, and white\/scots\/jack pine trees) live oak, holly, and ancient gymnosperms such as cycads.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":6601849,"ranking":8,"query_text":"different kinds of spruce trees","passage_text":"Types of Trees. The types of trees that we grow and offer at our farm include: Canaan Fir, Colorado Spruce, Norway Spruce, Scotch Pine, and White Pine. People tend to have differences in opinion as to what makes the most beautiful Christmas tree.he types of trees that we grow and offer at our farm include: Canaan Fir, Colorado Spruce, Norway Spruce, Scotch Pine, and White Pine.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":7385216,"ranking":9,"query_text":"different kinds of spruce trees","passage_text":"Spruce Trees. 1  Spruce Tree Pictures Gallery contains many photos of spruce trees. You will find useful info about spruce trees, spruce wood, types of spruce trees and facts on the spruce tree species. 2  Enlarge each Spruce tree picture just click on the tree image you like to full size the spruce tree photo.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":8503449,"ranking":10,"query_text":"different kinds of spruce trees","passage_text":"The spruce trees of North America include seven different species, all of them growing north of Mexico, mostly in cool climate locations. Spruce trees are important producers of lumber and are also useful in an ornamental capacity.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":483955,"ranking":11,"query_text":"different kinds of spruce trees","passage_text":"of the sort. something of the sort. something of the kind just mentioned. The tree isn't exactly a spruce tree, just something of the sort. Jane has a cold or something of the sort. See also: of, sort.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":8503446,"ranking":12,"query_text":"different kinds of spruce trees","passage_text":"The spruce trees of North America include seven different species, all of them growing north of Mexico, mostly in cool climate locations. Spruce trees are important producers of lumber and are also useful in an ornamental capacity. The spruces all have evergreen needles, most are tall and they have a conical shape.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":3125146,"ranking":13,"query_text":"different kinds of spruce trees","passage_text":"Evergreen Everlasting: The Differences between Fir, Spruce and Pine With so many artificial Christmas trees available in the market, itâ\u0080\u0099s difficult it is to tell each one apart. Howâ\u0080\u0099s a person supposed to tell the difference between a Norwegian Spruce and a Balsam Fir? And often, we want to make sure that our trees look like their Natural namesakes. Fir, spruce, and pine are three of the most popular Christmas tree varieties and have their own characteristics that make them special.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":3673401,"ranking":14,"query_text":"different kinds of spruce trees","passage_text":"The gymnosperms are primarily conifers (cone bearing trees and shrubs) such as the spruce, pine and fir trees. They are non-flowering plants that produce seeds not encased in â\u0080¦any kind of carpel or fruit. The seeds form on the scales of the cone.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":7377275,"ranking":15,"query_text":"different kinds of spruce trees","passage_text":"Differences Between Spruce & Fir Trees. Spruce and fir trees are biologically close cousins that belong to the family of evergreens known as conifers, or cone-bearing trees. Both species inhabit northern or high-altitude regions where the weather is typically cold during winter. At one time both species were referred to as fir trees.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":7377270,"ranking":16,"query_text":"different kinds of spruce trees","passage_text":"One of the easiest ways to tell the difference between a spruce tree and a pine tree is by looking closely at their needles. While spruce needles tend to be shorter than those of pines -- roughly 1-inch long -- it's their notable stiffness that really gives them away.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":2714584,"ranking":17,"query_text":"different kinds of spruce trees","passage_text":"There are several different tree species used as Christmas trees, such as the fir, pine, spruce, cypress and cedar. For each of the main category of Christmas trees, there are also different types among those. Plus, there are many different varieties of artificial Christmas trees available. Continue Reading.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":2714586,"ranking":18,"query_text":"different kinds of spruce trees","passage_text":"There are several different tree species used as Christmas trees, such as the fir, pine, spruce, cypress and cedar. For each of the main category of Christmas trees, there are also different types among those. Plus, there are many different varieties of artificial Christmas trees available. Keep Learning.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":2515078,"ranking":19,"query_text":"different kinds of spruce trees","passage_text":"Taiga: Plants Because the climate of the taiga is very cold, there is not a large variety of plant life. The most common type of tree found in the taiga is the conifer--trees that have cones.Four kinds of conifers are common in the taiga. Three of the common conifers are evergreens; spruce, fir, and pine.The fourth common conifer is the tamarack, or larch, a deciduous tree.Under certain conditions, broadleaf trees, such as birch and aspen, are able to survive the harsh climate of the taiga.our kinds of conifers are common in the taiga. Three of the common conifers are evergreens; spruce, fir, and pine. The fourth common conifer is the tamarack, or larch, a deciduous tree. Under certain conditions, broadleaf trees, such as birch and aspen, are able to survive the harsh climate of the taiga.","bm25_label":"high","relevance_label":0.0},{"query_id":149853,"passage_id":457999,"ranking":20,"query_text":"different kinds of spruce trees","passage_text":"Taiga: Plants Because the climate of the taiga is very cold, there is not a large variety of plant life. The most common type of tree found in the taiga is the conifer--trees that have cones. Four kinds of conifers are common in the taiga. Three of the common conifers are evergreens; spruce, fir, and pine.The fourth common conifer is the tamarack, or larch, a deciduous tree.Under certain conditions, broadleaf trees, such as birch and aspen, are able to survive the harsh climate of the taiga.our kinds of conifers are common in the taiga. Three of the common conifers are evergreens; spruce, fir, and pine. The fourth common conifer is the tamarack, or larch, a deciduous tree. Under certain conditions, broadleaf trees, such as birch and aspen, are able to survive the harsh climate of the taiga.","bm25_label":"high","relevance_label":0.0}]