[{"query_id":153794,"passage_id":7348274,"ranking":1,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Distance from Pittsburgh, PA to New York, NY. The total distance from Pittsburgh, PA to New York, NY is 316 miles. This is equivalent to 508 kilometers or 274 nautical miles. Your trip begins in Pittsburgh, Pennsylvania. It ends in New York, New York. Your flight direction from Pittsburgh, PA to New York, NY is East (85 degrees from North).","bm25_label":"high","relevance_label":1.0},{"query_id":153794,"passage_id":7348279,"ranking":2,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Pittsburgh, PA to New York, NY. The total driving distance from Pittsburgh, PA to New York, NY is 371 miles or 597 kilometers. Your trip begins in Pittsburgh, Pennsylvania. It ends in New York, New York.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":6403078,"ranking":3,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Batavia, NY to Pittsburgh, PA. The total driving distance from Batavia, NY to Pittsburgh, PA is 252 miles or 406 kilometers. Your trip begins in Batavia, New York. It ends in Pittsburgh, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":7348276,"ranking":4,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"There are miles from Pittsburgh and New York and miles by car. Pittsburgh and New York are far apart (by car). This is the best Pittsburgh, PA-New York, NY route.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":7973346,"ranking":5,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Distance conversions between Erie, PA and Pittsburgh, PA This table shows distance in kilometers, miles and nautical miles between Erie, PA and Pittsburgh, PA: Distance type","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":7973348,"ranking":6,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Your journey from Erie, PA to Pittsburgh, PA by car will take: Distance conversions between Erie, PA and Pittsburgh, PA. This table shows distance in kilometers, miles and nautical miles between Erie, PA and Pittsburgh, PA:","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":1324121,"ranking":7,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Pittsburgh, PA to Greensburg, PA. The total driving distance from Pittsburgh, PA to Greensburg, PA is 34 miles or 55 kilometers. Your trip begins in Pittsburgh, Pennsylvania. It ends in Greensburg, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":1538981,"ranking":8,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Pittsburgh, PA to Williamsport, PA. The total driving distance from Pittsburgh, PA to Williamsport, PA is 199 miles or 320 kilometers. Your trip begins in Pittsburgh, Pennsylvania. It ends in Williamsport, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":6399796,"ranking":9,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Pittsburgh, PA to Birdsboro, PA. The total driving distance from Pittsburgh, PA to Birdsboro, PA is 266 miles or 428 kilometers. Your trip begins in Pittsburgh, Pennsylvania. It ends in Birdsboro, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":6403075,"ranking":10,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Pittsburgh, PA to Cheswick, PA. The total driving distance from Pittsburgh, PA to Cheswick, PA is 15 miles or 24 kilometers. Your trip begins in Pittsburgh, Pennsylvania. It ends in Cheswick, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":6594031,"ranking":11,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Williamsport, PA to Pittsburgh, PA. The total driving distance from Williamsport, PA to Pittsburgh, PA is 195 miles or 314 kilometers. Your trip begins in Williamsport, Pennsylvania. It ends in Pittsburgh, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":887351,"ranking":12,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Pittsburgh, PA to Harmony, PA. The total driving distance from Pittsburgh, PA to Harmony, PA is 29 miles or 47 kilometers. Your trip begins in Pittsburgh, Pennsylvania. It ends in Harmony, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":2836126,"ranking":13,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Distance from Jim Thorpe, PA to Pittsburgh, PA. The total distance from Jim Thorpe, PA to Pittsburgh, PA is 226 miles. This is equivalent to 364 kilometers or 196 nautical miles. Your trip begins in Jim Thorpe, Pennsylvania. It ends in Pittsburgh, Pennsylvania. Your flight direction from Jim Thorpe, PA to Pittsburgh, PA is West (-96 degrees from North). The distance calculator helps you figure out how far it is to fly from Jim Thorpe, PA to Pittsburgh, PA. It does this by computing the straight line flying distance (as the crow flies).","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":2013910,"ranking":14,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving Distance from Pittsburgh, PA to Steubenville, OHGet the driving distance from Pittsburgh, Pennsylvania to Steubenville, Ohio in miles and kilometers. Steubenville Pike, Pittsburgh, PA | HomeFinder.comSee photos and schedule a showing for Steubenville Pike, Pittsburgh, PA.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":3971013,"ranking":15,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Distance from Pittsburgh, PA to Berlin, Germany. The total distance from Pittsburgh, PA to Berlin, Germany is 4,215 miles. This is equivalent to 6â\u0080\u0089783 kilometers or 3,663 nautical miles.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":5363291,"ranking":16,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Distance from Pittsburgh, PA to Washington, DC. There are miles from Pittsburgh to Washington and miles by car. Pittsburgh and Washington are far apart (by car). This is the best Pittsburgh, PA-Washington, DC route.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":5363298,"ranking":17,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Distance from Washington, DC to Pittsburgh, PA. There are miles from Washington to Pittsburgh and miles by car. Washington and Pittsburgh are far apart (by car). This is the best Washington, DC-Pittsburgh, PA route.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":6345219,"ranking":18,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Distance from Pittsburgh, PA to Atlanta, GA. There are miles from Pittsburgh to Atlanta and miles by car. Pittsburgh and Atlanta are far apart (by car). This is the best Pittsburgh, PA-Atlanta, GA route.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":5400785,"ranking":19,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"vacation deals to Mifflintown, PA. Driving distance from Pittsburgh, PA to Mifflintown, PA. The total driving distance from Pittsburgh, PA to Mifflintown, PA is 179 miles or 288 kilometers. Your trip begins in Pittsburgh, Pennsylvania. It ends in Mifflintown, Pennsylvania.","bm25_label":"high","relevance_label":0.0},{"query_id":153794,"passage_id":3237607,"ranking":20,"query_text":"distance in miles pittsburgh, pa to new york","passage_text":"Driving distance from Camp Hill, PA to Pittsburgh, PA. The total driving distance from Camp Hill, PA to Pittsburgh, PA is 200 miles or 322 kilometers. Your trip begins in Camp Hill, Pennsylvania. It ends in Pittsburgh, Pennsylvania.","bm25_label":"high","relevance_label":0.0}]