[{"query_id":155041,"passage_id":8108884,"ranking":1,"query_text":"do artichokes contain niacin","passage_text":"10 Artichoke also contains fiber, 1, 11 calcium, phosphorus, potassium, folic acid, vitamin C, niacin, thiamine, trace minerals, 1, 4 and carotenoids. 12 Acids present in artichoke consist primarily of acid alcohols, including glyceric, malic, citric, glycolic, lactic, and succinic acids.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":7780152,"ranking":2,"query_text":"do artichokes contain niacin","passage_text":"It contains vitamins which include vitamin C, thiamin, riboflavin, niacin, folate, vitamin B-6,B-12, A, E, D and vitamin K. Artichokes also provide minerals such as calcium, iron, zinc, sodium, potassium, manganese, phosphorus and zinc.","bm25_label":"high","relevance_label":1.0},{"query_id":155041,"passage_id":597172,"ranking":3,"query_text":"do artichokes contain niacin","passage_text":"Niacin is a form of vitamin B3. It is found in foods such as yeast, meat, fish, milk, eggs, green vegetables, and cereal grains. Niacin is also produced in the body from tryptophan, which is found in protein-containing food. When taken as a supplement, niacin is often found in combination with other B vitamins. Do not confuse niacin with niacinamide, inositol niacinamide, nicotinate (inositol hexaniacinate), or tryptophan.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":6223323,"ranking":4,"query_text":"do artichokes contain niacin","passage_text":"It is also rich in B-complex group of vitamins such as niacin, vitamin B-6 (pyridoxine), thiamin, and pantothenic acid that are essential for optimum cellular metabolic functions. Further, artichoke is rich source of minerals like copper, calcium, potassium, iron, manganese and phosphorus.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":3512864,"ranking":5,"query_text":"do artichokes contain niacin","passage_text":"Even though dried apricots do not contain thiamin and only have a small amount of folate and vitamin B-6, they retain a little more riboflavin and niacin. Your body uses riboflavin and niacin to form enzymes that metabolize food into energy.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":445873,"ranking":6,"query_text":"do artichokes contain niacin","passage_text":"The signs of niacin deficiency related to leg problems are enlarged hock joints and slipped tendons (called perosis) so the leg splays out. We do know that ducks have a higher requirement for niacin than chickens. NRC requirements for ducklings = 55 mg\/kg niacin compared to only 27-35 mg\/kg for chicks.On top of that, the niacin in corn has a very low bioavailability; although corn contains 24 mg\/kg of niacin, I use a value of 2 mg\/kg for formulation.ypically the pills contain 500 mgs of niacin per tablet. Assuming a duck is eating about .35 lbs per day (this is how much a Pekin is eating at about 3 -4 weeks of age) , they need 10 milligrams (mgs) of niacin a day. So, theoretically, one pill has enough niacin for 50 ducks.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":1472634,"ranking":7,"query_text":"do artichokes contain niacin","passage_text":"Healthy nonstarchy vegetable choices for diabetics include spinach, leafy greens, cucumbers, tomatoes, artichokes, asparagus, broccoli, cauliflower, cabbage, carrots and mushrooms. Meats do not contain carbohydrates and do not affect blood sugar.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":6641859,"ranking":8,"query_text":"do artichokes contain niacin","passage_text":"Using the list below for the 2 different walnuts nutrition entries in our database, the highest amount of Niacin is found in Nuts, walnuts, english which contains 1.125 mg of Niacin per 100g. The lowest amount of Niacin is in Nuts, walnuts, black, dried which in 100g contains 0.47 mg of Niacin. The average amount of Niacin contained in 100g of walnuts, based on the list below is 0.80 mg of Niacin.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":2830693,"ranking":9,"query_text":"do artichokes contain niacin","passage_text":"Posted in ' How to ' , Jerusalem artichokes , tagged Delicious Jerusalem Artichokes , Eating Jerusalem Artichokes , Fuseau Jerusalem Artichokes , growing Jerusalem Artichokes , How tall do Jerusalem Artichokes grow , How to plant Jerusalem Artichokes , How you grow Jerusalem Artichokes , Jerusalem artichokes , planting Jerusalem artichokes , Taste ...","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":1761290,"ranking":10,"query_text":"do artichokes contain niacin","passage_text":"Using the list below for the 7 different artichokes nutrition entries in our Carbs database, the highest amount of Carbs is in Jerusalem-artichokes, raw which contains 17 g of Carbs per 100g. The lowest amount of Carbs is in Artichokes, (globe or french), frozen, unprepared which in 100g contains 7 g of Carbs.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":1153712,"ranking":11,"query_text":"do artichokes contain niacin","passage_text":"Artichoke leaf supplements may be all the rage these days, but cooked artichoke hearts â\u0080\u0093 the soft edible flower buds of the Globe Artichoke â\u0080\u0093 deserve their own spotlight.ust like the leaves, the heart and inner leaves of the globe artichoke contain cynarin, the compound that is believed to be largely responsible for the positive effects of artichoke leaf supplements on cholesterol levels.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":3450916,"ranking":12,"query_text":"do artichokes contain niacin","passage_text":"A good, effective cleanse always contains niacin. As niacin is. ingested and metabolized the capillaries increase in size. Often doubling in size if the quality of the niacin there. There are several niacin products on the market and several. companies that manufacture niacin.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":8569522,"ranking":13,"query_text":"do artichokes contain niacin","passage_text":"Naturally, niacin can help reduce cholesterol in your body. Most of the over the counter medications for lowering cholesterol usually contain high doses of niacin. A niacin flush can completely rid your body of any traces of THC.However, niacin also dilates the capillaries and increases the blood flow through the body.here are ways to expel the THC from your body faster in order to pass the drug tests that are administered. However, to do this, you have to undergo different kinds of detoxifying procedures. The Niacin THC detox is one of the most popularly known detoxifying procedures.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":1153710,"ranking":14,"query_text":"do artichokes contain niacin","passage_text":"Artichoke hearts are also an excellent source of fiber, with 100 grams (3.5 oz) of cooked artichoke accounting for a whopping 34% of the daily value for fiber.ust like the leaves, the heart and inner leaves of the globe artichoke contain cynarin, the compound that is believed to be largely responsible for the positive effects of artichoke leaf supplements on cholesterol levels.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":4288903,"ranking":15,"query_text":"do artichokes contain niacin","passage_text":"One vegetable with high fiber content is the artichoke. If you have never tried an artichoke, it might seem intimidating. However, they are relatively simple to cook, are flavorful and full of fiber. In fact, one medium artichoke contains approximately 10.3 grams of fiber.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":2447138,"ranking":16,"query_text":"do artichokes contain niacin","passage_text":"niacin is a water soluble vitamin that can be found in meats dairy products contain niacin wheat germ is high in niacin niacin and other b vitamins can help improve the functioning of the heart","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":5179657,"ranking":17,"query_text":"do artichokes contain niacin","passage_text":"Jerusalem Artichokes\/Sunchokes History. Jerusalem artichokes are not artichokes and do not come from Jerusalem. Jerusalem Artichoke History. Jerusalem artichoke, botanically-named Helianthus tuberosus, is the tuber of a variety of perennial flower in the aster family. The flowers look like small yellow sunflowers.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":6076209,"ranking":18,"query_text":"do artichokes contain niacin","passage_text":"No-Flush Niacin contains a special form of niacin, inositol hexanicotinate, consisting of six molecules of niacin chemically linked to an inositol molecule. It is hydrolyzed in the body to free niacin and inositol, which is a very slow process.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":1219384,"ranking":19,"query_text":"do artichokes contain niacin","passage_text":"ARTICHOKE Overview Information. Artichoke is a plant. The leaf, stem, and root are used to make â\u0080\u009cextractsâ\u0080\u009d which contain a high concentration of certain chemicals found in the plant.","bm25_label":"high","relevance_label":0.0},{"query_id":155041,"passage_id":7598614,"ranking":20,"query_text":"do artichokes contain niacin","passage_text":"Anchovies are rich in heart healthy nutrients. They contain very good amount of Omega 3 fatty acids, potassium and Vitamin A. Also, they are strong source of protein. In addition, anchovies are a wonderful source of calcium, selenium and Vitamin D. Anchovies do provide small amount of Vitamin B3 or niacin as well.hey contain very good amount of Omega 3 fatty acids, potassium and Vitamin A. Also, they are strong source of protein. In addition, anchovies are a wonderful source of calcium, selenium and Vitamin D. Anchovies do provide small amount of Vitamin B3 or niacin as well.","bm25_label":"high","relevance_label":0.0}]