[{"query_id":160808,"passage_id":6640526,"ranking":1,"query_text":"do you need a transit visa for iran","passage_text":"1 For a Social and Business visit not beyond one month, the citizens of ASEAN countries do not need a visa to enter Malaysia. 2  For a Social and Business visit not more than 14 days, the nationals of Afghanistan, Iran, Iraq, Libya, Syria, and South Yemen do not need a visa.t is issued to foreign citizens, who need a visa to enter Malaysia on transit to other countries. Foreign Nationals on transit, who wouldn't leave the airport precincts and continue their flight to the next destination, do not need a transit visa.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":5736468,"ranking":2,"query_text":"do you need a transit visa for iran","passage_text":"Getting a visa. If you require a visa for your visit to the Netherlands, you need to apply for one at the Dutch embassy or consulate in your country. You should do this approximately 2 months before your arrival to the Netherlands.You cannot get a visa in the Netherlands. This type of visa does not give you the right to get into the country. 2  You need this transit visa if you are a national from; Afghanistan, Angola, Bangladesh, Congo (Democratic Republic), Eritrea, Ehteopea, Ghana, Guinea, Irak, Iran, Nigeria, Pakistan, Somalie, Sudan, Syria, Sri Lanka.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":7835836,"ranking":3,"query_text":"do you need a transit visa for iran","passage_text":"How to get an Iran Transit Visa. The Iran Transit visa is issued for a limited period of time for foreigners who intend to pass through Iran to a third country. The biggest hurdle is getting the visa authorization number from the Ministry of Foreign Affairs in Tehran.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":8275480,"ranking":4,"query_text":"do you need a transit visa for iran","passage_text":"Use transit visa in a sentence. I was given a brand new transit visa, so I could go to the place I needed to go in the country legally. Jeff was hoping he would be approved a transit visa to travel through Iran on his way to Turkey, or it would add significant time to his travel.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":1244363,"ranking":5,"query_text":"do you need a transit visa for iran","passage_text":"Non-Australian citizens from certain countries are eligible to transit through Australia without a visa. If you do not qualify for transit without a visa, you will need to apply for a Transit visa.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":2792633,"ranking":6,"query_text":"do you need a transit visa for iran","passage_text":"How do I get a transit visa? You can apply for a transit visa by filling out the application for a Temporary Resident Visa and selecting transit visa from the list of options on the form. You may not need a transit visa if you are travelling to or from the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":8627553,"ranking":7,"query_text":"do you need a transit visa for iran","passage_text":"1 Iran Visa. 2  Foreigners are allowed to stay in Kish without a visa for 14 days. 3  On the 14th day, if you do not have your employment visa yet you should go to the immigration and apply for an Iran Visa to extend your stay. 4  It costs 60 dirhams plus you also need to provide a passport sized photo wearing a shella\/hijab. Foreigners are allowed to stay in Kish without a visa for 14 days. 2  On the 14th day, if you do not have your employment visa yet you should go to the immigration and apply for an Iran Visa to extend your stay. 3  It costs 60 dirhams plus you also need to provide a passport sized photo wearing a shella\/hijab. 4  Hotel.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":5736472,"ranking":8,"query_text":"do you need a transit visa for iran","passage_text":"If you are a national from any other country, you need a visa for a stay of less than 3 months in the Netherlands. You need to apply for a visa at the Dutch embassy or consulate in your country before you come to the Netherlands. This type of visa does not give you the right to get into the country. 2  You need this transit visa if you are a national from; Afghanistan, Angola, Bangladesh, Congo (Democratic Republic), Eritrea, Ehteopea, Ghana, Guinea, Irak, Iran, Nigeria, Pakistan, Somalie, Sudan, Syria, Sri Lanka.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":8627556,"ranking":9,"query_text":"do you need a transit visa for iran","passage_text":"1 Iran Visa. 2  Foreigners are allowed to stay in Kish without a visa for 14 days. 3  On the 14th day, if you do not have your employment visa yet you should go to the immigration and apply for an Iran Visa to extend your stay. Foreigners are allowed to stay in Kish without a visa for 14 days. 2  On the 14th day, if you do not have your employment visa yet you should go to the immigration and apply for an Iran Visa to extend your stay. 3  It costs 60 dirhams plus you also need to provide a passport sized photo wearing a shella\/hijab. 4  Hotel.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":6924358,"ranking":10,"query_text":"do you need a transit visa for iran","passage_text":"Valid visa issued by the United States of America in your passport. 2 - If you do not hold one of this document listed above, and you are citizen of one of the nationality listed below YOU DO NEED an airport transit visa.he airport transit visa is issued by the consulate of the country where the airport of transit is located. If the arrival and the departure take place in 2 different airports (Paris-Roissy and Paris-Orly), you need a transit visa (see short stay visa). NOTA :","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":2222339,"ranking":11,"query_text":"do you need a transit visa for iran","passage_text":"Taiwan: You do not need a visa to visit or transit in Canada if you hold an ordinary passport issued by the Ministry of Foreign Affairs in Taiwan that includes your personal identification number.Israel: You do not need a visa to visit or transit in Canada if you hold a national Israeli passport.ritish Subjects: You do not need a visa to visit or transit in Canada if you hold a British Subject passport issued by the United Kingdom which contains the observation that the holder has the right of abode in the United Kingdom.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":7835833,"ranking":12,"query_text":"do you need a transit visa for iran","passage_text":"However, citizens of some countries do need an airport transit visa. Afghanistan, Bangladesh, Democratic Republic of the Congo, Eritrea, Ethiopia, Ghana, India, Iran, Iraq, Jordan* (see below), Lebanon, Myanmar\/Burma, Nigeria, Pakistan, Somalia, Sri Lanka, Sudan, Syria and Turkey.","bm25_label":"high","relevance_label":1.0},{"query_id":160808,"passage_id":2270603,"ranking":13,"query_text":"do you need a transit visa for iran","passage_text":"1 This type of visa does not give you the right to get into the country. 2  You need this transit visa if you are a national from; Afghanistan, Angola, Bangladesh, Congo (Democratic Republic), Eritrea, Ehteopea, Ghana, Guinea, Irak, Iran, Nigeria, Pakistan, Somalie, Sudan, Syria, Sri Lanka.f you are a national from any other country, you need a visa for a stay of less than 3 months in the Netherlands. You need to apply for a visa at the Dutch embassy or consulate in your country before you come to the Netherlands.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":1439111,"ranking":14,"query_text":"do you need a transit visa for iran","passage_text":"Few countries\/airports process transit visa at the airport itself. Some transit visas must be issued in advance from the traveler's home country by the applicable consulate of that country. Other countries do not require a visa.For example, you do not No transit visa is required if you have a valid US visa stamped in passport. This means that if you are planning to travel to India via London you will not need a British transit visa.ew countries\/airports process transit visa at the airport itself. Some transit visas must be issued in advance from the traveler's home country by the applicable consulate of that country. Other countries do not require a visa.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":1244361,"ranking":15,"query_text":"do you need a transit visa for iran","passage_text":"Formal sponsorship by an Australian citizen or permanent resident is required. Non-Australian citizens from certain countries are eligible to transit through Australia without a visa. If you do not qualify for transit without a visa, you will need to apply for a Transit visa.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":5788638,"ranking":16,"query_text":"do you need a transit visa for iran","passage_text":"How do I get a transit visa? You can apply for a transit visa by filling out the application for a Temporary Resident Visa and selecting transit visa from the list of options on the form. You may not need a transit visa if you are travelling to or from the United States. The Transit Without Visa program (TWOV) and the China Transit Program (CTP) allow certain foreign nationals to transit through Canada on their way to and from the United States without a Canadian transit visa, if they meet certain requirements.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":5581833,"ranking":17,"query_text":"do you need a transit visa for iran","passage_text":"Visa Types and Requirements. Circumstances do not excuse you from a visa in Russia. Even if you are traveling on to another country, you need a transit visa. Visas are required by everyone for almost every situation, though the types of visas vary for shorter trips.Get a tourist visa for stays of 30 days or less.isa Types and Requirements. Circumstances do not excuse you from a visa in Russia. Even if you are traveling on to another country, you need a transit visa. Visas are required by everyone for almost every situation, though the types of visas vary for shorter trips.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":424692,"ranking":18,"query_text":"do you need a transit visa for iran","passage_text":"Nationals of Brunei, Japan, and Singapore do not need a visa to enter China for up to 15 days. All other nationals need a visa. VISA-FREE TRANSIT 72-hour Transit Visa Exemption for Canadians. Canadian citizens can acquire a 72-hour visa free transit in Beijing and Shanghai airports only.ationals of Brunei, Japan, and Singapore do not need a visa to enter China for up to 15 days. All other nationals need a visa. VISA-FREE TRANSIT 72-hour Transit Visa Exemption for Canadians. Canadian citizens can acquire a 72-hour visa free transit in Beijing and Shanghai airports only.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":7835831,"ranking":19,"query_text":"do you need a transit visa for iran","passage_text":"Visa is a permission of entry to Iran for a limited period of time issued by Embassies and Consulates General of the Islamic Republic of Iran abroad, for foreign nationals after receiving the approval of the Ministry of Foreign Affairs. Visa Types : . Entry Visa. . Entry or transit visa for drivers carrying cargo.","bm25_label":"high","relevance_label":0.0},{"query_id":160808,"passage_id":4194167,"ranking":20,"query_text":"do you need a transit visa for iran","passage_text":"Taiwan: You do not need a visa to visit or transit in Canada if you hold an ordinary passport issued by the Ministry of Foreign Affairs in Taiwan that includes your personal identification number. Israel: You do not need a visa to visit or transit in Canada if you hold a national Israeli passport.ong Kong Special Administrative Region: You do not need a visa to visit or transit in Canada if you hold a valid and subsisting Special Administrative Region passport issued by the Hong Kong Special Administrative Region of the Peopleâ\u0080\u0099s Republic of China.","bm25_label":"high","relevance_label":0.0}]