[{"query_id":165135,"passage_id":8300545,"ranking":1,"query_text":"does crestor cause a cough","passage_text":"crestor. He's 57 years old and can't take OTC cough meds due to him being on Paxil, Lisinopril, Hydrocholorthiazide, and Crestor. The Lisinopril can cause a cough I know, but this cough had been there before he started this new med 2 weeks ago.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":4369750,"ranking":2,"query_text":"does crestor cause a cough","passage_text":"Side Effects of Crestor. Crestor can cause minor side effects like heartburn, constipation, coughing and difficulty sleeping. Serious complications can also occur, including type 2 diabetes, myopathy (muscle pain), liver damage, rhabdomyolyis (tissue deterioration) and death.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":8000479,"ranking":3,"query_text":"does crestor cause a cough","passage_text":"1 Support group for people who take Crestor and have Cough.  2 I have been taking Crestor 40 mg for 5 years. 3  I have been dealing with a cough most of that time. 4  My doctor never suggested Crestor as the reason.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":8300543,"ranking":4,"query_text":"does crestor cause a cough","passage_text":"Support group for people who take Crestor and have CoughI have been taking Crestor 40 mg for 5 years. I have been dealing with a cough most of that time. My doctor never suggested Crestor as the reason.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":7664577,"ranking":5,"query_text":"does crestor cause a cough","passage_text":"Does Crestor Cause Muscle Pain? While most people tolerate CrestorÂ® (rosuvastatin calcium) well, there are potential side effects that can occur. For people taking Crestor, muscle pain is one of these possible side effects. In previous clinical studies, muscle tenderness or pain occurred in up to 12.7 percent of people taking Crestor.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":8000474,"ranking":6,"query_text":"does crestor cause a cough","passage_text":"Support group for people who take Crestor and have CoughI have been taking Crestor 40 mg for 5 years. I have been dealing with a cough most of that time. My doctor never suggested Crestor as the reason. I have been tested for acid reflux, allergies, etc. with no solutions.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":7466522,"ranking":7,"query_text":"does crestor cause a cough","passage_text":"Crestor (rosuvastatin calcium) InternetDrugNews.com. information for patients, pharmacists, pharmaceutical marketers; side effects, dose, cost, mechanism of action, warnings; Crestor is a member of the statin family (closely related to Lipitor). How does Crestor work; Crestor mechanism of action; compare Crestor prices.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":8000476,"ranking":8,"query_text":"does crestor cause a cough","passage_text":"Summary: Cough is found among people who take Crestor, especially for people who are 60+ old, have been taking the drug for 1 - 6 months, also take medication Aspirin, and have High blood cholesterol. We study 57,870 people who have side effects while taking Crestor from FDA and social media.","bm25_label":"high","relevance_label":1.0},{"query_id":165135,"passage_id":6174203,"ranking":9,"query_text":"does crestor cause a cough","passage_text":"A. Most of the cholesterol in your blood is made in the liver. Crestor works by reducing cholesterol in two ways: Crestor blocks an enzyme in the liver causing the liver to make less cholesterol, and Crestor increases the uptake and breakdown by the liver of cholesterol already in the blood.This answer should not be considered medical advice...restor works by reducing cholesterol in two ways: Crestor blocks an enzyme in the liver causing the liver to make less cholesterol, and Crestor increases the uptake and breakdown by the liver of cholesterol already in the blood. This answer should not be considered medical advice...","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":5902196,"ranking":10,"query_text":"does crestor cause a cough","passage_text":"Internet Drug News'. Crestor (rosuvastatin calcium) InternetDrugNews.com information for patients, pharmacists, pharmaceutical marketers; side effects, dose, cost, mechanism of action, warnings; Crestor is a member of the statin family (closely related to Lipitor).How does Crestor work; Crestor mechanism of action; compare Crestor prices.he maximum dose of Crestor is 40 mg per day. Crestor therapy usually starts with a 10mg dose. Sometimes the doctor willstart with a 20mg dose. The 40mg dose is reserved for people who are on 20mg but still are not meeting their cholesterol goals.Crestor's labeling contains comparisons to Lipitor.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":300991,"ranking":11,"query_text":"does crestor cause a cough","passage_text":"No, coughing up phlegm does not mean you have cancer. Coughing up phlegm can be caused many things. Including infection, allergies, chronic lung disease as well as cancer. A cough that does not resolve should undergo evaluation by your physician.o, coughing up phlegm does not mean you have cancer. Coughing up phlegm can be caused many things. Including infection, allergies, chronic lung disease as well as cancer. A cough that does not resolve should undergo evaluation by your physician.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":8300542,"ranking":12,"query_text":"does crestor cause a cough","passage_text":"Summary: Cough is found among people who take Crestor, especially for people who are 60+ old, have been taking the drug for 1 - 6 months, also take medication Aspirin, and have High blood cholesterol.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":3913566,"ranking":13,"query_text":"does crestor cause a cough","passage_text":"FDA ALERT [03\/2005]: Rhabdomyolysis (serious muscle damage) has been reported in patients taking Crestor as well as other statin drugs. To date, it does not appear that the risk is greater with Crestor than with other marketed statins.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":8300544,"ranking":14,"query_text":"does crestor cause a cough","passage_text":"Summary: Productive cough is found among people who take Crestor, especially for people who are 60+ old, have been taking the drug for 1 - 6 months, also take medication Aspirin, and have High blood cholesterol.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":1509535,"ranking":15,"query_text":"does crestor cause a cough","passage_text":"What are the side effects of Generic for Crestor*? Like other medicines, Generic for Crestor* can cause some side effects. If they do occur, the side effects of Generic for Crestor* are most likely to be minor and temporary. However, some may be serious and may require the individual to inform the doctor or visit the nearest hospital immediately.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":7053499,"ranking":16,"query_text":"does crestor cause a cough","passage_text":"After 9 months on crestor, 3 on chemo, I began to have severe muscle pain, weakness, neuropathy, fatigue, depression, anhedonia, and malodorous urine. I blamed chemo of course. Finally read up on Crestor and asked cardiology if that could be the cause. He suggested I stop Crestor x 2 weeks and see if symptims improved.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":3337506,"ranking":17,"query_text":"does crestor cause a cough","passage_text":"Dry Cough: Causes and Simple Home Remedies. Dry cough (definition) is a type of cough that does not produce sputum or phlegm. It can be triggered by infections and cold (the most common causes of dry cough), allergic reactions, traumas, lung cancer, airway obstruction, and other abnormalities.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":3725855,"ranking":18,"query_text":"does crestor cause a cough","passage_text":"Crestor is manufactured by AstraZeneca Pharmaceuticals. Crestor is part of a class of drugs called statins. It works by blocking a particular enzyme (HMG-CoA reductase) that controls the rate of cholesterol production in the body. This causes the liver to make less cholesterol.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":6174201,"ranking":19,"query_text":"does crestor cause a cough","passage_text":"CRESTORÂ® (Kres-tor) rosuvastatin calcium. Read this Patient Information carefully before you start taking CRESTOR and each time you get a refill. There may be new information. This information does not take the place of talking with your doctor about your medical condition or treatment.o not take CRESTOR if you: 1  are allergic to rosuvastatin calcium or any of the ingredients in CRESTOR. 2  See the end of this leaflet for a complete list of ingredients in CRESTOR. 3  have liver problems. 4  are pregnant or think you may be pregnant, or are planning to become pregnant.","bm25_label":"high","relevance_label":0.0},{"query_id":165135,"passage_id":5863993,"ranking":20,"query_text":"does crestor cause a cough","passage_text":"Nonproductive coughs. A nonproductive cough is dry and does not produce sputum. A dry, hacking cough may develop toward the end of a cold or after exposure to an irritant, such as dust or smoke. There are many causes of a nonproductive cough, such as:","bm25_label":"high","relevance_label":0.0}]