[{"query_id":169305,"passage_id":361238,"ranking":1,"query_text":"does motion sensor device have camera","passage_text":"Motion detection devices, such as PIR motion detectors, have a sensor that detects a disturbance in the infrared spectrum. Once detected, a signal can activate an alarm or a camera that can capture an image or video of the motioner.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":7401611,"ranking":2,"query_text":"does motion sensor device have camera","passage_text":"There is no audio in the video clip as the Arlo camera does not have a microphone. The motion sensor detected motion and start recording motion at a distance of 12 feet. Not bad considering that once motion detection is triggered there is a small delay for the camera to wake up and begin the recording.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":4960678,"ranking":3,"query_text":"does motion sensor device have camera","passage_text":"PIR sensor. (Passive InfraRed sensor) A device used to detect motion by receiving infrared radiation. When a person walks past the sensor, it detects a rapid change of infrared energy and sends a signal. PIR sensors are used for applications such as automatically turning on lights when someone enters a room or causing a video camera to begin operating.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":2197255,"ranking":4,"query_text":"does motion sensor device have camera","passage_text":"Canary All-In-One Home Security Device The Canary All-In-One Home Security Device keeps tabs on your dwelling with 1080p video capture and sensors for air quality, humidity, and temperature. The Canary All-In-One Home Security Device ($199) is more than just a surveillance camera. Armed with multiple sensors and a 1080p camera, it records events when motion is detected, delivers crisp live streaming video to your smartphone, and monitors air quality, humidity levels, and temperature in your home.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":7994286,"ranking":5,"query_text":"does motion sensor device have camera","passage_text":"Inside that body is Canary's 1080p night-vision camera, along with the motion sensor that tells it when to start recording; ambient sensors for temperature, humidity and air quality; a 90 dB panic siren; and a Wi-Fi radio to send everything to your Android or iOS device by way of the cloud.","bm25_label":"high","relevance_label":1.0},{"query_id":169305,"passage_id":1522206,"ranking":6,"query_text":"does motion sensor device have camera","passage_text":"PIR = Passive Infrared Sensor a PIR is basically a form of motion detector, it triggers the camera to take a picture if something passes in front of the sensor.http:\/\/en.wikipedia.org\/wiki\/Passive_inf...IR = Passive Infrared Sensor a PIR is basically a form of motion detector, it triggers the camera to take a picture if something passes in front of the sensor.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":8478939,"ranking":7,"query_text":"does motion sensor device have camera","passage_text":"With an HD, night-vision camera and a bevy of sensors for things like motion, temperature, and air quality Canary promises to stand guard over the living room and alert your Android or iOS device if anything's amiss, all for $250 and no monthly fees.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":7994284,"ranking":8,"query_text":"does motion sensor device have camera","passage_text":"With an HD, night-vision camera and a bevy of sensors for things like motion, temperature, and air quality Canary promises to stand guard over the living room and alert your Android or iOS device if anything's amiss, all for $250 and no monthly fees. It's a solid pitch.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":454985,"ranking":9,"query_text":"does motion sensor device have camera","passage_text":"iPhone 5s camera specs: better optics, slow motion, and 'True Tone' flash. As a part of the iPhone 5s announcement today, Apple is eager to talk about the improved camera. It's got a 5-element lens with an aperture of f\/2.2 on top of a sensor with a surface area 15 percent larger than the device it replaces (though it's still 8 megapixels).","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":5780167,"ranking":10,"query_text":"does motion sensor device have camera","passage_text":"Yes. Canadian Tire does\/did have just that. You can add it to an existing light and switch. You get a motion sensor that you can place in the area as opposed to modifying your existing light.This will require some electrical wiring and may not be within the skillset of your average home owner._______________- Alarms, Cameras, Vacuums, GDOs, TVs, Home Automation and other electronics.ou get a motion sensor that you can place in the area as opposed to modifying your existing light. This will require some electrical wiring and may not be within the skillset of your average home owner. _______________- Alarms, Cameras, Vacuums, GDOs, TVs, Home Automation and other electronics.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":2197249,"ranking":11,"query_text":"does motion sensor device have camera","passage_text":"$199.00. 1  Pros Sharp 1080p video. 2  Cons Pricey cloud subscription plans. 3  Bottom Line The Canary All-In-One Home Security Device keeps tabs on your dwelling with 1080p video capture and sensors for air quality, humidity, and temperature. The Canary All-In-One Home Security Device ($199) is more than just a surveillance camera. Armed with multiple sensors and a 1080p camera, it records events when motion is detected, delivers crisp live streaming video to your smartphone, and monitors air quality, humidity levels, and temperature in your home.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":8002231,"ranking":12,"query_text":"does motion sensor device have camera","passage_text":"Many of us are familiar with motion sensors, as they have become a common part of most home security systems. These sensors are much like the motion detectors that open the doors to the grocery store or cause the sinks and toilets in the airport to activate without touch. We see motion-sensing devices everywhere. But how do they work? There are two basic types of motion detecting systems. There are those with active sensors and those with passive sensors. Active sensors send out ultrasonic sound waves and passive sensors detect infrared energy.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":2454964,"ranking":13,"query_text":"does motion sensor device have camera","passage_text":"A mirrorless interchangeable lens camera (MILC, commonly referred to simply as a mirrorless camera), is a camera with an interchangeable lens that does not have a mirror reflex optical viewfinder.ot all mirrorless cameras have a large sensor: The original Pentax Q (announced in June 2011) has a 1\/2.3 sensor (typical of mainstream compact cameras); the current Pentax Q7 (announced in June 2013) has a 1\/1.7 sensor (typical for high-end compacts).","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":3830665,"ranking":14,"query_text":"does motion sensor device have camera","passage_text":"Wireless Motion Sensor-Wireless motion sensors are mostly used in doors and windows. These could be convenient to place and easy to install. When the device detects movement or motion, it may send signals back to a base device that triggers an alarm.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":8023193,"ranking":15,"query_text":"does motion sensor device have camera","passage_text":"It is used mostly in digital cameras and other imaging devices. It is a set of charge-coupled devices (CCD) or CMOS sensors such as active-pixel sensors. (from Wiki) So in other words a cameraâ\u0080\u0099s image sensor receives the light coming through the lens into the camera, and turns that light into an image.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":2683516,"ranking":16,"query_text":"does motion sensor device have camera","passage_text":"PDF EPUB. Download this resource. A motion sensor (or motion detector) is the linchpin of your security system, because it's the main device that detects when someone is in your home when they shouldn't be. A motion sensor uses one or multiple technologies to detect movement in an area.DF EPUB. Download this resource. A motion sensor (or motion detector) is the linchpin of your security system, because it's the main device that detects when someone is in your home when they shouldn't be. A motion sensor uses one or multiple technologies to detect movement in an area.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":2495632,"ranking":17,"query_text":"does motion sensor device have camera","passage_text":"View products in the Wireless HD Network Motion Sensor Camera with 720p Resolution, and Remote Viewing series.","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":4960677,"ranking":18,"query_text":"does motion sensor device have camera","passage_text":"Report Abuse. 1  Game Camera Stands. Source(s): https:\/\/shorte.im\/a9kVa. 2  PIR = Passive Infrared Sensor. a PIR is basically a form of motion detector, it triggers the camera to take a picture if something passes in front of the sensor. http:\/\/en.wikipedia.org\/wiki\/Passive_inf...","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":5603591,"ranking":19,"query_text":"does motion sensor device have camera","passage_text":"sad the part that does hit the crop sensor is exactly the same image as over in the full frame sensor camera that is why and how people say that the equivalent value of a 50mm lens on a crop sensor body is equivalent to a 80mm lens on a full frame sensor cameraad the part that does hit the crop sensor is exactly the same image as over in the full frame sensor camera that is why and how people say that the equivalent value of a 50mm lens on a crop sensor body is equivalent to a 80mm lens on a full frame sensor camera","bm25_label":"high","relevance_label":0.0},{"query_id":169305,"passage_id":7994288,"ranking":20,"query_text":"does motion sensor device have camera","passage_text":"What is a Motion Detector? Motion sensors and detectors have been around since the seventies and are designed to provide effective security to home owners. Although technological advancements have improved the functioning of motion detectors, the basic purpose and system of this device remains the same.","bm25_label":"high","relevance_label":0.0}]