[{"query_id":178468,"passage_id":7377856,"ranking":1,"query_text":"effects hot stone has on the circulatory system","passage_text":"Since this formalization of the use of heated stones within the context of therapeutic massage, the use of this type of therapy has become widespread. Benefits. Hot Stone Massage is deeply detoxifying and profoundly relaxing. By combining massage with hot stones, the circulatory system is both stimulated and relaxed.This circulatory activity promotes the release of toxins from the muscles, assisting the body in self-healing.In addition, tense muscles are also softened and eased by the deeply penetrating heat of the stones.y combining massage with hot stones, the circulatory system is both stimulated and relaxed. This circulatory activity promotes the release of toxins from the muscles, assisting the body in self-healing. In addition, tense muscles are also softened and eased by the deeply penetrating heat of the stones.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":7377855,"ranking":2,"query_text":"effects hot stone has on the circulatory system","passage_text":"Hot Stone Massage is a form of body work that involves the application of heated stones (thermotherapy) to the body within the context of a therapeutic massage.Round, smooth stones are heated to luxurious warmth, oiled and used in the palm of the hands to massage the body.y combining massage with hot stones, the circulatory system is both stimulated and relaxed. This circulatory activity promotes the release of toxins from the muscles, assisting the body in self-healing. In addition, tense muscles are also softened and eased by the deeply penetrating heat of the stones.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":7377860,"ranking":3,"query_text":"effects hot stone has on the circulatory system","passage_text":"Tired, sore and aching muscles are relaxed with improvements to strength and flexibility and tensions held at the deepest level are released. Hot & Cold Stone Massage Therapy. Hot and Cold Stone therapy can also be used to treat muscular injury or inflammation by using cooled or frozen stones.These provide a thermotherapeutic effect within the circulatory system, allowing the body to heal faster and more efficiently.ired, sore and aching muscles are relaxed with improvements to strength and flexibility and tensions held at the deepest level are released. Hot & Cold Stone Massage Therapy. Hot and Cold Stone therapy can also be used to treat muscular injury or inflammation by using cooled or frozen stones.","bm25_label":"high","relevance_label":1.0},{"query_id":178468,"passage_id":7377859,"ranking":4,"query_text":"effects hot stone has on the circulatory system","passage_text":"Relax your mind, body and soul with the benefits of Hot Stone Therapy. Stone therapy is an wonderful and relaxing treatment and is used to create balance within the body. It provides a deep massage using either hot or cold basalt stones.tone therapy can be traced back to ancient Egypt, China and Incas. Cold stones soothe the body and can reduce inflammation and muscular injury. This creates a type of thermo therapeutic â\u0080\u0098vascular gymnasticsâ\u0080\u0099 in the circulatory system to help the body detoxify and heal.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":7377854,"ranking":5,"query_text":"effects hot stone has on the circulatory system","passage_text":"The relaxation of hot stone massage therapy goes far deeper than a standard massage, since the direct heat causes the blood vessels to expand and push blood around the body, which helps to move toxins away from the affected area.This also has a beneficial effect on the nervous system in general.ired, sore and aching muscles are relaxed with improvements to strength and flexibility and tensions held at the deepest level are released. Hot & Cold Stone Massage Therapy. Hot and Cold Stone therapy can also be used to treat muscular injury or inflammation by using cooled or frozen stones.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":5283833,"ranking":6,"query_text":"effects hot stone has on the circulatory system","passage_text":"Side Effects of Massage on the Circulatory System. Massage therapy has a number of incredible benefits on the circulatory system, including the lymphatic and immune systems. Massage helps to promote the circulation of lymph, which usually depends on your bodyâ\u0080\u0099s natural movement to flush it through the body.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":7352069,"ranking":7,"query_text":"effects hot stone has on the circulatory system","passage_text":"What Are The Benefits of Chelation Therapy? Chelation therapy is widely used for the treatment of atherosclerosis and other chronic degenerative diseases involving the circulatory system. It also has other side effects.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":5346630,"ranking":8,"query_text":"effects hot stone has on the circulatory system","passage_text":"Circulatory system. The circulatory system contains the heart and the blood vessels and moves blood throughout the body. Our body has about five litres of blood continually travelling through the circulatory system.All our circulatory organs work together, forming a very efficient pipe network for our bodies.irculatory system. The circulatory system contains the heart and the blood vessels and moves blood throughout the body. Our body has about five litres of blood continually travelling through the circulatory system.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":2782831,"ranking":9,"query_text":"effects hot stone has on the circulatory system","passage_text":"Transcript of System's Affected by Hemophilia. Hemophilia can really affect any of the systems, but mostly affects the Circulatory System, because of hemophilia's effect on blood. Hemophilia is also involved with the Urinary and Muscular Systems. It affects the circulatory system because of hemophilia's affects on blood.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":7620513,"ranking":10,"query_text":"effects hot stone has on the circulatory system","passage_text":"The heart lies at the center of the circulatory system, functionally speaking, and is responsible for circulating blood throughout the body. Since cells depend on blood supply to receive nutrients and oxygen, heart disease that affects the function of the circulatory system can be quite dangerous. There are a number of effects that heart disease can have on the circulatory system itself.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":6981450,"ranking":11,"query_text":"effects hot stone has on the circulatory system","passage_text":"Hot flashes, hot flushes and night sweats are common symptoms of menopause, and while the exact cause is unknown, it is believed to be linked to complex interactions between the hypothalamus, the circulatory system and hormonal fluctuations.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":736229,"ranking":12,"query_text":"effects hot stone has on the circulatory system","passage_text":"Anti-inflammatory: Sandalwood essential oil is anti-inflammatory by nature. It has a soothing effect, which helps in getting relief from severe internal inflammations. This oil is of great use in curing the soreness of nervous system (including brain), circulatory system, digestive system and excretory system.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":7482736,"ranking":13,"query_text":"effects hot stone has on the circulatory system","passage_text":"The perfusionist is responsible for the management of circulatory and respiratory functions of the patient which has a great effect on the patient systemic condition and allows the cardiac surgeon to focus on the actual surgical procedure and less on the immediate needs of the patient.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":5579495,"ranking":14,"query_text":"effects hot stone has on the circulatory system","passage_text":"Features of the Hypothalamus. The hypothalamus is only about the size of a pearl, and is located in the middle part of the brain. It monitors the state of the body through the circulatory and nervous systems, and effectively links these two systems to the endocrine system through the pituitary gland.eatures of the Hypothalamus. The hypothalamus is only about the size of a pearl, and is located in the middle part of the brain. It monitors the state of the body through the circulatory and nervous systems, and effectively links these two systems to the endocrine system through the pituitary gland.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":3611510,"ranking":15,"query_text":"effects hot stone has on the circulatory system","passage_text":"Polychaetes are a class of worms that are very common marine organisms in the depths of the ocean. These worms are also called bristle worms. Most Polychaetes contains a closed circulatory system but in many small polychaetes, they lack a circulatory system. The blood is effected by a system of closed vessels with muscular walls.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":8022206,"ranking":16,"query_text":"effects hot stone has on the circulatory system","passage_text":"Circulatory System Your circulatory system has two major jobs: 1. Transportation The main tissue of the human circulatory system is blood. It carries food and oxygen to all the cells of the body. The blood also carries waste away from the cells. It flows inside tubes called blood vessels. The main organ of the circulatory system is the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":3930408,"ranking":17,"query_text":"effects hot stone has on the circulatory system","passage_text":"To help students explore the chemical and physical effects of alcohol on these human body organ systems: the digestive system, the central nervous system, the circulatory system, and the endocrine system.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":1479826,"ranking":18,"query_text":"effects hot stone has on the circulatory system","passage_text":"dog circulatory system; circulatory system of a dog; dogs circulatory system; circulatory system in dogs; dog\\s circulatory system; canine circulatory system; circulatory system of dog; circulatory system of dogs; circulatory system dog; circulatory system in a dog; the circulatory system of a dog; a dogs circulatory system; circulatory system for dogs; circulatory system dogs","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":3853141,"ranking":19,"query_text":"effects hot stone has on the circulatory system","passage_text":"  Circulatory system:   When food has been digested, the nutrients are absorbed in the blood through the small intestine. The absorption of nutrients into the circulatory system allows body cells to get nutrients.54 people found this useful. Circulatory system:   When food has been digested, the nutrients are absorbed in the blood through the small intestine. The absorption of nutrients into the circulatory system allows body cells to get nutrients. 54 people found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":178468,"passage_id":3241000,"ranking":20,"query_text":"effects hot stone has on the circulatory system","passage_text":"Circulatory system. The circulatory system contains the heart and the blood vessels and moves blood throughout the body. Our body has about five litres of blood continually travelling through the circulatory system. All our circulatory organs work together, forming a very efficient pipe network for our bodies.","bm25_label":"high","relevance_label":0.0}]