[{"query_id":186265,"passage_id":7993921,"ranking":1,"query_text":"felony aggravated battery definition","passage_text":"Aggravated battery generally is seen as a serious offense of felony grade, involving the loss of the victim's limb or some other type of permanent disfigurement. As successor to the common-law crime of mayhem, this is sometimes subsumed in the definition of aggravated assault. In Florida, Aggravated Battery is the intentional infliction of great bodily harm and is a second degree felony, whereas battery that unintentionally causes great bodily harm is considered a third degree felony. Kansas","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":4180126,"ranking":2,"query_text":"felony aggravated battery definition","passage_text":"Regardless of which definition the jurisdiction uses, the broader definition of assault, or separate definitions for assault and battery, a crime of this nature in the first-degree (or aggravated) is classified as a felony.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":8523637,"ranking":3,"query_text":"felony aggravated battery definition","passage_text":"Battery: Reclassified from a First Degree Misdemeanor to a Third Degree Felony. Aggravated Battery: From a Second Degree Felony to a First Degree Felony. Additionally, any person convicted of aggravated battery of a law enforcement officer shall be sentenced to a minimum 5 years in prison.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":1556972,"ranking":4,"query_text":"felony aggravated battery definition","passage_text":"Aggravated battery generally is seen as a serious offense of felony grade, involving the loss of the victim's limb or some other type of permanent disfigurement. As successor to the common-law crime of mayhem, this is sometimes subsumed in the definition of aggravated assault.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":2916339,"ranking":5,"query_text":"felony aggravated battery definition","passage_text":"Then you have a misdemeanor battery but the injuries upgrade it to a Felony Battery. Aggravated Battery (without a weapon) is a lot like Felony Battery. There is a battery and there is great bodily harm. The difference is that with an Aggravated Battery there is the Intent to cause the great bodily harm. So again with your hypothetical, if you punched the cashier and specifically intended to cause the broken nose\/broken tooth\/scar, and actually caused it, then there is an Aggravated Battery.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":2771223,"ranking":6,"query_text":"felony aggravated battery definition","passage_text":"Regardless of which definition the jurisdiction uses, the broader definition of assault, or separate definitions for assault and battery, a crime of this nature in the first-degree (or aggravated) is classified as a felony. Depending on the state, it is punishable by 5-25 years in prison.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":3335691,"ranking":7,"query_text":"felony aggravated battery definition","passage_text":"1 Aggravated battery generally is seen as a serious offense of felony grade, involving the loss of the victim's limb or some other type of permanent disfigurement. 2  As successor to the common-law crime of mayhem, this is sometimes subsumed in the definition of aggravated assault.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":1384941,"ranking":8,"query_text":"felony aggravated battery definition","passage_text":"Aggravated domestic battery, which is domestic battery causing great bodily harm, is a Class 2 felony offense. Aggravated battery to a peace officer, such as resisting arrest resulting in injury to the police officer, is also a Class 2 felony. In these cases, the injury can be any injury, no matter how minor.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":6636760,"ranking":9,"query_text":"felony aggravated battery definition","passage_text":"(2) A person who has one prior conviction for battery, aggravated battery, or felony battery and who commits any second or subsequent battery commits a felony of the third degree, punishable as provided in s.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":7993924,"ranking":10,"query_text":"felony aggravated battery definition","passage_text":"Florida law separates the crime of battery into two categories. Simple battery is typically charged as a misdemeanor, but can be charged as a felony under certain circumstances. Aggravated battery is always charged as a felony.","bm25_label":"high","relevance_label":1.0},{"query_id":186265,"passage_id":6772854,"ranking":11,"query_text":"felony aggravated battery definition","passage_text":"The primary distinction between misdemeanor battery, felony battery, and aggravated battery is in the amount of harm that is inflicted. While no injury is necessary for a misdemeanor battery to be committed; a significant injury must occur before Felony Battery can be charged.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":7974120,"ranking":12,"query_text":"felony aggravated battery definition","passage_text":"Felony aggravated domestic battery is a crime involving moral turpitude (CIMT), an aggravated felony (only if one year of jail or more is actually imposed), and constitutes a domestic violence ground for deportation.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":6772857,"ranking":13,"query_text":"felony aggravated battery definition","passage_text":"775.083.(2)â\u0080\u0083A person who has one prior conviction for battery, aggravated battery, or felony battery and who commits any second or subsequent battery commits a felony of the third degree, punishable as provided in s. 775.082, s.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":6938438,"ranking":14,"query_text":"felony aggravated battery definition","passage_text":"Felony Battery is a Third Degree Felony punishable by up to 5 years in prison. â\u0080\u009d-- Richard Hornsby. In Florida, the crime of Felony Battery is defined as intentionally touching or striking another person against their will and causes great bodily harm, permanent disability, or permanent disfigurement. [1] The primary distinction between misdemeanor battery, felony battery, and aggravated battery is in the amount of harm that is inflicted.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":6040893,"ranking":15,"query_text":"felony aggravated battery definition","passage_text":"Without a doubt, should the severity of the assault or battery case rise to the level of an aggravated assault \/ battery, potential penalties would rise dramatically, because aggravated assault constitutes a felony in all states.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":6772855,"ranking":16,"query_text":"felony aggravated battery definition","passage_text":"(2) A person who has one prior conviction for battery, aggravated battery, or felony battery and who commits any second or subsequent battery commits a felony of the third degree, punishable as provided in s. 775.082, s. 775.083, or s. 775.084.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":322326,"ranking":17,"query_text":"felony aggravated battery definition","passage_text":"Florida Aggravated Battery. The most serious of basic assault charges under Florida law is aggravated battery. This is considered a felony of the second degree which carries a potential 15 years in prison and $10,000 in fines.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":6466824,"ranking":18,"query_text":"felony aggravated battery definition","passage_text":"Sexual battery and rape are felonies, and the applicable fines and prison term depend on the circumstances of the crime. Sexual battery is a Class E felony, which incurs a fine of up to $3,000, at least one (and up to six) years in prison, or both. Aggravated sexual battery and rape are Class B felonies.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":6772856,"ranking":19,"query_text":"felony aggravated battery definition","passage_text":"775.083.(2)â\u0080\u0083A person who has one prior conviction for battery, aggravated battery, or felony battery and who commits any second or subsequent battery commits a felony of the third degree, punishable as provided in s. 775.082, s. 775.083, or s. 775.084.","bm25_label":"high","relevance_label":0.0},{"query_id":186265,"passage_id":4232516,"ranking":20,"query_text":"felony aggravated battery definition","passage_text":"The crime of aggravated battery, which also includes battery with a deadly weapon, usually is a misdemeanor or a third degree felony. Someone who commits an aggravated assault or battery in New Mexico can be sentenced to time in jail or prison, probation, and a fine. (N.M. Stat.","bm25_label":"high","relevance_label":0.0}]