[{"query_id":196720,"passage_id":8669409,"ranking":1,"query_text":"graveyard shift meaning","passage_text":"Graveyard Shift. Graveyard shift is a work shift running through the late hours of the evening to the early hours of the morning, typically from midnight until 8 am. Graveyard Shift may also refer to: Graveyard Shift (1987 film), by Jerry Ciccoritti. Graveyard Shift (1990 film), based on the Stephen King story of the same name.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":288102,"ranking":2,"query_text":"graveyard shift meaning","passage_text":"Look up graveyard shift in Wiktionary, the free dictionary. Graveyard shift is a work shift running through the late hours of the evening to the early hours of the morning, typically from midnight until 8 am, or 3 pm to midnight.Graveyard Shift may also refer to:ook up graveyard shift in Wiktionary, the free dictionary. Graveyard shift is a work shift running through the late hours of the evening to the early hours of the morning, typically from midnight until 8 am, or 3 pm to midnight. Graveyard Shift may also refer to:","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":803440,"ranking":3,"query_text":"graveyard shift meaning","passage_text":"Look up graveyard shift in Wiktionary, the free dictionary. Graveyard shift is a work shift running through the late hours of the evening to the early hours of the morning, typically from midnight until 8 am, or 3 pm to midnight. Graveyard Shift may also refer to:","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":8669410,"ranking":4,"query_text":"graveyard shift meaning","passage_text":"graveyard shift. 1. a work shift usually beginning at about midnight and continuing for about eight hours through the early morning hours. 2. those who work this shift. Also called graveyard watch, lobster shift. After several rounds of unemployment he securedâ\u0080\u0094with gratitudeâ\u0080\u0094a graveyard shift as a private guard at a nuclear-waste site.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":8669407,"ranking":5,"query_text":"graveyard shift meaning","passage_text":"Definition of graveyard shift for English Language Learners. : a scheduled period of work that begins late at night and ends in the morning. See words that rhyme with graveyard shift.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":7826074,"ranking":6,"query_text":"graveyard shift meaning","passage_text":"The Graveyard Shift, or Graveyard Watch, was the name coined for the work shift of the early morning, typically midnight until 8am. The name originated in the USA at the latter end of the 1800s.","bm25_label":"high","relevance_label":1.0},{"query_id":196720,"passage_id":7826073,"ranking":7,"query_text":"graveyard shift meaning","passage_text":"A man took the bus home from the graveyard shift, bone-tired but dreaming big dreams for his son. Another time as the graveyard shift came to the surface the men noticed a peculiar wavering light in the sky. Not once had she hesitated or turned from the beaten trail, but she had gone down after the graveyard shift.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":1091681,"ranking":8,"query_text":"graveyard shift meaning","passage_text":"Graveyard Shift: Cast a Deadly Spell full cast and crew. View cast photos, videos and more on Fandango. Graveyard Shift: Cast a Deadly Spell full cast and crew.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":556861,"ranking":9,"query_text":"graveyard shift meaning","passage_text":"graveyard shift (graveyard shifts plural ) If someone works thegraveyard shift, they work during the night. (mainly AM) n-count usu the N stick shift (stick shifts plural ) A stick shift is the lever that you use to change gear in a car or other vehicle. (AM) n-count (=gearshift) in BRIT, usually use gear lever","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":7826076,"ranking":10,"query_text":"graveyard shift meaning","passage_text":"Someone would have to sit out in the graveyard all night (the graveyard shift) to listen for the bell; thus, someone could be saved by the bell or was considered a dead ringer.. We have debunked the saved by the bell and dead ringer myths previously, so now let's take a look at 'graveyard shift'.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":7826078,"ranking":11,"query_text":"graveyard shift meaning","passage_text":"Why is the phrase graveyard shift used for late-night work? Current popular explanations for the origin of the phrase graveyard shift reference the 19th century problem of accidentally burying people who were still alive.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":8669413,"ranking":12,"query_text":"graveyard shift meaning","passage_text":"Definition of graveyard shift. : a work shift beginning late at night (as 11 o'clock); also : the workers on such a shift.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":8619791,"ranking":13,"query_text":"graveyard shift meaning","passage_text":"NOCturnal...the night shift...they think its better than saying graveyard shift.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":4237879,"ranking":14,"query_text":"graveyard shift meaning","passage_text":"Report Abuse. i found this on wordorigins.org: Graveyard Shift This term for a late-night work shift dates to around the turn of the 20th century. It is a reference to the desolation and loneliness of late-night work. The term gets it start in nautical circles with the form graveyard watch.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":4237884,"ranking":15,"query_text":"graveyard shift meaning","passage_text":"He explains that the graveyard shift is an evocative term for the night shift between about midnight and eight in the morning, when-no matter how often you've worked it-your skin is clammy, there's sand behind your eyeballs, and the world is creepily silent, like the graveyard.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":7826075,"ranking":16,"query_text":"graveyard shift meaning","passage_text":"He explains that the graveyard shift is an evocative term for the night shift between about midnight and eight in the morning, when - no matter how often you've worked it - your skin is clammy, there's sand behind your eyeballs, and the world is creepily silent, like the graveyard.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":7826081,"ranking":17,"query_text":"graveyard shift meaning","passage_text":"Another time as the graveyard shift came to the surface the men noticed a peculiar wavering light in the sky. The Pinos Altos Story Dorothy Watson. Not once had she hesitated or turned from the beaten trail, but she had gone down after the graveyard shift.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":8669408,"ranking":18,"query_text":"graveyard shift meaning","passage_text":"graveyard shift. n. 1. A work shift that runs during the early morning hours, as from midnight to 8 am. 2. The workers on such a shift.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":7826079,"ranking":19,"query_text":"graveyard shift meaning","passage_text":"AUGUST is regarded as the graveyard shift for networking events with so many people on holiday. people: By invitation only; Carolyn Hughes reports from the latest lunches, launches and parties. A few years ago Newell was working the graveyard shift at a big computer company and he started to battle insomnia.","bm25_label":"high","relevance_label":0.0},{"query_id":196720,"passage_id":690145,"ranking":20,"query_text":"graveyard shift meaning","passage_text":"Gravestone Graveness Graven Image Graven Gravely Gravelly Gravel Grave Mound Graveyard Graveyard Shift Gravid Gravida Gravida I Gravidation Gravidity Gravidness Gravitas Gravitation Gravitational A...","bm25_label":"high","relevance_label":0.0}]