[{"query_id":198581,"passage_id":7191676,"ranking":1,"query_text":"harland clarke customer service number","passage_text":"Phone Number of Harland Clarke Texas is : 1-800-275-1053. (go below for more numbers) Below you find the information about Harland Clarke Texas, Harland Clarke Texas customer service number, Harland Clarke Texas address, Harland Clarke Texas email id and website.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7191673,"ranking":2,"query_text":"harland clarke customer service number","passage_text":"Harland Clarke Texas toll free customer service phone number : 1-800-275-1053, (800) 382-0818 Harland Checks toll free customer service phone number : +1-800-643-5737 Click to enter your compliant for Harland Clarke","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7191677,"ranking":3,"query_text":"harland clarke customer service number","passage_text":"Harland Clarke Customer Service Phone Number Phone Number of Harland Clarke is +1-210-697-8888, +1-800-643-5737. The Harland Clarke is a lead provider of best possible payment solutions, marketing and retail products.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7506368,"ranking":4,"query_text":"harland clarke customer service number","passage_text":"More Harland Clarke 800 numbers and support. This is the best of 3 ways to contact Harland Clarke according to 97956 GetHuman users. Below you can compare the ways to contact Harland Clarke customer service.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7191680,"ranking":5,"query_text":"harland clarke customer service number","passage_text":"This Harland Clarke phone number is ranked #2 out of 2 because 1,758 Harland Clarke customers tried our tools and information and gave us feedback after they called. The reason customers call 800-643-5737 is to reach the Harland Clarke Customer Service department for problems like . As far as we can tell, Harland Clarke has call center locations in null and you can call during their open hours 24 hours, 7 days. Harland Clarke has 2 phone numbers and undefined different ways to get customer help.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7191675,"ranking":6,"query_text":"harland clarke customer service number","passage_text":"While 800-858-3355 is Harland Clarke's best toll-free number, there are 3 total ways to get in touch with them. The next best way to talk to their customer support team, according to other Harland Clarke customers, is by calling their 800-643-5737 phone number for their Customer Service department.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7191674,"ranking":7,"query_text":"harland clarke customer service number","passage_text":"Get the complete contact detail of the Harland Clarke customer service toll free contact number with its support email id, address detail and website.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":300242,"ranking":8,"query_text":"harland clarke customer service number","passage_text":"Delivery Services. To meet the unique needs of each of your customers or members, Harland Clarke provides a variety of expedited delivery service options. Overnight, Two-Day Delivery and First Class. When combined with Harland Clarke's rush order process, these services provide a solution to your customers' non-standard check order needs.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7191678,"ranking":9,"query_text":"harland clarke customer service number","passage_text":"Email address to send mail to Harland Clarke. Send mail to Harland Clarke using the email address mentioned above and Harland Clarke may not be reply back. Call Harland Clarke Phone Numbers for Help: +1-210-697-8888, +1-800-643-5737. Call to Harland Clarke for any help. You can visit Harland Clarke Website for more information: www.harlandclarke.com","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7191679,"ranking":10,"query_text":"harland clarke customer service number","passage_text":"Harland Clarke Texas resides at 10931 Laureate Drive, San Antonio, Texas 78249, United States provides here all the necessory details like contact number 1-800-275-1053, (800) 382-0818 by which customers can reach to Harland Clarke Texas Go to www.harlandclarke.com and get more information from there.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7506365,"ranking":11,"query_text":"harland clarke customer service number","passage_text":"Call Harland Clarke Customer Service. Call Customer Service by tapping below if on your phone, or talk to them from your browser. Tap or click to call. Tap or click here to call (800-643-5737); Press 1, then press 0.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7506366,"ranking":12,"query_text":"harland clarke customer service number","passage_text":"Call Harland Clarke Customer Service. Call Customer Service by tapping below if on your phone, or talk to them from your browser. Tap or click here to call (800-643-5737); Press 1, then press 0. Use our web-phone to save plan minutes.","bm25_label":"high","relevance_label":1.0},{"query_id":198581,"passage_id":300241,"ranking":13,"query_text":"harland clarke customer service number","passage_text":"These include: 1  Overnight, Two-Day Delivery and First Class. When combined with Harland Clarke's rush order process, these services provide a solution to your customers' non-standard check order needs. 2  Rush Service is available to all accountholders.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":7506369,"ranking":14,"query_text":"harland clarke customer service number","passage_text":"Here are some things that other customers said after calling 800-858-3355 and talking to a Harland Clarke customer service agent: Trying to get the right officeanonymous2y agoWebsite needs to be more hones~Disappointed 2y agoHave called on NUMEROUS occasi~kaitlyn2y ago.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":5133147,"ranking":15,"query_text":"harland clarke customer service number","passage_text":"San Antonio-based Harland Clarke Acquires RetailMeNot for $630 million. San Antonio-based Harland Clarke announced Monday it has acquired RetailMeNot for $11.60 per share or approximately $630 million. Harland Clarke, a payment solutions and marketing services company, is a wholly owned subsidiary of MacAndrews & Forbes Inc., which is owned by Chairman and Chief Executive Officer Ronald O. Perelman, a billionaire.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":5133142,"ranking":16,"query_text":"harland clarke customer service number","passage_text":"Victor Nichols is the Chief Executive Officer of Harland Clarke Holdings (HCH), responsible for strategic initiatives, client relationships and overall corporate planning and strategy. Victor oversees Harland Clarke, Scantron and Valassis, as well as a range of shared services that support the HCH enterprise.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":1984581,"ranking":17,"query_text":"harland clarke customer service number","passage_text":"Order by phone from Harland-Clarke. Call Harland-Clarke at (800) 355-8123. You will need to provide the next check number, your 12-digit SDCCU checking account number and San Diego County Credit Union's ABA Routing Number. This information can be found on your check order form.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":1320142,"ranking":18,"query_text":"harland clarke customer service number","passage_text":"Clarks Customer Support Service Phone Number The customer support phone number of Clarks is +44-8444-995544, Fax: +44-1458-447547 (Click phone number to call). The postal and official address, email address and phone number (helpline) of Clarks Service Center and Clarks customer service phone number is given below.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":5114374,"ranking":19,"query_text":"harland clarke customer service number","passage_text":"And, of course, Harland Clarke uses the newest safety and security features for online ordering. All you need is your account number, found at the bottom of your check, and the Bank of Prescott's routing number (082901402). Click the Harland Clarke Check Reorder Express picture below to go directly to the reorder web site. When there just follow the simple steps to complete your order.","bm25_label":"high","relevance_label":0.0},{"query_id":198581,"passage_id":1320147,"ranking":20,"query_text":"harland clarke customer service number","passage_text":"Clarks Shoes customer services phone number. This is a directory service for help and support from Clarks Shoes customer service.","bm25_label":"high","relevance_label":0.0}]