[{"query_id":198807,"passage_id":7341212,"ranking":1,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Confidence votes 69. The MLB team that has gone undefeated in the playoffs were the 1976 Cincinatti Reds swept the Phillies 3-0 in the NLCS and then swept the Yankees 4-0. The MLB team that has gone undefeated in the playoffs were the 1976 Cincinatti Reds swept the Phillies 3-0 in the NLCS and then swept the Yankees 4-0.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":7341214,"ranking":2,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"exists and is an alternate of . The MLB team that has gone undefeated in the playoffs were the 1976 Cincinatti Reds swept the Phillies 3-0 in the NLCS and then swept the Yankees 4-0. The MLB team that has gone undefeated in the playoffs were the 1976 Cincinatti Reds swept the Phillies 3-0 in the NLCS and then swept the Yankees 4-0.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":7070128,"ranking":3,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"also on the list are two teams who went undefeated through the first 13 games of the regular season not to mention a team that won 35 of its first 40 games as it produced one of the most memorable seasons in mlb history","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":7341207,"ranking":4,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Also on the list are two teams who went undefeated through the first 13 games of the regular season, not to mention a team that won 35 of its first 40 games, as it produced one of the most memorable seasons in MLB history. Iâ\u0080\u0099ve compiled a list of my 10 most memorable and prominent starts to a MLB baseball season.","bm25_label":"high","relevance_label":1.0},{"query_id":198807,"passage_id":5236005,"ranking":5,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Has any NBA team ever gone undefeated in the entire month of May? Yes during the season 1995-96 San Antonio Spurs won all the games  in March 1996. They were 2nd team unbeaten in a month. The 1st team  which achieved this was Los Angeles Lâ\u0080¦akers in the season 1971-72  (November 1971).","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":5236004,"ranking":6,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Has an nba team ever gone undefeated in their division? No team in NBA history has gone undefeated in their division. The Boston Celtics in 08-09 went 15-1 in their division, as did the Miami Heat in 03-04. In 1949-50 the Syracuse â\u0080¦Nationals also went 15-1 in their division. 4 people found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":5569283,"ranking":7,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"how many mlb teams have won 100 games and the world series in same year through the 2008 season 33 teams have won 100 games in the regular season and gone on to win the world series the same year but in the last 30 years it has happened only 3 times","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":2800791,"ranking":8,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"The last time a team went undefeated in the regular season was the UNLV Runninâ\u0080\u0099 Rebels, in 1991, who eventually lost in the Final Four to Duke, the champions that season. The last team to go both undefeated in the regular season and ultimately win the championship was the 1976 Indiana Hoosiers. After twenty-three years we finally get to see another team enter the Tournament undefeated.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":531685,"ranking":9,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"The 1972 Miami Dolphins are the only NFL team to go undefeated in both the regular season as well as the playoffs. Four teams have had an undefeated regular season, 1924 â\u0080¦Bears, 1942 Bears, 1972 Dolphins, 2007 Patriots.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":7457761,"ranking":10,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"How many undefeated seasons have the Dolphins had? One. The 1972 Miami Dolphins are the only NFL team to go undefeated in both the regular season as well as the playoffs. Four teams have had an undefeated regular season, 1924 â\u0080¦Bears, 1942 Bears, 1972 Dolphins, 2007 Patriots. With the exception of the Dolphins, they all lost the championship game.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":2800787,"ranking":11,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"UNLV was undefeated in the regular season during the 1991 season, eventually losing to Duke in the NCAA tournament. Indiana University was the last team to go undefeated durinâ\u0080¦g the regular and post season. They were 32-0 in 1976.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":3967886,"ranking":12,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Miami Dolphins and New England Patriots are the only Nfl teams to go undefeated in the regular season, but the Dolphins are the only team to go undefeated and also win the Supâ\u0080¦erbowl.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":4170987,"ranking":13,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Ranking the Top 25 Regular-Season Teams in MLB History. Ranking the Top 25 Regular-Season Teams in MLB History. Major League Baseball has always had a disproportionately brief postseason, and it's unfortunate that a handful of games can overshadow how teams perform during the eternal summer.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":7755278,"ranking":14,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Do Kevin Daniels and Hank St. Clare possess any of the same personality traits? What major league baseball team has the record for most wins in a season?   The 1906 Chicago Cubs and the 2001 Seattle Mariners hold the MLB record for wins in the regular season with 116. Most innings ever played in major league baseball? The MLB record for innings played was 26 by Brooklyn and Boston in 1920.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":3967893,"ranking":15,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"The 1940s and Pro Football's Other Undefeated Teams. 1948 Cleveland Browns and 1942 Chicago Bears. You won't find it in the NFL Record and Fact Book but there was another team that like the 1972 Miami Dolphins, experienced a perfect season, undefeated and untied through regular and post-season play.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":3967887,"ranking":16,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"Yes, the 1972 Miami Dolphins went 17-0 and are the only team (so far) to go through the entire NFL regular season (14 games at the time) and postseason undefeated.    Tâ\u0080¦he 2007 New England Patriots also went undefeated in the regular season, going 16-0.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":4333101,"ranking":17,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"During the 2007 regular season, the Patriots became the only NFL team in history to win 16 games, and the first since the 1972 Miami Dolphins (in a 14-game season) to complete the regular campaign undefeated.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":5347979,"ranking":18,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"The 1978â\u0080\u009379 Indiana State Sycamores men's basketball team is considered the greatest in the school's history. The Sycamores were undefeated in the regular season and were led by Larry Bird. He led an undefeated team to the national title game versus a Magic Johnson-led Michigan State Spartans team, and ended the season as National Runner-Up with a record of 33â\u0080\u00931.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":3967892,"ranking":19,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"The 1940s and Pro Football's Other Undefeated Teams. You won't find it in the NFL Record and Fact Book but there was another team that like the 1972 Miami Dolphins, experienced a perfect season, undefeated and untied through regular and post-season play. The Cleveland Browns, then members of the All-America Football Conference finished 15-0 in 1948.","bm25_label":"high","relevance_label":0.0},{"query_id":198807,"passage_id":5641285,"ranking":20,"query_text":"has a mlb team ever gone undefeated in the regular season","passage_text":"With 50 Games Left Till Playoffs, Few MLB Teams Out Of Contention. In the dog days of summer, Major League Baseball's regular season has nearly 50 games left. Fans have their eyes on postseason play, and every division has tight races. It might be the best invention the world has ever seen or maybe, actually, the worst.","bm25_label":"high","relevance_label":0.0}]