[{"query_id":202081,"passage_id":7741853,"ranking":1,"query_text":"highest dose of glimepiride","passage_text":"The highest recommended dose per day should be 8 mg of glimepiride and 2000 mg. Of metformin. Daily doses Of glimepiride Of more than 6 mg are more effective only. in a minority Of patients. In order to avoid hypoglycaemia the starting dose Of. Amaryl M S.R. should not exceed the daily doses of glimepiride or metformin already. being taken.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":71696,"ranking":2,"query_text":"highest dose of glimepiride","passage_text":"Glimepiride can be used in combination with insulin. In this case, the recommended dose is glimepiride 8 mg daily. If necessary, your healthcare provider may slowly increase your glimepiride dosage by 2 mg or less every one to two weeks. The maximum recommended dose of glimepiride is 8 mg daily.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":7741855,"ranking":3,"query_text":"highest dose of glimepiride","passage_text":"1 Glimepiride can be used in combination with insulin. In this case, the recommended dose is glimepiride 8 mg daily. 2  If necessary, your healthcare provider may slowly increase your glimepiride dosage by 2 mg or less every one to two weeks.  The maximum recommended dose of glimepiride is 8 mg daily.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":7741852,"ranking":4,"query_text":"highest dose of glimepiride","passage_text":"1 In this case, the recommended dose is glimepiride 8 mg daily. 2  If necessary, your healthcare provider may slowly increase your glimepiride dosage by 2 mg or less every one to two weeks.  The maximum recommended dose of glimepiride is 8 mg daily.","bm25_label":"high","relevance_label":1.0},{"query_id":202081,"passage_id":7741856,"ranking":5,"query_text":"highest dose of glimepiride","passage_text":"Glimepiride Dosage for Type 2 Diabetes. 1  The recommended starting does is glimepiride 1 mg or glimepiride 2 mg once a day. 2  The recommended starting dose for elderly people and people with kidney, liver, adrenal, or pituitary problems is glimepiride 1 mg daily.  Glimepiride can be used in combination with insulin.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":7741849,"ranking":6,"query_text":"highest dose of glimepiride","passage_text":"Glimepiride Dosage for Type 2 Diabetes. 1  The recommended starting does is glimepiride 1 mg or glimepiride 2 mg once a day.  The recommended starting dose for elderly people and people with kidney, liver, adrenal, or pituitary problems is glimepiride 1 mg daily.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":7741857,"ranking":7,"query_text":"highest dose of glimepiride","passage_text":"1 The recommended starting does is glimepiride 1 mg or glimepiride 2 mg once a day. 2  The recommended starting dose for elderly people and people with kidney, liver, adrenal, or pituitary problems is glimepiride 1 mg daily.  Glimepiride can be used in combination with insulin.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":71690,"ranking":8,"query_text":"highest dose of glimepiride","passage_text":"The recommended starting glimepiride dose is generally 1 mg or 2 mg once a day. Your healthcare provider will determine your glimepiride dosing guidelines based on a number of factors, such as your age, other medical conditions you may have, and other medications you may be taking.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":8052323,"ranking":9,"query_text":"highest dose of glimepiride","passage_text":"In this 26-week trial, 1041 patients were randomized to Victoza 0.6 mg, Victoza 1.2 mg, Victoza 1.8 mg, placebo, or rosiglitazone 4 mg (one-half of the maximal approved dose in the United States), all as add-on to glimepiride.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":4012304,"ranking":10,"query_text":"highest dose of glimepiride","passage_text":"Restores healthy women will viagra cost per pill be used a process. Riff on the highest obesity and molecular mechanisms are categorized as glimepiride. Regulated, and obstructing blood sugar, also said dr. $225 billions' worth about 20 min.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":2047625,"ranking":11,"query_text":"highest dose of glimepiride","passage_text":"The recommended starting dose of Glimepiride tablets is 1 mg or 2 mg once daily. Patients at increased risk for hypoglycemia (e.g., the elderly or patients with renal impairment) should be started on 1 mg once daily [see Warnings and Precautions (5.1)and Use in Specific Populations (8.5,8.6)].","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":2939470,"ranking":12,"query_text":"highest dose of glimepiride","passage_text":"Glimepiride is an oral diabetes medicine that helps control blood sugar levels. This medication helps your body respond better to insulin produced by your pancreas. Glimepiride is used together with diet and exercise to treat type 2 diabetes. Insulin or other diabetes medicines are sometimes used in combination with glimepiride if needed. Glimepiride may also be used for purposes not listed in this medication guide.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":7353298,"ranking":13,"query_text":"highest dose of glimepiride","passage_text":"Clinical and\/or therapeutic drug monitoring of these potentially interacting drugs may be warranted on initiation of leflunomide therapy. Glimepiride: (Moderate) Glimepiride is metabolized by CYP2C9. It is possible for serum concentrations of glimepiride to rise when coadministered with drugs that inhibit CYP2C9 like leflunomide.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":2047628,"ranking":14,"query_text":"highest dose of glimepiride","passage_text":"Approximately 2,800 patients with type 2 diabetes have been treated with Glimepiride in the controlled clinical trials. In these trials, approximately 1,700 patients were treated with Glimepiride for at least 1 year.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":71694,"ranking":15,"query_text":"highest dose of glimepiride","passage_text":"Increased incidence of bone fracture reported. Postmarketing reports for glimepiride include anaphylaxis, angioedema, and Stevens-Johnson syndrome; promptly discontinue glimepiride, assess for other causes, institute appropriate monitoring and treatment, and initiate alternative treatment for diabetes.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":132455,"ranking":16,"query_text":"highest dose of glimepiride","passage_text":"The second generation sulfonylureas are used in smaller doses than the first-generation drugs. There are three second-generation drugs: glipizide (Glucotrol and Glucotrol XL), glyburide (Micronase, Glynase, and Diabeta), and glimepiride (Amaryl). These drugs are generally taken one to two times a day, before meals. All sulfonylurea drugs have similar effects on blood glucose levels, but they differ in side effects, how often they are taken, and interactions with other drugs.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":6028408,"ranking":17,"query_text":"highest dose of glimepiride","passage_text":"Colesevelam can decrease the absorption of glimepiride. If you are taking colesevelam, take glimepiride at least 4 hours before taking colesevelam. Tell your doctor if your condition does not improve or if it worsens (your blood sugar levels are too high or too low).","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":620081,"ranking":18,"query_text":"highest dose of glimepiride","passage_text":"A 104-week, double-blind, glimepiride-controlled, noninferiority study in which adult patients with type 2 diabetes with insufficient glycemic control on metformin therapy were randomized to receive the addition of TRADJENTA 5 mg\/day (n=777) or glimepiride, titrated as needed (n=775).","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":3768047,"ranking":19,"query_text":"highest dose of glimepiride","passage_text":"Glimepiride helps control blood sugar, but it will not cure your diabetes. You should continue to take glimepiride even if you feel well. This medication should not be used to treat patients with type 1 diabetes, a disease in which the body does not produce insulin.Glimepiride will only help lower blood sugar if your body produces insulin naturally.his medication should not be used to treat patients with type 1 diabetes, a disease in which the body does not produce insulin. Glimepiride will only help lower blood sugar if your body produces insulin naturally.","bm25_label":"high","relevance_label":0.0},{"query_id":202081,"passage_id":2139868,"ranking":20,"query_text":"highest dose of glimepiride","passage_text":"Sulfonylureas stimulate the beta cells of the pancreas to release more insulin. Sulfonylurea drugs have been in use since the 1950s. Chlorpropamide (Diabinese) is the only first-generation sulfonylurea still in use today. The second generation sulfonylureas are used in smaller doses than the first-generation drugs. There are three second-generation drugs: glipizide (Glucotrol and Glucotrol XL), glyburide (Micronase, Glynase, and Diabeta), and glimepiride (Amaryl). These drugs are generally taken one to two times a day, before meals.","bm25_label":"high","relevance_label":0.0}]