[{"query_id":202306,"passage_id":4787770,"ranking":1,"query_text":"highest mileage crossover india","passage_text":"High Mileage Vehicles You Should Buy. We already told you about the most reliable car brands, but now let's look at the top high mileage vehicles by class like compact, midsize, full size, crossover, SUV, pickup and minivan. We analyzed almost 300,000 vehicles on Mojo Motors from the model years 2002 to 2012 to find the highest mileage used vehicles. Advertisement.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":5470234,"ranking":2,"query_text":"highest mileage crossover india","passage_text":"We already told you about the most reliable car brands, but now let's look at the top high mileage vehicles by class like compact, midsize, full size, crossover, SUV, pickup and minivan. We analyzed almost 300,000 vehicles on Mojo Motors from the model years 2002 to 2012 to find the highest mileage used vehicles. Advertisement.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":8119805,"ranking":3,"query_text":"highest mileage crossover india","passage_text":"Honda CR-V Gas Mileage: 1998 â\u0080\u0093 2013 gas mileage, honda, suv First introduced in 1998, the Honda CR-V has become one of Americaâ\u0080\u0099s most popular compact crossover SUVs.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":8502857,"ranking":4,"query_text":"highest mileage crossover india","passage_text":"Going & Stopping The Equinox's claim to fame is its gas mileage â\u0080\u0094 an EPA-estimated 22\/32 mpg city\/highway with the standard 182-horsepower four-cylinder engine and front-wheel drive. Small Crossover Gas Mileage","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":3173464,"ranking":5,"query_text":"highest mileage crossover india","passage_text":"The Edge is a comfortable, quick, smooth-riding light SUV with five seats and fresh styling. Even though it's a crossover, its gas mileage isn't what it could be, and it lacks the third row of seats that seems so important to buyers nowadays.he Edge is a comfortable, quick, smooth-riding light SUV with five seats and fresh styling. Even though it's a crossover, its gas mileage isn't what it could be, and it lacks the third row of seats that seems so important to buyers nowadays.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":2669237,"ranking":6,"query_text":"highest mileage crossover india","passage_text":"The distance between cities of Orissa (India) is calculated in kilometers(kms), miles and nautical miles. Distance in miles gives you the mileage between cities by this Orissa (India) mileage calculator.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":5832874,"ranking":7,"query_text":"highest mileage crossover india","passage_text":"The distance between cities of Punjab (India) is calculated in kilometers(kms), miles and nautical miles. Distance in miles gives you the mileage between cities by this Punjab (India) mileage calculator.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":5928821,"ranking":8,"query_text":"highest mileage crossover india","passage_text":"The distance between cities of Haryana (India) is calculated in kilometers(kms), miles and nautical miles. Distance in miles gives you the mileage between cities by this Haryana (India) mileage calculator.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":1483570,"ranking":9,"query_text":"highest mileage crossover india","passage_text":"The distance between cities of Tamil Nadu (India) is calculated in kilometers(kms), miles and nautical miles. Distance in miles gives you the mileage between cities by this Tamil Nadu (India) mileage calculator.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":7526769,"ranking":10,"query_text":"highest mileage crossover india","passage_text":"Distance in miles gives you the mileage between cities by this Orissa (India) mileage calculator. Orissa (India) Distance Chart (Distance Table): For your quick reference, below is a Distance Chart or Distance Table of distances between some of the major cities in Orissa (India).","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":5377159,"ranking":11,"query_text":"highest mileage crossover india","passage_text":"Top 11 Crossovers and SUVs With the Best Highway Fuel Economy for 2014. For many drivers, freeway travel comprises the lion's share of their time spent behind the wheel. In cases like this, strong gas mileage can save money, and the mileage figure that's most important is highway fuel economy.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":2084356,"ranking":12,"query_text":"highest mileage crossover india","passage_text":"Get Best Mileage Electric Cars in India 2016\/2017 with Prices at AutoPortal.com. Explore Top Most Fuel efficient Electric Cars in India Specifications Reviews Mileage of Electric Cars. New Cars","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":939824,"ranking":13,"query_text":"highest mileage crossover india","passage_text":"The result is that the term SUV is often applied to both crossovers and SUVs. In the past, that was even more common. Before, SUV brought up negative associations with large size and poor gas mileage. That's when many automakers started using the term crossover to describe a vehicle that was crossing over from the practicality of an SUV to the drivability and fuel efficiency of a car.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":391875,"ranking":14,"query_text":"highest mileage crossover india","passage_text":"Renault will launch the Captur crossover in India tomorrow. It is the French automakerâ\u0080\u0099s new flagship vehicle Renault will launch the Captur crossover in India tomorrow. It is the French automakerâ\u0080\u0099s new flagship vehicle that will slot in above the Duster in their hierarchy. We have already driven the car and here is our first drive review or you can also find it in the reviews section of our mobile app.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":7992838,"ranking":15,"query_text":"highest mileage crossover india","passage_text":"A crossover car, as the name suggests, is a car manufactured on a car platform and combining, in highly variable degrees, features of two different design styles or segments. There are 19 Crossover Cars in India on 09 August 2016. Filter Results. Filter 19 Matching Variants.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":7063837,"ranking":16,"query_text":"highest mileage crossover india","passage_text":"2017 Kia Niro: gas mileage review. However you choose to view the 2017 Kia Niro hybridâ\u0080\u0094Kia says it's a crossover utility, we call it a wagonâ\u0080\u0094it's a good-looking and relatively capacious small car.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":5243247,"ranking":17,"query_text":"highest mileage crossover india","passage_text":"CNG Cars with prices in india 16. Sort By -Sort By- Price(Low to High) Price(High to Low) Mileage(Low to High) Mileage(High to Low) Popularity.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":179352,"ranking":18,"query_text":"highest mileage crossover india","passage_text":"Renault Captur Overview. Crossovers are the future in cars and Renault, the pioneer of the compact SUVs in India is set to bring another one to the country. Based on the Duster platform, Renault has built the Kaptur crossover for the emerging markets and the car is expected to hit the Indian market by mid-2017.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":7992832,"ranking":19,"query_text":"highest mileage crossover india","passage_text":"In the following paragraphs, we have listed the Best Mileage Cars In India. And this list also provides price details of all the models weâ\u0080\u0099ve mentioned here. So, starting with the most fuel efficient, hereâ\u0080\u0099s our list of Best Mileage Cars In India with Price, Specs, Images and more.","bm25_label":"medium","relevance_label":0.0},{"query_id":202306,"passage_id":8279580,"ranking":20,"query_text":"highest mileage crossover india","passage_text":"New Upcoming SUV Cars in India 2017 â\u0080\u0093 Honda WR-V. Honda will be looking to strengthen its portfolio in India with the launch of WR-V crossover next year. The WR-V is based on the Honda Jazz currently on sale in India. It will come to India probably in the second half of 2017 with the same engines as the Jazz.","bm25_label":"medium","relevance_label":0.0}]