[{"query_id":203274,"passage_id":7953937,"ranking":1,"query_text":"hillsborough community college president","passage_text":"Hillsborough Community College president arrested on DUI charge. TAMPA, Fla. (WFLA) â\u0080\u0094 The president of Hillsborough Community College faces a charge of drunk driving after a weekend arrest. Deputies say he was pulled over Saturday night just before 11 and refused to take a blood alcohol test.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7953939,"ranking":2,"query_text":"hillsborough community college president","passage_text":"Hillsborough Community College President Kenneth Atwater, Hillsborough County Jail booking photo TAMPA, Fla. (WFLA) â\u0080\u0094 The president of Hillsborough Community College faces a charge of drunk driving after a weekend arrest. Deputies say he was pulled over Saturday night just before 11 and refused to take a blood alcohol test. Doctor Kenneth Atwater represents around 50,000 students and oversees five different campuses.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":701014,"ranking":3,"query_text":"hillsborough community college president","passage_text":"Hillsborough Community College. Hillsborough Community College (HCC) is a two-year community college, located in Hillsborough County, Florida.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7953938,"ranking":4,"query_text":"hillsborough community college president","passage_text":"Kenneth Howard Atwater, the 65-year-old president of Hillsborough Community College, was arrested on a charge of driving under the influence.","bm25_label":"high","relevance_label":1.0},{"query_id":203274,"passage_id":7953940,"ranking":5,"query_text":"hillsborough community college president","passage_text":"Kenneth Howard Atwater, the 65-year-old president of Hillsborough Community College, was arrested on a charge of driving under the influenceâ\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7980489,"ranking":6,"query_text":"hillsborough community college president","passage_text":"Introduction. Hillsborough Community College, commonly known to local residents as HCC, is a two-year community college with campuses in the Tampa Bay area. It is one of 28 community colleges in the state of Florida. Six locations can be found throughout the county.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7953932,"ranking":7,"query_text":"hillsborough community college president","passage_text":"HCC President Dr. Ken Atwater and the Hillsborough Community College Foundation request the pleasure of your company at the 2017 Presidential Showcase Presented by: Honoring Champion of Education Caspers Company Distinguished Alumnus The Honorable Eric Ward Former Tampa Police Department Chief . Wednesday, November 15, 2017 Port Tampa Bay Cruise Terminal #2","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7953936,"ranking":8,"query_text":"hillsborough community college president","passage_text":"Lane Community College, Eugene, OR. 1998-1999. Ruth L. Prather. Valencia Community College, Orlando, FL. 1997-1998. Andrew L. Meyer. Anne Arundel Community College, Arnold, MD. 1996-1997. Elizabeth Thornton. Tarrant County Community College, Hurst, TX. 1995-1996. Jack Wismer. Blackhawk College, Moline, IL. 1994-1995. Alma S. Hires. Hillsborough Community College, Tampa, FL","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":8140116,"ranking":9,"query_text":"hillsborough community college president","passage_text":"The District Board of Trustees of Hillsborough Community College is authorized to provide lower level undergraduate instruction and to award associate degrees and certificates to ensure that the College meets its primary mission of responding to community needs for postsecondary academic and career degree education.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7980495,"ranking":10,"query_text":"hillsborough community college president","passage_text":"Summary. Hillsborough Community College is a public institution in Tampa, Florida. Its campus is located in a city, with a total enrollment of 26,590. The school utilizes a semester-based academic calendar. The student-faculty ratio is 23-to-1. The highest degree offered at Hillsborough Community College is an associate degree. The school has an open admissions policy and offers credit for life experiences. The in-state tuition and fees for 2013-14 were $2,506, and out-of-state tuition and fees were $9,111.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":1063315,"ranking":11,"query_text":"hillsborough community college president","passage_text":"Health & Fitness 101 with Custin at Hillsborough Community College *. * The material on this site is created by StudyBlue users. StudyBlue is not affiliated with, sponsored by or endorsed by the academic institution or instructor.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":3596656,"ranking":12,"query_text":"hillsborough community college president","passage_text":"Anatomy & Physiology 1086 with Germroth at Hillsborough Community College *. * The material on this site is created by StudyBlue users. StudyBlue is not affiliated with, sponsored by or endorsed by the academic institution or instructor.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7980487,"ranking":13,"query_text":"hillsborough community college president","passage_text":"Hillsborough Community College a public, comprehensive institution of higher education empowers students to excel through, its superior teaching and service in an innovative learning environment. Information based on 2010 data from the U.S. Department of Education, National Center for Education Statistics. At Hillsborough Community College, 68.0% percent of first-time undergrads receive financial aid, 35.0% receive grants and\/or scholarships (an average of $3,838), and 7% receive loans ($7,954 on average). On-campus room and board costs about $7,188. Off campus it is around $5,964.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":5957936,"ranking":14,"query_text":"hillsborough community college president","passage_text":"Program Introduction. 1  The Criminology and Criminal Justice Studies Program is an undergraduate college program at Hillsborough Community College in which students can earn an Associate in Science Degree, a College Credit Certificate, as well as an Associate in Arts Degree in various Criminal Justice fields.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":6772409,"ranking":15,"query_text":"hillsborough community college president","passage_text":"Fingerprint Identification and Classification are growing fields within Criminal Justice brought about by the growth of technological investigative tools. Hillsborough Community College now offers courses in Fingerprinting.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":6680831,"ranking":16,"query_text":"hillsborough community college president","passage_text":"TALLAHASSEE, Fla. â\u0080\u0093 A Disaster Recovery Center (DRC) will open Thursday, Sept. 21 in Hillsborough County to help Florida storm survivors. The DRC will be open 9 a.m. to 6 p.m. seven days a week until further notice. The DRC is at the following address: Location: Hillsborough Community College -- The Regent","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7980490,"ranking":17,"query_text":"hillsborough community college president","passage_text":"Students at Hillsborough Community College typically borrow $5,630 in Federal loans for their undergraduate study. The Federal loan payment over 10 years for this amount is approxmiately $64.79 per month.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":3596659,"ranking":18,"query_text":"hillsborough community college president","passage_text":"Anatomy & Physiology 1086 with Germroth at Hillsborough Community College *. Get started today for free. * The material on this site is created by StudyBlue users. StudyBlue is not affiliated with, sponsored by or endorsed by the academic institution or instructor.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":8222291,"ranking":19,"query_text":"hillsborough community college president","passage_text":"President Franklin Pierce 14th President Franklin Pierce, a member of the Democratic Party, took office as the 14th President of the United States on March 4, 1853 at age 48. Pierce served in office for 4 years and was passed over for nomination to a second term by his party. He was born in Hillsborough, NH and received an education from Bowdoin College.","bm25_label":"high","relevance_label":0.0},{"query_id":203274,"passage_id":7173544,"ranking":20,"query_text":"hillsborough community college president","passage_text":"Chandler-Gilbert Community College President Search; Glendale Community College President Search; Mesa Community College President Search; Phoenix College President Search; How to Apply. Adjunct Faculty Pool; Clinical Nursing Pool; Faculty Minimum Qualifications; Faculty Transfer; Part-Time Temporary Pool; Public Safety Officer Pool","bm25_label":"high","relevance_label":0.0}]