[{"query_id":20597,"passage_id":7828548,"ranking":1,"query_text":"architectural design","passage_text":"The European Centre for Architecture Art Design and Urban Studies and The Chicago Athenaeum Museum of Architecture and Design: annual: architect: American Architecture Awards: 1994: The Chicago Athenaeum Museum of Architecture and Design, The European Centre for Architecture Art Design and Urban Studies: annual: architects: American Prize for Architecture: 1994","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":6822139,"ranking":2,"query_text":"architectural design","passage_text":"Incoming search terms: 1  architecture software. 2  best architecture software. 3  architect software. 4  best home design software. 5  architectural design software. 6  architectural software. 7  best architect software. 8  best architectural software. 9  software for architects. 10  architecture design software.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":7132520,"ranking":3,"query_text":"architectural design","passage_text":"In practice, each of these components (sometimes called subsystems) is sometimes said to have an architecture, so, as usual, context contributes to usage and meaning. By comparison, the term design connotes thinking that has less scope than architecture. An architecture is a design, but most designs are not architectures. A single component or a new function has a design that has to fit within the overall architecture.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":287636,"ranking":4,"query_text":"architectural design","passage_text":"Architectural design is more about creating a structure for an appropriate design.it is more for complex and large project.Where the interior design will provide furniture to fit the better with existant architectural design. I can resume that architectural design is the background for interior design.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":3229562,"ranking":5,"query_text":"architectural design","passage_text":"The top creative designs picked up for you, it is your best source of website design inspiration & website awards. Offbox Architecture by creotive.co. Offbox Architecture is a architecture company from Kosovo who provides various services in the architecture and interior design.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":4964200,"ranking":6,"query_text":"architectural design","passage_text":"Often, architectural designers who have not registered as architects are referred to as architectural draftspersons or designers as this term is not protected by statute in most countries. However, in many countries around the world, the term architectural designer and the derivatives of architecture are legally reserved for registered architects.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":8690266,"ranking":7,"query_text":"architectural design","passage_text":"Bachelor of Architectural Studies Develop a sound understanding of architectural design, urban housing design, and the history and theory of architecture. Explore different styles of architecture, and become knowledgeable about architectural site analysis and ways to achieve sustainability.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":225456,"ranking":8,"query_text":"architectural design","passage_text":"Architecture, Interior Design and Residential Design, Nevada State Board of. Architecture, Interior Design and Residential Design; Nevada State Board of.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":5208379,"ranking":9,"query_text":"architectural design","passage_text":"1. (Architecture) the art and science of designing and superintending the erection of buildings and similar structures. 2. (Architecture) a style of building or structure: Gothic architecture. 3. (Architecture) buildings or structures collectively. 4. the structure or design of anything: the architecture of the universe.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":8690263,"ranking":10,"query_text":"architectural design","passage_text":"Study a Bachelor of Architectural studies and develop a sound understanding of architectural design, urban housing design, and the history and theory of architecture. Explore different styles of architecture, and become knowledgeable about architectural site analysis and ways to achieve sustainability.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":2110679,"ranking":11,"query_text":"architectural design","passage_text":"Category: Competitions. TRENDS Excellence Awards for Architecture & Design 2015. TRENDS Excellence Awards for Architecture & Design 2015 is Indiaâ\u0080\u0099s premier design competition for professionals, brought to you by Home & Design TRENDS magazine (India). Categories are spread over architecture, interior design, product design and visual design.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":2110680,"ranking":12,"query_text":"architectural design","passage_text":"The A' Architecture, Building and Structure Design Competition is a specialized design competition open to both concept stage and realized architectural projects, urban design projects and buildings designed by architects, architecture offices, real estate developers and construction companies worldwide.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":21568,"ranking":13,"query_text":"architectural design","passage_text":"In the field of architecture an architectural plan is a design and planning for a building, and can contain architectural drawings, specifications of the design, calculations, time planning of the building process, and other documentation. 1  1 The term Architectural plan.  2 Architectural plan aspects.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":7322579,"ranking":14,"query_text":"architectural design","passage_text":"Architectural design values. Architectural design values make up an important part of what influences architects and designers when they make their design decisions. However, architects and designers are not always influenced by the same values and intentions. Value and intentions differ between different architectural movements.","bm25_label":"high","relevance_label":1.0},{"query_id":20597,"passage_id":7105331,"ranking":15,"query_text":"architectural design","passage_text":"Computer architecture. In computer engineering, computer architecture is a set of rules and methods that describe the functionality, organization, and implementation of computer systems. Some definitions of architecture define it as describing the capabilities and programming model of a computer but not a particular implementation. In other definitions computer architecture involves instruction set architecture design, microarchitecture design, logic design, and implementation.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":5958118,"ranking":16,"query_text":"architectural design","passage_text":"Company Profile. MCG Architecture provides commercial architectural solutions and services throughout the United States. The Company offers interior design, graphic design, design\/build, and master planning services. MCG Architecture covers signage, architectural illustrations, space planning, design and decor selection, site analysis and planning, and program and project management.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":3136460,"ranking":17,"query_text":"architectural design","passage_text":"Web architecture is a distillation of several academic fields: 1  web usability, 2  information architecture, 3  user experience design, 4  interaction design, 5  user interface design,6  human-computer interaction, 7  information design, 8  web design, and. 9  graphic design.eb architecture is a distillation of several academic fields: 1  web usability, 2  information architecture, 3  user experience design, 4  interaction design, 5  user interface design,","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":5466387,"ranking":18,"query_text":"architectural design","passage_text":"Posted on April 23, 2016Author admin [â\u0080¦] [â\u0080¦] Whatâ\u0080\u0099s the difference between architecture and design â\u0080¦ â\u0080\u0093 Hi Tom, From my perspective, architecture is design and design may be an architecture, depending on what the scope and objective of the design activity is.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":8690257,"ranking":19,"query_text":"architectural design","passage_text":"Programme overview. Are you interested in architecture and urban design? This is the first step towards a career in architecture. Develop the drawing, design and graphic presentation skills to express architectural concepts. Analyse architectural sites and explore how to ensure the environmental sustainability of architectural projects.","bm25_label":"high","relevance_label":0.0},{"query_id":20597,"passage_id":6659083,"ranking":20,"query_text":"architectural design","passage_text":"Developing the solution design and architecture. The development team begins the design process with the solution design and architecture and culminates it with a design document that becomes part of the functional specification.","bm25_label":"high","relevance_label":0.0}]