[{"query_id":211621,"passage_id":2278016,"ranking":1,"query_text":"how close is a meter to a yard?","passage_text":"While the reference to 80 yards [~73 meters] obviously is an error, it is eerily close to the 66 meters that we found as a plausible example of just how far that the ancient Greek javelin could be thrown with the ankyle. It is an example of how sheer happenstance can be close as long as the value seems reasonable.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5156260,"ranking":2,"query_text":"how close is a meter to a yard?","passage_text":"How to convert yards to meters : Use the conversion calculator titled Convert yards to meters. Enter a value in the yards field and click on the Calculate meters button. Your answer will appear in the meters field. How to convert meters to yards : Use the conversion calculator titled Convert meters to yards. Enter a value in the meters field and click on the Calculate yards button. Your answer will appear in the yards field.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":7373879,"ranking":3,"query_text":"how close is a meter to a yard?","passage_text":"How big is a meter compared to a yard? For every yard, there is approximately 0.9144 meter and for every meter, there are 1.0936 yards.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5131638,"ranking":4,"query_text":"how close is a meter to a yard?","passage_text":"To find out how many meters in yards, multiply by the conversion factor or simply use the converter. 1 Yard = 0.9144 Meters There are 0.9144 meters in a yard, because one foot is defined as 0.3048 meters exactly and there are 3 feet in a yard, that makes 0.3048 * 3 = 0.9144 meters in a yard. For example, to find out how many meters there are in a yard and a half, multiply the yard value by the conversion factor, that makes 1.5 * 0.9144 = 1.3716 meters in 1.5 yards. Yard is an imperial and US customary length unit and equals to 0.9144 meters. 1 yard is 3 feet or 36 inches.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5549846,"ranking":5,"query_text":"how close is a meter to a yard?","passage_text":"It depends on my mood. They are pretty close. But a meter is a little longer (39.37 inches) vs. a yard (36) So, I memorize the two numbers in parans. And I multiply by 39.37\/36 to convert meters to yards. Or by 36\/39.37 to convert yards to meters.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":7373888,"ranking":6,"query_text":"how close is a meter to a yard?","passage_text":"How Big is a Meter Compared to a Yard? Now, if you are wondering how many meters there are in a yard, according to the International Yard standard; one yard is approximately 0.9144 meter which means that there is less than one yard for every meter. To elaborate further, one meter is equivalent to 1.0936 yards. Yard Conversions to Feet and Inches Still based on International Yard standards, one foot is equivalent to one-third of a yard which means that one yard is equal three feet.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":3835535,"ranking":7,"query_text":"how close is a meter to a yard?","passage_text":"How do you convert 100 square yards to square meters?   You need to know how many meters are in a yard.   One yard is .9144 meters, so 1 square yard = .9144 x .9144 meters (.836127)   If 1 square yard is .836127 square â\u0080¦ meters, then 100 square yards is 83.6127 square meters. 7 people found this useful. No, because they are used to measure different things.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5563430,"ranking":8,"query_text":"how close is a meter to a yard?","passage_text":"Conversion for how many meters ( m ) of length are contained in a yard ( 1 yd ). Or, how much in meters of length is in 1 yard? To link to this length yard to meters online converter simply cut and paste the following. The link to this tool will appear as: length from yard (yd) to meters (m) conversion.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5780966,"ranking":9,"query_text":"how close is a meter to a yard?","passage_text":"How to convert meters to yards : Use the conversion calculator titled Convert meters to yards. Enter a value in the meters field and click on the Calculate yards button. Your answer will appear in the yards field. The following is a list of definitions relating to conversions between yards and meters.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":4414585,"ranking":10,"query_text":"how close is a meter to a yard?","passage_text":"The 55 meter dash, not run as often anymore, and 60 meter dash is a great quantifier of pure straight-line speed and quickness. In fact, those races are very close to the 60 yard (almost 55 meters) standard baseball uses to time prospects and closely mimics the king of all football combine eventsâ\u0080¦the 40 yard dash.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5131636,"ranking":11,"query_text":"how close is a meter to a yard?","passage_text":"How many yards in a meter? Yards to meters conversion factor is 1.0936133. To find out how many yards in meters, multiply by this conversion factor or instead, use the converter. 1 Meter = 1.0936133 Yards Meter (metre in SI spelling) is a metric system base length unit and defined as the length of the path travelled by light in vacuum during a time interval of 1\/299,792,458 of a second. 1 meter equals to 3.28 feet and 39.37 inches.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":458230,"ranking":12,"query_text":"how close is a meter to a yard?","passage_text":"How many yards are there in a meter? There are 1.09 yards, or 39.37 inches, in 1 meter. The yard is a unit of measurement typical of the U.S. customary system of measurement, while the meter is a unit of measurement from the metric system.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5131632,"ranking":13,"query_text":"how close is a meter to a yard?","passage_text":"how many meters in 100 yards It comes back quickly with the answer 100 yards = 91.44 meters. A meter stick is just a bit longer than a yard stick, so a good guess is that 100 yards is just a bit fewer than 100 meters. Google's answer is consistent with that expectation.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":4335023,"ranking":14,"query_text":"how close is a meter to a yard?","passage_text":"For other length unit conversions, please go to Length Conversion. Imperial length unit yard to metric meters conversion factor is 1.0936133. To find out how many yards in meters, multiply by this conversion factor or instead, use the converter below.1 Meter = 1.0936133 Yards. Meter is a metric system base length unit and defined as the length of the path travelled by light in vacuum during a time interval of 1\/299,792,458 of a second.mperial length unit yard to metric meters conversion factor is 1.0936133. To find out how many yards in meters, multiply by this conversion factor or instead, use the converter below. 1 Meter = 1.0936133 Yards.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":524850,"ranking":15,"query_text":"how close is a meter to a yard?","passage_text":"So by asking google: how many meters in 100 yards. It comes back quickly with the answer 100 yards = 91.44 meters. A meter stick is just a bit longer than a yard stick, so a good guess is that 100 yards is just a bit fewer than 100 meters. Google's answer is consistent with that expectation.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":6105989,"ranking":16,"query_text":"how close is a meter to a yard?","passage_text":"We can convert this value to other units also like yards; for converting meters to yards we would multiply the quantity by a conversion factor 1.09 and back from yards to meters by multiplying by a factor 0.91. Thus we can find in 1 meter equals how many yards are there as follows: 1 meter = 1.09 yards, Squaring both sides we get: 1 meter square = 1.1881 approx. So, the area of the rectangle in yards square can be calculated as: 600 meters = 600 x 1.1881 yards square = 712.86 yards square.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":458225,"ranking":17,"query_text":"how close is a meter to a yard?","passage_text":"Meters To Yards Conversion. Imperial length unit yard to metric meters conversion factor is 1.0936133. To find out how many yards in meters, multiply by this conversion factor or instead, use the converter below. 1 Meter = 1.0936133 Yards. Meter is a metric system base length unit and defined as the length of the path travelled by light in vacuum during a time interval of 1\/299,792,458 of a second.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":4872797,"ranking":18,"query_text":"how close is a meter to a yard?","passage_text":"How many meters in track and field oval? The 400 meters is exactly 1312.34 feet or 437.2 yards. Conversely, the 440 yard dash = 402.56 meters. You can read a lot more on 440 Yard and 400 Meters Races from an earlâ\u0080¦ier blog post where Tommie Smith ran 44.5 400 meters and 44.8 for 440 yards in the same race.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":5563434,"ranking":19,"query_text":"how close is a meter to a yard?","passage_text":"One yard of length converted to meter equals to 0.91 m. How many meters of length are in 1 yard? The answer is: The change of 1 yd ( yard ) unit of length measure equals = to 0.91 m ( meter ) as the equivalent measure for the same length type.","bm25_label":"medium","relevance_label":0.0},{"query_id":211621,"passage_id":6603436,"ranking":20,"query_text":"how close is a meter to a yard?","passage_text":"How many yards in a meter ... and vice versa? Mizpah Silk works in metric measurements. You can order single lengths of fabric from four to ten meters, in half meter increments. To help you decide what fabric lengths you want to order, use these tables: Convert Meters to Yards. Convert Yards to Meters. So, for example, if you require nine yards of fabric, you need to order 8.5 meters.","bm25_label":"medium","relevance_label":0.0}]