[{"query_id":224626,"passage_id":2162072,"ranking":1,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Why is electroconvulsive therapy performed? What types of health care professionals administer electroconvulsive therapy? How does electroconvulsive therapy work? How does it treat depression and other illnesses? How do doctors perform electroconvulsive therapy today? What are the side effects of ECT? Why does ECT cause memory loss? What does ECT cost?","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":6396584,"ranking":2,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Once the symptoms of OCD begin to lessen, the headaches that accommodate these symptoms will dissipate. Electroconvulsive therapy (ECT) is used for the more severe symptoms of OCD. Behavioral therapy combined with antidepressant medications is also being utilized for relief of OCD symptoms.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":2162071,"ranking":3,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"ECT See ELECTROCONVULSIVE THERAPY. ECT. Electroconvulsive therapy sometimes is used to treat depression or mania when pharmaceutical treatment fails. Mentioned in: Bipolar Disorder. ECT . Abbreviation for electroconvulsive therapy; electroshock therapy. ECT. electroconvulsive therapy. Patient discussion about ECT. Q. What is the ECT method of treatment for depression? I have a friend who is suffering from major depression and is now about to start ECT treatment. What exactly is that? A. ECT is the electroshock therapy for treating severe depression that does not heal with medication trials. In this treatment, an electric shock is induced, in levels that are not by any means risking the patientâ\u0080\u0099s life.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":210766,"ranking":4,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Biomedical therapies are physical or medical treatments such as drug therapy, electroconvulsive therapy (electroshock), or surgery (i.e lobotomy) that are used to treat mental or psychological disorders.iomedical therapies are physical or medical treatments such as drug therapy, electroconvulsive therapy (electroshock), or surgery (i.e lobotomy) that are used to treat mental or psychological disorders.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":7144913,"ranking":5,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Abbreviation for electroconvulsive therapy; electroshock therapy. ECT. electroconvulsive therapy. Patient discussion about ECT. Q. What is the ECT method of treatment for depression? I have a friend who is suffering from major depression and is now about to start ECT treatment. What exactly is that? A. ECT is the electroshock therapy for treating severe depression that does not heal with medication trials. In this treatment, an electric shock is induced, in levels that are not by any means risking the patientâ\u0080\u0099s life.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":6832318,"ranking":6,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Home Â» Find Help Â» Mental Health Treatments Â» Electroconvulsive Therapy (ECT) Electroconvulsive therapy (ECT) is a procedure in which a brief application of electric stimulus is used to produce a generalized seizure. It is not known how or why ECT works or what the electrically stimulated seizure does to the brain.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":6672729,"ranking":7,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"It is a specific type of therapy that was introduced in psychotherapies. Done by organic methods. SOMATIC THERAPY: Somatic therapy is treating mental disorders with organic therapies such as psychotropic drugs, electroconvulsive therapy or megavitamin therapy.. No related posts.t is a specific type of therapy that was introduced in psychotherapies. Done by organic methods. SOMATIC THERAPY: Somatic therapy is treating mental disorders with organic therapies such as psychotropic drugs, electroconvulsive therapy or megavitamin therapy.. No related posts.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":4322868,"ranking":8,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Brain stimulation therapies involve activating or touching the brain directly with electricity, magnets, or implants to treat depression and other disorders. Electroconvulsive therapy is the most researched stimulation therapy and has the longest history of use.rain stimulation therapies involve activating or touching the brain directly with electricity, magnets, or implants to treat depression and other disorders. Electroconvulsive therapy is the most researched stimulation therapy and has the longest history of use.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":6947652,"ranking":9,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Clomipramine is approved for OCD treatment in children, teens, and adults. Although antidepressants, such as clomipramine, are effective for treating the symptoms of OCD, behavior therapy for OCD is often used along with medications. Ask your healthcare provider about behavior therapy for OCD.Clomipramine belongs to a class of medications called tricyclic antidepressants.lthough antidepressants, such as clomipramine, are effective for treating the symptoms of OCD, behavior therapy for OCD is often used along with medications. Ask your healthcare provider about behavior therapy for OCD.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":4881942,"ranking":10,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Electroconvulsive Therapy (ECT). Guide. Electroconvulsive therapy (ECT) is a procedure used to treat severe depression. It may be used in people who have symptoms such as delusions, hallucinations, or suicidal thoughts or when other treatments such as psychotherapy and antidepressant medicines have not worked.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":3027991,"ranking":11,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Biomedical therapies are physical or medical treatments such as drug therapy, electroconvulsive therapy (electroshock), or surgery (i.e lobotomy) that are used to treat mental or psychological disorders.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":604592,"ranking":12,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Electroconvulsive Therapy (ECT) Treatment Overview. Electroconvulsive therapy (ECT) is a procedure used to treat severe depression. It may be used in people who have symptoms such as delusions, hallucinations, or suicidal thoughts or when other treatments such as psychotherapy and antidepressant medicines have not worked.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":496061,"ranking":13,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"OCD is treated with medicine and therapy. For kids who need medicines, doctors give SSRIs (selective serotonin reuptake inhibitors), like Zoloft, Prozac, and Luvox. Therapists treat OCD with cognitive behavioral therapy. During this kind of talk-and-do therapy, kids learn about OCD and begin to understand it better.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":655169,"ranking":14,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"References. 1  Kellner C. Overview of electroconvulsive therapy (ECT) for adults. 2  Kellner C. Technique for performing electroconvulsive therapy (ECT) in adults. 3  AskMayoExpert. 4  ECT, TMS and other brain stimulation therapies. 5  Depression: How electroconvulsive therapy works. 6  Brain stimulation therapies. 7  Acharya D, et al.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":7296711,"ranking":15,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"While current treatment guidelines for obsessive-compulsive disorder (OCD) do not recommend electroconvulsive therapy (ECT), the NIMH is supporting new research into the use of ECT and deep brain stimulation (DBS) for OCD treatment.CT is not a treatment. Instead it traumatizes the brain and has side effects that interrupt regular brain functionâ\u0080¦There are effective treatments for â\u0080\u009cOCDâ\u0080\u009d such as meditation, CBT and other types of psychotherapy. ECT should be banned.","bm25_label":"high","relevance_label":1.0},{"query_id":224626,"passage_id":1429735,"ranking":16,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"It is a specific type of therapy that was introduced in psychotherapies. Done by organic methods. SOMATIC THERAPY: Somatic therapy is treating mental disorders with organic therapies such as psychotropic drugs, electroconvulsive therapy or megavitamin therapy.. No related posts.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":1810930,"ranking":17,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Shock Therapy's Effect On Depressed Brain Explained By New Electroconvulsive Therapy Study. While shock therapy has been used in psychiatry for more than 70 years, researchers had little idea how the controversial treatment worked to treat depression. Now, scientists say they may have solved the mystery.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":6671311,"ranking":18,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"A second type of biomedical therapy is electroconvulsive therapy, better known as electric shock therapy. It was first used by doctors in the 1930s to treat depression, anxiety, and schizophrenia by altering brain waves.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":4020661,"ranking":19,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Brain stimulation therapies involve activating or touching the brain directly with electricity, magnets, or implants to treat depression and other disorders. Electroconvulsive therapy is the most researched stimulation therapy and has the longest history of use.","bm25_label":"high","relevance_label":0.0},{"query_id":224626,"passage_id":4837129,"ranking":20,"query_text":"how does Electroconvulsive therapy treat ocd","passage_text":"Brain stimulation techniques such as electroconvulsive therapy (ECT), for example, can be used to treat major depression that hasn't responded to standard treatments.","bm25_label":"high","relevance_label":0.0}]