[{"query_id":22479,"passage_id":8182699,"ranking":1,"query_text":"are florida mangroves protected","passage_text":"Carol McArdle Mangrove Paintings. Mangroves are essential to the survival of the south Florida coastline. In the water among their roots are the nurseries of nearly all marine life. The mangroves create thick forests along the costline that hold the rich mud and soil in place and that protect the coastline in bad weather and hurricanes.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":267112,"ranking":2,"query_text":"are florida mangroves protected","passage_text":"mangrove. large tropical evergreen tree, genus Rhizophora, that grows on muddy tidal flats and along protected ocean shorelines. Mangroves are most abundant in tropical Asia, Africa, and the islands of the SW Pacific.The American, or red, mangrove (Rhizophora mangle) is found along the muddy shores and in the everglades of the Florida peninsula and on other tropical American coast lines.arge tropical evergreen tree, genus Rhizophora, that grows on muddy tidal flats and along protected ocean shorelines. Mangroves are most abundant in tropical Asia, Africa, and the islands of the SW Pacific.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":7710581,"ranking":3,"query_text":"are florida mangroves protected","passage_text":"Thomson Reuters Handout of red and black mangrove in Miami. By Zachary Fagenson. MIAMI, Fla. (Reuters) - New revelations that a long strip of protected mangrove trees were illegally razed amid preparations for the 2016 Miami International Boat Show has outraged Florida environmentalists.","bm25_label":"high","relevance_label":1.0},{"query_id":22479,"passage_id":5368454,"ranking":4,"query_text":"are florida mangroves protected","passage_text":"The Florida mangroves ecoregion, of the mangrove forest biome, comprise an ecosystem along the coasts of the Florida peninsula, and the Florida Keys.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":2785569,"ranking":5,"query_text":"are florida mangroves protected","passage_text":"Mangroves line more than 1,800 miles of shoreline within Florida Keys National Marine Sanctuary. In the Florida Keys, the red mangrove, black mangrove, and white mangrove tend to dominate wetland areas.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":8182694,"ranking":6,"query_text":"are florida mangroves protected","passage_text":"The best mangrove paintings by carol McArdle, the mangrove artist. Award wining and beautiful paintings of Florida mangroves, original paintings and prints for sale. Florida art, Carol McArdle oil and acrylic paintings for sale. Paintings of Florida nature, mangroves, sea grapes, beaches, birds, turtles and scenery.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":5368456,"ranking":7,"query_text":"are florida mangroves protected","passage_text":"Mangrove Swamps Florida's mangroves: Florida is home to approximately 2,700 square kilometers of this dominant subtropical coastal ecosystem. Florida's mangrove swamps are concentrated along the southwest coast, where the Everglades and Big Cypress Swamp drain to the Gulf of Mexico.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":815422,"ranking":8,"query_text":"are florida mangroves protected","passage_text":"Florida's mangroves: Florida is home to approximately 2,700 square kilometers of this dominant subtropical coastal ecosystem. Florida's mangrove swamps are concentrated along the southwest coast, where the Everglades and Big Cypress Swamp drain to the Gulf of Mexico.rabs burrow in the sediments, prey on mangrove seedlings, facilitate litter decomposition and help convert detritus energy to the ecosystem's birds and fish. Well-known mangroves: With an area of about 600 square kilometers, Florida's Ten Thousand Islands is one of the world's largest mangrove swamps.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":6223797,"ranking":9,"query_text":"are florida mangroves protected","passage_text":"Florida's Mangroves. Worldwide, more than 50 species of mangroves exist. Of the three species found in Florida, the red mangrove (Rhizophora mangle) is probably the most well-known. It typically grows along the water's edge.The red mangrove is easily identified by its tangled, reddish roots called prop-roots.These roots have earned mangroves the title, walking trees.lorida's Mangroves. Worldwide, more than 50 species of mangroves exist. Of the three species found in Florida, the red mangrove (Rhizophora mangle) is probably the most well-known. It typically grows along the water's edge.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":5406530,"ranking":10,"query_text":"are florida mangroves protected","passage_text":"Mangroves of Florida. The term mangrove is loosely used to describe a wide variety of often unrelated tropical and subtropical trees and shrubs which share common characteristics. Globally, more than 50 species in 16 different families are considered mangroves (Tomlinson 1986). In Florida, the mangrove community consists of three main species of true mangroves: the red mangrove, Rhizophora mangle, the black mangrove, Avicennia germinans, and the white mangrove, Laguncularia racemosa.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":815428,"ranking":11,"query_text":"are florida mangroves protected","passage_text":"It is illegal to remove mangroves from the shoreline. Mangrove vegetation: Three of the 10 known mangrove species dominate Florida's mangroves: red mangroves, black mangroves, and white mangroves. Red mangroves have dense roots and are found along coastal edges that face the sea.Black mangroves are most common in hammock wetlands and basin swamps.rabs burrow in the sediments, prey on mangrove seedlings, facilitate litter decomposition and help convert detritus energy to the ecosystem's birds and fish. Well-known mangroves: With an area of about 600 square kilometers, Florida's Ten Thousand Islands is one of the world's largest mangrove swamps.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":5368450,"ranking":12,"query_text":"are florida mangroves protected","passage_text":"Florida's Mangroves. Worldwide, more than 50 species of mangroves exist. Of the three species found in Florida, the red mangrove (Rhizophora mangle) is probably the most well-known. It typically grows along the water's edge. The red mangrove is easily identified by its tangled, reddish roots called prop-roots. These roots have earned mangroves the title, walking trees.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":7710575,"ranking":13,"query_text":"are florida mangroves protected","passage_text":"Florida mangrove plant communities covered an estimated 430,000 to 540,000 acres (1,700 to 2,200 km 2) in Florida in 1981. Ninety percent of the Florida mangroves are in southern Florida, in Collier, Lee, Miami-Dade and Monroe Counties. Approximately 280,000 acres (1,100 km 2) of mangrove forests are in the hands of the Federal, State and local governments, and of private, non-profit organizations.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":4536966,"ranking":14,"query_text":"are florida mangroves protected","passage_text":"Florida's Mangroves. Worldwide, more than 50 species of mangroves exist. Of the three species found in Florida, the red mangrove (Rhizophora mangle) is probably the most well-known. It typically grows along the water's edge.The red mangrove is easily identified by its tangled, reddish roots called prop-roots.ndian River is the longest saltwater lagoon in Florida. There are just less than 8,000 acres of mangroves within the study site, but only 1,900 acres are available as fisheries habitat because of mosquito impoundments. Consequently, 76 percent of the existing mangrove areas are not productive to fisheries.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":5368451,"ranking":15,"query_text":"are florida mangroves protected","passage_text":"It is illegal to remove mangroves from the shoreline. Mangrove vegetation: Three of the 10 known mangrove species dominate Florida's mangroves: red mangroves, black mangroves, and white mangroves. Red mangroves have dense roots and are found along coastal edges that face the sea. Black mangroves are most common in hammock wetlands and basin swamps.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":6201635,"ranking":16,"query_text":"are florida mangroves protected","passage_text":"Red mangroves, together with the other three U.S. mangrove speciesâ\u0080\u0094black mangroves, white mangroves, and buttonwoodâ\u0080\u0094create vast coastal forests. U.S. Range: In the U.S. red mangroves are native to Florida, Puerto Rico, and the Virgin Islands, but they are also present as an exotic in Hawaii.Life History and Reproduction: Small, yellow flowers blossom on red mangroves and are pollinated by wind..S. Range: In the U.S. red mangroves are native to Florida, Puerto Rico, and the Virgin Islands, but they are also present as an exotic in Hawaii. Life History and Reproduction: Small, yellow flowers blossom on red mangroves and are pollinated by wind.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":815426,"ranking":17,"query_text":"are florida mangroves protected","passage_text":"Crabs are another important mangrove species, as they help maintain biodiversity. Crabs burrow in the sediments, prey on mangrove seedlings, facilitate litter decomposition and help convert detritus energy to the ecosystem's birds and fish.Well-known mangroves: With an area of about 600 square kilometers, Florida's Ten Thousand Islands is one of the world's largest mangrove swamps.rabs burrow in the sediments, prey on mangrove seedlings, facilitate litter decomposition and help convert detritus energy to the ecosystem's birds and fish. Well-known mangroves: With an area of about 600 square kilometers, Florida's Ten Thousand Islands is one of the world's largest mangrove swamps.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":6223790,"ranking":18,"query_text":"are florida mangroves protected","passage_text":"Three species of mangroves are found in Florida: the red mangrove, black mangrove, and white mangrove. Typically, red mangroves grow along the water's edge, black mangroves grow on slightly higher elevations than the red mangrove, and white mangroves grow upland from the red and black.hite mangroves are normally found upland of the red and black mangroves. The white mangroves are a bit harder to identify than red or black mangroves, since they don't have any obvious features like prop roots or pneumatophores.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":4570701,"ranking":19,"query_text":"are florida mangroves protected","passage_text":"Human activities such as dredging and careless boating are threatening South Floridaâ\u0080\u0099s mangroves and seagrass. Despite the valuable role that mangroves and seagrass play in the Florida Keys ecosystem, these plants are facing one particularly large threat: Us. In the Florida Keys, human development is the greatest threat to mangrove communities. Since the 1950s, more than 60 percent of mangroves in Monroe County have been destroyed for development. Activities such as dredging, using herbicides, and increasing waste water runoff have destroyed thousands of acres of mangrove habitat.","bm25_label":"high","relevance_label":0.0},{"query_id":22479,"passage_id":5406525,"ranking":20,"query_text":"are florida mangroves protected","passage_text":"More than a third of the worldâ\u0080\u0099s mangroves are believed to have disappeared between 1980 and 2000, mostly due to the rise of industrial shrimp farming and coastal development. In China alone, the last 50 years have seen a 70 percent loss of mangrove forests. In the U.S., protected mangroves along Floridaâ\u0080\u0099s coasts and the tip of Louisiana are faring better, with higher protections than mangroves in other countries. Of the remaining mangroves, only about 6.9 percent are officially protected.","bm25_label":"high","relevance_label":0.0}]