[{"query_id":22882,"passage_id":1567595,"ranking":1,"query_text":"are herpes contagious","passage_text":"Herpes simplex, the virus that causes oral herpes, is contagious. To prevent catching the virus, do not kiss or share personal items with anyone who has a cold sore.es, the fluid in the blister of oral herpes is the most contagious. After the blister breaks and an ulcer forms, herpes is less contagious. However, caution should always be taken as long as there is an active lesion.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":1567596,"ranking":2,"query_text":"are herpes contagious","passage_text":"Herpes is always potentially contagious, whether or not you see blisters. Although herpes is thought to be most contagious immediately before, during, and after blisters are present, the lack of blisters in between outbreaks does not equal not contagious.erpes is always potentially contagious, whether or not you see blisters. Although herpes is thought to be most contagious immediately before, during, and after blisters are present, the lack of blisters in between outbreaks does not equal not contagious.","bm25_label":"high","relevance_label":1.0},{"query_id":22882,"passage_id":6129118,"ranking":3,"query_text":"are herpes contagious","passage_text":"Herpes is always potentially contagious, whether or not you see blisters. Although herpes is thought to be most contagious immediately before, during, and after blisters are present, the lack of blisters in between outbreaks does not equal not contagious.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":8083357,"ranking":4,"query_text":"are herpes contagious","passage_text":"Oral Herpes: 75% of adults have oral herpes and cannot get it more than once. Herpes viral shedding is independent from oral lesions. Contagiousness is not in any way correlated to having or not having a sore. You should always consider yourself contagious if you have herpes.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":4162870,"ranking":5,"query_text":"are herpes contagious","passage_text":"Varicella, or chicken pox, is a very contagious disease caused by the varicella-zoster virus of the herpes family.aricella, or chicken pox, is a very contagious disease caused by the varicella-zoster virus of the herpes family.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":4915635,"ranking":6,"query_text":"are herpes contagious","passage_text":"Genital Herpes. Genital herpes is a contagious infection caused by the herpes simplex virus (HSV). There are two different strains, or types, of HSV: herpes simplex virus type 1 (HSV-1) and type 2 (HSV-2).Both can cause genital herpes, although most cases of genital herpes are caused by HSV-2.enital Herpes. Genital herpes is a contagious infection caused by the herpes simplex virus (HSV). There are two different strains, or types, of HSV: herpes simplex virus type 1 (HSV-1) and type 2 (HSV-2).","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":386900,"ranking":7,"query_text":"are herpes contagious","passage_text":"Yes. Herpes is spread by skin-to-skin contact with an infected person. Herpes is a comminicable disease and it's very common to have. But people have stigmatised it because it's contagious and because of the way it looks.es. Herpes is spread by skin-to-skin contact with an infected person. Herpes is a comminicable disease and it's very common to have. But people have stigmatised it because it's contagious and because of the way it looks.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":2857012,"ranking":8,"query_text":"are herpes contagious","passage_text":"Genital and oral herpes is most likely spread during an active outbreak when no precautions are being taken to avoid it. Herpes is a highly contagious virus that is spread by direct contact.Having sexual contact during a herpes outbreak is risky even with protection.enital and oral herpes is most likely spread during an active outbreak when no precautions are being taken to avoid it. Herpes is a highly contagious virus that is spread by direct contact.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":1567591,"ranking":9,"query_text":"are herpes contagious","passage_text":"A Good In Bed answered. The herpes virus is most contagious during and just before a person has an outbreak. Herpes outbreaks often appear as a rash, bumps, or one or more sores around the genitals or the mouth, which can progress to blisters.Initial outbreaks are sometimes associated with fevers and flu-like symptoms.erpes is always potentially contagious, whether or not you see blisters. Although herpes is thought to be most contagious immediately before, during, and after blisters are present, the lack of blisters in between outbreaks does not equal not contagious.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":6726463,"ranking":10,"query_text":"are herpes contagious","passage_text":"Find an Infectious Disease Specialist. Herpes simplex virus infections are very contagious and can be spread to either the genital or oral areas by direct contact with herpes sores or blisters, or skin, saliva, or mucus membranes infected with a herpes simplex virus.ind an Infectious Disease Specialist. Herpes simplex virus infections are very contagious and can be spread to either the genital or oral areas by direct contact with herpes sores or blisters, or skin, saliva, or mucus membranes infected with a herpes simplex virus.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":3538027,"ranking":11,"query_text":"are herpes contagious","passage_text":"Herpes Stomatitis. Recurrent herpes simplex labialis, also known as oral or orolabial herpes, is an infection of the mouth area caused by the herpes simplex virus. It is a common and contagious infection that spreads easily.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":875101,"ranking":12,"query_text":"are herpes contagious","passage_text":"Canker sores are not a form of herpes, however, they are often confused and mistaken as herpes. Canker sores are not considered to be contagious. Cold sores and mouth herpes on the other hand are caused by the herpes simplex virus and can be very contagious. Canker sores usually occur inside the mouth, are gray in color and have a distinct edge. The sores will usually heal within 10 to 14 days, without treatment.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":5717756,"ranking":13,"query_text":"are herpes contagious","passage_text":"Genital herpes is a contagious infection caused by the herpes simplex virus (HSV). There are two different strains, or types, of HSV: herpes simplex virus type 1 (HSV-1) and type 2 (HSV-2).Both can cause genital herpes, although most cases of genital herpes are caused by HSV-2.enital Herpes. Genital herpes is a contagious infection caused by the herpes simplex virus (HSV). There are two different strains, or types, of HSV: herpes simplex virus type 1 (HSV-1) and type 2 (HSV-2). Both can cause genital herpes, although most cases of genital herpes are caused by HSV-2.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":3990511,"ranking":14,"query_text":"are herpes contagious","passage_text":"Cold sores are very contagious. They are caused by the herpes simplex virus type 1. The initial infection (primary herpes) may be confused with a cold or flu and can cause painful lesions to erupt throughout the mouth.old sores are very contagious. They are caused by the herpes simplex virus type 1. The initial infection (primary herpes) may be confused with a cold or flu and can cause painful lesions to erupt throughout the mouth.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":1274196,"ranking":15,"query_text":"are herpes contagious","passage_text":"Genital Herpes. Genital herpes is a contagious infection caused by the herpes simplex virus (HSV). There are two different strains, or types, of HSV: herpes simplex virus type 1 (HSV-1) and type 2 (HSV-2). Both can cause genital herpes, although most cases of genital herpes are caused by HSV-2.enital Herpes. Genital herpes is a contagious infection caused by the herpes simplex virus (HSV). There are two different strains, or types, of HSV: herpes simplex virus type 1 (HSV-1) and type 2 (HSV-2). Both can cause genital herpes, although most cases of genital herpes are caused by HSV-2.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":7702404,"ranking":16,"query_text":"are herpes contagious","passage_text":"Recurrent herpes simplex labialis is an infection of the mouth caused by the herpes simplex virus. It's a common and contagious infection that spreads easily. Recurrent herpes simplex labialis is an infection of the mouth caused by the herpes simplex virus.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":2358431,"ranking":17,"query_text":"are herpes contagious","passage_text":"Recurrent herpes simplex labialis, also known as oral or orolabial herpes, is an infection of the mouth area caused by the herpes simplex virus. It is a common and contagious infection that spreads easily.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":7766156,"ranking":18,"query_text":"are herpes contagious","passage_text":"Herpes, particularly genital herpes, is a very contagious viral infection. Although it can be spread by skin-to-skin contact, you are more likely to contract this disease if you come in contact with the fluid or pus from herpes sores.t the beginning of a herpes outbreak, you will usually not notice any blisters or pus. Later, however, you may notice red bumps, then sores with pus in them. Pus from herpes is generally clear or yellowish in color, and it is typically very contagious.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":4755009,"ranking":19,"query_text":"are herpes contagious","passage_text":"Canker sores (Aphthous ulcers) Canker sores are not a form of herpes, however, they are often confused and mistaken as herpes. Canker sores are not considered to be contagious. Cold sores and mouth herpes on the other hand are caused by the herpes simplex virus and can be very contagious. Canker sores usually occur inside the mouth, are gray in color and have a distinct edge. The sores will usually heal within 10 to 14 days, without treatment.","bm25_label":"high","relevance_label":0.0},{"query_id":22882,"passage_id":3652613,"ranking":20,"query_text":"are herpes contagious","passage_text":"Canker sores are not considered to be contagious. Cold sores and mouth herpes on the other hand are caused by the herpes simplex virus and can be very contagious. If you are experiencing ulcerations on or inside of your mouth please visit your health care provider for a professional diagnosis.","bm25_label":"high","relevance_label":0.0}]