[{"query_id":231877,"passage_id":7680305,"ranking":1,"query_text":"how far is niagara on the lake to hamilton","passage_text":"It Ends at Niagara-on-the-Lake, ON, CanadaCan't get a feel of the tour distance on the small map? How far is Hamilton from Niagara-on-the-Lake?","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":7680300,"ranking":2,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Refer the Directions from Hamilton to Niagara on the Lake!How much would be the distance if one could just fly from Hamilton to Niagara-on-the-Lake like a bird in a staight line? Check the Flight distance between Hamilton and Niagara on the Lake.Travel time is an important point to know with the driving distance. Hence you might also want to know the Travel Time from Hamilton to Niagara on the Lake. This will help you estimate how much time you will spend travelling for the distance from Hamilton to Niagara-on-the-Lake.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":7680302,"ranking":3,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Distance from Niagara on the Lake, Ontario to Hamilton, Ontario. Distance Â» Ontario Â» Niagara on the Lake Â» Ontario Â» Hamilton. There are 46 miles or 74 km from Niagara on the Lake to Hamilton. Niagara on the Lake and Hamilton are take 1 hour 1 min by car and you can see best route for this distance.","bm25_label":"high","relevance_label":1.0},{"query_id":231877,"passage_id":4436630,"ranking":4,"query_text":"how far is niagara on the lake to hamilton","passage_text":"The Good Witch stars Catherine Bell as Cassandra Nightingale. The  filming locations for the movie are Hamilton and Niagara on the  Lake, Ontario, Canada. The house shown in â\u0080¦ the series is a movie set  and not an actual house.onfidence votes 116. Canada is the country that serves as the filming location for 'The Good Witch'. Specifically, the action takes place in Hamilton, southern Ontario. The city is the third largest of its province and the ninth of it's nation. Scenes are also filmed in Niagara On The Lake, near Niagara Falls, Ontario.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":2841620,"ranking":5,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Although set in Middleton, USA it was filmed in Hamilton and Niagara on the Lake, Ontario. In the sequel The Good Witch's Charm, the map on the wall in the police station shows Middleton north and west of Chicago, in the vicinity of DuPage County.lthough set in Middleton, USA it was filmed in Hamilton and Niagara on the Lake, Ontario. In the sequel The Good Witch's Charm, the map on the wall in the police station shows Middleton north and west of Chicago, in the vicinity of DuPage County.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":2940873,"ranking":6,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Grimsby, Ontario. Grimsby is a town on Lake Ontario in the Niagara Region, Ontario, Canada. Grimsby is a part of the Hamilton Census Metropolitan Area. It is named after the English fishing town of Grimsby in North East Lincolnshire. The majority of residents reside in the area bounded by Lake Ontario and the Niagara Escarpment.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":4464355,"ranking":7,"query_text":"how far is niagara on the lake to hamilton","passage_text":"See also: Transportation in Hamilton, Ontario and List of streets in Hamilton, Ontario. Hamilton is located in Southern Ontario on the western end of the Niagara Peninsula and wraps around the westernmost part of Lake Ontario; most of the city, including the downtown section, is on the south shore.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":4037765,"ranking":8,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Hamilton [1] is a port city in Ontario with a population around 505,000. It is situated at the westernmost end of Lake Ontarioâ\u0080\u0094the city wraps around the lake and continues towards the Niagara Escarpment, referred to by locals as the mountain..","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":3422723,"ranking":9,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Hamilton's location at the western end of Lake Ontario has ensured it a strategic position within Ontario's transportation network. Southeast of the lake are the Niagara Peninsula and Buffalo, NY; northeast of the lake are Toronto and eastern Ontario; and to the west are southwestern Ontario and Detroit, MI. Today, an increasing number of Hamilton residents commute to work in Toronto by car or via GO Transit.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":4436634,"ranking":10,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Canada is the country that serves as the filming location for 'The Good Witch'. Specifically, the action takes place in Hamilton, southern Ontario.onfidence votes 116. Canada is the country that serves as the filming location for 'The Good Witch'. Specifically, the action takes place in Hamilton, southern Ontario. The city is the third largest of its province and the ninth of it's nation. Scenes are also filmed in Niagara On The Lake, near Niagara Falls, Ontario.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":3422721,"ranking":11,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Hamilton, Ontario, incorporated as a city in 1846, population 519,949 (2011c), 504,559 (2006c). The City of Hamilton is situated at the west end of Lake Ontario, on Burlington Bay, 68 km southwest of Toronto, and 66 km west of Niagara Falls and the American border.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":6378816,"ranking":12,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Between the cities of Hamilton and Niagara Falls, and along the South shores of Lake Ontario runs the Niagara Peninsula. A fertile micro-climate where the majority of Ontario vineyards can be found.To the East lies the majestic town of Niagara-on-the-Lake. To the West the quaint town of Grimsby, and in the heart of the region lies Jordan Village. All three towns designed to delight the tourist as they explore the wineries of Ontario.o the East lies the majestic town of Niagara-on-the-Lake. To the West the quaint town of Grimsby, and in the heart of the region lies Jordan Village. All three towns designed to delight the tourist as they explore the wineries of Ontario.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":2911991,"ranking":13,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Hamilton is located in Southern Ontario on the western end of the Niagara Peninsula and wraps around the westernmost part of Lake Ontario; most of the city, including the downtown section, is on the south shore.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":2414968,"ranking":14,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Confidence votes 116. Canada is the country that serves as the filming location for 'The Good Witch'. Specifically, the action takes place in Hamilton, southern Ontario.The city is the third largest of its province and the ninth of it's nation. Scenes are also filmed in Niagara On The Lake, near Niagara Falls, Ontario.onfidence votes 116. Canada is the country that serves as the filming location for 'The Good Witch'. Specifically, the action takes place in Hamilton, southern Ontario.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":2911995,"ranking":15,"query_text":"how far is niagara on the lake to hamilton","passage_text":"The area from Oshawa, Ontario around the west end of Lake Ontario to Niagara Falls, with Hamilton at its centre, is known as the Golden Horseshoe and had a population of approximately 8.1 million people in 2006.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":7508780,"ranking":16,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Burlington is a city in Ontario, Canada. It lies across Burlington Bay from Hamilton and is located a 45-minute drive from Toronto and Niagara. It is listed among the best cities to live in Canada. Nestled on the shore of beautiful Lake Ontario in the shadow of the Niagara Escarpment, Burlington offers everything for that perfect get-away.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":7680296,"ranking":17,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Driving distance from Hamilton, Canada to Niagara Falls, NY. The total driving distance from Hamilton, Canada to Niagara Falls, NY is 45 miles or 72 kilometers. Your trip begins in Hamilton, Canada. It ends in Niagara Falls, New York.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":2414966,"ranking":18,"query_text":"how far is niagara on the lake to hamilton","passage_text":"The Good Witch stars Catherine Bell as Cassandra Nightingale. The  filming locations for the movie are Hamilton and Niagara on the  Lake, Ontario, Canada. The house shown in â\u0080¦ the series is a movie set  and not an actual house.onfidence votes 116. Canada is the country that serves as the filming location for 'The Good Witch'. Specifically, the action takes place in Hamilton, southern Ontario.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":5871971,"ranking":19,"query_text":"how far is niagara on the lake to hamilton","passage_text":"Another major airport is Buffalo Niagara International Airport (BUF \/ KBUF), which has domestic flights from Buffalo, New York and is 25 miles from Niagara Falls, NY. John C. Munro Hamilton International Airport (YHM \/ CYHM) has domestic flights from Hamilton, Canada and is 56 miles from Niagara Falls, NY.omestic airports near Niagara Falls, NY. 6 miles: Niagara Falls, NY (IAG \/ KIAG) Niagara Falls International Airport. 25 miles: Buffalo, NY (BUF \/ KBUF) Buffalo Niagara International Airport. 56 miles: Hamilton, Canada (YHM \/ CYHM) John C. Munro Hamilton International Airport.","bm25_label":"high","relevance_label":0.0},{"query_id":231877,"passage_id":5182765,"ranking":20,"query_text":"how far is niagara on the lake to hamilton","passage_text":"In addition to being the most populous province in the country, Ontario is also the most urban. The most outstanding feature of this urban pattern is the continuous network of communities around the western end of Lake Ontarioâ\u0080\u0094 called the Golden Horseshoeâ\u0080\u0094which includes St.Catharines-Niagara, Hamilton and Toronto.","bm25_label":"high","relevance_label":0.0}]