[{"query_id":242107,"passage_id":5729778,"ranking":1,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long do cooked Italian sausages last after being frozen and thawed? Cooked Italian sausages that has been thawed in the fridge can be kept for an additional 3 to 4 days in the refrigerator before cooking; Italian sausages that were thawed in the microwave or in cold water should be eaten immediately.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":6538890,"ranking":2,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long do raw Italian sausages last after being frozen and thawed? Italian sausages that have been defrosted in the fridge can be kept for an additional 1 to 2 days in the refrigerator before cooking; Italian sausages that were thawed in the microwave or in cold water should be cooked immediately.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":3968773,"ranking":3,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"If you are wondering how long can you keep cooked sausage in the refrigerator, you've come to the right place. Cooked sausage can be kept in the refrigerator longer than raw sausage, so it is best to go ahead and cook it. According to the U.S. Department of Agriculture, fresh uncooked sausage can be kept in the refrigerator only one to two days although it can be kept in the freezer for one to two months. Once cooked, they recommend being able to keep it in the refrigerator for only three to four days (or two to three months in the freezer).","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":6979331,"ranking":4,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"other sources say that you can keep the fresh cooked sausage in the refrigerator up to seven days if kept at 40 degrees f which is the normal setting in both restaurant and home refrigerators another says up to five days for cooked italian sausage lightly smoked sausage or breakfast sausage","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":92150,"ranking":5,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Other sources say that you can keep the fresh cooked sausage in the refrigerator up to seven days if kept at 40 degrees F (which is the normal setting in both restaurant and home refrigerators). Another says up to five days for cooked Italian sausage, lightly smoked sausage, or breakfast sausage.","bm25_label":"high","relevance_label":1.0},{"query_id":242107,"passage_id":6591469,"ranking":6,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Other sources say that you can keep the fresh cooked sausage in the refrigerator up to seven days if kept at 40 degrees F (which is the normal setting in both restaurant and home refrigerators). Another says up to five days for cooked Italian sausage, lightly smoked sausage, or breakfast sausage. echnically in the sausage family, hot dogs can be kept in the refrigerator for up to two weeks unopened or for seven days in the refrigerator after opening.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":5305583,"ranking":7,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long you can keep meat in the refrigerator depends on the type. Keep raw ground meats, sausage and poultry in the refrigerator for one to two days. Cook raw roasts, steaks, and chops, including pork chops, lamb chops, and veal chops, within three to five days. You can also keep cooked meat in the refrigerator for three or four days.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":5691107,"ranking":8,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long can you freeze italian sausages? i bought some italian sausages 2 weeks ago, there still sealed in the box and frozen, how long can it be frozen? thank you.ow long can you freeze italian sausages? i bought some italian sausages 2 weeks ago, there still sealed in the box and frozen, how long can it be frozen? thank you.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":1846880,"ranking":9,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Other sources say that you can keep the fresh cooked sausage in the refrigerator up to seven days if kept at 40 degrees F (which is the normal setting in both restaurant and home refrigerators). Another says up to five days for cooked Italian sausage, lightly smoked sausage, or breakfast sausage. Remember that you are to cook sausages of ground beef, pork, veal, or lamb to 160 degrees F. For those made of ground turkey or chicken, it is 165 degrees F.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":48374,"ranking":10,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long you can keep meat in the refrigerator depends on the type. Keep raw ground meats, sausage and poultry in the refrigerator for one to two days. Cook raw roasts, steaks, and chops, including pork chops, lamb chops, and veal chops, within three to five days. You can also keep cooked meat in the refrigerator for three or four days. Unopened cooked meat, such as hot dogs and luncheon meat, stays safe for about two weeks in the refrigerator.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":4516724,"ranking":11,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Other sources say that you can keep the fresh cooked sausage in the refrigerator up to seven days if kept at 40 degrees F (which is the normal setting in both restaurant and home refrigerators). Another says up to five days for cooked Italian sausage, lightly smoked sausage, or breakfast sausage.uncheon meats can also be kept unopened in the refrigerator for up to two weeks and in the freezer for one to two months, but the time in the refrigerator after opening is less than hot dogs at three to five days.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":5729779,"ranking":12,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long do cooked Italian sausages last in the freezer? Properly stored, they will maintain best quality for about 1 to 2 months, but will remain safe beyond that time. The freezer time shown is for best quality only - cooked Italian sausages that have been kept constantly frozen at 0â\u0084\u0089 will keep safe indefinitely.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":1737755,"ranking":13,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Basics. How long you can keep meat in the refrigerator depends on the type. Keep raw ground meats, sausage and poultry in the refrigerator for one to two days. Cook raw roasts, steaks, and chops, including pork chops, lamb chops, and veal chops, within three to five days.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":5539743,"ranking":14,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Once you take meat out of the freezer, bacterial growth will resume, so you should cook the meat within a few days. How long you can keep meat in the refrigerator depends on the type. Keep raw ground meats, sausage and poultry in the refrigerator for one to two days. Cook raw roasts, steaks, and chops, including pork chops, lamb chops, and veal chops, within three to five days. You can also keep cooked meat in the refrigerator for three or four days.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":6971905,"ranking":15,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Once you take meat out of the freezer, bacterial growth will resume, so you should cook the meat within a few days. Basics How long you can keep meat in the refrigerator depends on the type. Keep raw ground meats, sausage and poultry in the refrigerator for one to two days. Cook raw roasts, steaks, and chops, including pork chops, lamb chops, and veal chops, within three to five days. You can also keep cooked meat in the refrigerator for three or four days.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":1598990,"ranking":16,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long can I keep mushrooms in refrig!! I've refrigerated mushrooms for 5 days until now, and they're turning dark. I'm wondering if it's ok to cook them?? and how long can I keep mushrooms in refrigerator?? __________________.There's really no hard or fast rule to how long you can keep mushrooms in the fridge. Frankly, you can keep them in the fridge for as long as they remain fresh-lol!! That said, so long as they're kept dry, they should last quite awhile, although they may begin drying out a bit.'ve refrigerated mushrooms for 5 days until now, and they're turning dark. I'm wondering if it's ok to cook them?? and how long can I keep mushrooms in refrigerator??","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":1100161,"ranking":17,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Sealed, prepackaged, fresh pork cuts can be kept in the refrigerator 2 to 4 days; sealed ground pork will keep in the refrigerator for 1 to 2 days.If you do plan on keeping fresh pork longer than 2 to 3 days before cooking it, store it well-wrapped in the freezer.. How long can I store ham or other smoked products in the refrigerator? Whole smoked ham and whole ham slices can be stored in the refrigerator for 3 to 4 days or until the use by date on the label. Smoked bacon and sausages can be kept for up to 7 days.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":5547672,"ranking":18,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"How long can I keep cooked ground turkey in the refrigerator before it will go bad? I cooked the turkey yesterday, and it is in the fridge now.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":1615222,"ranking":19,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"Question on how long you can keep cooked meat in refrigerator. Hi, I had a question about the length of time you can keep cooked meat in the refrigerator. I thought it was 3-4 days at most. As you can see, the sell by date is actually 5 days after the day they cooked it.","bm25_label":"high","relevance_label":0.0},{"query_id":242107,"passage_id":7329204,"ranking":20,"query_text":"how long can i keep cooked italian sausage in refrigerator","passage_text":"View top rated How long will sausage gravy keep in refrigerator recipes with ratings and reviews. Cinnamon Scottish Scones, Cooking Oil Storage Information, Dali Side Eggâ\u0080¦ The world's largest kitchen","bm25_label":"high","relevance_label":0.0}]