[{"query_id":273481,"passage_id":2709751,"ranking":1,"query_text":"how long will food last in the refrigerator without power","passage_text":"How Long Will Food Last? Perishable food in a refrigerator lasts about four hours without power, as long as the door is kept closed. Opening the door lets some of the cold escape and increases the temperature in the fridge, so keep it closed as long as possible. A refrigerator thermometer helps you keep an eye on the temperature.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":4694658,"ranking":2,"query_text":"how long will food last in the refrigerator without power","passage_text":"The refrigerator: how long will foods remain safe without power? Â· All foods: at least 4 hours, if the fridge is left unopened. Â· Discard after 4 hours without power: Meat, poultry, fish, milk, eggs, cooked leftovers, soft cheeses, deli cold cuts\/salads and other perishable foods.he refrigerator: how long will foods remain safe without power? Â· All foods: at least 4 hours, if the fridge is left unopened. Â· Discard after 4 hours without power: Meat, poultry, fish, milk, eggs, cooked leftovers, soft cheeses, deli cold cuts\/salads and other perishable foods.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":7557486,"ranking":3,"query_text":"how long will food last in the refrigerator without power","passage_text":"How long does vacuum-packed food last? A: Vacuum-packed foods may last three to five times longer compared to stored foods without this type of packaging. For example, refrigerated cooked ham lasts three to four days, while vacuum-packed cooked ham can last up to two weeks in the refrigerator.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":2097896,"ranking":4,"query_text":"how long will food last in the refrigerator without power","passage_text":"Perishable food in a refrigerator lasts about four hours without power, as long as the door is kept closed. Opening the door lets some of the cold escape and increases the temperature in the fridge, so keep it closed as long as possible. A refrigerator thermometer helps you keep an eye on the temperature.","bm25_label":"high","relevance_label":1.0},{"query_id":273481,"passage_id":7557485,"ranking":5,"query_text":"how long will food last in the refrigerator without power","passage_text":"How long does vacuum-packed food last? Quick Answer. Vacuum-packed foods may last three to five times longer compared to stored foods without this type of packaging. For example, refrigerated cooked ham lasts three to four days, while vacuum-packed cooked ham can last up to two weeks in the refrigerator.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":6570014,"ranking":6,"query_text":"how long will food last in the refrigerator without power","passage_text":"Obviously, the food is in the fridge to keep it from spoiling and without power to the appliance, it will eventually go bad. But how long does that take? The U.S. Department of Agriculture says the average refrigerator will keep food cold for about four hours without power, as long as you keep the doors closed. The more you open the door, the shorter that period becomes. A powered refrigerator temperature should be 40 degrees F or lower and the freezer should be 0 degrees F or lower. If you are without power for any length of time, you should use an appliance thermometer to help you keep track of your refrigerator's temperature.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":3257445,"ranking":7,"query_text":"how long will food last in the refrigerator without power","passage_text":"The time a refrigerator will stay cold when power is lost depends on the brand and how. Keep your food fresh during the storm. good the seals keep the cold inside. Time can vary from 2-6 hours without opening the doors. Without any power you can think of your refrigerator as a large picnic cooler. Placing blocks of ice inside will help to keep the temperature cool. Food in the freezer will last longer, especially if the freezer is more than half full. You need to be aware of how long the power has been out. Foods that start to get warm (above 40 degrees) may not look or smell bad but are starting to get bacteria that could make you sick.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":337926,"ranking":8,"query_text":"how long will food last in the refrigerator without power","passage_text":"Obviously, the food is in the fridge to keep it from spoiling and without power to the appliance, it will eventually go bad. But how long does that take? The U.S. Department of Agriculture says the average refrigerator will keep food cold for about four hours without power, as long as you keep the doors closed. The more you open the door, the shorter that period becomes. A powered refrigerator temperature should be 40 degrees F or lower and the freezer should be 0 degrees F or lower.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":5550056,"ranking":9,"query_text":"how long will food last in the refrigerator without power","passage_text":"Obviously, the food is in the fridge to keep it from spoiling and without power to the appliance, it will eventually go bad. But how long does that take? The U.S. Department of Agriculture says the average refrigerator will keep food cold for about four hours without power, as long as you keep the doors closed. The more you open the door, the shorter that period becomes.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":220060,"ranking":10,"query_text":"how long will food last in the refrigerator without power","passage_text":"The refrigerator: how long will foods remain safe without power? Â· All foods: at least 4 hours, if the fridge is left unopened. Â· Discard after 4 hours without power: Meat, poultry, fish, milk, eggs, cooked leftovers, soft cheeses, deli cold cuts\/salads and other perishable foods.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":3007015,"ranking":11,"query_text":"how long will food last in the refrigerator without power","passage_text":"Perishable food in a refrigerator lasts about four hours without power, as long as the door is kept closed. Opening the door lets some of the cold escape and increases the temperature in the fridge, so keep it closed as long as possible.A refrigerator thermometer helps you keep an eye on the temperature.reezer. Items stored in a freezer compartment will last longer than in the fridge because the temperature is cooler and the items have been frozen. A freezer that's full may keep food cool enough to be safe for 24 hours.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":6154296,"ranking":12,"query_text":"how long will food last in the refrigerator without power","passage_text":"There are some foods that can last for a long time without refrigeration. Other foods can't last for more than a couple hours. For example, uncooked, dried beans or pasta will keep a year or more unrefrigerated.Foods that are normally refrigerated should never be allowed to sit at room temperature more than 2 hours.here are some foods that can last for a long time without refrigeration. Other foods can't last for more than a couple hours. For example, uncooked, dried beans or pasta will keep a year or more unrefrigerated.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":4410581,"ranking":13,"query_text":"how long will food last in the refrigerator without power","passage_text":"It might last about a day or two, depending on how long before the power went off it was last opened, as well as how long you keep it closed after. It depends on the kind of food. If is rice almost 24 hours, if is milk no more than 6 hours, cheese 2 days. How i said before it depends in the kind of food and most important of all how many times do you open and close the refrigerator all that I said before is if you keep the refrigerator close.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":7376380,"ranking":14,"query_text":"how long will food last in the refrigerator without power","passage_text":"How Long Refrigerated Food Is Safe to Eat. If the power goes out, keep track of how long it's out. Keep the door to the refrigerator closed as much as possible, and remember that full refrigerators stay colder longer than emptier ones. Food stored in the refrigerator is still safe to eat if the power is out for no more than four hours.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":7370980,"ranking":15,"query_text":"how long will food last in the refrigerator without power","passage_text":"Be sure to make a note of the time of the power outage to have an idea of how long the refrigerator and freezer have been without power. Because outside temperatures can fluctuate, foods may not stay completely frozen when put out in wintry conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":5703912,"ranking":16,"query_text":"how long will food last in the refrigerator without power","passage_text":"1 Be sure to make a note of the time of the power outage to have an idea of how long the refrigerator and freezer have been without power.  Because outside temperatures can fluctuate, foods may not stay completely frozen when put out in wintry conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":2193244,"ranking":17,"query_text":"how long will food last in the refrigerator without power","passage_text":"How long will food last in the refrigerator? So you've cooked that big Thanksgiving meal and now you're ready for the leftovers. To avoid food-borne illnesses, make sure you keep them refrigerated. Here's a list of how long certain foods will last in the fridge. (courtesy: pastrywiz.com)","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":5884801,"ranking":18,"query_text":"how long will food last in the refrigerator without power","passage_text":"1 Be sure to make a note of the time of the power outage to have an idea of how long the refrigerator and freezer have been without power. 2  Because outside temperatures can fluctuate, foods may not stay completely frozen when put out in wintry conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":5766667,"ranking":19,"query_text":"how long will food last in the refrigerator without power","passage_text":"The refrigerator: how long will foods remain safe without power? Â· All foods: at least 4 hours, if the fridge is left unopened. Â· Discard after 4 hours without power: Meat, poultry, fish, milk, eggs, cooked leftovers, soft cheeses, deli cold cuts\/salads and other perishable foods. All foods: at least 4 hours, if the fridge is left unopened. Â· Discard after 4 hours without power: Meat, poultry, fish, milk, eggs, cooked leftovers, soft cheeses, deli cold cuts\/salads and other perishable foods.","bm25_label":"high","relevance_label":0.0},{"query_id":273481,"passage_id":262745,"ranking":20,"query_text":"how long will food last in the refrigerator without power","passage_text":"Perishable food in a refrigerator lasts about four hours without power, as long as the door is kept closed. Opening the door lets some of the cold escape and increases the temperature in the fridge, so keep it closed as long as possible.A refrigerator thermometer helps you keep an eye on the temperature.reezer. Items stored in a freezer compartment will last longer than in the fridge because the temperature is cooler and the items have been frozen. A freezer that's full may keep food cool enough to be safe for 24 hours. Freezer food that thaws to above 40 degrees Fahrenheit for more than two hours should be discarded.","bm25_label":"high","relevance_label":0.0}]