[{"query_id":276338,"passage_id":7193422,"ranking":1,"query_text":"how many calories do you burn by dancing?","passage_text":"How many calories do I burn while I dance? How Many Calories Do I Burn While I Dance? There is no doubt that dancing is great aerobic exercise, but are you aware of how many calories youâ\u0080\u0099re burning while youâ\u0080\u0099re grooving to your favorite music? Youâ\u0080\u0099ll be amazed at how many calories you burn while having fun! Check out the chart below:","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":7396376,"ranking":2,"query_text":"how many calories do you burn by dancing?","passage_text":"Calories Burned - Cardio Dancing (including aerobic dance, Zumba, Hip Hop HUSTLE) Find out how many calories you burn for Cardio Dancing (including aerobic dance, Zumba, Hip Hop HUSTLE). The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout. Calculate.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":5532976,"ranking":3,"query_text":"how many calories do you burn by dancing?","passage_text":"The dancing style you choose affects how many calories you can burn. How Many Calories Are Burned with Dancing? During a dance session of about 30 minutes, you can burn anywhere between 105 and 620 calories. Many factors, like your weight, the type of dance, how hard you work, and how many breaks you take affect the total calories you burn. Here is more about how many calories you can burn in 30 minutes with different styles of dancing. Samba, foxtrot, waltz, mambo, tango, and chacha are some of the most common types of slow-paced ballroom dance routines. How much calories you burn in 30 minutes of these dance routines depends on your weight.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":2100694,"ranking":4,"query_text":"how many calories do you burn by dancing?","passage_text":"Find out how many calories you burn for Belly Dancing. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout. Your Weight in Pounds:","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":5532975,"ranking":5,"query_text":"how many calories do you burn by dancing?","passage_text":"The dancing style you choose affects how many calories you can burn. How Many Calories Are Burned with Dancing? During a dance session of about 30 minutes, you can burn anywhere between 105 and 620 calories. Many factors, like your weight, the type of dance, how hard you work, and how many breaks you take affect the total calories you burn. Here is more about how many calories you can burn in 30 minutes with different styles of dancing. Slow Paced Ballroom Dance. Samba, foxtrot, waltz, mambo, tango, and chacha are some of the most common types of slow-paced ballroom dance routines. How much calories you burn in 30 minutes of these dance routines depends on your weight. For instance:","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":7316160,"ranking":6,"query_text":"how many calories do you burn by dancing?","passage_text":"You can burn 105-620 calories dancing for 30 minutes. It depends on how much you weigh, how hard you work, the type of dance, and the number of breaks you take. Below is a general estimate of how many calories you can burn during 30 minutes of various types of dance.","bm25_label":"high","relevance_label":1.0},{"query_id":276338,"passage_id":7316164,"ranking":7,"query_text":"how many calories do you burn by dancing?","passage_text":"How Tap Dancing Can Motivate You. Tap dancing burns approximately 315 calories per hour. If you have a two-hour tape dance class, that is 630 calories burned. If you take two-hour tape classes five days per week, that is almost a full pound of calorie-burning. Of course, you do not have to be so extreme.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":2044893,"ranking":8,"query_text":"how many calories do you burn by dancing?","passage_text":"How many calories do you burn doing 25 squats? 1  54% - If you do squats for 1 min how many calories do you burn? 2  51% - If you weigh 140 lbs how many calories does 1000 squats burn? 3  32% - How much squats to do to burn 3500? 4  36% - How many squats to burn 100 belly fat? 5  75% - How many calories burned in a set of squats? 6  85% - How many calories are 7  ... 1 32% - How much squats to do to burn 3500? 2  36% - How many squats to burn 100 belly fat? 3  75% - How many calories burned in a set of squats? 4  85% - How many calories are burned doing 15 squats?","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":2100692,"ranking":9,"query_text":"how many calories do you burn by dancing?","passage_text":"You can burn 105-620 calories dancing for 30 minutes. It depends on how much you weigh, how hard you work, the type of dance, and the number of breaks you take. Below is a general estimate of how many calories you can burn during 30 minutes of various types of dance. Waltz, foxtrot, samba, tango, mambo, chacha, etc.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":2044896,"ranking":10,"query_text":"how many calories do you burn by dancing?","passage_text":"1 50% - How much squats to do to burn 3500? 2  53% - How many squats to burn 100 belly fat? 3  66% - How many calories burned in a set of squats? 4  70% - How many calories are burned doing 15 squats? 54% - If you do squats for 1 min how many calories do you burn? 2  69% - If you weigh 140 lbs how many calories does 1000 squats burn? 3  50% - How much squats to do to burn 3500? 4  53% - How many squats to burn 100 belly fat?","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":4508211,"ranking":11,"query_text":"how many calories do you burn by dancing?","passage_text":"How many calories do I burn climbing 1 story's worth of stairs? How many calories are burned by walking up a flight of stairs? How many calories are burn in stair climbing 150 stairs? How many calories do you burn climbing 125 stairs?","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":5439863,"ranking":12,"query_text":"how many calories do you burn by dancing?","passage_text":"Calories Burned-Water aerobics. Find out how many calories you burn for Water aerobics. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise.Use the calories burned calculator below to see how many calories you burned during your workout. Your Weight in Pounds:alories Burned-Water aerobics. Find out how many calories you burn for Water aerobics. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":114951,"ranking":13,"query_text":"how many calories do you burn by dancing?","passage_text":"Calories Burned-Mowing Lawn: Push, hand. Find out how many calories you burn for Mowing Lawn: Push, hand. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise.Use the calories burned calculator below to see how many calories you burned during your workout.he number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":114953,"ranking":14,"query_text":"how many calories do you burn by dancing?","passage_text":"Find out how many calories you burn for Mowing Lawn: Push, Power. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise.Use the calories burned calculator below to see how many calories you burned during your workout.Your Weight in Pounds:he number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":429347,"ranking":15,"query_text":"how many calories do you burn by dancing?","passage_text":"Find out how many calories you burn for Sit-Ups-vigorous. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout.Your Weight in Pounds:he number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout. Your Weight in Pounds:","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":5192528,"ranking":16,"query_text":"how many calories do you burn by dancing?","passage_text":"Find out how many calories you burn for Moving: carrying boxes. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise.Use the calories burned calculator below to see how many calories you burned during your workout.Your Weight in Pounds:he number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout. Your Weight in Pounds:","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":4642191,"ranking":17,"query_text":"how many calories do you burn by dancing?","passage_text":"Calories Burned - Bowling. Find out how many calories you burn for Bowling. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":7409371,"ranking":18,"query_text":"how many calories do you burn by dancing?","passage_text":"How Many Calories Does Walking & Pulling Golf Cart Burn? How Many Calories Do You Burn Walking 30 Minutes to an Hour? How Many Calories Do You Burn Going to the Driving Range for an Hour? Does Walking or Riding a Bike Burn More Fat? Which Burns More Calories: Walking or Biking?","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":8016829,"ranking":19,"query_text":"how many calories do you burn by dancing?","passage_text":"How many calories do you burn during Kayaking? Calories Burned: 230 calories per hour Enter your information to get an estimate of how many calories you burn.","bm25_label":"high","relevance_label":0.0},{"query_id":276338,"passage_id":3774582,"ranking":20,"query_text":"how many calories do you burn by dancing?","passage_text":"Calories Burned - Bowling. Find out how many calories you burn for Bowling. The number of calories you burn while exercising is dependent on the exercise you do, your weight, and the time spent doing the exercise. Use the calories burned calculator below to see how many calories you burned during your workout. Calculate.","bm25_label":"high","relevance_label":0.0}]