[{"query_id":287912,"passage_id":7887832,"ranking":1,"query_text":"how many lives were lost in the rana plaza","passage_text":"On that day, early in the morning many garment workers walked into the factories of Rana Plaza, their working place. Within an hour everything was shattered. Nobody knows how many workers were running to save his or her lives at the end moment.Workersâ\u0080\u0099 scream echoed on the walls of Rana Plaza. Many of their voices could not reach out passing through the heavy concrete walls. Over a thousand workers lost their lives in the deathtrap.ithin an hour everything was shattered. Nobody knows how many workers were running to save his or her lives at the end moment. Workersâ\u0080\u0099 scream echoed on the walls of Rana Plaza. Many of their voices could not reach out passing through the heavy concrete walls.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887833,"ranking":2,"query_text":"how many lives were lost in the rana plaza","passage_text":"On Wednesday morning, April 24, 2013 at 8:00 a.m., 3,639 workers refused to enter the eight-story Rana Plaza factory building because there were large and dangerous cracks in the factory walls.he death toll at the Rana Plaza building has reached 665 as of Monday morning U.S. Eastern Time while less than 50 percent of the rubble has been removed. Survivor, Morium Begum told us, We demand justice as so many lives have been lost and so many othe.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887834,"ranking":3,"query_text":"how many lives were lost in the rana plaza","passage_text":"Some 3,639 workers toiled in five factories housed in the Rana Plaza building producing clothing for some ## U.S., Canadian and European clothing labels and retailers. Eighty percent of the workers were young women, 18, 19, 20 years of age.he death toll at the Rana Plaza building has reached 665 as of Monday morning U.S. Eastern Time while less than 50 percent of the rubble has been removed. Survivor, Morium Begum told us, We demand justice as so many lives have been lost and so many othe.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887830,"ranking":4,"query_text":"how many lives were lost in the rana plaza","passage_text":"Workers of the Rana Plaza are a part of the 4 million garment workers from Bangladesh; among them 80% are women. They are the cheapest labor in the world and they toil from dawn to dusk for a minimum wage of BDT3000 taka a month (less than 37 $) till 2013.ithin an hour everything was shattered. Nobody knows how many workers were running to save his or her lives at the end moment. Workersâ\u0080\u0099 scream echoed on the walls of Rana Plaza. Many of their voices could not reach out passing through the heavy concrete walls.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887836,"ranking":5,"query_text":"how many lives were lost in the rana plaza","passage_text":"It was a year ago that the Rana Plaza garment factory in the Bangladesh capital, Dhaka, collapsed, taking with it the lives of 1,133 people. 13-year-old survivor and her rescuer meet one year on from the collapse of the garment factory that killed more than 1300. Anna Khatun (R), one of the victims of the Rana Plaza building collapse, is seen with the rescuer Didar Hossain (L) at Dhaka Airport Railway station in Dhaka Photo: FIROZ AHMED.","bm25_label":"high","relevance_label":1.0},{"query_id":287912,"passage_id":7887831,"ranking":6,"query_text":"how many lives were lost in the rana plaza","passage_text":"Languages. Survivors and relatives of the garment workers who died in the Rana Plaza building collapse, and in the fire of Tazreen Fashions factory, take part in a rally in Savar on November 24, 2013.Â© 2013 Reuters.Survivors and relatives of the garment workers who died in the Rana Plaza building collapse, and in the fire of Tazreen Fashions factory, take part in a rally in Savar on November 24, 2013. (Bangkok) â\u0080\u0093 Survivors of the Rana Plaza building collapse one year ago in.anguages. Survivors and relatives of the garment workers who died in the Rana Plaza building collapse, and in the fire of Tazreen Fashions factory, take part in a rally in Savar on November 24, 2013.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887835,"ranking":7,"query_text":"how many lives were lost in the rana plaza","passage_text":"Building collapses in Bangladesh â\u0080\u0093 Sohel Rana, owner of the collapsed Rana Plaza building, wears police-issued body armor and a helmet while being escorted to court in Dhaka on Tuesday, April 30.uilding collapses in Bangladesh â\u0080\u0093 Bangladeshi troops carry the body of a garment worker out of the rubble of the collapsed Rana Plaza building in Savar on April 30.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887828,"ranking":8,"query_text":"how many lives were lost in the rana plaza","passage_text":"When the Rana Plaza factory building collapsed in the Bangladesh capital, Dhaka, last year, more than 1,130 garment workers were killed, crushed under eight stories of concrete. More than 2,500 people were rescued from the building alive, but some suffered terrible injuries.Here are some of their stories.hen the Rana Plaza factory building collapsed in the Bangladesh capital, Dhaka, last year, more than 1,130 garment workers were killed, crushed under eight stories of concrete. More than 2,500 people were rescued from the building alive, but some suffered terrible injuries. Here are some of their stories.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887829,"ranking":9,"query_text":"how many lives were lost in the rana plaza","passage_text":"When the Rana Plaza factory building collapsed in the Bangladesh capital, Dhaka, last year, more than 1,130 garment workers were killed, crushed under eight stories of concrete. More than 2,500 people were rescued from the building alive, but some suffered terrible injuries. Here are some of their stories.hen the Rana Plaza factory building collapsed in the Bangladesh capital, Dhaka, last year, more than 1,130 garment workers were killed, crushed under eight stories of concrete. More than 2,500 people were rescued from the building alive, but some suffered terrible injuries. Here are some of their stories.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":5348371,"ranking":10,"query_text":"how many lives were lost in the rana plaza","passage_text":"How many Americans lost their lives in the Vietnam war?   Sadly, too many ~   58,226 American soldiers also in the war or are missing in action. How many American aircraft were lost in Vietnam War?   Approximately 2,000 fixed wing aircraft were lost; approximately 5,000 rotary-wing aircraft were lost.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":8725986,"ranking":11,"query_text":"how many lives were lost in the rana plaza","passage_text":"Massood Reza, the architect who drew up the plan for Rana Plaza in 2004, said he was asked to design a commercial shopping mall with three or four storeys for a market and then the upper two storeys were for offices. He said: We did not design it for industrial use.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":8725991,"ranking":12,"query_text":"how many lives were lost in the rana plaza","passage_text":"When the Rana Plaza factory building collapsed in the Bangladesh capital, Dhaka, last year, more than 1,130 garment workers were killed, crushed under eight stories of concrete. More than 2,500 people were rescued from the building alive, but some suffered terrible injuries. Here are some of their stories.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":5348374,"ranking":13,"query_text":"how many lives were lost in the rana plaza","passage_text":"How many many more lives were lost in the Vietnam than were lost in the Korean War?   Approximately 20,000 men. Keep in mind that Korea only lasted from 1950 to 1953, approximately the same amount of time that the US fought WWII.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":8725985,"ranking":14,"query_text":"how many lives were lost in the rana plaza","passage_text":"You can do it, but you then have to strengthen the building so it can take the load of industrial machinery, vibration and the movement of a good number of human beings.. The original plan for Rana Plaza, seen by The Daily Telegraph, duly describes the building's purpose as com for commercial, not industrial. Primark has declined to say what it knew about Rana Plaza before the disaster. Bonmarche has insisted that it was unaware of any reason to doubt the building's safety.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":8412950,"ranking":15,"query_text":"how many lives were lost in the rana plaza","passage_text":"His book on the topic is self-recommending.) Critics of sweatshops point to the 1,000+ people killed and 2,500+ people injured by the collapse of the Rana Plaza sweatshop in Bangladesh in 2013. This was indeed grotesque, and evidence of the poor conditions that many sweatshop workers have to work in. But what is their next-best alternative?","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7887837,"ranking":16,"query_text":"how many lives were lost in the rana plaza","passage_text":"Courrieres, France (1906): Dust explosion at Courrieres mine in Pas-de-Calais department kills almost 1,100 people. Savar, Bangladesh (2013): Eight-storey Rana Plaza, housing garment factories, collapses in suburb of Dhaka, killing more than 1,000 people.ourrieres, France (1906): Dust explosion at Courrieres mine in Pas-de-Calais department kills almost 1,100 people. Savar, Bangladesh (2013): Eight-storey Rana Plaza, housing garment factories, collapses in suburb of Dhaka, killing more than 1,000 people.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":1781254,"ranking":17,"query_text":"how many lives were lost in the rana plaza","passage_text":"Bangladesh's official wage board has approved a 77% rise in pay for the region's garment workers from December after the world's second largest clothing exporter was crippled by strikes and the Rana Plaza disaster.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":6294187,"ranking":18,"query_text":"how many lives were lost in the rana plaza","passage_text":"In 2010, Bangladesh increased the minimum wage for garment workers by 80 percent following worker protests, the Associated Press reported. Current per capita income in the country is just $1,940 per year.he collapse of Rana Plaza last month has brought new attention to the lives of garment workers in Bangladesh, who make a minimum wage of $38 a month and often face substandard workplace safety.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":7524288,"ranking":19,"query_text":"how many lives were lost in the rana plaza","passage_text":"(Photo: Reuters). Bangladesh's official wage board has approved a 77% rise in pay for the region's garment workers from December after the world's second largest clothing exporter was crippled by strikes and the Rana Plaza disaster.","bm25_label":"high","relevance_label":0.0},{"query_id":287912,"passage_id":1553171,"ranking":20,"query_text":"how many lives were lost in the rana plaza","passage_text":"The Plaza has provided the location for other motion pictures such as Plaza Suite, The Way We Were, The Great Gatsby, Barefoot in the Park, Funny Girl, Cotton Club, Crocodile Dundee I and II and Home Alone II: Lost In New-York.","bm25_label":"high","relevance_label":0.0}]