[{"query_id":303777,"passage_id":1807942,"ranking":1,"query_text":"how much coffee is safe per day pregnancy","passage_text":"But after decades of controversy and conflicting evidence, there's still no consensus on how much caffeine is safe during pregnancy. To err on the side of caution, the March of Dimes advises women to limit their caffeine intake to less than 200 milligrams per day, which is about one 12-ounce cup of coffee.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":3110787,"ranking":2,"query_text":"how much coffee is safe per day pregnancy","passage_text":"There's general agreement that pregnant women and those trying to conceive should avoid consuming large quantities of caffeine. But after decades of controversy and conflicting evidence, there's still no consensus on how much caffeine is safe during pregnancy. To err on the side of caution, the March of Dimes advises women to limit their caffeine intake to less than 200 milligrams per day, which is about one 12-ounce cup of coffee.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":5428930,"ranking":3,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Recommendations for pregnancy. In view of current knowledge, small amounts of caffeine are considered safe in pregnancy. The. recommended limit in Australia is a maximum of 200mg caffeine per day. This would be. equivalent to 1 cup of strong espresso style coffee, 3 cups of instant coffee, 4 cups of medium.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":7335967,"ranking":4,"query_text":"how much coffee is safe per day pregnancy","passage_text":"But the March of Dimes, among other experts, suggests that it is safe to drink one or two cups of caffeinated coffee a day during pregnancy, whereas consuming too much herbal tea (and three or more cups of coffee a day) can be risky and may result in a miscarriage.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":2720893,"ranking":5,"query_text":"how much coffee is safe per day pregnancy","passage_text":"How Much Caffeine Is Safe? It seems that experts who study caffeine agree that consuming up to 300 milligrams of caffeine per day is safe -- for adults anyway. That's roughly the amount of caffeine you would get from three cups (not mugs or big paper cups) of coffee.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":2596125,"ranking":6,"query_text":"how much coffee is safe per day pregnancy","passage_text":"The problem with coffee in pregnancy is not the coffee itself it is the caffeine content. Most doctors recommend that pregnant women limit themselves to 200mg of caffeine per day.The problem with this, though, is that how do you tell how much caffeine is in a cup of coffee?here are many different coffee substitute drinks that you can use during your pregnancy if you are not interested in drinking straight decaffeinated coffee. The one drink substitute you should look into is herbal coffee.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":647600,"ranking":7,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Caffeine is classified by the Food and Drug Administration as  generally recognized as safe  (GRAS). Toxic doses, over 10 grams per day for an adult, are much higher than typical dose of under 500 milligrams per day.A cup of coffee contains 80â\u0080\u0093175 mg of caffeine, depending on what bean (seed) is used and how it is prepared (e.g. drip, percolation, or espresso).oxic doses, over 10 grams per day for an adult, are much higher than typical dose of under 500 milligrams per day. A cup of coffee contains 80â\u0080\u0093175 mg of caffeine, depending on what bean (seed) is used and how it is prepared (e.g. drip, percolation, or espresso).","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":7372760,"ranking":8,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Is it safe to drink coffee during pregnancy? Yes, but hold the refills. The American College of Obstetricians and Gynecologists recommends limiting your caffeine consumption to fewer than 200 milligrams (mg) per day. That's about what you'd get from drinking one 10-ounce cup of Starbucks coffee.","bm25_label":"high","relevance_label":1.0},{"query_id":303777,"passage_id":5045795,"ranking":9,"query_text":"how much coffee is safe per day pregnancy","passage_text":"How much coffee does the average person drink? Coffee Cup Consumption Per Day: Men drink as much coffee as women; each consuming an average of 1.6 cups per day. Women seem to be more concerned about the price than men. Among coffee drinkers, the average consumption in the United States is 3.2 cups of coffee per day. The average coffee cup size is 9 ounces.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":5375020,"ranking":10,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Now that I'm pregnant, do I have to stop drinking coffee and avoid other sources of caffeine? If you're pregnant, it's a good idea to limit your intake of caffeine. But how much is okay? After decades of discussion and conflicting studies, there's still no clear answer on how much caffeine is safe during pregnancy.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":3615290,"ranking":11,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Caffeine is classified by the Food and Drug Administration as  generally recognized as safe  (GRAS). Toxic doses, over 10 grams per day for an adult, are much higher than typical dose of under 500 milligrams per day. A cup of coffee contains 80â\u0080\u0093175 mg of caffeine, depending on what bean (seed) is used and how it is prepared (e.g. drip, percolation, or espresso).","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":6483233,"ranking":12,"query_text":"how much coffee is safe per day pregnancy","passage_text":"So how much coffee is healthy, and how much is too much? Two to three eight-ounce cups per day is considered moderate; heavy coffee drinkers consume four cups or more daily. Remember, the amount of caffeine per coffee beverage varies depending upon the preparation and style of beverage.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":7619974,"ranking":13,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Best Answer: YOu can drink caffeinated coffee when you're pregnant. You can safely have up to 300 mg. of caffeine per day when you're pregnant. this is the equivalent of 6 or 7 colas, or 2 or 3 cups of coffee. Unless the pregnancy is high risk this doesn't harm the fetus at all.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":4079196,"ranking":14,"query_text":"how much coffee is safe per day pregnancy","passage_text":"They tout that they are as safe as coffee, but maybe not. They have a lot more caffeine than an 8-ounce cup of coffee.. That 8-ounce cup of coffee has about 100 milligrams of caffeine, although coffees and teas vary widely in their caffeine content depending on how they are brewed. For example, CR finds that 8 ounces of Starbucks coffee has 165 milligrams of caffeine. CR says safe limits of caffeine are up to 400 milligrams per day for healthy adults, 200 milligrams a day for pregnant women, and up to 45-85 milligrams per day for children, depending on weight.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":5780457,"ranking":15,"query_text":"how much coffee is safe per day pregnancy","passage_text":"So how much coffee is healthy, and how much is too much? Two to three eight-ounce cups per day is considered moderate; heavy coffee drinkers consume four cups or more daily. Remember, the amount of caffeine per coffee beverage varies depending upon the preparation and style of beverage. Eight ounces of brewed coffee may contain as little as 80 to as much as 200 mg of caffeine per cup (an â\u0080\u009caverageâ\u0080\u009d cup probably contains about 100 mg).","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":6633813,"ranking":16,"query_text":"how much coffee is safe per day pregnancy","passage_text":"So, how do you know how much coffee to give them? Well, just keep it flowing all day, right? WRONG! At $100 per gallon, youâ\u0080\u0099ve got to get strategic when it comes to coffee! Yes, at many venues a gallon of coffee can cost as much as $100 (makes $4 per gallon gas seem like a great deal, right?).","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":333034,"ranking":17,"query_text":"how much coffee is safe per day pregnancy","passage_text":"How much is too much? Up to 400 milligrams (mg) of caffeine a day appears to be safe for most healthy adults. That's roughly the amount of caffeine in four cups of brewed coffee, 10 cans of cola or two energy shot drinks. Although caffeine use may be safe for adults, it's not a good idea for children.","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":3021671,"ranking":18,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Vivarin provides mental energy that helps you power your day. Itâ\u0080\u0099s safe, has about as much caffeine as a cup of coffee â\u0080\u0093 but costs. less than a quarter per tablet. So if youâ\u0080\u0099re tired of coffee and those. strange ingredients in expensive energy drinks, revive with Vivarin!","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":3063530,"ranking":19,"query_text":"how much coffee is safe per day pregnancy","passage_text":"Thread: safe to drink tea in early pregnancy?!?! safe to drink tea in early pregnancy?!?! i'm currently 5wks pregnant after having a mc @6wks in august,and i read in the paper today that in early pregnancy you are only allowed 3 mugs of tea(or 2 mugs of coffee) a day as anymore than this may cause early miscarriage!","bm25_label":"high","relevance_label":0.0},{"query_id":303777,"passage_id":276803,"ranking":20,"query_text":"how much coffee is safe per day pregnancy","passage_text":"They have a lot more caffeine than an 8-ounce cup of coffee.. That 8-ounce cup of coffee has about 100 milligrams of caffeine, although coffees and teas vary widely in their caffeine content depending on how they are brewed. For example, CR finds that 8 ounces of Starbucks coffee has 165 milligrams of caffeine. CR says safe limits of caffeine are up to 400 milligrams per day for healthy adults, 200 milligrams a day for pregnant women, and up to 45-85 milligrams per day for children, depending on weight.","bm25_label":"high","relevance_label":0.0}]