[{"query_id":306806,"passage_id":7982362,"ranking":1,"query_text":"how much do phlebotomist make starting out","passage_text":"How Much Is a Phlebotomist's starting Salary? | EHow UK Most phlebotomists do not make a lot of money, especially when just starting out. â\u0080¦ most phlebotomists in the U.S. make between Â£6.80 and Â£8.70 per hour, â\u0080¦ How much money does a phlebotomist make?","bm25_label":"high","relevance_label":1.0},{"query_id":306806,"passage_id":1407911,"ranking":2,"query_text":"how much do phlebotomist make starting out","passage_text":"Want to find out how do much do phlebotomists make? At Hospital Jobs Inc, we provide the national phlebotomist salary by state. Learn about what a phlebotomist does and more!","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":7982360,"ranking":3,"query_text":"how much do phlebotomist make starting out","passage_text":"How Much Does a Phlebotomist Make How much does a phlebotomist make? Depends on the Experience While starting wages for phlebotomists might be low, â\u0080¦ your hourly wage calculation is effective out between $ 16 in order to $ 17 per hour. you have need more information click here.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":1446730,"ranking":4,"query_text":"how much do phlebotomist make starting out","passage_text":"The average salary of any phlebotomist depends upon several factors which include basic qualification, work experience, certifications, and work location. Let us find out how much do phlebotomist make on a yearly basis in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":4115517,"ranking":5,"query_text":"how much do phlebotomist make starting out","passage_text":"how Much Do CNA (certified Nurse Assistants) make In North â\u0080¦ How much do CNA (certified nurse assistants) make in North Carolina (Chapel Hill\/Durham\/Raleigh) â\u0080¦ How much does a CNA (Certified Nursing Assistant) make an hour in Abingdon,Virginia? More questions. Does a certified nursing assistant â\u0080¦ How Much does a Phlebotomist make An Hour In North Carolina â\u0080¦ How much does a Phlebotomist make an hour in North Carolina? I am certified Phlebotomist with less than a year experience.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":8821391,"ranking":6,"query_text":"how much do phlebotomist make starting out","passage_text":"Interested in learning about Phlebotomists and the Phlebotomy occupational field? Phlebotomists are valuable healthcare team members who draw blood for tests, transfusions, donations, or research. You may have questions such as: What tasks do phlebotomists do? How much do phlebotomists make? What skills do they need? How long is their education?","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":7516686,"ranking":7,"query_text":"how much do phlebotomist make starting out","passage_text":"How Much Do Phlebotomist Make On Long Island New York Phlebotomist Salaries | Salary.com â\u0080¦ bonuses, stats, job descriptions and open positions for Phlebotomist in New York.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":6541037,"ranking":8,"query_text":"how much do phlebotomist make starting out","passage_text":"Average phlebotomist salary. Find out how much you can earn as a phlebotomist and other FAQs. How To Become A Phlebotomist. â\u0080¦ According to the US Bureau of Labor, the national average rate of pay for a phlebotomist in 2008 was $12.50 per hour.verage phlebotomist salary. Find out how much you can earn as a phlebotomist and other FAQs. How To Become A Phlebotomist. â\u0080¦ According to the US Bureau of Labor, the national average rate of pay for a phlebotomist in 2008 was $12.50 per hour.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":1446727,"ranking":9,"query_text":"how much do phlebotomist make starting out","passage_text":"How Much Do Phlebotomists Make A Year? According to the latest 2013 survey data provided by Salary.com website, it is seen that the average pay scale of a phlebotomist in the United States is about $30,130. It can be considered as a median expected salary for typical phlebotomists in the US.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":2969450,"ranking":10,"query_text":"how much do phlebotomist make starting out","passage_text":"We need to take into account these factors while finding out how much do phlebotomists make every year. There is a difference between medical laboratory technician and a phlebotomist. A phlebotomist is also known as phlebotomy technician. If we calculate median hourly salary for such professionals then it can go up to $20.56 per hour. The lowest range can go up to $13.50 per hour while the highest hourly salary can reach up to $25.00 per hour.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":1204442,"ranking":11,"query_text":"how much do phlebotomist make starting out","passage_text":"How much money do entry-level phlebotomists make? In 2012, the median pay of phlebotomists was about $29,700 a year, or roughly 14 dollars per hour, and about $21,400 for the lowest 10 percent. This is according to the U.S. Bureau of Labor Statistics.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":5503610,"ranking":12,"query_text":"how much do phlebotomist make starting out","passage_text":"How Much Do Phlebotomists Make An Hour In Florida. By CanThai | July 6, â\u0080\u009cAbout how much money do most middle-class American parents spend on birthday gifts for their children? Phlebotomy Average Salary Ct; How Much Does A Phlebotomy Make In Va; Who Can Practice Phlebotomy; â\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":933594,"ranking":13,"query_text":"how much do phlebotomist make starting out","passage_text":"How much does a phlebotomist make? According to the U.S. Bureau of Labor Statistics, Phlebotomists can earn an average of $29,730 a year in the United States.ow much does a phlebotomist make? According to the U.S. Bureau of Labor Statistics, Phlebotomists can earn an average of $29,730 a year in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":7785000,"ranking":14,"query_text":"how much do phlebotomist make starting out","passage_text":"Phlebotomist Average Salary. How much does a phlebotomist make? Phlebotomists made a mean average annual salary of $33,750 in 2016 per data from the Bureau of Labor Statistics (BLS). If we divide this annual salary by 2,080 working hours, the average mean hourly rate comes out to $16.22 per hour.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":1204439,"ranking":15,"query_text":"how much do phlebotomist make starting out","passage_text":"How much does a Phlebotomist make in Seattle?The average Phlebotomist salary is $27,940. In Seattle, a Phlebotomist can make $37,271, which is 33.4% higher than the national median. Filter by location to see Phlebotomist salaries in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":1407906,"ranking":16,"query_text":"how much do phlebotomist make starting out","passage_text":"How much does a Phlebotomist make in Seattle?The average Phlebotomist salary is $27,940. In Seattle, a Phlebotomist can make $33,301, which is 19.2% higher than the national median. Filter by location to see Phlebotomist salaries in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":1407910,"ranking":17,"query_text":"how much do phlebotomist make starting out","passage_text":"{ seoText: <b>How much does a Phlebotomist make in Seattle?<\/b>The average Phlebotomist salary is $27,940. In Seattle, a Phlebotomist can make $33,301, which is 19.2% higher than the national median.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":8522918,"ranking":18,"query_text":"how much do phlebotomist make starting out","passage_text":"A starting pay is often going to be much different and can be as much as 25% less than a phlebotomist with 30% more experience. The average hourly wage in the United States for phlebotomists is $14.29. The average annual wage in the US is $30,900.That wage average is based on the 100,000 phlebotomists that work in the United States. The top 25% of phlebotomists make an average of $17.27 per hour.The top 25% make about $35,900 per year. The top 10% of phlebotomists earn $20.48 per hour and about $42,600 per year. starting pay is often going to be much different and can be as much as 25% less than a phlebotomist with 30% more experience. The average hourly wage in the United States for phlebotomists is $14.29. The average annual wage in the US is $30,900.","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":921267,"ranking":19,"query_text":"how much do phlebotomist make starting out","passage_text":"I wanna be a phlebotomist how long does it take? I live in florida, but i live 20 mins from alabama and the college there is offering phlebotomy classes,and im really interested . The councelor said it would be 2 semesters so,about how many months would that be for college? Also how much do phlebotomists make in florida?","bm25_label":"high","relevance_label":0.0},{"query_id":306806,"passage_id":7982363,"ranking":20,"query_text":"how much do phlebotomist make starting out","passage_text":"Phlebotomy Salary: How Much Does a Phlebotomist Make. A phlebotomy technician is one important member of a medical team. Phlebotomists are in charge of drawing blood for tests, donations, research and transfusions. They are also trained to help patients recover if they suffer from adverse reactions to the process. To learn how how much does a phlebotomist make, read on. We have a salary pool! See what other phlebotomists are saying about their income: What is your salary? Phlebotomy Salary per Hour. According to the U.S. Bureau of Labor Statistics, the average hourly wage was $15.10 in 2013. That mean annual wage was $31,410 for the same year. If youâ\u0080\u0099re starting your career, you can expect between $10.46 and $12.27 hourly and $21,760 and $25,510 annually.","bm25_label":"high","relevance_label":0.0}]