[{"query_id":30860,"passage_id":7402572,"ranking":1,"query_text":"average amount of money stna make","passage_text":"A new STNA can start at little as 8.50 an hour, but the normal is from 10-12.50. An STNA can make up to 14 an hour depending on shift differential and experience. When you get into home private care that's where the money is higher. A new STNA can start at little as 8.50 an hour, but the normal is from 10-12.50. An STNA can make up to 14 an hour depending on shift differential and experience. When you get into home private care that's where the money is higher. An STNA can make up to 14 an hour depending on shift differential and experience.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":8020298,"ranking":2,"query_text":"average amount of money stna make","passage_text":"An STNA can make up to 14 an hour depending on shift differential and experience. When you get into home private care that's where the money is higher. A new STNA can start at â\u0080¦ little as 8.50 an hour, but the normal is from 10-12.50. 12 people found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":7402571,"ranking":3,"query_text":"average amount of money stna make","passage_text":"Their most recent figures that are available are from May of 2013. According to the BLS data, the average salary of an STNA is $24,700. Or if you would prefer to the know the average hourly wage, it is $11.87. As with any job, the amount you make will vary based on your expericence, your location, and your employer. The BLS also provides salary ranges. The bottom 10% of State Tested Nursing Assistants in Ohio make $9.07 per hour while the top 10% make $15.35 per hour.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":7402569,"ranking":4,"query_text":"average amount of money stna make","passage_text":"According to the BLS data, the average salary of an STNA is $24,700. Or if you would prefer to the know the average hourly wage, it is $11.87. Of course these salary figures are just averages, and when you are just starting out you may make less than this.","bm25_label":"high","relevance_label":1.0},{"query_id":30860,"passage_id":3175017,"ranking":5,"query_text":"average amount of money stna make","passage_text":"Much of an STNA's work day revolves around basic personal care, or bath and bedpan duty. The STNA helps patients make use of the restroom or bedpan and provides bathing assistance or sponge baths as needed.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":7569902,"ranking":6,"query_text":"average amount of money stna make","passage_text":"The average amount of money that the average game designer makes is somewhere between $60,000 and $70,000 a year.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":3074653,"ranking":7,"query_text":"average amount of money stna make","passage_text":"How much money does a Teachers assistant make? The average amount of money that a teacher's assistant makes per year is about $25,000. Highest earners make about $36,000 while the lowest get $17,000 per year.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":1292692,"ranking":8,"query_text":"average amount of money stna make","passage_text":"However, there are a lot of opportunities overseas. I know a good amount of average basketball players making great money in Europe. My advice is go to Europe. Make around a $100,000 a year for ten years and then retire and come back with a substantial amount of money heading into life after basketball.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":4608243,"ranking":9,"query_text":"average amount of money stna make","passage_text":"Ohio STNA Skills Test - Question. This is a very specific question regarding the Ohio STNA Skills Test. Of the 24 skills that STNA's must learn, there are only a handful that specifically state to WEAR GLOVES at some point during the procedure. What I need to know is this: we learned to wash our hands first, then to put on the gloves.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":3175011,"ranking":10,"query_text":"average amount of money stna make","passage_text":"Throughout the health care industry, support staff help meet patients' needs for basic bedside care. These include orderlies and attendants, as well as certified nursing assistants, or CNAs. In Ohio, these nursing assistants are known as State Trained Nurses Aides, or STNAs. In other states CNAs can work in hospitals and clinics, but Ohio's STNAs are limited to employment in nursing homes and other long-term care facilities. The STNA Role STNAs, like orderlies and attendants, aren't licensed care providers in their own right.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":598643,"ranking":11,"query_text":"average amount of money stna make","passage_text":"Making the world better, one answer at a time. If a teenager from 15-17 works part-time over the summer, the average amount of money made in those 3 months is $1,000. If a teenager from 15-17 works part-time over the summer, the average amount of money made in those 3 months is $1,000.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":3175009,"ranking":12,"query_text":"average amount of money stna make","passage_text":"The STNA Role. STNAs, like orderlies and attendants, aren't licensed care providers in their own right. Instead, they provide care under the direction or supervision of a registered nurse or physician.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":5832906,"ranking":13,"query_text":"average amount of money stna make","passage_text":"How much money does an entrepreneur make in a year? As of 2013, the average money an entrepreneur make in a year is $68,000, as stated by Fox Business. Typically, the amount will vary from one person to another due to the different types of businesses that people start.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":3074652,"ranking":14,"query_text":"average amount of money stna make","passage_text":"The average amount of money that a teacher's assistant makes per  year is about $25,000. Highest earners make about $36,000 while the  lowest get $17,000 per year.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":5817347,"ranking":15,"query_text":"average amount of money stna make","passage_text":"The difference in salary is due to a smaller amount of optometrists who are making more money, which increases the average salary, so it is not safe to assume that an optometristâ\u0080\u0099s salary in a larger city will be more than a smaller one.he difference in salary is due to a smaller amount of optometrists who are making more money, which increases the average salary, so it is not safe to assume that an optometristâ\u0080\u0099s salary in a larger city will be more than a smaller one.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":5338592,"ranking":16,"query_text":"average amount of money stna make","passage_text":"The average amount of money that a professional basketball player  makes in Denmark is about $5 million. The amount will vary  depending on the experience and teams played f â\u0080¦ or. Answered. In Salary and Pay Rates.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":6333747,"ranking":17,"query_text":"average amount of money stna make","passage_text":"For example, in a profession in which 10 people are employed, and nine make $10,000 per year and the last makes $100,000 per year, the average salary for the profession would be said to $19,000. Yet, given the current distribution of salaries, a person entering the profession would be likely to make only half that.ound This Helpful. The term average salary refers to the amount of money that person in a particular profession makes. This is meant to provide a general idea of the amount of money that a person entering that profession is likely to make. A similar term used for the same purpose is median salary.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":6553141,"ranking":18,"query_text":"average amount of money stna make","passage_text":"The amount of money that aerospace engineers make may vary  depending on their experience and the company they work for. On  average, they will earn about $85,000 per year.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":7427434,"ranking":19,"query_text":"average amount of money stna make","passage_text":"In many other states the certification is known as Certified Nursing Assistant, or CNA. The first step to get your certification is to attend STNA classes. These STNA classes are required to include at least 59 hours of classroom training and 16 hours of clinical training. Once you have completed your course, you will then be ready to take your test. There are two sections of the Ohio STNA test.","bm25_label":"high","relevance_label":0.0},{"query_id":30860,"passage_id":2317275,"ranking":20,"query_text":"average amount of money stna make","passage_text":"According to the Bureau of Labor Statistics, head chefs made an average annual salary of $44,780 in 2010. Bakers, on the other hand, made an average annual salary of around $25,350 in that same year.Research suggests that pastry chefs can expect to make annual salaries between the average amounts of these two professions.More experienced chefs, obviously, will be able to make slightly more money, as will chefs located in more densely populated areas.esearch suggests that pastry chefs can expect to make annual salaries between the average amounts of these two professions. More experienced chefs, obviously, will be able to make slightly more money, as will chefs located in more densely populated areas.","bm25_label":"high","relevance_label":0.0}]