[{"query_id":311540,"passage_id":7967212,"ranking":1,"query_text":"how much does a spectacled bear weigh","passage_text":"Male spectacled bears are much larger than female spectacled bears, giving local farmers the impression that they live with more than one species of bear. Male bears weigh from 120 to 340 pounds 54 to 154 kg); females weigh 60 to 180 pounds (27 to 82 kg). At birth, cubs weigh from 10 to 11 ounces (284 to 312 grams).","bm25_label":"high","relevance_label":1.0},{"query_id":311540,"passage_id":5047774,"ranking":2,"query_text":"how much does a spectacled bear weigh","passage_text":"Spectacled Bear Description. Spectacled Bears are generally smaller bears of the Ursidae family. Males are significantly larger than females (33% larger) and grow over 5 feet (1.5 metres) in length and weigh up to 340 pounds (154 kilograms). Females rarely weigh more than 180 pounds (82 kilograms).","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":5290235,"ranking":3,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does a full grown grizzly weight? kgb answers Â» Science & Technology Â» Animals Â» How much does a full grown grizzly weight? The grizzly tops out at around 900 pounds, but some other races of the brown bear, like the kodiak, can weigh up to 1500 pounds or more. Tags: kodiak, brown bear, race and ethnicity in the united states census, grizzly.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":5846552,"ranking":4,"query_text":"how much does a spectacled bear weigh","passage_text":"The panda's closest relative is the spectacled bear of South America. Physical Characteristics. Pandas are about the size of the American black bear. An adult panda is typically 1.5 meters long (4 - 5 feet) and weighs about 75 to 135 kilograms (165 to 353 pounds).Males are 10% to 20% heavier than females. Pandas live between 18 to 25 years in the wild.he panda's closest relative is the spectacled bear of South America. Physical Characteristics. Pandas are about the size of the American black bear. An adult panda is typically 1.5 meters long (4 - 5 feet) and weighs about 75 to 135 kilograms (165 to 353 pounds).","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":6240184,"ranking":5,"query_text":"how much does a spectacled bear weigh","passage_text":"533 Post(s). How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh? Re: How much does a 4x8 of mdf weigh?Originally Posted by THUMPPER 88 pounds per sheet for the 3\/4 Premium Rangerboard x2, I am getting older and it seemed heavier this time around.riginally Posted by THUMPPER 88 pounds per sheet for the 3\/4 Premium Rangerboard x2, I am getting older and it seemed heavier this time around.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":3255853,"ranking":6,"query_text":"how much does a spectacled bear weigh","passage_text":"How much force does it take to cut someone's arm, hand, or head off with a sword (that weighs 3.5 to 5 lbs)? How much does an adult human kidney weigh? How much does the glycogen in your body weigh? A body weighs 150 N in the air and was found to weigh 100N in the water when fully submerged.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":4086943,"ranking":7,"query_text":"how much does a spectacled bear weigh","passage_text":"New How Much Does Chevy Colorado 2015 Weigh Release, Reviews and. How much does your wrangler weigh? - jeepforum.com, I'm just curious on how much of a difference models (yj, tj, jk), bumpers, tops, tires, wheels, engines, and any other options can make on weight.. How much does f150 weigh empty? - ford-trucks.com, How much does f150 weigh empty? 1987 - 1996 f150 & larger f-series trucks.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":1283449,"ranking":8,"query_text":"how much does a spectacled bear weigh","passage_text":"SIZE: There are few measurements available for this bear. Adult spectacled bears can weigh between 140 and 385 pounds (63-173 kg). However, the body length of adults is about 150 to 180 centimeters (60 to 72 inches) and males may be 30 to 40 percent larger than females.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":8476847,"ranking":9,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does a pumpkin seed weigh? How much does a pumpkin seed weigh? Thank you for your help.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":2607374,"ranking":10,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does the toro 3180 snowblower weigh, We purchased. How much does the toro 3180 snowblower weigh, We purchased it in 1990 and it is small and listed for small jobs.Submitted: 4 years ago.ow much does the toro 3180 snowblower weigh, We purchased. How much does the toro 3180 snowblower weigh, We purchased it in 1990 and it is small and listed for small jobs.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":5660314,"ranking":11,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does 6 xbox 360 games\/cases weigh? How much does an xbox 360 elite weigh (in the box)? How much does an xbox 360 weigh? im going to fedex one? I am considering purchasing an Xbox 360, or a Playstation 3...","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":4634491,"ranking":12,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does a full grown grizzly weight? The KGB Agent answer: The grizzly tops out at around 900 pounds, but some other races of the brown bear, like the kodiak, can weigh up to 1500 pounds or more. Tags: kodiak, brown bear, race and ethnicity in the united states census, grizzly. Saturday, February 04 2012.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":7967217,"ranking":13,"query_text":"how much does a spectacled bear weigh","passage_text":"Spectacled Bears are relatively small species, compared to other species of bear. Adult males can range in weigh from 220 to 440 pounds, while females from 77 to 181 pound. Length can range from 120 to 200 cm. The males are larger than the females for about one third.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":3475156,"ranking":14,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does the average Katana or Samurai Sword weigh? Just wondering.... Source(s): average katana samurai sword weigh: https:\/\/trimurl.im\/e14\/how-much-does-the-average-katana-or-samurai-sword-weigh","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":1566595,"ranking":15,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does a 5.9 cummins complete motor weigh? and how much does a chevy 350 comlete motor weigh? comparing weight difference for cummins\/chevy conversion. Follow","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":1283446,"ranking":16,"query_text":"how much does a spectacled bear weigh","passage_text":"Spectacled Bear Distribution. Spectacled bears are the only species of bears that live in South America. They have been identified around Venezuela, Columbia, Ecuador, Bolivia and Peru.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":7967210,"ranking":17,"query_text":"how much does a spectacled bear weigh","passage_text":"Spectacled bear. The spectacled bear (Tremarctos ornatus), also known as the Andean bear or Andean short-faced bear and locally as jukumari (Aymara), ukumari (Quechua) or ukuku, is the last remaining short-faced bear (subfamily Tremarctinae).","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":2961867,"ranking":18,"query_text":"how much does a spectacled bear weigh","passage_text":"Thread: How much does an awning weigh? How much does an awning weigh? Just wanting to get a ball park figure on how much 2*2.5m awnings weigh? I'm going to see if I can get some brackets made up to allow mounting to the roof rails with no roof racks.","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":5465170,"ranking":19,"query_text":"how much does a spectacled bear weigh","passage_text":"Related QuestionsMore Answers Below. How much does a 5 gallon bottle of bottled water weigh? How much does a gallon of fresh water weigh? If the weight of gold is almost 20, and the weight of a 5 gallon bucket of water is 40 pounds, how much would a 5 gallon bucket of gold weigh?...","bm25_label":"high","relevance_label":0.0},{"query_id":311540,"passage_id":6350501,"ranking":20,"query_text":"how much does a spectacled bear weigh","passage_text":"How much does a gallon of blood weigh? kgb answers Â» Science & Technology Â» Math, Chemistry, Physics Â» How much does a gallon of blood weigh? Not Medical Advice: A gallon of blood may weigh around 8.85 lbs.","bm25_label":"high","relevance_label":0.0}]