[{"query_id":32176,"passage_id":7590074,"ranking":1,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Your consent is not required to use our service. Choose from over 14 Assisted Living communities in Syracuse, NY and see 62 reviews with a 4.1 average rating. We've helped 2,805 families in Syracuse, NY where Assisted Living ranges from $2000.00 to $5600.00. With so many options for senior assisted living in Syracuse in , NY, how do you know which community is right for you?","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":7590069,"ranking":2,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Our compassionate advisors can help you find the best Syracuse assisted living facilities for your unique needs and budget. The official website for the city of Syracuse is http:\/\/www.syracuse.ny.us\/. Assisted Living Costs in Nearby Cities. * The costs above represent the AVERAGE monthly cost of assisted living for a one person bedroom in that city.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":7590073,"ranking":3,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Assisted Living Costs in Syracuse, NY. Cost for a single bedroom in Syracuse runs between $2,850 to $4,555 a month. Availability is almost guaranteed but you can request information online by filling out the form to the right or call us at (866) 355-7043 for a no-cost, in-depth assessment of your senior care needs.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":7590071,"ranking":4,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Assisted Living in Syracuse, NY. Cost for a single bedroom in Syracuse runs between $2,850 to $4,555 a month. Availability is almost guaranteed but you can request information online by filling out the form to the right or call us at (866) 355-7043 for a no-cost, in-depth assessment of your senior care needs.","bm25_label":"high","relevance_label":1.0},{"query_id":32176,"passage_id":7455453,"ranking":5,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Share with fellow travellers any question or tips about the route from Rochester, NY to Syracuse, NY: Gas Consumption and Emissions A car with an MPG of will need 4.02 gallons of gas to cover the route between Rochester, NY and Syracuse, NY. The estimated cost of gas to go from Rochester to Syracuse is $10.50. During the route, an average car will release 78.79 pounds of CO 2 to the atmosphere.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":8537849,"ranking":6,"query_text":"average cost for assisted living in syracuse ny","passage_text":"driving time from Syracuse, NY to Niagara Falls, Canada; cost of driving from Syracuse, NY to Niagara Falls, Canada; reverse drive distance from Niagara Falls, Canada to Syracuse, NY; halfway between Syracuse, NY and Niagara Falls, Canada; hotels near Niagara Falls, Canada; flight distance from Syracuse, NY to Niagara Falls, Canada","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":4255172,"ranking":7,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Gas consumption and emissions. A car with an average. will need gallons of gas to cover the route between Rochester, NY and Syracuse, NY. The estimated cost of gas to go from Rochester to Syracuse is. During the route, an average car will release pounds of CO2 to the atmosphere. Your carbon footprint is pounds of CO 2 per mile. Note: US market averages used for calculations: 22.75 MPG and $2.33 per gallon of regular gas.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":6144090,"ranking":8,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Print Email. Comments. Syracuse, NY â\u0080\u0093 For the first time since being named Syracuse University head football coach 10 days ago, Scott Shafer was able to show off most of his new assistants this morning.rint Email. Comments. Syracuse, NY â\u0080\u0093 For the first time since being named Syracuse University head football coach 10 days ago, Scott Shafer was able to show off most of his new assistants this morning.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":7590072,"ranking":9,"query_text":"average cost for assisted living in syracuse ny","passage_text":"We've found at least 14 Assisted Living Facilities within 60 miles of Syracuse, NY that meet your criteria () We offer a home like setting and cheerful smiles from our professional staff who greet you everyday.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":8268042,"ranking":10,"query_text":"average cost for assisted living in syracuse ny","passage_text":"How much does a Finance Manager make in Syracuse, NY?The average salary for a Finance Manager in Syracuse, NY is $85,120. That is 18.8% lower than the national median salary of $104,878.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":6320717,"ranking":11,"query_text":"average cost for assisted living in syracuse ny","passage_text":"The Syracuse, NY air quality index is a median value which considers the most hazardous air pollutants. The Syracuse, NY air quality index is 25.2% less than the New York average and 35.6% less than the national average.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":101345,"ranking":12,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Distance, Gas Consumption and Emission Notes. Distance from Geneva, NY to Syracuse, NY is 55Miles or 88 Km. You can get this distance about 56 mins. If you want to planning travel with plane for 45 Miles or 72 Km, You can get this distance about 35 mins . A car with an average MPG will needs 2.55 gallons of gas to get the route between these points. The estimated cost of gas to get between Geneva, NY and Syracuse, NY is $5.79. During the route, an average car will release 49.96 pounds of CO2 to the atmosphere. Your carbon footprint is 0.91 pounds of CO2 per mile.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":1093549,"ranking":13,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Local weather report for Syracuse, NY, Local Syracuse, NY weather. Forecast for Syracuse, New York, Syracuse, NY weather forecast. Find your local Syracuse weather forecast. Syracuse, NY weather conditions. Weather outlook for Syracuse, NY. Weather report for Syracuse, NY.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":6815324,"ranking":14,"query_text":"average cost for assisted living in syracuse ny","passage_text":"You can also calculate the cost to drive from Syracuse, NY to Buffalo, NY based on current local gas prices and an estimate of your car's best gas mileage. If you're meeting a friend, you might be interested in finding the city that is halfway between Syracuse, NY and Buffalo, NY.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":5717845,"ranking":15,"query_text":"average cost for assisted living in syracuse ny","passage_text":"The total driving time is 2 hours, 10 minutes. Your trip begins in Albany, New York. It ends in Syracuse, New York. If you're planning a road trip, you might be interested in seeing the total driving distance from Albany, NY to Syracuse, NY. You can also calculate the cost to drive from Albany, NY to Syracuse, NY based on current local gas prices and an estimate of your car's best gas mileage. If you're meeting a friend, you might be interested in finding the city that is halfway between Albany, NY and Syracuse, NY.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":7348559,"ranking":16,"query_text":"average cost for assisted living in syracuse ny","passage_text":"The total driving time is 4 hours, 11 minutes. Your trip begins in Brooklyn, New York. It ends in Syracuse, New York. If you're planning a road trip, you might be interested in seeing the total driving distance from Brooklyn, NY to Syracuse, NY. You can also calculate the cost to drive from Brooklyn, NY to Syracuse, NY based on current local gas prices and an estimate of your car's best gas mileage. If you're meeting a friend, you might be interested in finding the city that is halfway between Brooklyn, NY and Syracuse, NY.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":1093548,"ranking":17,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Forecast for Syracuse, New York, Syracuse, NY weather forecast. Find your local Syracuse weather forecast. Syracuse, NY weather conditions. Weather outlook for Syracuse, NY. Weather report for Syracuse, NY.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":4255166,"ranking":18,"query_text":"average cost for assisted living in syracuse ny","passage_text":"Distance from Rochester, NY to Syracuse, NY. There are miles from Rochester to Syracuse and miles by car. Rochester and Syracuse are far apart (by car). This is the best Rochester, NY-Syracuse, NY route.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":2524826,"ranking":19,"query_text":"average cost for assisted living in syracuse ny","passage_text":"The final two digits incorporate the old Zone number. So, suppose you live at or near Syracuse University in Syracuse, NY. Your ZIP Code is 13210. Or, 1 New York, 32 SCF-Syracuse and 10 University postal station.","bm25_label":"high","relevance_label":0.0},{"query_id":32176,"passage_id":4814921,"ranking":20,"query_text":"average cost for assisted living in syracuse ny","passage_text":"City of Syracuse, NY Zip Codes. City of Syracuse, NY Demographic Information. * Demographic data is based on information taken from the 2000 Census. City of Syracuse, NY covers 1 Area Code. City of Syracuse, NY covers 28 Zip Codes. 23 Cities within 15 Miles of the City of Syracuse, NY.","bm25_label":"high","relevance_label":0.0}]