[{"query_id":323998,"passage_id":7074375,"ranking":1,"query_text":"how much magnesium in kidney beans","passage_text":"How much Calcium is in Kidney beans? Amount of Calcium in Kidney beans: Calcium How much Iron is in Kidney beans? Amount of Iron in Kidney beans: Iron How much Magnesium is in Kidney beans? Amount of Magnesium in Kidney beans: Magnesium How much Phosphorus is in Kidney beans? Amount of Phosphorus in Kidney beans: Phosphorus How much Zinc is in Kidney beans? Amount of Zinc in Kidney beans: Zinc How much Copper is in Kidney beans?","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":7074377,"ranking":2,"query_text":"how much magnesium in kidney beans","passage_text":"Kidney Beans. A cup of kidney beans contains 70 mg of magnesium and is a great source of protein and fiber. More: How to Bake With Beans.","bm25_label":"high","relevance_label":1.0},{"query_id":323998,"passage_id":7074372,"ranking":3,"query_text":"how much magnesium in kidney beans","passage_text":"How much fiber is in Kidney beans? Amount of fiber in Kidney beans: Fiber How much sucrose is in Kidney beans? Amount of sucrose in Kidney beans: Sucrose How much protein is in Kidney beans? Amount of protein in Kidney beans: Protein: Vitamins and minerals","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":3509542,"ranking":4,"query_text":"how much magnesium in kidney beans","passage_text":"Nutrition-wise, they are an excellent source of many minerals and vitamins. High in Magnesium. Eating a good amount of kidney beans is vital if you want to get your daily dose of magnesium. Kidney beans are a great source of magnesium, as 3.5 ounces of the beans gets you 140 milligrams worth.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":3509541,"ranking":5,"query_text":"how much magnesium in kidney beans","passage_text":"Nutrition-wise, they are an excellent source of many minerals and vitamins. Eating a good amount of kidney beans is vital if you want to get your daily dose of magnesium. Kidney beans are a great source of magnesium, as 3.5 ounces of the beans gets you 140 milligrams worth. Magnesium is essential to the human body if you want to avoid serious conditions that can have a deleterious effect on your well-being.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":728695,"ranking":6,"query_text":"how much magnesium in kidney beans","passage_text":"But did you know that these little legumes can do much more than just that? Packed with protein, soluble (and insoluble) fiber, folate (vitamin B9), magnesium, potassium and a number of other health promoting nutrients, red kidney beans (haricots rouges, red beans, in French) are a true superfood.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":957964,"ranking":7,"query_text":"how much magnesium in kidney beans","passage_text":"Kidney beans are an excellent source of molybdenum. They are a very good source of folate, dietary fiber and copper. Kidney beans are a good source of manganese, phosphorus, protein, vitamin B1, iron, potassium and magnesium.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":2966211,"ranking":8,"query_text":"how much magnesium in kidney beans","passage_text":"Too much vitamin D and\/or calcium can lead to kidney stones. No more than 4,000 IU of vitamin D should be consumed daily and no more than 2,000 mg of calcium. Magnesium is found in nuts, beans, whole grains and green leafy vegetables magnesium levels are generally good in people who have a balanced diet.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":4057916,"ranking":9,"query_text":"how much magnesium in kidney beans","passage_text":"They are a very good source of folate, dietary fiber, and copper. Kidney beans are a good source of manganese, phosphorus, protein, vitamin B1, iron, potassium, and magnesium. For an in-depth nutritional profile click here: Kidney beans.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":5802964,"ranking":10,"query_text":"how much magnesium in kidney beans","passage_text":"Joining them as very good sources are three additional foods (pumpkin seeds, turnip greens, and summer squash). Our top 20 WHFoods for magnesium also include numerous legumes, nuts, and seeds. Top legumes for magnesium are navy beans, tempeh (fermented soybeans), pinto beans, lima beans, and kidney beans.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":4828783,"ranking":11,"query_text":"how much magnesium in kidney beans","passage_text":"Kidney beans and other beans such as pinto beans, navy beans and black beans are known scientifically as Phaseolus vulgaris. They are referred to as common beans probably owing to the fact that they all derived from a common bean ancestor that originated in Peru.hey are a very good source of folate, dietary fiber, and copper. Kidney beans are a good source of manganese, phosphorus, protein, vitamin B1, iron, potassium, and magnesium. For an in-depth nutritional profile click here: Kidney beans.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":4828789,"ranking":12,"query_text":"how much magnesium in kidney beans","passage_text":"Description. Just as its name suggests, the kidney bean is shaped like a kidney. Since these dark red beans hold their shape really well during cooking and readily absorb surrounding flavors, they are a favorite bean to use in simmered dishes. Kidney beans that are white in color are known as cannellini beans.hey are a very good source of folate, dietary fiber, and copper. Kidney beans are a good source of manganese, phosphorus, protein, vitamin B1, iron, potassium, and magnesium. For an in-depth nutritional profile click here: Kidney beans.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":7074379,"ranking":13,"query_text":"how much magnesium in kidney beans","passage_text":"How much Serine is in Kidney beans? Amount of Serine in Kidney beans: Serine * The Percent Daily Values are based on a 2,000 calorie diet, so your values may change depending on your calorie needs.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":1779954,"ranking":14,"query_text":"how much magnesium in kidney beans","passage_text":"Other legumes rich in magnesium include black beans, kidney beans, white beans, chickpeas, black-eyed peas, and lentils. 1  Avocado Loaded with multivitamins, heart-healthy nutrients, and disease-thwarting chemical compounds, avocados are one of the most nutritious and versatile produce picks around.ther legumes rich in magnesium include black beans, kidney beans, white beans, chickpeas, black-eyed peas, and lentils. 1  Avocado Loaded with multivitamins, heart-healthy nutrients, and disease-thwarting chemical compounds, avocados are one of the most nutritious and versatile produce picks around.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":3689089,"ranking":15,"query_text":"how much magnesium in kidney beans","passage_text":"1 Snack on a half-cup serving of dry roasted soybeans, which provides nearly half the necessary magnesium for the day, or add shelled soybeans (edamame) to your shopping list. 2  Other legumes rich in magnesium include black beans, kidney beans, white beans, chickpeas, black-eyed peas, and lentils.1  Avocado Loaded with multivitamins, heart-healthy nutrients, and disease-thwarting chemical compounds, avocados are one of the most nutritious and versatile produce picks around. Snack on a half-cup serving of dry roasted soybeans, which provides nearly half the necessary magnesium for the day, or add shelled soybeans (edamame) to your shopping list. 2  Other legumes rich in magnesium include black beans, kidney beans, white beans, chickpeas, black-eyed peas, and lentils.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":6777309,"ranking":16,"query_text":"how much magnesium in kidney beans","passage_text":"White kidney beans contain a third as much toxin while broad varieties of beans contain 10% as much hemagglutinin as red kidney beans. This is still plenty, since you only need to eat 4-5 undercooked red kidney beans to get sick.hite kidney beans contain a third as much toxin while broad varieties of beans contain 10% as much hemagglutinin as red kidney beans. This is still plenty, since you only need to eat 4-5 undercooked red kidney beans to get sick.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":6277561,"ranking":17,"query_text":"how much magnesium in kidney beans","passage_text":"Kidney Disease and Kidney Beans. For those with healthy kidneys, kidney beans make an excellent complement to a balanced diet, and they contribute to overall kidney health. For people who have kidney disease, however, kidney beans provide several nutrients that need to be carefully monitored and modulated.idney beans contain phosphorus, potassium, protein and magnesium. The kidneys filter out dietary excesses, so nutrients that are necessary for normal functioning, and which donâ\u0080\u0099t create an undue burden on kidneys for those who have normal kidney function, can create problems for those with kidney disease.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":4870638,"ranking":18,"query_text":"how much magnesium in kidney beans","passage_text":"1 Snack on a half-cup serving of dry roasted soybeans, which provides nearly half the necessary magnesium for the day, or add shelled soybeans (edamame) to your shopping list. 2  Other legumes rich in magnesium include black beans, kidney beans, white beans, chickpeas, black-eyed peas, and lentils.","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":4144897,"ranking":19,"query_text":"how much magnesium in kidney beans","passage_text":"Other Beans and Lentils High in Magnesium (%DV per cup cooked): White Beans (28%), French Beans (25%), Black-eyed Peas (23%), Kidney Beans (21%), Chickpeas (Garbanzo) (20%), Lentils (18%), Pinto Beans (16%).","bm25_label":"high","relevance_label":0.0},{"query_id":323998,"passage_id":1338895,"ranking":20,"query_text":"how much magnesium in kidney beans","passage_text":"Plant-based protein foods provide quality protein, healthy fats, and fiber. They vary in how much fat and carbohdyrate they contain, so make sure to read labels. 1  Beans such as black, kidney, and pinto. 2  Bean products like baked beans and refried beans. 3  Hummus and falafel.4  Lentils such as brown, green, or yellow.lant-based protein foods provide quality protein, healthy fats, and fiber. They vary in how much fat and carbohdyrate they contain, so make sure to read labels. 1  Beans such as black, kidney, and pinto. 2  Bean products like baked beans and refried beans. 3  Hummus and falafel.","bm25_label":"high","relevance_label":0.0}]