[{"query_id":330560,"passage_id":3485018,"ranking":1,"query_text":"how much wider is a california king vs regular king","passage_text":"You will occasionally run across a California king bed, which is a few inches wider than a regular king mattress. A pillow for a California king bed is 20 inches x 40 inches, 4 inches wider than a king pillow.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":7451295,"ranking":2,"query_text":"how much wider is a california king vs regular king","passage_text":"A regular king is 76 inches wide by 80 inches long. A California king is 72 inches wide by 84 inches long. Though the California king is longer and the regular king is wider, the regular offers the most square inches of sleeping at 6,080 square inches. The California king bed contains only 6,048 square inches.","bm25_label":"high","relevance_label":1.0},{"query_id":330560,"passage_id":3329770,"ranking":3,"query_text":"how much wider is a california king vs regular king","passage_text":"King: King bed is 4 inches shorter than California King in length and 4 inches wider than California King in width.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":3329772,"ranking":4,"query_text":"how much wider is a california king vs regular king","passage_text":"These are the differences between California King and King bed. Though both are large beds, you have to remember that King is wider than California King while California King is longer than King. So, your bed linens for one will not suit the other.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":741355,"ranking":5,"query_text":"how much wider is a california king vs regular king","passage_text":"King and California king sheets are different sizes. Even though the names are similar, a king and California king mattress are not the same size, nor are their respective sheets. A king mattress, also called an eastern king, is four inches wider and shorter than a California or western king mattress.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":7451296,"ranking":6,"query_text":"how much wider is a california king vs regular king","passage_text":"The California King, sometimes called a Western King, is longer and narrower than the Eastern King, usually referred to as a King or Standard King. The Standard King is 4 wider while the California or Western King is 4 longer. Both sizes come with two box springs and one mattress. California King.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":6377738,"ranking":7,"query_text":"how much wider is a california king vs regular king","passage_text":"The Eastern king is four inches wider than the California king, and the California king is four inches longer than the Eastern king mattress. The size of the Eastern king is 76 inches wide by 80 inches long and the California king is 72 inches wide by 84 inches long.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":4205990,"ranking":8,"query_text":"how much wider is a california king vs regular king","passage_text":"What is the difference between a California King and a Standard King Mattress? The California King, sometimes called a Western King, is longer and narrower than the Eastern King, usually referred to as a King or Standard King. The Standard King is 4 wider while the California or Western King is 4 longer. Both sizes come with two box springs and one mattress.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":6377739,"ranking":9,"query_text":"how much wider is a california king vs regular king","passage_text":"2. The Eastern king is four inches wider than the California king, and the California king is four inches longer than the Eastern king mattress. The size of the Eastern king is 76 inches wide by 80 inches long and the California king is 72 inches wide by 84 inches long. 3.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":5626133,"ranking":10,"query_text":"how much wider is a california king vs regular king","passage_text":"A Standard King is also called an Eastern King and a California King is also called a Western King. A Standard King is about 4 wider and a California King is 4 longer. Two people sleeping in a King size bed will get the same amount of personal sleeping space as in a Twin bed. Standard King or Eastern King beds are about 16 wider than a Queen bed and the same length. 2  A King size bed is sold with two box springs or frames and one mattress. 3  This makes it easier to move.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":1656383,"ranking":11,"query_text":"how much wider is a california king vs regular king","passage_text":"A Standard King is also called an Eastern King and a California King is also called a Western King. A Standard King is about 4 wider and a California King is 4 longer. Two people sleeping in a King size bed will get the same amount of personal sleeping space as in a Twin bed.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":4205985,"ranking":12,"query_text":"how much wider is a california king vs regular king","passage_text":"California King vs King. The difference between California King and King bed comes from the differences in the width and length of both beds. California King and King denote the sizes of the bed and mattresses. California King is designed for taller people, and King is designed for people bigger in size.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":4751626,"ranking":13,"query_text":"how much wider is a california king vs regular king","passage_text":"Calfornia King Size Mattresses. California King Mattress Dimensions are 72 x 84. California King size mattresses are 12 wider than a Queen bed but they add 4 in length. This may be a better choice for taller adults. This size is sometimes known as the Western King, and bedding may be labeled either California King or Western King.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":6038328,"ranking":14,"query_text":"how much wider is a california king vs regular king","passage_text":"The standard queen-size bed is 21 inches wider than a twin and 6 inches wider than a full. A king-size bed is 16 inches wider than a queen, but a California king is only 12 inches wider. A queen-size bed mattress is 80 inches long, the same length as an extra-long twin bed or a king bed.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":1104514,"ranking":15,"query_text":"how much wider is a california king vs regular king","passage_text":"King 76''x 80'' (inches) King size (also known as an eastern king) is the same length as a queen but much wider (16 inches). If you have the space it offers the most room for couples. King size beds are also great if you have kids or pets who like to share your bed. For very tall people you can also special order a California-King which is a 72'' x 84''.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":7684299,"ranking":16,"query_text":"how much wider is a california king vs regular king","passage_text":"A king (aka Eastern King) is quite a bit wider than a queen, offering each sleeper the equivalent to a twin size mattress. This bed is well-suited for a large master bedroom. This mattress comes standard with two twin size box springs as a foundation. California King. The California King (aka Western King) is the standard size king on the West Coast.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":8675376,"ranking":17,"query_text":"how much wider is a california king vs regular king","passage_text":"1 The split king is often two inches (5 cm) wider than the standard king, meaning the two halves are 30 x 80 (76 cm x 203 cm). There is no split version of the California king.  IKEA does not offer California king size mattresses, but they do sell king and queen size mattresses.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":7360768,"ranking":18,"query_text":"how much wider is a california king vs regular king","passage_text":"King and California king sheets are different sizes. Even though the names are similar, a king and California king mattress are not the same size, nor are their respective sheets. A king mattress, also called an eastern king, is four inches wider and shorter than a California or western king mattress. Because of the difference in mattress sizes, sheets designed for one type of king bed generally won't fit well on the other. Both flat and fitted sheet sizes also vary based on brand.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":7248724,"ranking":19,"query_text":"how much wider is a california king vs regular king","passage_text":"With all that said, there are some reasons you might consider getting a California King instead of a regular King: 1  A California King is great for tall people. If youâ\u0080\u0099re taller than about 6â\u0080\u00993â\u0080³ or so, your feet might hang off of a regular King. A California King gives you an extra 4 inches.","bm25_label":"high","relevance_label":0.0},{"query_id":330560,"passage_id":7451298,"ranking":20,"query_text":"how much wider is a california king vs regular king","passage_text":"The Two Kings. King-size bed options include regular king and California king. A regular king-size mattress is also called Eastern king and generally measures 76 by 80 inches. The California king measures 72 by 84 inches, although measurements may vary. Standard pillows tend to look small on a king-size bed, so you might opt for king-size pillows.","bm25_label":"high","relevance_label":0.0}]