[{"query_id":333700,"passage_id":166786,"ranking":1,"query_text":"how old do you have to be to run for congress","passage_text":"$20\/hour. You might want to do a test run on a pair of old jeans that you have around and see how long it takes. Most people completely underestimate how long it takes to hem up a pair of pants, especially if you have to cut them off and turn a new hem. Also, be sure that YOU do the measuring and fitting.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":7569437,"ranking":2,"query_text":"how old do you have to be to run for congress","passage_text":"How to make a bootable DOS disc. You might want to create a DOS boot disc if you have old games that only run under DOS. To do so, you need a PC with a floppy drive and a DOS boot disk, which you can download from www.bootdisk.com. Use ImgBurn and choose 'Mode | Build'.Put your DOS boot floppy into the floppy disk drive.ow to make a bootable DOS disc. You might want to create a DOS boot disc if you have old games that only run under DOS. To do so, you need a PC with a floppy drive and a DOS boot disk, which you can download from www.bootdisk.com. Use ImgBurn and choose 'Mode | Build'.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":7461102,"ranking":3,"query_text":"how old do you have to be to run for congress","passage_text":"For the House of Representatives the minimum age is 25, for the Senate the minimum age age is 30. To run for Congress you must be at least 25 years old, a U.S. citizen and be a resident in the state you're running in. the minimum age to run for U.S. Congress is 30. Minimum age for the House is 25.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":7461100,"ranking":4,"query_text":"how old do you have to be to run for congress","passage_text":"Quick Answer. In the United States as of 2014, candidates for Congress must be 25 years old to run for a seat in the House of Representatives and 30 years old to run for a seat in the Senate. Other countries have other age minimums for their respective legislative bodies.","bm25_label":"high","relevance_label":1.0},{"query_id":333700,"passage_id":6956724,"ranking":5,"query_text":"how old do you have to be to run for congress","passage_text":"Quick Answer. In the United States as of 2014, candidates for Congress must be 25 years old to run for a seat in the House of Representatives and 30 years old to run for a seat in the Senate. Other countries have other age minimums for their respective legislative bodies. Continue Reading.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":3252731,"ranking":6,"query_text":"how old do you have to be to run for congress","passage_text":"What branch does Article 1 define? See: Article 1 How many houses of Congress are there? See: Article 1 Section 1 How old do you have to be to be a Representative? See: Article 1 Section 2 How long must you have been a citizen to be a Representative? See: Article 1 Section 2 How long is a Representative's term of office? See: Article 1 Section 2 How is a vacancy in a seat in the House of Representatives filled? See: Article 1 Section 2 How old do you have to be to be a Senator? See: Article 1 Section 3 How long must you have been a citizen to be a Senator? See: Article 1 Section 3 How long is a Senator's term of office? See: Article 1 Section 3 How is a vacancy in a seat in the Senate filled? See: Amendment 17 How many Senators does each state have? See: Article 1 Section 3 What role does the Vice President serve in the Senate? See: Article 1 Section 3 When is the only time that the Vice President can vote in the Senate? See: Article 1 Section 3 How often does Congress have to meet? See: Article 1 Section 4","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":5464088,"ranking":7,"query_text":"how old do you have to be to run for congress","passage_text":"People also view. 1  How fast can the average person run. 2  How do I increase my cardio exercise. 3  Why am i so sore today.  Does stress cause body 1  fat. How much should a 5'9 &quot;14 year old weigh.  How to lose 20 1  pounds. How much should an average eleven year old girl 2  weigh. How fast do people usually  run. How do you find your bpm.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":4595886,"ranking":8,"query_text":"how old do you have to be to run for congress","passage_text":"requirements to serve in congress. To be 30 years old, you must be a citizen of US for for at least 9 years,you must be a citizen of the state for which you are running as a candidate for the senate. US REPRESENTATIVE. AT LEAST 25 YEARS OLD.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":8556500,"ranking":9,"query_text":"how old do you have to be to run for congress","passage_text":"requirements to serve in congress To be 30 years old, you must be a citizen of US for for at least 9 years,you must be a citizen of the state for which you are running as a candidate for the senate. us representative at least 25 years old","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":944402,"ranking":10,"query_text":"how old do you have to be to run for congress","passage_text":"Report Abuse. Average cost is $300-$500, depending on how marred the flywheel is and if the old clutch is rebuildable. If you do it yourself, if you have the capability, it will run around $180.rex_rrracefab Â· 9 years ago. Thumbs up.t should run about $400.00 to $700.00 depending on where you get it done. If you do it yourself, much less some where near the $150.00 to $200.00 mark. Pls don't forget to buy a through out bearing. Note: you will have to access to an engine hoist or a comealong to pull the engine out if you do it yourself.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":3099056,"ranking":11,"query_text":"how old do you have to be to run for congress","passage_text":"In the United States as of 2014, candidates for Congress must be 25 years old to run for a seat in the House of Representatives and 30 years old to run for a seat in the Senate. Other countries have other age minimums for their respective legislative bodies. Continue Reading. Credit: Tom Merton OJO Images Getty Images.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":8114652,"ranking":12,"query_text":"how old do you have to be to run for congress","passage_text":"RY. How do I get my fps up for minecraft I have a windows 8 dell Inspiron and minecraft runs slower on my windows 8 than my old computer made In 2000. 3 people had this question.Y. How do I get my fps up for minecraft I have a windows 8 dell Inspiron and minecraft runs slower on my windows 8 than my old computer made In 2000. 3 people had this question.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":7826720,"ranking":13,"query_text":"how old do you have to be to run for congress","passage_text":"How Old Do You Have to Be to Have a Facebook Account? Posted on March 24, 2013 by Deb in Family, Internet. How Old Do You Have to Be to Have a Facebook Account? Letâ\u0080\u0099s face it â\u0080\u0094 Facebook is ubiquitous.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":7461103,"ranking":14,"query_text":"how old do you have to be to run for congress","passage_text":"For the House of Representatives the minimum age is 25, for the Senate the minimum age age is 30. Danielle McGinnis. To run for Congress you must be at least 25 years old, a U.S. citizen and be a resident in the state you're running in.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":2709148,"ranking":15,"query_text":"how old do you have to be to run for congress","passage_text":"This will require in many instances you having to vote for someone outside of your normal party, but you are a patriot and you can do what is right. Show congress in this next election that we the people are running things in this country, not career politicians.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":8113073,"ranking":16,"query_text":"how old do you have to be to run for congress","passage_text":"Republican Congress - doing what for jobs? If you did your Job as badly as Congress and the President, What job would you qualify for? How do You want the President and Congress to Create Jobs?","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":944561,"ranking":17,"query_text":"how old do you have to be to run for congress","passage_text":"How old do you have to be to work in oregon. Beaverton, OR | January 19, 2013 3:34am. so im wondering to work at a fast food restaurant in oregon how old do you have to be.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":6319408,"ranking":18,"query_text":"how old do you have to be to run for congress","passage_text":"In Louisiana how old do you have to be to get a drivers permit? 15 years old How do you know are you from Louisiana and do you have a permit? Where does a 14 year old get a work permit?   Answer   Usually you would get a work permit from your high school office.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":1427135,"ranking":19,"query_text":"how old do you have to be to run for congress","passage_text":"requirements to serve in congress. To be 30 years old, you must be a citizen of US for for at least 9 years,you must be a citizen of the state for which you are running as a candidate for the senate.US REPRESENTATIVE.AT LEAST 25 YEARS OLD.o be 30 years old, you must be a citizen of US for for at least 9 years,you must be a citizen of the state for which you are running as a candidate for the senate. US REPRESENTATIVE. AT LEAST 25 YEARS OLD.","bm25_label":"high","relevance_label":0.0},{"query_id":333700,"passage_id":204740,"ranking":20,"query_text":"how old do you have to be to run for congress","passage_text":"how old do you have to be to get a CNA degree. by vwright2012 Mar 28, '10 | 12,674 Views | 5 Comments. 0 how old do you have to be to get the CNA degree and work as a CNA?","bm25_label":"high","relevance_label":0.0}]