[{"query_id":335910,"passage_id":7744036,"ranking":1,"query_text":"how old is marzia bisognin","passage_text":"Related to Marzia Bisognin has been dating Felix Kjellberg, better known as PewDiePie. The couple has regarded as YouTube's biggest power couple. Web Video Star Marzia Bisognin born on 21 10 1990 in . Until now, Marzia Bisognin's age is 26 year old and have Libra constellation. Count down 6 days will come next birthday of Marzia Bisognin !","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883309,"ranking":2,"query_text":"how old is marzia bisognin","passage_text":"Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883311,"ranking":3,"query_text":"how old is marzia bisognin","passage_text":"Marzia Bisognin, also known by name CutiePie or CutiePieMarzia is a 22 year old Vlogger known for her YouTube videos. Mainly staring in her own videos, Marzia also stars in various videos by her boyfriend, or Felix Arvid Ulf Kjellberg. Marzia grew up in a small city that goes by the name of Vicenza, Italy.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883313,"ranking":4,"query_text":"how old is marzia bisognin","passage_text":"Actress. Marzia Bisognin, also known by name CutiePie or CutiePieMarzia is a 22 year old Vlogger known for her YouTube videos. Mainly staring in her own videos, Marzia also stars in various videos by her boyfriend, or Felix Arvid Ulf Kjellberg. Marzia grew up in a small city that goes by the name of Vicenza, Italy.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883308,"ranking":5,"query_text":"how old is marzia bisognin","passage_text":"Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883310,"ranking":6,"query_text":"how old is marzia bisognin","passage_text":"811 pages on this wiki. Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883306,"ranking":7,"query_text":"how old is marzia bisognin","passage_text":"Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up. She also creates How-to\/DIY videos in which she makes various things, such as jewelry, foods and accessories.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":3904072,"ranking":8,"query_text":"how old is marzia bisognin","passage_text":"811 pages on this wiki. Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up. She also creates How-to\/DIY videos in which she makes various things, such as jewelry, foods and accessories.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":2879506,"ranking":9,"query_text":"how old is marzia bisognin","passage_text":"Marzia Bisognin, born (October 21, 1992), also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up. She also creates How-to\/DIY videos in which she makes various things, such as jewelry, foods and accessories.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":3904069,"ranking":10,"query_text":"how old is marzia bisognin","passage_text":"As of 2011, he is in a relationship with fashion and beauty vlogger Marzia Bisognin, better known as CutiePieMarzia. The pair met when Bisognin was introduced to PewDiePie's channel through a friend, and later e-mailed Kjellberg, telling him she found his videos funny.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":7744037,"ranking":11,"query_text":"how old is marzia bisognin","passage_text":"Hello, this up here is me! Iâ\u0080\u0099m Marzia Bisognin, a 23 years old Italian living in England. You can already follow my adventures on Youtube, but I decided to put this up on the internet because writing has always been easier for me than talking.","bm25_label":"high","relevance_label":1.0},{"query_id":335910,"passage_id":5193971,"ranking":12,"query_text":"how old is marzia bisognin","passage_text":"Marzia Bisognin, also known as the adorable and sweet Italian Youtube star CutiePieMarzia. Marzia was born on October 21st, 1985 in Vicenza, Italy.[1] She currently lives with her boyfriend Felix, also known as PewDiePie, and their pugs Maya and Edgar in Brighton, U.K.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883312,"ranking":13,"query_text":"how old is marzia bisognin","passage_text":"Wyatt. CutiePie Marzia, PewDiePie â\u0080\u0098s girlfriendâ\u0080\u0099s real name is Marzia Bisognin and is a hot vlogger from Italy. She lives in Italy with her boyfriend and makes YouTube videos of all sorts of stuff, mostly regarding fashions, trends and makeup.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":5193969,"ranking":14,"query_text":"how old is marzia bisognin","passage_text":"Marzia Bisognin, also known as the adorable and sweet Italian Youtube star CutiePieMarzia. Personal Life. Marzia was born on October 21st, 1985 in Vicenza, Italy.[1] She currently lives with her boyfriend Felix, also known as PewDiePie, and their pugs Maya and Edgar in Brighton, U.K.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":6883307,"ranking":15,"query_text":"how old is marzia bisognin","passage_text":"In case you don't know who CutiepieMarzia is, her real name is Marzia Bisognin (Age:19) who used to live in Italy with her family. She met Felix Kjellberg (Age:22) when a close friend introduced Marzia to Felix's Youtube channel, who is well known as Pewdiepie.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":7811237,"ranking":16,"query_text":"how old is marzia bisognin","passage_text":"Discover the most famous people from Italy including Cole Sprouse, Dylan Sprouse, Marzia Bisognin, Leonardo da Vinci, Christopher Columbus and many more. Famous Birthdays popular","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":8640854,"ranking":17,"query_text":"how old is marzia bisognin","passage_text":"Kim Kardashian, 35 Marzia Bisognin, 23 Cody Johns, 26 Amber Rose, 32 Kaycee Rice, 13 Carrie Fisher, 59 Judge Judy Sheindlin, 73 Andrew Scott, 39 Aaron Tveit, 32 More.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":1457514,"ranking":18,"query_text":"how old is marzia bisognin","passage_text":"He currently gets subscribers at an average of one per minute, explaining why he's made it this far with 40,000,000+ subscribers. At the moment, he is in a relationship with Marzia Bisognin otherwise known as CutiePieMarzia for more than 4 years. He also has his own game called PewDiePie: Legend of the Brofist.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":7744035,"ranking":19,"query_text":"how old is marzia bisognin","passage_text":"Mini Bio (1) Marzia Bisognin, also better known by her name CutiePie or her YouTube username CutiePieMarzia is a highly popular Italian YouTube vlogger known for her YouTube videos. She discusses fashion and helps her viewers with speaking Italian. She is also an Italian YouTube personality, fashion designer and author.","bm25_label":"high","relevance_label":0.0},{"query_id":335910,"passage_id":5193967,"ranking":20,"query_text":"how old is marzia bisognin","passage_text":"MY PASTEL COLLECTION IS HERE! Thank you so much for visiting my brand new online store! This is the home of my Subscription Box and Fashion Collection! If you don't know who I am, my name is Marzia Bisognin. I make videos about anything that interests me. I post my YouTube videos every Thursday so make sure you check them out!","bm25_label":"high","relevance_label":0.0}]