[{"query_id":341317,"passage_id":7669137,"ranking":1,"query_text":"how tall is samus aran","passage_text":"Samus Aran. Samus Aran (ã\u0082µã\u0083 ã\u0082¹ã\u0083»ã\u0082¢ã\u0083©ã\u0083³, Samus Aran) is the protagonist of the Metroid series. Samus is the galaxy's most famous bounty hunter, constantly helping the Galactic Federation in their fight against the Space Pirates. She has appeared in all Super Smash Bros. games to date.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7669136,"ranking":2,"query_text":"how tall is samus aran","passage_text":"Samus Aran is a human. She is 6 feet 3 inches tall and weighs 198 pounds, without her armor. Despite this relatively high weight, her body is very slender and narrow, although this may be accountable to her muscle\/bone density given her superhuman abilities.","bm25_label":"high","relevance_label":1.0},{"query_id":341317,"passage_id":7669133,"ranking":3,"query_text":"how tall is samus aran","passage_text":"Samus Aran (ã\u0082µã\u0083 ã\u0082¹ã\u0083»ã\u0082¢ã\u0083©ã\u0083³, Samusu Aran) is an intergalactic bounty hunter and the main protagonist of the Metroid series. Orphaned during a Space Pirate raid on her home of K-2L, Samus was adopted by the mysterious Chozo and taken to Zebes where she was infused with their DNA and raised to become a warrior.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7808013,"ranking":4,"query_text":"how tall is samus aran","passage_text":"Samus Aran wearing the Zero Suit, as depicted in Metroid: Other M. Super Metroid's Player's Guide describes Samus as an athletic woman who is 6 ft 3 in (1.91 m) tall and weighs 198 pounds (90 kg) without her armor.amus has appeared in every Metroid video game and has also been featured in media outside of the series, including the comic book version of Captain N: The Game Master and the Super Smash Bros. series.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7669138,"ranking":5,"query_text":"how tall is samus aran","passage_text":"Six Things You Didn't Know About Metroid's Samus Aran. The lore of the Metroid series tells us that the reason Samus Aran is such a bad-ass bounty hunter is because she was raised by birds. The ancient, dying sentient bird people called the Chozo took her in and raised her as one of their own after she was the lone survivor of a Space Pirate attack that killed her parents.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":8839702,"ranking":6,"query_text":"how tall is samus aran","passage_text":"Dark Samus is a main antagonist of the Metroid Prime series. She is a combination of elements from Metroid Prime, Samus Aran, and Samus's Phazon Suit. She appears in all three of the Prime games, although her appearance in the first Metroid Prime was only in a brief cut scene. As she is an incarnation of Metroid Prime, Dark Samus is a primary antagonist of the Prime series.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7669134,"ranking":7,"query_text":"how tall is samus aran","passage_text":"If the height and weight do indeed refer to Samus in suit, then it would be Varia. Notice that it says Samus Aran with Full Equipment, and in Metroid 2 the Varia is the only suit item. --Poiuyt Man talk 02:57, 19 August 2005 (UTC) ah yes....been playing MP lately......","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":8556813,"ranking":8,"query_text":"how tall is samus aran","passage_text":"You can even dress Bayonetta up in five Nintendo-themed costumes-Princess Peach, Princess Daisy, Link, Fox McCloud, and Samus Aran. Bayonetta This is the prequel to the Bayonetta 2 game, and it's every bit as sassy, destructive, and epic as you'd expect.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7808009,"ranking":9,"query_text":"how tall is samus aran","passage_text":"Samus Aran (Japanese: ã\u0082µã\u0083 ã\u0082¹ã\u0083»ã\u0082¢ã\u0083©ã\u0083³, Hepburn: Samusu Aran) is the protagonist of the Metroid science fiction action-adventure game series by Nintendo.She was introduced in the 1986 video game Metroid.amus has appeared in every Metroid video game and has also been featured in media outside of the series, including the comic book version of Captain N: The Game Master and the Super Smash Bros. series.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7808015,"ranking":10,"query_text":"how tall is samus aran","passage_text":"Samus Aran is a human. She is 6 feet 3 inches tall and weighs 198 pounds, without her armor. Despite this relatively high weight, her body is very slender and narrow, although this may be accountable to her muscle\/bone density given her superhuman abilities.amusâ\u0080\u0099s lack of defined personality is largely due to the fact that, aside from opening narrations, she has never had a speaking role except in Metroid: Other M. Prior to Metroid: Other M, her voice would be represented by text at the beginning narration, as well as throughout Metroid Fusion.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":2156554,"ranking":11,"query_text":"how tall is samus aran","passage_text":"Effect(s) Obtained. The Wide Beam was one of the many Beams available to Samus Aran in her Fusion Suit during the events of Metroid Fusion. It is similar to the Spazer Beam of other games, but the Wide Beam splits into three pink rings like a wall, as opposed to the Spazer's three individual lasers.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":2156559,"ranking":12,"query_text":"how tall is samus aran","passage_text":"Defeat Core-X during Sector 3 overheat. The Wide Beam was one of the many Beams available to Samus Aran in her Fusion Suit during the events of Metroid Fusion. It is similar to the Spazer Beam of other games, but the Wide Beam splits into three pink rings like a wall, as opposed to the Spazer's three individual lasers.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7808012,"ranking":13,"query_text":"how tall is samus aran","passage_text":"Samus Aran is an ex-soldier of the Galactic Federation who turned into a Galactic bounty hunter, usually fitted with a powered exoskeleton with weapons that include directed-energy weapons and missiles.amus has appeared in every Metroid video game and has also been featured in media outside of the series, including the comic book version of Captain N: The Game Master and the Super Smash Bros. series.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":8158111,"ranking":14,"query_text":"how tall is samus aran","passage_text":"Bomb Torizo's claw and laser attacks each deal 2 \/ 5 \/ 10 damage to Gravity Suit \/ Varia Suit \/ Power Suit Samus, respectively. Bomb Torizo's claw explosions can strike Samus multiple times depending on how Samus comes into contact with it. Interactions Walking. Bomb Torizo will walk forwards towards Samus if she is nearby.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":8839707,"ranking":15,"query_text":"how tall is samus aran","passage_text":"Samus's first battle with Dark Samus takes place within the Space Pirates' mining facility in the Agon Wastes. Samus encounters her doppelganger in a room designed to process Phazon; Dark Samus absorbs a large amount of the Phazon and battles Samus.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":754329,"ranking":16,"query_text":"how tall is samus aran","passage_text":"arachnology; arachnolysin; arachnomelia; arachnophobia; araha-vabhedaka; Arakawa, Tsuneo; Aralen; aralkyl; Aramine; aran; Aran, Francois; Aranaeomorpha; Aran-Duchenne disease; Aran-Duchenne muscular atrophy; Aran-Duchenne Muscular Dystrophy; Araneida; araneism; araneous; Arantius; Arantius body; Arantius' ventricle; Arantius, Giulio C. Arantius, Julius Caesar; Arantiusâ\u0080\u0099 ventricle; araphia; ARAS","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7808016,"ranking":17,"query_text":"how tall is samus aran","passage_text":"Super Smash Bros. Melee Trophies. This intergalactic bounty hunter's full name is Samus Aran. Clad in a Power Suit made by the Chozo race and infused with their enhanced blood, she cleared the planet Zebes of a Metroid infestation.Samus is an orphan, the sole survivor of a Space Pirate raid that destroyed an Earth colony named K-2L..amusâ\u0080\u0099s lack of defined personality is largely due to the fact that, aside from opening narrations, she has never had a speaking role except in Metroid: Other M. Prior to Metroid: Other M, her voice would be represented by text at the beginning narration, as well as throughout Metroid Fusion.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7669140,"ranking":18,"query_text":"how tall is samus aran","passage_text":"Samus is suppose to be 6'3 without the suit. Pretty sure that she's supposed to be 6' with the suit on, and 225 LBS (meaning the suit probably weighs about 90-100 pounds). Without the suit, she's probably about 5' 10 and 130 LBS. That's still tall enough to tower over a great many men.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":7669141,"ranking":19,"query_text":"how tall is samus aran","passage_text":"Samus is supposed to be over six feet tall right? I remember in the beginning cut scenes she was shorter than the entire squad surrounding her..she looked maybe 5'4. But in the cut scene when she talks to Madeline she towers over her like god damn king kong.","bm25_label":"high","relevance_label":0.0},{"query_id":341317,"passage_id":6624525,"ranking":20,"query_text":"how tall is samus aran","passage_text":"Henry Samueli Net Worth is $1.7 Billion. Henry Samueli Net Worth is $1.7 Billion. Henry Samueli is co-founder, senior vice president, and chief technology officer of the Broadcom Corporation; he has a net worth of $1.7 billion. Henry Samueli has in addition to his company has built is net w Henry Samueli is co-founder, senior vice president, and chief technology officer of the Broadcom Corporation, owner of the Anaheim Ducks, and Sat, 18 Nov 2017 02:36:00","bm25_label":"high","relevance_label":0.0}]