[{"query_id":372378,"passage_id":7614306,"ranking":1,"query_text":"how to pin an app on the start screen","passage_text":"How to pin apps to Start screen in Windows 8.1: Step 1: Switch to the Start screen. Move the mouse pointer to the lower-left of the screen to see a small Down arrow icon and click on the same to see Apps view.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":6684463,"ranking":2,"query_text":"how to pin an app on the start screen","passage_text":"Step 1: Switch to the Start screen. Move the mouse pointer to the lower-left of the screen to see a small Down arrow icon and click on the same to see Apps view. Step 2: Right-click on the app name that you would like to pin to the Start and then click Pin to Start option to pin the selected app to the Start screen.ove the mouse pointer to the lower-left of the screen to see a small Down arrow icon and click on the same to see Apps view. Step 2: Right-click on the app name that you would like to pin to the Start and then click Pin to Start option to pin the selected app to the Start screen.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":6248468,"ranking":3,"query_text":"how to pin an app on the start screen","passage_text":"Unlike in Windows 8, where every installed app lands up on the Start screen (itâ\u0080\u0099s possible to disable Start screen pinning though), Windows 8.1 doesnâ\u0080\u0099t automatically pin all installed apps and programs to the Start. Instead, all apps and programs appear in Apps view.ove the mouse pointer to the lower-left of the screen to see a small Down arrow icon and click on the same to see Apps view. Step 2: Right-click on the app name that you would like to pin to the Start and then click Pin to Start option to pin the selected app to the Start screen.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":7801603,"ranking":4,"query_text":"how to pin an app on the start screen","passage_text":"Pin Apps to Windows 8 Start Screen. To pin an application that is not showing up on your Start Screen by default, Launch Start Screen and right-click anywhere in it to select All Apps. After you click on All Apps, you will see all the applications that are installed on your computer.in Apps to Windows 8 Start Screen. To pin an application that is not showing up on your Start Screen by default, Launch Start Screen and right-click anywhere in it to select All Apps. After you click on All Apps, you will see all the applications that are installed on your computer.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":3953860,"ranking":5,"query_text":"how to pin an app on the start screen","passage_text":"Step 1: Switch to the Start screen. Move the mouse pointer to the lower-left of the screen to see a small Down arrow icon and click on the same to see Apps view. Step 2: Right-click on the app name that you would like to pin to the Start and then click Pin to Start option to pin the selected app to the Start screen.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":680364,"ranking":6,"query_text":"how to pin an app on the start screen","passage_text":"NOTE: If you do not see the Pin to Start icon, then the app is already pinned to the Start screen and you would see Unpin from Start instead. See also: How to Open Context Menu and Options Bar on Start Screen in Windows 8.1. B) Go to step 4 below.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":4457283,"ranking":7,"query_text":"how to pin an app on the start screen","passage_text":"How to 'Pin to Start' and 'Unpin from Start items in Windows 10. Information. You can pin any apps, contacts (People app), folders, drives, homegroup, library, network, and OneDrive to your Start screen and Start menu so you can open them quickly, and see updates on live tiles for modern apps at a glance.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":7614305,"ranking":8,"query_text":"how to pin an app on the start screen","passage_text":"Move the mouse pointer to the lower-left of the screen to see a small Down arrow icon and click on the same to see Apps view. Step 2: Right-click on the app name that you would like to pin to the Start and then click Pin to Start option to pin the selected app to the Start screen.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":3953857,"ranking":9,"query_text":"how to pin an app on the start screen","passage_text":"Pin Apps to Windows 8 Start Screen. To pin an application that is not showing up on your Start Screen by default, Launch Start Screen and right-click anywhere in it to select All Apps. After you click on All Apps, you will see all the applications that are installed on your computer.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":7484272,"ranking":10,"query_text":"how to pin an app on the start screen","passage_text":"When you download an app from the Windows store in 8.1 it does not get pinned to the Start Screen automatically. Use the following steps to pin an app to the Start Screen: 1  Open the Start Screen. 2  Click or tap the arrow icon in the lower left corner to view the list of apps. 3  Tap and hold or right-click the app you want to add. 4  Click Pin to Start from the menu bar that opens along the bottom of the screen.","bm25_label":"high","relevance_label":1.0},{"query_id":372378,"passage_id":7614308,"ranking":11,"query_text":"how to pin an app on the start screen","passage_text":"It'll open the Apps page where you'll get a long list of lots of interesting apps. Right-click on an app which you want to pin to Start Screen and click on  Pin to Start  option in bottom bar: That's it. It'll immediately add the app tile to Start Screen.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":680365,"ranking":12,"query_text":"how to pin an app on the start screen","passage_text":"(see screenshot below). NOTE: If you do not see the Unpin from Start icon, then the app is not pinned to the Start screen and you would see Pin to Start instead. See also: How to Open Context Menu and Options Bar on Start Screen in Windows 8.1. B) Go to step 4 below.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":3336736,"ranking":13,"query_text":"how to pin an app on the start screen","passage_text":"You can Pin App Tiles to your start menu for quick access. Use the following steps to add tiles to your Start Screen: 1  Type the name of the app you want to Pin in the search box.2  Right-click the app and select Pin to Start.ou can Pin App Tiles to your start menu for quick access. Use the following steps to add tiles to your Start Screen: 1  Type the name of the app you want to Pin in the search box.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":680368,"ranking":14,"query_text":"how to pin an app on the start screen","passage_text":"(see screenshot below) NOTE: If you do not see the Pin to Start icon, then the app is already pinned to the Start screen and you would see Unpin from Start instead. See also: How to Open Context Menu and Options Bar on Start Screen in Windows 8.1 B) Go to step 4 below.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":7614310,"ranking":15,"query_text":"how to pin an app on the start screen","passage_text":"Unlike in Windows 8, where every installed app lands up on the Start screen (itâ\u0080\u0099s possible to disable Start screen pinning though), Windows 8.1 doesnâ\u0080\u0099t automatically pin all installed apps and programs to the Start. Instead, all apps and programs appear in Apps view.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":6248467,"ranking":16,"query_text":"how to pin an app on the start screen","passage_text":"In Windows 8.1, apps don't make their way to the Start screen unless you pin them there. After you install a new app, click on the down arrow in the lower left corner of the Start screen. That takes you to the App screen where you'll see any recently-installed apps highlighted with the word New.Right-click on the tile or tiles of any apps that you wish to appear on the Start screen and click on the Pin to Start button. Windows 8.1 then transports you back to the Start screen to reveal the new tile.Finally, more choices are available for you to change the color and background of the Start screen.ow to customize the new Start screen in Windows 8.1. Windows 8.1 users can easily move and resize tiles, create and name groups of tiles, change the background image, and pin freshly installed apps on the Start screen. by Lance Whitney @lancewhit \/.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":3562535,"ranking":17,"query_text":"how to pin an app on the start screen","passage_text":"It sounds silly, but one of the issues with Windows 8 .1 is that the OS no longer pins newly installed apps on your Start screen. So you need to know where to find these apps, and then how to pin them to the Start screenâ\u0080\u0094or, in the case of desktop apps, to your taskbarâ\u0080\u0094so you can access them more easily going forward.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":6684462,"ranking":18,"query_text":"how to pin an app on the start screen","passage_text":"In Windows 8.1, apps don't make their way to the Start screen unless you pin them there. After you install a new app, click on the down arrow in the lower left corner of the Start screen. That takes you to the App screen where you'll see any recently-installed apps highlighted with the word New.Right-click on the tile or tiles of any apps that you wish to appear on the Start screen and click on the Pin to Start button. Windows 8.1 then transports you back to the Start screen to reveal the new tile.Finally, more choices are available for you to change the color and background of the Start screen.ight-click on the tile or tiles of any apps that you wish to appear on the Start screen and click on the Pin to Start button. Windows 8.1 then transports you back to the Start screen to reveal the new tile. Finally, more choices are available for you to change the color and background of the Start screen.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":5218828,"ranking":19,"query_text":"how to pin an app on the start screen","passage_text":"To pin a program to the desktop taskbar from the Start screen in Windows Server 2012 R2, Windows Server 2012, Windows 8.1, or Windows 8. 1  On the Start screen, search for or navigate to the app that you want to pin to the desktop taskbar. 2  Right-click the app tile, and in the app bar, click Pin to taskbar.","bm25_label":"high","relevance_label":0.0},{"query_id":372378,"passage_id":7614312,"ranking":20,"query_text":"how to pin an app on the start screen","passage_text":"Right click or swipe down on the app, folder, library, or drive, and click\/tap on Pin to Start. (see screenshot below) 3. The app, folder, library, or drive will now be pinned to the Metro Start screen. OPTION FOUR Pin to Start or Unpin from Start a Contact in People app 1.","bm25_label":"high","relevance_label":0.0}]