[{"query_id":372792,"passage_id":7501074,"ranking":1,"query_text":"how to plug a tire","passage_text":"â\u0080\u009cHow to Plug A Tireâ\u0080\u009d In Four Easy Steps Without Removing The Tire. 1  1 Find the leak caused by a nail or foreign object. 2  2 Prepare the tire plug and tools needed. 3  3 Prep the leak with a reaming tool.  4 Install the tire plug and check the tire pressure.","bm25_label":"high","relevance_label":1.0},{"query_id":372792,"passage_id":5738860,"ranking":2,"query_text":"how to plug a tire","passage_text":"How should my tire be repaired? There is only one correct way to repair a steel-belted radial, which virtually all modern tires are. That method is a combination patch and plug. The plug is pushed through the hole from the inside of the tire, and the attached patch is sealed overtop of the entry point.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":7815272,"ranking":3,"query_text":"how to plug a tire","passage_text":"Hopefully, they can just plug the hole for $10, and I wonâ\u0080\u0099t have to buy a whole new tire. Wouldnâ\u0080\u0099t that be a dream scenario? I remember in 12th-grade auto shop learning how to plug holes in tires. Since then Iâ\u0080\u0099ve never come across a tire that could just be â\u0080\u0098fixedâ\u0080\u0099. They always seem to need to be â\u0080\u0098replacedâ\u0080\u0099.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":2975393,"ranking":4,"query_text":"how to plug a tire","passage_text":"How does tire sealant work? Tire sealant is often sold as a sticky, fiber-filled liquid that coats the interior of the tire with the excess puddling inside as well. If the tire is punctured, the escaping air carries the viscous sealant out through the hole and the sealant fibers create a plug.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":7769582,"ranking":5,"query_text":"how to plug a tire","passage_text":"Show All Items. My car got a nail in the tire and rather than bring it to the garage to have them plug it, I did and took some pics. This instructable will show you how to patch your car tire.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":6114008,"ranking":6,"query_text":"how to plug a tire","passage_text":"Tire plug or not!! Discussion in 'Touring Models' started by tdufren, Oct 12, 2010. Page 1 of 3 1 2 3 Next >. The Harley shop found a nail in my tire after checking pressure and told me they do not plug tires because of liability issues. They said I could plug it myself or have someone do it for me. I decided to change tire for safety but was curious to know if any body is riding around on a tire with a plug in it.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":7501078,"ranking":7,"query_text":"how to plug a tire","passage_text":"Here are a few areas they all agree on. Everyone who says that you can plug a tire (including tire-plug makers) agree that the repairable area is limited to the crown of the tire. â\u0080\u009cYou cannot plug a sidewall because it doesnâ\u0080\u0099t have the structure to hold the plug,â\u0080\u009d says TJ Tennent, Bridgestoneâ\u0080\u0099s engineering manager.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":6078533,"ranking":8,"query_text":"how to plug a tire","passage_text":"1 Remove the tire from the wheel. 2  Inspect the tire inside and outside. 3  The tire may be repaired when the puncture: 4  Is 1\/4 inch or smaller. 5  Is located on the tread. 6  Repair the tread with a plug, and repair the lining with a patch. 7  Repairs cannot overlap.8  Never repair a large hole or one that's in the sidewall.ere's how the tire industry's professional group, the Rubber Manufacturer's Association (RMA), says to repair a flat tire: 1  Remove the tire from the wheel. 2  Inspect the tire inside and outside. 3  Is 1\/4 inch or smaller. 4  Is located on the tread. 5  Repair the tread with a plug, and repair the lining with a patch. 6  Repairs cannot overlap. 7  Never repair a ...","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":6114011,"ranking":9,"query_text":"how to plug a tire","passage_text":"Tires â\u0080\u0093 Plug Repair. To plug, or not to plug: that is the question: Whether it â\u0080\u0099tis nobler in the mind to suffer. The slings and arrows of outraged industry peers, Or to leave unplugâ\u0080\u0099d the tires I see troubled.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":4247842,"ranking":10,"query_text":"how to plug a tire","passage_text":"2150 E SEMORAN BLVD, APOPKA, FLORIDA -- Discount Tire Stores are the only company that advertises FREE TIRE PLUG\/REPAIR. I am a single woman and recently had my back rear tire go flat due to a large nail in it. Called a friend to come and inflate it and he told me all about how Discount Tires will fix it for free.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":6078534,"ranking":11,"query_text":"how to plug a tire","passage_text":"1 The tire may be repaired when the puncture: 2  Is 1\/4 inch or smaller. 3  Is located on the tread. 4  Repair the tread with a plug, and repair the lining with a patch. 5  Repairs cannot overlap. 6  Never repair a large hole or one that's in the sidewall.ere's how the tire industry's professional group, the Rubber Manufacturer's Association (RMA), says to repair a flat tire: 1  Remove the tire from the wheel. 2  Inspect the tire inside and outside. 3  Is 1\/4 inch or smaller. 4  Is located on the tread. 5  Repair the tread with a plug, and repair the lining with a patch. 6  Repairs cannot overlap. 7  Never repair a ...","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":3772018,"ranking":12,"query_text":"how to plug a tire","passage_text":"Sealing Larger Holes. Use a tire plug to repair holes more than 1\/16 inch in diameter. Remove any foreign object from the tire with pliers. Insert the black rubber plug through the eyelet of the tire tool provided with the kit. Pull the plug through the eyelet so it is centered in it.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":6078539,"ranking":13,"query_text":"how to plug a tire","passage_text":"Funny you say that.....I did go to Autozone, got a tire plug in kit, and had one of the guys at my job install it.Only problem was that the guy at Autozone didn't fucking specify which tire we had and I bought a tire plug in kit for lawn, ATV, and non-vehicle tires.ate Posted: Jul 22, 2014 #10. Funny you say that.....I did go to Autozone, got a tire plug in kit, and had one of the guys at my job install it. Only problem was that the guy at Autozone didn't fucking specify which tire we had and I bought a tire plug in kit for lawn, ATV, and non-vehicle tires.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":1783764,"ranking":14,"query_text":"how to plug a tire","passage_text":"There are several options for repairing a flat tire: 1  Fix-A-Flat aerosol inflator and similar products. 2  Tire plug (described here).  Take the flat tire to a repair shop for professional evaluation and repair with a inside patch and plug.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":638256,"ranking":15,"query_text":"how to plug a tire","passage_text":"Instructions. Locate the hole in the tire. The tire may still contain a nail or a screw. Mark the hole with a piece of masking tape, and remove the screw or nail with pliers or a vise grip. Push the tire repair tool into the hole a few times to roughen up the hole's edges.The repair tool looks like a round file with a handle.enter the tire plug on the repair tool. The plug is about four inches long and looks like a tar worm. Place the plug on the hole to be repaired so it is centered. Push the plug and repair tool firmly into the hole. Leave 1\/2 inch of the plug sticking outside of the hole. Trim the plug excess with a utility knife.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":6078532,"ranking":16,"query_text":"how to plug a tire","passage_text":"No, your tire doesnâ\u0080\u0099t have lines like that. You have to envision them on the tires. The typical way that a tire is fixed, and itâ\u0080\u0099s completely improper, is to take a plug and just jam it through the tread of the tire and thatâ\u0080\u0099s the end of it. If it doesnâ\u0080\u0099t leak, everything is fine.o the ideal situation is a plug patch. This is both a plug and a patch, and this goes from the inside of the tire to the outside. Itâ\u0080\u0099s pushed through and then you grab it with a pair of pliers and you pull it.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":5738866,"ranking":17,"query_text":"how to plug a tire","passage_text":"Patching a tire can cost $10.00 to $15.00 and plugging can cost as little as $2.00 but usually $5.00. The NHSTA says the proper repair for a punctured tire requires a plug for the hole and patch for the area inside the tire that surrounds the puncture hole.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":2433567,"ranking":18,"query_text":"how to plug a tire","passage_text":"So thatâ\u0080\u0099s the reason you de-mount the tire and you put a special sealant around the plug that keeps air from migrating into the plies of the rubber in the tire. Now granted, you can put a patch in there, but the patch doesnâ\u0080\u0099t seal the outside of the tire, therefore water can get in and rust the steel belts. So the ideal situation is a plug patch. This is both a plug and a patch, and this goes from the inside of the tire to the outside.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":7501076,"ranking":19,"query_text":"how to plug a tire","passage_text":"First, find the tire plug tool from the tire repair kit and thread a string plug into the tip of it. This is the tool that has the hole and slit in the end. Pull a plug string strip from the pack and save the others for other repairs. You can add a little grease to the tool to help the plug slide through.","bm25_label":"high","relevance_label":0.0},{"query_id":372792,"passage_id":3210461,"ranking":20,"query_text":"how to plug a tire","passage_text":"Rating Newest Oldest. Best Answer: If the cause of the flat is in the tread a Walmart Super Center charges $12.00 to dismount the tire and plug the hole from the inside out. Any new car dealership, tire shop or private mechanic can plug a tire. If the puncture is not directly in the tread you'll have to replace the tire.","bm25_label":"high","relevance_label":0.0}]