[{"query_id":384985,"passage_id":7974697,"ranking":1,"query_text":"how to use asa documentation","passage_text":"This document describes how to set up a site-to-site Internet Key Exchange version 2 (IKEv2) tunnel between a Cisco Adaptive Security Appliance (ASA) and a router that runs Cisco IOSÂ® software.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":4549753,"ranking":2,"query_text":"how to use asa documentation","passage_text":"Introduction. This document describes the Average Speed of Answer (ASA) Report Calculation and details the different options that are now available in order to define the ASA value in the Cisco Unified Contact Center and Cisco Unified Intelligent Contact Management (ICM) Enterprise and Hosted environments.ntroduction. This document describes the Average Speed of Answer (ASA) Report Calculation and details the different options that are now available in order to define the ASA value in the Cisco Unified Contact Center and Cisco Unified Intelligent Contact Management (ICM) Enterprise and Hosted environments.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":8764398,"ranking":3,"query_text":"how to use asa documentation","passage_text":"This document explains how to configure an Adaptive Security Appliance (ASA) to communicate with a Microsoft Windows 2008 Network Policy Server (NPS) with the RADIUS protocol so that the legacy Cisco VPN Client\/AnyConnect\/Clientless WebVPN users are authenticated against Active Directory.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":5116558,"ranking":4,"query_text":"how to use asa documentation","passage_text":"Definition of software. : something used or associated with and usually contrasted with hardware: such asa : the entire set of programs, procedures, and related documentation associated with a system and especially a computer system; specifically : computer programsb : materials for use with audiovisual equipment.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7541256,"ranking":5,"query_text":"how to use asa documentation","passage_text":"According to the ASA Style Guide, citations must be used both in-text and at the end of the document in a References section. The citation format will vary depending on the location of the citation and the specific source (i.e. book, journal, website, etc.).","bm25_label":"high","relevance_label":1.0},{"query_id":384985,"passage_id":3540717,"ranking":6,"query_text":"how to use asa documentation","passage_text":"4. Re: Software upgrade Cisco ASA in multiple context mode Juergen Ilse CCNA R&S Feb 24, 2016 7:10 PM (in response to Ismael da Silva Mariano) I think the question was not for specifics of upgrading a failover pair of ASAs (the referenced document in your post would be perfect for this topic) but for a single ASA in multi context mode (which is a ...","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":8413980,"ranking":7,"query_text":"how to use asa documentation","passage_text":"MIPR's are accepted as Direct Cite Basis (Category II) only, we are not authorized to accept reimbursable (Category I) MIPRs. Direct Cite (Category II) acceptance means T-ASA will cite your fund cite directly on all documents needed to support the fulfillment of the MIPR. The requestors funds stay in the commitment stage until a copy of the obligating document, in this case, a contract(s) is received from T-ASA.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7943470,"ranking":8,"query_text":"how to use asa documentation","passage_text":"This document provides examples of basic Network Address Translation (NAT) and Port Address Translation (PAT) configurations on the Cisco Secure Adaptive Security Appliance (ASA) Firewall. This document also provides simplified network diagrams.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7943471,"ranking":9,"query_text":"how to use asa documentation","passage_text":"Introduction. This document provides examples of basic Network Address Translation (NAT) and Port Address Translation (PAT) configurations on the Cisco Secure Adaptive Security Appliance (ASA) Firewall. This document also provides simplified network diagrams.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":2591724,"ranking":10,"query_text":"how to use asa documentation","passage_text":"Aspirin (acetylsalicylic acid, ASA) has a long, remarkable history in the development of useful drugs from herbal or vegetable sources. In ancient times, extracts of willow (Latin: salix) tree bark were used for therapeutic purposes. Early documentation appears on a Sumerian tablet dating from ~2000 BCE.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":3540721,"ranking":11,"query_text":"how to use asa documentation","passage_text":"ASA Clustering Multiple Context Transparent Mode. Some quick template-style notes on deploying clustered ASAs running multiple context mode with transparent contexts. There are some well-documented guides and a few blog posts out there already detailing clustering and transparent-mode firewalls. The purpose of this post is just to dive in to configuration.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7943472,"ranking":12,"query_text":"how to use asa documentation","passage_text":"This document provides examples of basic Network Address Translation (NAT) and Port Address Translation (PAT) configurations on the Cisco Secure Adaptive Security Appliance (ASA) Firewall.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7943474,"ranking":13,"query_text":"how to use asa documentation","passage_text":"Introduction. This document provides examples of basic Network Address Translation (NAT) and Port Address Translation (PAT) configurations on the Cisco Secure Adaptive Security Appliance (ASA) Firewall.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":5169703,"ranking":14,"query_text":"how to use asa documentation","passage_text":"Below from Commission Document #5 (pronounced dead @ 1:25) tippit was pronounced dead at the hospital at 1:15 p.m. asa sees here>. threWarren Commission use that time as time of the shooting because they knew oswld didn't have time to arrive in time of the shooting at 1:07.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":1263711,"ranking":15,"query_text":"how to use asa documentation","passage_text":"Impact of High Average Speed of Answer in the Call Center. Once a comprehensive understanding of how to calculate ASA has been developed, it is important to understand the impact of high ASA in the call center. High ASA can have a profound impact on the customer, agent, team and call center as a whole.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7323325,"ranking":16,"query_text":"how to use asa documentation","passage_text":"Solving ASA Triangles. ASA means Angle, Side, Angle. ASA is when we know two angles and a side between the angles. To solve an ASA Triangle. 1  find the third angle using the three angles add to 180Â°.  then use The Law of Sines to find each of the other two sides.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7375941,"ranking":17,"query_text":"how to use asa documentation","passage_text":"This document updates the â\u0080\u009cPractice Guidelines for Management of the Difficult Airway: An Updated Report by the Task Force on Difficult Airway Management,â\u0080\u009d adopted by the ASA in 2002 and published in 2003.*1.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":7722473,"ranking":18,"query_text":"how to use asa documentation","passage_text":"Film Speed. Film Speed Rating - ISO \/ ASA. All film has a speed rating, whether digital or traditional. You may see this number called ASA or ISO (both indicate the film's rated speed). The ISO \/ ASA rating describes how quickly the film reacts to light.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":1723105,"ranking":19,"query_text":"how to use asa documentation","passage_text":"Hi Everyone, Need to check how many tunnels IPSEC are running over ASA 5520. Tried commands which we use on Routers no luck. Thanks. Mahesh.","bm25_label":"high","relevance_label":0.0},{"query_id":384985,"passage_id":5192873,"ranking":20,"query_text":"how to use asa documentation","passage_text":"Aspirin (ASA). ASA is widely used in the management of acute coronary syndromes (ACSs). Other effects of ASA include anti-inflammation and antioxidation. It is typically used alone or in conjunction with thienopyridines to treat ACSs or prevent stent thrombosis.","bm25_label":"high","relevance_label":0.0}]