[{"query_id":38946,"passage_id":7914413,"ranking":1,"query_text":"average money market interest rates","passage_text":"Money Market Rates. Money Market Rates are tiered and are based on the Average Daily Balance. The interest is paid monthly. Rates are subject to change. Please verify todayâ\u0080\u0099s rates with a Member Advisor.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":4269358,"ranking":2,"query_text":"average money market interest rates","passage_text":"U.S. Average Savings Account Interest Rate. As of April 2016, the national average savings account interest rate is only 0.06 percent for all balances, according to the FDIC â\u0080\u0094 the same as it was before the fed funds rate increase at the end of 2015. The national average money market account interest rate is slightly higher, however. For deposits less than $100,000, the average money market account interest rate is 0.08 percent; for deposits of $100,000 and higher, the rate is 0.12 percent. These rates have remained steady since before the fed funds rate increase in December 2015.","bm25_label":"high","relevance_label":1.0},{"query_id":38946,"passage_id":6629872,"ranking":3,"query_text":"average money market interest rates","passage_text":"money market account (MMA) Special savings-account which pays fluctuating interest rate that, on average, is higher than the interest rate on ordinary savings accounts.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":1032485,"ranking":4,"query_text":"average money market interest rates","passage_text":"Typically based on a particular money market rate or the average interest rate in a particular trading market, different index rates are used for each type of loan. In the United States, for example, the prime rate is the most common factor used to determine interest rates for variable rate loans.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":3888111,"ranking":5,"query_text":"average money market interest rates","passage_text":"Interest Rates Today: The Highest Interest Rates in the World. Checking, savings, money market account and CD interest rates in the U.S. are low. Consider that the average 12-month CD rate is a mere 0.24 percent, according to the FDIC.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":4949609,"ranking":6,"query_text":"average money market interest rates","passage_text":"Interest Rates Today: The Highest Interest Rates in the World Checking, savings, money market account and CD interest rates in the U.S. are low. Consider that the average 12-month CD rate is a mere 0.24 percent, according to the FDIC.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":4949605,"ranking":7,"query_text":"average money market interest rates","passage_text":"Related: Hereâ\u0080\u0099s How the Average Savings Account Interest Rate Compares to Yours. Interest Rates Today: The Highest Interest Rates in the World. Checking, savings, money market account and CD interest rates in the U.S. are low. Consider that the average 12-month CD rate is a mere 0.24 percent, according to the FDIC.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":4071248,"ranking":8,"query_text":"average money market interest rates","passage_text":"U.S. Average Savings Account Interest Rate. As of April 2016, the national average savings account interest rate is only 0.06 percent for all balances, according to the FDIC â\u0080\u0094 the same as it was before the fed funds rate increase at the end of 2015. The national average money market account interest rate is slightly higher, however.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":7403877,"ranking":9,"query_text":"average money market interest rates","passage_text":"Average Bank Interest Rates in 2017: Checking, Savings, Money Market, and CD Rates. When you put money in a bank, you'll find that you earn different interest rates based on the type of deposit account you open and the institution you do business with.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":4045619,"ranking":10,"query_text":"average money market interest rates","passage_text":"The average money market account interest rate was 0.08 percent during 2014 and 2015. The average one-year certificate of deposit interest rate was 0.20 percent and rose to 0.21 percent in December 2015. The average five-year CD interest rate was between 0.78 percent and 0.79 percent during 2014 and 2015.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":7914419,"ranking":11,"query_text":"average money market interest rates","passage_text":"From 2010 to 2011, money market deposit account rates hovered at a level just narrowly above standard savings account rates, with interest levels for money market accounts during the week of Feb. 8, 2010 averaging just 1.4 percent.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":1531380,"ranking":12,"query_text":"average money market interest rates","passage_text":"Jumbo Money Market Jumbo Money Market Accounts come with higher minimum initial deposit and minimum balance requirements, but can sometimes be a great way to safely reach for extra yield on your cash. Jumbo Money Market Account interest rates are regularly twice as much (on average) as standard, non-Jumbo, Money Market rates. The Money Market instrument is very similar to a savings account in that it serves as an easily accessible account that bears interest and is insured by the financial institution (every institution listed on DepositAccounts is backed by the FDIC or NCUA).","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":1351708,"ranking":13,"query_text":"average money market interest rates","passage_text":"Savings and money market accounts today offer an average interest rate of only 0.44%, according to Bankrate, but the good news for savers is that rising interest rates should buoy yields across the board.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":1218707,"ranking":14,"query_text":"average money market interest rates","passage_text":"However, the capital market depends upon the nature of and the conditions in the money market. The short-term interest rates of the money market influence the long-term interest rates of the capital market.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":8100066,"ranking":15,"query_text":"average money market interest rates","passage_text":"Unfortunately, even the best money market accounts havenâ\u0080\u0099t been immune to sinking interest rates. According to Bankrate, the average MMA interest rate has sunk from 0.52% at the beginning of 2012 to 0.26% in 2016.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":7914417,"ranking":16,"query_text":"average money market interest rates","passage_text":"As of March 23, 2011, the average rate of interest on money market bank accounts, taken from a sampling of 13, was approximately 1.6 percent. However, low rates of return had been the norm for money market bank accounts even before the country's economic downturn late in the 2000s.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":7914414,"ranking":17,"query_text":"average money market interest rates","passage_text":"The average prime rate for the decade 2001 to 2010 was 5.4 percent, as compared to 7.8 percent during the previous decade. When this figure begins to rebound, the average money market interest rate should respond accordingly.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":8100065,"ranking":18,"query_text":"average money market interest rates","passage_text":"How I Picked the Best Money Market Accounts for 2018 Most savers choose a money market account instead of a savings account because they want a higher interest rate. Looking for MMAs with rates significantly higher than the national average effectively limited my search to online banks.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":5820166,"ranking":19,"query_text":"average money market interest rates","passage_text":"Both the interest rates of the interbank money market and the retail lending and deposit rates will be made available in the interest rates and yields area.In addition, data on the current yields of domestic issuers' debt securities and on the yield curve in the German bond market will be presented.oth the interest rates of the interbank money market and the retail lending and deposit rates will be made available in the interest rates and yields area.","bm25_label":"high","relevance_label":0.0},{"query_id":38946,"passage_id":5804543,"ranking":20,"query_text":"average money market interest rates","passage_text":"For the type of mutual fund, see Money market fund. A money market account (MMA) or money market deposit account (MMDA) is a non-financial account that pays interest based on current interest rates in the money markets.oney market accounts typically have a relatively high rate of interest and require a higher minimum balance (anywhere from $1,000 to $10,000 or $25,000) to earn interest or avoid monthly fees.","bm25_label":"high","relevance_label":0.0}]