[{"query_id":393954,"passage_id":5811670,"ranking":1,"query_text":"in what county is honea path sc","passage_text":"Honea Path Genealogy (in Anderson County, SC) USA (603,054) > South Carolina (6,728) > Anderson County (346) > Honea Path (11) Note: This page primarily lists records kept at the city level. Additional records are listed on the county and state pages.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439298,"ranking":2,"query_text":"in what county is honea path sc","passage_text":"Major cities near Honea Path, SC. This is a list of large cities closest to Honea Path, SC. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Honea Path, SC. 103 miles to Charlotte, NC.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439294,"ranking":3,"query_text":"in what county is honea path sc","passage_text":"This is a list of large cities closest to Honea Path, SC. A big city usually has a population of at least 200,000 and you can often fly into a major airport. If you need to book a flight, search for the nearest airport to Honea Path, SC. 1  103 miles to Charlotte, NC.  124 miles to Atlanta, GA.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439299,"ranking":4,"query_text":"in what county is honea path sc","passage_text":"Distance, Gas Consumption and Emission Notes. Distance from Columbia, SC to Honea Path, SC is 98Miles or 158 Km. You can get this distance about 1 hour 40 mins. If you want to planning travel with plane for 84 Miles or 135 Km, You can get this distance about 40 mins . A car with an average MPG will needs 4.54 gallons of gas to get the route between these points. The estimated cost of gas to get between Columbia, SC and Honea Path, SC is $10.31.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":5811671,"ranking":5,"query_text":"in what county is honea path sc","passage_text":"Honea Path â\u0080\u0093 South Carolina. Honea Path, which dates from 1794, is located primarily in Anderson County but partially in Abbeville County. Residents of the town pronounce the word honey-uh. The origin of this unusual name is unclear. Old documents and maps sometimes identify the area as Honea Path and sometimes as Honey Path.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":5811673,"ranking":6,"query_text":"in what county is honea path sc","passage_text":"Honea Path, South Carolina. Honea Path is a town primarily in Anderson County, South Carolina and extending into Abbeville County in the northwest part of the state. The population was 3,597 at the 2010 census. Contents.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":5811666,"ranking":7,"query_text":"in what county is honea path sc","passage_text":"Watkins Community Center houses Town Hall, Honea Path Arts Center, Honea Path Museum, Tri County Technical College Senator Billy O'Dell Learning Center, Watkins Center All Purpose Room and Anderson County Magistrate's Office.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439297,"ranking":8,"query_text":"in what county is honea path sc","passage_text":"Distance, Gas Consumption and Emission Notes. Distance from Honea Path, SC to Charleston, SC is 209Miles or 336 Km. You can get this distance about 3 hours 17 mins. If you want to planning travel with plane for 183 Miles or 295 Km, You can get this distance about 53 mins . A car with an average MPG will needs 9.68 gallons of gas to get the route between these points. The estimated cost of gas to get between Honea Path, SC and Charleston, SC is $21.97. During the route, an average car will release 189.65 pounds of CO2 to the atmosphere. Your carbon footprint is 0.91 pounds of CO2 per mile.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439291,"ranking":9,"query_text":"in what county is honea path sc","passage_text":"Berea, SC. Wade Hampton, SC. The center of each city listed is within 35 miles of Honea Path, SC. Scroll down the page to find a list of big cities if you're booking a flight between airports, or a list of smaller surrounding towns if you're doing a road trip.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":7673045,"ranking":10,"query_text":"in what county is honea path sc","passage_text":"Search the Town of Honea Path, public records using best found research sources online. This Town zip code is 29654 with a total population of 3,597. Look up recorded information of Honea Path, including demographics and local economy. Link to all levels of Honea Path, government and their sites with services which provide public information. Current economy, business and housing data. Read about up to date current events and what is occurring in the Town of Honea Path.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":7673048,"ranking":11,"query_text":"in what county is honea path sc","passage_text":"Looking for rural homes and land for sale in Honea Path, Anderson County, South Carolina? LandWatch.com has thousands of rural properties in Honea Path, Anderson County, South Carolina, including hunting & fishing properties, cabins, Land for sale and land auctions. Choose from small acreage lots to massive 500+ acre estates.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":7673049,"ranking":12,"query_text":"in what county is honea path sc","passage_text":"You can also find Honea Path, Anderson County, South Carolina real estate agents who specialize in land and rural retreats. Sign up for our Honea Path, Anderson County, South Carolina email alerts and never miss out on a new listing again! Subscribe to this search for updates RSS Feed.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439295,"ranking":13,"query_text":"in what county is honea path sc","passage_text":"3 hours 17 mins. Distance from Honea Path, SC to Charleston, SC is 209Miles or 336 Km. You can get this distance about 3 hours 17 mins. If you want to planning travel with plane for 183 Miles or 295 Km, You can get this distance about 53 mins .","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439296,"ranking":14,"query_text":"in what county is honea path sc","passage_text":"1 hour 40 mins. Distance from Columbia, SC to Honea Path, SC is 98Miles or 158 Km. You can get this distance about 1 hour 40 mins. If you want to planning travel with plane for 84 Miles or 135 Km, You can get this distance about 40 mins .","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":7673043,"ranking":15,"query_text":"in what county is honea path sc","passage_text":"Honea Path is a town primarily in Anderson County, South Carolina and extending into Abbeville County in the northwest part of the state. The population was 3,597 at the 2010 census.","bm25_label":"high","relevance_label":1.0},{"query_id":393954,"passage_id":7673047,"ranking":16,"query_text":"in what county is honea path sc","passage_text":"Honea Path, Anderson County, South Carolina $75,500. This lovely country home sits on an FHA approved foundation and 2.47 acres.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":3439292,"ranking":17,"query_text":"in what county is honea path sc","passage_text":"Honea Path is a town in Abbeville and Anderson counties in the U.S. state of South Carolina. The population was 3,504 at the 2000 census. Honea Path is located at 34Â°26â\u0080²51â\u0080³N 82Â°23â\u0080²35â\u0080³W \/ 34.4475Â°N 82.39306Â°W \/ 34.4475; -82.39306 (34.447400, -82.393044). According to the United States Census Bureau, the town has a total area of 3.5 square miles (9.0 kmÂ²), all land.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":7673041,"ranking":18,"query_text":"in what county is honea path sc","passage_text":"Drinking water stations with addresses in Honea Path that have no violations reported: 1  HONEA PATH TOWN OF (0410003) (Population served: 4,195, Primary Water Source Type: Purch surface water). 2  BELTON-HONEA PATH W\/A (0410011) (Population served: 1,746, Primary Water Source Type: Surface water).","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":5811672,"ranking":19,"query_text":"in what county is honea path sc","passage_text":"Town of Honea Path has a lot to offer - whether you live in, work or visit our community. Located in the Upstate of South Carolina, Honea Path is known for its historic homes, marvelous climate, lovely countryside and friendly residents.","bm25_label":"high","relevance_label":0.0},{"query_id":393954,"passage_id":5811674,"ranking":20,"query_text":"in what county is honea path sc","passage_text":"Church minutes, 1869-1955 (First Baptist Church (Honea Path, South Carolina)) Family History Library. Minutes of meetings and lists of members, 1869-1955 (First Baptist Church (Honea Path, South Carolina)) Family History Library.","bm25_label":"high","relevance_label":0.0}]