[{"query_id":401878,"passage_id":7404506,"ranking":1,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Best Answer: Several state supreme courts have ruled that the 12-step program of Alcoholics Anonymous constitues religious practice and bars the court system from ordering people guilty of alcohol related crimes to attend. You may then deduct your donations to A.A. just as you may deduct tithes to a church.nless you have written proof of the contributions. You may be able to deduct mileage if you are itemizing medical costs. You can use mileage for any medical expences like Dr. visits and Pharmacy trips. Things like that. The mileage rate is different than for business though. Your tax preparer will know.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":3564949,"ranking":2,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Tax Deductible Rehab Services. On the bright side, fees charged by residential therapy centers are often tax-deductible as a medical expense. If you have paid drug or alcohol rehabilitation expenses for yourself, your spouse or your dependent, these expenses are most likely tax deductible.RS Publication 502 includes a detailed list of the types of medical expenses you can deduct. These expenses, as they pertain to alcohol and drug addiction rehab, include: 1  Payments of fees to doctors, psychiatrists, psychologists and nontraditional medical practitioners.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":151708,"ranking":3,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Share this conversation. Expert: RD replied 7 years ago. You can deduct drug rehab expenses on your tax return as medical expenses on sch A, if you itemize if these expenses are in connection with alcohol or drug treatment programs.Medical expense are deductible to the extent they are over 7.5 % of the adjusted gross income as itemized deductions.Link to addtl info.ou can deduct drug rehab expenses on your tax return as medical expenses on sch A, if you itemize if these expenses are in connection with alcohol or drug treatment programs.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":151711,"ranking":4,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Treatment for drug and alcohol addiction can be tax deductible if it meets the IRS requirements. Please consult with your accountant or a tax expert to make sure you personally qualify for these deductions and that you submit all the required information to the IRS correctly.lthough your tax professional is best qualified to determine whether or not your rehab expenses are tax deductible, donâ\u0080\u0099t let your tax situation be the deciding factor in your decision to get help. If you need drug rehab and youâ\u0080\u0099re wondering if it is tax deductible, the time to learn more is now.","bm25_label":"high","relevance_label":1.0},{"query_id":401878,"passage_id":7755122,"ranking":5,"query_text":"is alcoholics anonymous tax deductible","passage_text":"12 Steps of Alcoholics Anonymous. Custom 12 Steps of Alcoholics Anonymous Essay Writing Service || 12 Steps of Alcoholics Anonymous Essay samples, help. In this short essay, I discuss about my attendance to alcoholics anonymous meetings. From my understanding, alcoholics anonymous meetings are attended by groups of alcoholic men and women who sit together and share their experiences and hopes (Kurtz, 1991).","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":7755127,"ranking":6,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Alcoholism and Drinking - Alcoholics Anonymous as an Important Literary Work - Alcoholics Anonymous as an Important Literary Work Alcoholics Anonymous is one of the great unrecognized literary works of the first half of the twentieth century.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":151710,"ranking":7,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Tax Deductible Rehab Services. On the bright side, fees charged by residential therapy centers are often tax-deductible as a medical expense. If you have paid drug or alcohol rehabilitation expenses for yourself, your spouse or your dependent, these expenses are most likely tax deductible.lthough your tax professional is best qualified to determine whether or not your rehab expenses are tax deductible, donâ\u0080\u0099t let your tax situation be the deciding factor in your decision to get help. If you need drug rehab and youâ\u0080\u0099re wondering if it is tax deductible, the time to learn more is now.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":5207247,"ranking":8,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Alcoholics Anonymous: Historical Data: The Birth of A.A. and its growth in U.S.\/Canada Alcoholics Anonymous: This Is A.A. Akron Intergroup Council of Alcoholics Anonymous: Celebrate Foundersâ\u0080\u0099 Day!","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":3908684,"ranking":9,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Search The Big Book HERE. Not associated with or connected to or related to\/with Alcoholics Anonymous, to\/with Alcoholics Anonymous World Services Inc.. This site does not represent Alcoholics Anonymous in any way shape or form.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":8572675,"ranking":10,"query_text":"is alcoholics anonymous tax deductible","passage_text":"AA is Alcoholics Anonymous or African-American or Automobile Association. The definition of AA is Alcoholics Anonymous or African-American or Automobile Association. AA means Alcoholics Anonymous or African-American or Automobile Association. So now you know - AA means Alcoholics Anonymous or African-American or Automobile Association - don't thank us.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":5207245,"ranking":11,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Alcoholics Anonymous: Historical Data: The Birth of A.A. and its growth in U.S.\/Canada; Alcoholics Anonymous: This Is A.A. Akron Intergroup Council of Alcoholics Anonymous: Celebrate Foundersâ\u0080\u0099 Day! Time: Bill W.: The Healer","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":513851,"ranking":12,"query_text":"is alcoholics anonymous tax deductible","passage_text":"See all results for big book on cd. 1  Joe and Charlie Big Book Study on 11 CDs with Handouts - Alcoholics Anonymous 12 Steps1998 | Audiobook. by Joe & Charlie. 2  Alcoholics Anonymous Big Book on Audio CD - 4th Edition, Abridged2009. by Alcoholics Anonymous World Services Inc and Alcoholics Anonymous World Services.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":3564948,"ranking":13,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Share this conversation. Expert: RD replied 7 years ago. You can deduct drug rehab expenses on your tax return as medical expenses on sch A, if you itemize if these expenses are in connection with alcohol or drug treatment programs.Medical expense are deductible to the extent they are over 7.5 % of the adjusted gross income as itemized deductions.Link to addtl info.hare this conversation. Expert: RD replied 7 years ago. You can deduct drug rehab expenses on your tax return as medical expenses on sch A, if you itemize if these expenses are in connection with alcohol or drug treatment programs.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":151709,"ranking":14,"query_text":"is alcoholics anonymous tax deductible","passage_text":"As of right now, there are ways to claim the cost of drug and alcohol rehab on your tax return â\u0080\u0093 as long as you itemize your deductions on Schedule A. In fact, any medical and dental cost is deductible in the same way, as long as it exceeds more than 7.5 percent of your adjusted gross income for the year.f you would like assistance filing your taxes in a year that you pay for drug and alcohol rehab, tax accountants can help. If you are seeking a drug rehab for yourself or your loved one, we can assist you.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":151712,"ranking":15,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Inpatient drug rehab typically includes fees for room, board and other expenses. Both drug and alcohol addiction treatment are tax deductible. IRS Publication 502 includes a detailed list of the types of medical expenses you can deduct.lthough your tax professional is best qualified to determine whether or not your rehab expenses are tax deductible, donâ\u0080\u0099t let your tax situation be the deciding factor in your decision to get help. If you need drug rehab and youâ\u0080\u0099re wondering if it is tax deductible, the time to learn more is now.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":2618625,"ranking":16,"query_text":"is alcoholics anonymous tax deductible","passage_text":"History of Alcoholics Anonymous. Alcoholics Anonymous (AA) was founded in 1935 by Bill Wilson (known as Bill W.) and Dr. Robert Smith (known as Dr. Bob). Subsequently, The history of Alcoholics Anonymous (AA) has been documented in books, movies, and AA literature.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":7755120,"ranking":17,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Alcoholics Anonymous World Services, Inc. All Rights Reserved. This is the Online Store web site of the General Service Office (G.S.O.) of Alcoholics Anonymous. Graphic images may not be downloaded, copied or duplicated without the express written permission of Alcoholics Anonymous World Services, Inc..","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":7474927,"ranking":18,"query_text":"is alcoholics anonymous tax deductible","passage_text":"Does Alcoholics Anonymous really work? Does Alcoholics Anonymous really work? As Alcoholics Anonymous, the most prevalent alcohol-abuse treatment method in the United States, and the 12-step model come under new scrutiny, Chris Hayes presides over a vigorous debate over the efficacy of AA and its place in our culture. ... more Duration: {{video.duration.momentjs}}.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":3258233,"ranking":19,"query_text":"is alcoholics anonymous tax deductible","passage_text":"The Big Book serves as the basis of Alcoholics Anonymous (AA). It contains the 12 steps that are at the core of the Alcoholics Anonymous program, as well as stories about alcoholics who have been through the recovery process.","bm25_label":"high","relevance_label":0.0},{"query_id":401878,"passage_id":5207243,"ranking":20,"query_text":"is alcoholics anonymous tax deductible","passage_text":"On This Day: Alcoholics Anonymous Founded. On June 10, 1935, Bill Wilson and his friend Dr. Robert Smith set out to find the best way to reform alcoholics, and Alcoholics Anonymous was born.","bm25_label":"high","relevance_label":0.0}]