[{"query_id":405737,"passage_id":7575867,"ranking":1,"query_text":"is cefepime a cephalosporin","passage_text":"[Cefepime (maxipime), large spectrum 4th generation cephalosporin, resistant to beta-lactamases]. Angelescu M, Apostol A. As a result of the appearance of bacterial strains resistant to 3rd generation cephlosporin, since 1993 cephalosporins of 4th generation have been developed and introduced in therapy; among them are: cefepime and cefpirome.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":7575861,"ranking":2,"query_text":"is cefepime a cephalosporin","passage_text":"Cefepime is a Cephalosporin with activity against both Gram-positive and Gram-negative aerobic bacteria. In common with other Î²-lactam agents, cefepime exerts its antibacterial effects by binding to penicillin-binding proteins.","bm25_label":"high","relevance_label":1.0},{"query_id":405737,"passage_id":7575864,"ranking":3,"query_text":"is cefepime a cephalosporin","passage_text":"Summary. 1  Cefepime is a new parenteral cephalosporin with antimicrobial activity similar to third-generation cephalosporins. It acts against the Enterobacteriaceae family, and Pseudomonas aeruginosa, but maintains Gram-positive activity similar to that of first- or second-generation cephalosporins.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":7575868,"ranking":4,"query_text":"is cefepime a cephalosporin","passage_text":"Cefepime is a â\u0080\u0098fourthâ\u0080\u0099 generation Cephalosporin that has a broader spectrum of antibacterial activity than the third generation Cephalosporins and is more active in vitro against Gram-positive aerobic bacteria.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":7575863,"ranking":5,"query_text":"is cefepime a cephalosporin","passage_text":"FDA ALERT [06\/17\/2009]: The purpose of this communication is to share information about the FDAâ\u0080\u0099s continuing safety review about the potential increased mortality in patients treated with cefepime. Cefepime is a cephalosporin antibacterial and is a member of the Î²â\u0080\u0093lactam class of antibacterial drugs. Cefepime is currently approved for the treatment of a variety of infections due to susceptible strains of microorganisms.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":7575865,"ranking":6,"query_text":"is cefepime a cephalosporin","passage_text":"Cefepime has a tolerability profile similar to that of other parenteral Cephalosporins; adverse events are primarily gastrointestinal in nature. A total of 1.4 and 2.9% of patients receiving cefepime â\u0089¤2 g\/day and =2 g\/day, respectively, required treatment withdrawal as a result of any adverse event.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":7575862,"ranking":7,"query_text":"is cefepime a cephalosporin","passage_text":"Barbhaiya RH, Knupp CA, Forgue ST, Matzke GR, Guay DRP, et al. Pharmacokinetics of cefepime in subjects with renal insufficiency. Barbhaiya RH, Knupp CA, Forgue ST, Matzke GR, Halstenson CE, et al. Disposition of the cephalosporin cefepime in normal and renally impaired subjects.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":4435708,"ranking":8,"query_text":"is cefepime a cephalosporin","passage_text":"Cytokines (growth factors) are used to stimulate production of neutrophils by acting on precursor cells. In cases of neutropenia, third-generation cephalosporins (eg, ceftazidime, cefepime) with or without gentamicin are used as first-line therapy. Imipenem-cilastatin and meropenem can be substituted for cephalosporins.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":2281108,"ranking":9,"query_text":"is cefepime a cephalosporin","passage_text":"1 Cefepime, a fourth-generation cephalosporin from the Î²-Lactam antibiotic class. 2  Imipenem (carbapenems) is often the antibiotic of choice. 3  Aminoglycosides such as amikacin have been found to be very effective, as well.  Quinolones can be an effective alternative.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":4507019,"ranking":10,"query_text":"is cefepime a cephalosporin","passage_text":"These researchers described the elevated cefepime MIC as being due to the combined effect of SHV-5 hyperproduction and decreased outer membrane permeability (loss of 36-kDa outer membrane protein [OMP]) (13). Cefepime MIC as a predictor of the extended-spectrum [beta]-lactamase type in Klebsiella pneumoniae, Taiwan.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":7575866,"ranking":11,"query_text":"is cefepime a cephalosporin","passage_text":"Cefepime is prescribed for Infection and Pneumonia and is mostly mentioned together with these indications. Cephalexin is prescribed for Infection and UTI and is mostly mentioned together with these indications.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":244016,"ranking":12,"query_text":"is cefepime a cephalosporin","passage_text":"Each time the structure changes, a new generation of cephalosporins are made. So far there are five generations of cephalosporins. All cephalosporins start with cef, ceph, or kef. Third generation cephalosporins followed the second generation cephalosporins.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":8054693,"ranking":13,"query_text":"is cefepime a cephalosporin","passage_text":"Penicillin and ampicillin c. Gentamicin and tobramycin b. Vancomycin and bacitracin d. Cefazolin and cefepime ANS: C Although numerous antibiotics can produce nephrotoxic ATN, the aminoglycosides (gentamicin, tobramycin) are the major culprits.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":6471849,"ranking":14,"query_text":"is cefepime a cephalosporin","passage_text":"Antibiotics that cover Pseudomonas aeruginosa: 1  Aminoglycosides. 2  Carbapenems. 3  Ceftazidime (3rd generation)  Cefepime (4th 1  generation) Ceftobiprole (5th generation) 2  Fluoroquinolones. Piperacillin\/tazobactam.  Ticarcillin\/clavulanic acid.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":244011,"ranking":15,"query_text":"is cefepime a cephalosporin","passage_text":"Third generation cephalosporins. What are Third generation cephalosporins. Cephalosporins are a large group of antibiotics derived from the mold Acremonium (previously called Cephalosporium). This mold yielded three main compounds, historically called Cephalosporin N and C, and P, from which the first cephalosporins were derived.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":3354309,"ranking":16,"query_text":"is cefepime a cephalosporin","passage_text":"First generation cephalosporins. What are First generation cephalosporins. Cephalosporins are a group of broad spectrum, semi-synthetic beta-lactam antibiotics derived from the mould Cephalosporium. They are divided into three groups: Cephalosporin N and C are chemically related to penicillins and Cephalosporin P a steroid antibiotic resembles fusidic acid.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":2659077,"ranking":17,"query_text":"is cefepime a cephalosporin","passage_text":"For people who are suspected to have infection with Pseudomona aeruginosa, a different combination of drugs is preferred. For the beta lactam, the drugs peracillin-tazobactam (Zosyn), cefepime, imipenem or meropenem are recommended, in combination with either ciprofloxacin (Cipro) or levofloxacin (Levaquin).","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":136073,"ranking":18,"query_text":"is cefepime a cephalosporin","passage_text":"For example, the fourth generation of cephalosporins is not recognized as such in Japan. In Japan, cefaclor is classed as a first-generation cephalosporin, though in the United States it is a second-generation one; and cefbuperazone, cefminox, and cefotetan are classed as second-generation cephalosporins.ephalosporins are sometimes grouped into generations by their antimicrobial properties. The first cephalosporins were designated first-generation cephalosporins, whereas, later, more extended-spectrum cephalosporins were classified as second-generation cephalosporins.","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":287717,"ranking":19,"query_text":"is cefepime a cephalosporin","passage_text":"A Î²-lactam (cefotaxime, ceftriaxone, or ampicillin-sulbactam) PLUS. Either azithromycin. OR. A respiratory fluoroquinolone (levofloxacin [750 mg], moxifloxacin, or gemifloxacin) If Pseudomonas is a consideration: An antipneumococcal, antipseudomonal Î²-lactam (piperacillin-tazobactam, cefepime, imipenem, or meropenem) PLUS","bm25_label":"high","relevance_label":0.0},{"query_id":405737,"passage_id":267923,"ranking":20,"query_text":"is cefepime a cephalosporin","passage_text":"Cephalosporins are grouped based on their antibacterial properties and when they were introduced: 2. 1  First generation cephalosporins include cephalexin and cefazolin. 2  Second generation cephalosporins include cefaclor, cefuroxime and cefoxitin. 3  Ceftriaxone is a third generation cephalosporin.","bm25_label":"high","relevance_label":0.0}]