[{"query_id":406181,"passage_id":7436156,"ranking":1,"query_text":"is china a reserve currency","passage_text":"Foreign-exchange reserves of China. The foreign-exchange reserves of China are the People's Republic of China holdings of cash, bank deposits, bonds, and other financial assets denominated in currencies other than China's national currency (renminbi).","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":854939,"ranking":2,"query_text":"is china a reserve currency","passage_text":"For the reasons outlined by Pettis, China â\u0080\u0093 which has the worldâ\u0080\u0099s 2nd biggest economy (or 1st â\u0080¦ depending on the measure used) â\u0080\u0093 doesnâ\u0080\u0099t want the burden of housing the worldâ\u0080\u0099s reserve currency. As such, China is pushing for a basket of currencies to replace the dollar as reserve currency.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":7436157,"ranking":3,"query_text":"is china a reserve currency","passage_text":"Reserve Currency from Bretton Woods to China's Yuan. A reserve currency is a currency held in significant quantities by many governments and institutions as a means of international payment. While this used to consist of mostly gold and silver, 1944's Bretton Woods system expanded acceptable reserves to include the U.S. dollar and other currencies.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":2173175,"ranking":4,"query_text":"is china a reserve currency","passage_text":"Chinese Currency Named as a World Reserve Christine Lagarde, the managing director of the International Monetary Fund, announces that China's renminbi will become a world reserve currency alongside the dollar, euro, pound and yen.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":7436158,"ranking":5,"query_text":"is china a reserve currency","passage_text":"But the U.S. dollar isn't likely to be the world's reserve currency forever. The euro has become increasingly popular as a reserve currency. China is already the largest creditor, and may soon become the largest exporter in the world.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":1917490,"ranking":6,"query_text":"is china a reserve currency","passage_text":"Definition: Foreign Currency Reserves (Forex Reserves). This is the amount of foreign currency reserves that are held by the Central Bank of a country. In general use, foreign currency reserves also include gold and IMF reserves.ctually, the Chinese have been trying to keep the Yuan undervalued by selling Yuan and buying Dollars. This is why China has so many Dollar reserves. In a fixed exchange rate, foreign currency reserves can play an important role in trying to keep a target exchange rate.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":286486,"ranking":7,"query_text":"is china a reserve currency","passage_text":"At the same time, this policy costs China as well. China has an inflation problem that is exacerbated by its artificial currency exchange rate. The exchange rate, and the position of the U.S. dollar as a global reserve currency, allows us to effectively export inflation.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":2982756,"ranking":8,"query_text":"is china a reserve currency","passage_text":"A large portion of China's reserves are held in U.S. Treasuries. The decline in reserves has quickened following China's near 2 percent devaluation of the yuan on Aug. 11, which stoked fresh concerns about the economy and heavy selling of the currency.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":4850904,"ranking":9,"query_text":"is china a reserve currency","passage_text":"International Business. Chinaâ\u0080\u0099s Renminbi Is Approved by I.M.F. as a Main World Currency. Chinese Currency Named as a World Reserve. Christine Lagarde, the managing director of the International Monetary Fund, announces that China's renminbi will become a world reserve currency alongside the dollar, euro, pound and yen. By REUTERS on Publish Date November 30, 2015.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":2723260,"ranking":10,"query_text":"is china a reserve currency","passage_text":"As Chovanec saw it, China's central bank has three main options: The central bank defends the currency. China sets an exchange price that its economists believe is defensible against outside speculation, and then the bank uses its considerable (but decreasing) foreign currency reserves to fix that price.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":5520925,"ranking":11,"query_text":"is china a reserve currency","passage_text":"The dollar is very susceptible to losing its vaunted reserve currency position by the first major trading country that stops inflating its currency. There is evidence that China understands what is at stake; it has increased its gold holdings and has instituted controls to prevent gold from leaving China.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":3045383,"ranking":12,"query_text":"is china a reserve currency","passage_text":"We use the term â\u0080\u009creserve currencyâ\u0080\u009d when referring to the common use of the dollar by other countries when settling their international trade accounts. For example, if Canada buys goods from China, it may pay China in US dollars rather than Canadian dollars, and vice versa.here may be other currencies that are in demand for trade settlement by other international companies as well. In spite of all this, one factor that has helped the dollar retain its reserve currency demand is that the other currencies have been inflated, too.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":2982761,"ranking":13,"query_text":"is china a reserve currency","passage_text":"China forex reserves slump by record $93.9B in August. China's foreign exchange reserves posted their biggest monthly fall on record in August, reflecting Beijing's attempts to halt a slide in the yuan and stabilize financial markets following its surprise move to devalue the currency last month.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":4758003,"ranking":14,"query_text":"is china a reserve currency","passage_text":"Without foreign currency reserves, the value of the dollar today would be much lower. For example, many Congressmen accuse China of manipulating its currency, the yuan. They want China to let the yuan's value rise, so the exporters in their states can be more competitive. However, this would be disastrous to most of us.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":1480064,"ranking":15,"query_text":"is china a reserve currency","passage_text":"Here are three reasons why: 1  The dollar is the world's reserve currency. 2  Some countries, like China and Japan, export a lot to the United States. 3  China and Japan also like to keep buying dollars.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":3045387,"ranking":16,"query_text":"is china a reserve currency","passage_text":"The dollar is very susceptible to losing its vaunted reserve currency position by the first major trading country that stops inflating its currency. There is evidence that China understands what is at stake; it has increased its gold holdings and has instituted controls to prevent gold from leaving China.here may be other currencies that are in demand for trade settlement by other international companies as well. In spite of all this, one factor that has helped the dollar retain its reserve currency demand is that the other currencies have been inflated, too.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":4850903,"ranking":17,"query_text":"is china a reserve currency","passage_text":"MAULDIN: Bitcoin 2.0 has a better chance of becoming the world's reserve currency than China's yuan. The Chinese renminbi has been recently included in the IMFâ\u0080\u0099s reserve currency basket, which previously consisted of the US dollar, the euro, the British pound, and the Japanese yen. These currencies represent the developed worldâ\u0080\u0099s most stable economies, so having the renminbi among them is a nice compliment to Beijing.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":7204865,"ranking":18,"query_text":"is china a reserve currency","passage_text":"â\u0080\u009cIt is a historic moment in international finance for an emerging market economy, with a per-capita income barely a quarter that of other reserve currency economies, to be anointed as the issuer of one of the worldâ\u0080\u0099s major reserve currencies,â\u0080\u009d said Eswar Prasad, a former head of the I.M.F.â\u0080\u0099s China division who is now the Tolani Senior Professor of Trade Policy at Cornell University.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":4850897,"ranking":19,"query_text":"is china a reserve currency","passage_text":"When we talk about the US dollar being the worldâ\u0080\u0099s reserve currency, what we really mean is that the bulk of global trade is denominated in dollars. And yes, China is doing one bilateral agreement after another in order to trade in its own currency.","bm25_label":"medium","relevance_label":0.0},{"query_id":406181,"passage_id":3264145,"ranking":20,"query_text":"is china a reserve currency","passage_text":"Influence the exchange Rate. With large foreign exchange reserves, a country can target a certain exchange rate. For example, suppose China wanted to increase the value of its currency the Yuan.China could sell itâ\u0080\u0099s dollar reserves to buy Yuan on the foreign exchange markets. The increased demand for Yuan would appreciate the Yuan. The problem with holding foreign currency reserves is that they can lose their value. 2  Inflation erodes the value of currencies not fixed against gold (fiat exchange rates). 3  Therefore, a Central Bank will need to keep buying foreign reserves to maintain the same purchasing power in markets.","bm25_label":"medium","relevance_label":0.0}]