[{"query_id":406205,"passage_id":7508547,"ranking":1,"query_text":"is chinese white watercolor transparent","passage_text":"Florida Artist John Bowen increases his palette of colors and adds texture to his paintings by mixing zinc white gouache with his transparent watercolors. by M. Stephen Doherty. Many watercolorists avoid using Chinese white or zinc white gouache with their transparent watercolors because they think they might appear to be lazy or breaking rules.","bm25_label":"high","relevance_label":1.0},{"query_id":406205,"passage_id":7508552,"ranking":2,"query_text":"is chinese white watercolor transparent","passage_text":"Florida Artist John Bowen increases his palette of colors and adds texture to his paintings by mixing zinc white gouache with his transparent watercolors. Many watercolorists avoid using Chinese white or zinc white gouache with their transparent watercolors because they think they might appear to be lazy or breaking rules. But there are just as many artists who like expanding their range of creative options by changing the physical appearance of their paints with the addition of opaque white paints.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":8545102,"ranking":3,"query_text":"is chinese white watercolor transparent","passage_text":"Transparent is just as the word describes. Transparent watercolors allow the light to shine through to the watercolor paper and in turn lets the white of the paper reflect back. The colors look clean, crisp, and appear to glow.ransparent is just as the word describes. Transparent watercolors allow the light to shine through to the watercolor paper and in turn lets the white of the paper reflect back. The colors look clean, crisp, and appear to glow.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":2419796,"ranking":4,"query_text":"is chinese white watercolor transparent","passage_text":"- Keep in mind that opaque watercolor looks very different from transparent watercolor. Opaque watercolor has a matte, velvet-like quality and looks much like a gouache painting. - With transparent watercolor, colors are lightened with water, whereas with opaque watercolor, colors are lightened with white gouache.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":6208827,"ranking":5,"query_text":"is chinese white watercolor transparent","passage_text":"Watercolor paint is transparent, and the white of the ground (paper) underneath provides light that shines through the painting. Second, a watercolor is what we call a painting created with watercolors. Finally, watercolor can also be used as a verb. To watercolor describes painting with watercolors.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":2419798,"ranking":6,"query_text":"is chinese white watercolor transparent","passage_text":"With opaque watercolor, paint is used for the paintingâ\u0080\u0099s whites. - Just as it is with transparent watercolor, in opaque watercolor the artist must be in total control of the water-pigment ratio in his brush, on his painting, and on the palette. In both transparent and opaque watercolor, too much water if often the enemy as it can easily lead to mud. - Techniques: There are no â\u0080\u009crightâ\u0080\u009d or â\u0080\u009cwrongâ\u0080\u009d techniques. With opaque watercolor you can use transparent watercolor techniques, oil painting techniques, pastel techniques, and any other technique you can think of.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":1590761,"ranking":7,"query_text":"is chinese white watercolor transparent","passage_text":"Definition: Gouache is an water-soluble paint that is opaque, rather than transparent like watercolor. Gouache and watercolor paints can be used together. White is one of the paint colors available in gouache, unlike watercolors, where the paper is preserved, or kept pristine, as the white in the painting.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":6601083,"ranking":8,"query_text":"is chinese white watercolor transparent","passage_text":"The beauty of watercolor paint is its transparent quality and luminance. Don't overwork it. One of watercolor's greatest strengths is its ability to show complexity of color by revealing layers of transparent color. It allows light to travel through the layers of paint and reflect back up off the white of the paper.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":6208824,"ranking":9,"query_text":"is chinese white watercolor transparent","passage_text":"First, it means a pigment that, when mixed with water as a medium, creates a type of paint. Watercolor paint is transparent, and the white of the ground (paper) underneath provides light that shines through the painting. Second, a watercolor is what we call a painting created with watercolors.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":3814517,"ranking":10,"query_text":"is chinese white watercolor transparent","passage_text":"(noun) - Watercolor has several meanings. First, it means a pigment that, when mixed with water as a medium, creates a type of paint. Watercolor paint is transparent, and the white of the ground (paper) underneath provides light that shines through the painting. Second, a watercolor is what we call a painting created with watercolors. Finally, watercolor can also be used as a verb. To watercolor describes painting with watercolors.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":4627587,"ranking":11,"query_text":"is chinese white watercolor transparent","passage_text":"Gouache is an opaque watercolor paint. Whereas transparent watercolors allow you to see the white of the paper below the paint, gouache can be applied in solid colors. This allows an artist to paint in layers from dark to light.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":6200102,"ranking":12,"query_text":"is chinese white watercolor transparent","passage_text":"Gouache is opaque watercolor. It is manufactured in much the same way as transparent watercolor. While they both are comprised of pigment, wetting agent, and a binder, gouache additionally receives an inert white pigment and higher levels of concentrated pigment.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":7508548,"ranking":13,"query_text":"is chinese white watercolor transparent","passage_text":"â\u0080¢ Colors must be lightened by adding white pigment, as in oil paints; they are not lightened by dilution to show more of the white paper, as in transparent watercolors. â\u0080¢ Paints are not applied in glazes or tints (unlike oils and watercolors, where glazing one color over another is a common technique).","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":6208822,"ranking":14,"query_text":"is chinese white watercolor transparent","passage_text":"Definition: (noun) - Watercolor has several meanings. First, it means a pigment that, when mixed with water as a medium, creates a type of paint. Watercolor paint is transparent, and the white of the ground (paper) underneath provides light that shines through the painting.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":7508546,"ranking":15,"query_text":"is chinese white watercolor transparent","passage_text":"Watercolors are usually translucent, and appear luminous because the pigments are laid down in a pure form with few fillers obscuring the pigment colors. Watercolors can also be made opaque by adding Chinese white. In East Asia, watercolor painting with inks is referred to as brush painting or scroll painting. In Chinese, Korean, and Japanese painting it has been the dominant medium, often in monochrome black or browns.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":6601084,"ranking":16,"query_text":"is chinese white watercolor transparent","passage_text":"Select a set of watercolor paints. This 12-color set is a great deal. Most sets have a good selection of basic colors youâ\u0080\u0099ll need for transparent watercolor painting. Rarely use the white paint that is included in most cake or tube color sets. Itâ\u0080\u0099s opaque. Its use will change your watercolor paintings into gouache paintings.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":8545094,"ranking":17,"query_text":"is chinese white watercolor transparent","passage_text":"Non-Staining and Staining. Non-Staining watercolors will settle on the surface of your watercolor paper after the water has evaporated. These colors, once dried, allow you to lift the pigment off the surface to reveal the white of the paper underneath. These colors mix extremely well with other non-staining colors.If you are new to watercolor, I would recommend beginning with non-staining colors, then slowly introduce staining colors into your palette.ransparent is just as the word describes. Transparent watercolors allow the light to shine through to the watercolor paper and in turn lets the white of the paper reflect back. The colors look clean, crisp, and appear to glow.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":8545095,"ranking":18,"query_text":"is chinese white watercolor transparent","passage_text":"Non-Staining watercolors will settle on the surface of your watercolor paper after the water has evaporated. These colors, once dried, allow you to lift the pigment off the surface to reveal the white of the paper underneath.These colors mix extremely well with other non-staining colors.If you are new to watercolor, I would recommend beginning with non-staining colors, then slowly introduce staining colors into your palette.ransparent is just as the word describes. Transparent watercolors allow the light to shine through to the watercolor paper and in turn lets the white of the paper reflect back. The colors look clean, crisp, and appear to glow.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":6565867,"ranking":19,"query_text":"is chinese white watercolor transparent","passage_text":"Watercolor paper is often made entirely or partially with cotton, which gives a good texture and minimizes distortion when wet. Watercolors are usually translucent, and appear luminous because the pigments are laid down in a pure form with few fillers obscuring the pigment colors. Watercolors can also be made opaque by adding Chinese white. In East Asia, watercolor painting with inks is referred to as brush painting or scroll painting.","bm25_label":"high","relevance_label":0.0},{"query_id":406205,"passage_id":1670635,"ranking":20,"query_text":"is chinese white watercolor transparent","passage_text":"I'm hesitant to get opaque enough or I can't get opaque enough.. --Use pure watercolor (or a gouache without opacifiers) for the transparent bits. Then bring in plenty of opaque gouache or titanium white in mixtures.","bm25_label":"high","relevance_label":0.0}]