[{"query_id":407274,"passage_id":7336820,"ranking":1,"query_text":"is cortana smart???","passage_text":"Microsoft set release cortana powered smart speaker, Watch out alexa, there is a new digital assistant in town. microsoft and harman kardon are set to release a smart speaker this fall that is powered by cortana in a.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":3251739,"ranking":2,"query_text":"is cortana smart???","passage_text":"1 Cortana also recites a few lines from the Cortana Letters in Halo 3 in some of her messages and in the announcement trailer. 2  Some of the lines are said in the Cortana moments in the level Cortana. 3  Being a smart AI, Cortana's operational life span is approximately seven years.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":7336822,"ranking":3,"query_text":"is cortana smart???","passage_text":"cortana app on windows 10 review. Microsoft set release cortana powered smart speaker, Microsoft declares war on alexa: smart speaker developed with samsung to use cortana ai. microsoft has teamed up with harman kardon to make the device. Windows 10 review: windows 10 ui, cortana | techradar, Sign up for a new, free business service from techradar pro to help you in your job delivering high value, original content direct to your inbox.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":8290371,"ranking":4,"query_text":"is cortana smart???","passage_text":"Insteon calls on Cortana to control the smart home. A promised update to Insteon's Windows Phone app will introduce voice controls for smart-home devices. When , it seemed like just a matter of time before Cortana would be calling the shots. Today, the California-based home-automation network is confirming the speculation, announcing that full, Cortana-powered voice controls will be making their way to Insteon's Windows Phone 8.1 app in the coming months.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":7280735,"ranking":5,"query_text":"is cortana smart???","passage_text":"which Dr. Halsey says to the six-year-old Spartan candidates in Halo: The Fall of Reach. Cortana also recites a few lines from the Cortana Letters in Halo 3 in some of her messages and in the announcement trailer. Some of the lines are said in the Cortana moments in the level Cortana. Being a smart AI, Cortana's operational life span is approximately seven years.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":7446791,"ranking":6,"query_text":"is cortana smart???","passage_text":"Moreover Cortana also claimed Microsoft can communicate in both directions with a more natural way, not like Appleâ\u0080\u0099s Siri or Google Now. Cortana name itself is taken from one of Microsoftâ\u0080\u0099s Halo game character. In the game this character is a female figure drawn from artificial intelligence. Cortana smart, because he just can not take orders, but also to learn, adapt, and reply to all natural speech with words and sound smart.","bm25_label":"high","relevance_label":1.0},{"query_id":407274,"passage_id":358169,"ranking":7,"query_text":"is cortana smart???","passage_text":"and go to the Option settings and enable Cortana. Once done, you should be able to speak to Cortana to control the notifications and other things on your Android device. As for the smart bulbs and other gadgets that you may have and want to control using Cortana, you will need to first link it to the Tasker app.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":1175677,"ranking":8,"query_text":"is cortana smart???","passage_text":"Microsoftâ\u0080\u0099 cortana finally speaker: hands-, Alexa has a bunch of them. siri is getting one. so why not cortana, too? a new smart speaker from audio equipment maker harman kardon is the first to comeâ\u0080¦.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":907482,"ranking":9,"query_text":"is cortana smart???","passage_text":"Cortana could be a wine expert and a travel agent and a personal assistant and anything else you might need to make your everyday life a little bit easier. The vision is of Cortana as a smart, well-informed helper or friend.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":8380369,"ranking":10,"query_text":"is cortana smart???","passage_text":"The Bottom Line If you're a fan of Cortana, Windows 10 or Microsoft in general, Harman Kardon's Invoke is an exciting new smart speaker with quality sound and most of the expected smart speaker tricks. ","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":3615032,"ranking":11,"query_text":"is cortana smart???","passage_text":"Microsoft Cortana: The smart person's guide. Cortana is Microsoft's universal digital agent and you should get to know her before she gets to know you. By Mark Kaelin | November 3, 2016, 9:00 AM PST.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":4896602,"ranking":12,"query_text":"is cortana smart???","passage_text":"Microsoft's Windows Phone 8.1 just got an upgrade with the voice of Cortana. If you're an avid video game player, you're probably thrilled. Cortana is a character in the popular Halo video games series. She's sexy and smart and tries to save the world.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":7336821,"ranking":13,"query_text":"is cortana smart???","passage_text":"Cortana will be available to third party developers: unlike Siri, which is limited to Apple's own apps and a few Apple-anointed services, Cortana could potentially work with any of your apps. Microsoft demonstrated Cortana working in Skype, Hulu Plus and Facebook. That third-party support could be significant. Cortana could be a wine expert and a travel agent and a personal assistant and anything else you might need to make your everyday life a little bit easier. The vision is of Cortana as a smart, well-informed helper or friend.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":4374700,"ranking":14,"query_text":"is cortana smart???","passage_text":"Cortana is expected to go way beyond the realms of a traditional assistant as it is a smart AI which is specifically programmed to understand you as a user and your habits. The new windows 10 phones would also come with a feature called â\u0080\u0098the notebookâ\u0080\u0099 which would be only accessible via Cortana. This would be the core of cortana where she takes notes of what we speak and stores our data. Notebook will also be one of the offline available features of Cortana.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":3393012,"ranking":15,"query_text":"is cortana smart???","passage_text":"Cortana is not all business either and like Siri she has a bit of an attitude with personal interaction that makes Cortana enjoyable to use. You can perform all of the traditional functions with Cortana, such as make phone calls, text people, add appointments, take notes, play music, get directions, check the weather, and much more. In addition there is location, time, and person awareness for reminders. As you can see, Cortana is quite smart and the more you use her the better she gets.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":3615030,"ranking":16,"query_text":"is cortana smart???","passage_text":"Microsoft Cortana: The smart person's guide. Cortana is Microsoft's universal digital agent and you should get to know her before she gets to know you. You may not have noticed, but there has been a subtle yet significant change in the way human beings interface with their computing devices.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":4396568,"ranking":17,"query_text":"is cortana smart???","passage_text":"While smart AI are not carbon copies of their 'parents', Cortana chose a young representation of Halsey to act as her physical avatar, while also retaining some of Halsey's mannerisms. In Fall 2552, in preparation for RED FLAG, Cortana was asked by Dr. Halsey to pick a soldier that would act as her carrier.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":3393015,"ranking":18,"query_text":"is cortana smart???","passage_text":"Cortana could be a wine expert and a travel agent and a personal assistant and anything else you might need to make your everyday life a little bit easier. The vision is of Cortana as a smart, well-informed helper or friend. It'll be a few months before we discover if Microsoft can deliver on those promises.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":2636615,"ranking":19,"query_text":"is cortana smart???","passage_text":"Cortana will be available to third party developers: unlike Siri, which is limited to Apple's own apps and a few Apple-anointed services, Cortana could potentially work with any of your apps. Microsoft demonstrated Cortana working in Skype, Hulu Plus and Facebook. That third-party support could be significant. Cortana could be a wine expert and a travel agent and a personal assistant and anything else you might need to make your everyday life a little bit easier. The vision is of Cortana as a smart, well-informed helper or friend. It'll be a few months before we discover if Microsoft can deliver on those promises.","bm25_label":"high","relevance_label":0.0},{"query_id":407274,"passage_id":4440754,"ranking":20,"query_text":"is cortana smart???","passage_text":"Windows Phone chief Greg Sullivan spoke with NBC News about why the company named Cortana after a video game character -- and how she represents the Microsoft vision under the company's new CEO Satya Nadella. Cortana in particular is emblematic of this idea about how individual and how smart the smartphone can be.","bm25_label":"high","relevance_label":0.0}]