[{"query_id":409854,"passage_id":4235366,"ranking":1,"query_text":"is fainting serious","passage_text":"1 Fainting is caused by a temporary loss of the brain's blood supply and can be a sign of a more serious condition. 2  People of any age can faint, but elderly persons may have a serious underlying cause.  Fainting accounts for a small portion of emergency department visits and 6% of hospital admissions.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":6714070,"ranking":2,"query_text":"is fainting serious","passage_text":"While some causes of unexplained fainting are harmless, others may be serious. Heart-related causes, including abnormal heart rhythms, are among the most serious causes of fainting. Also, if you do not have any warning signs before you faint, you may fall unexpectedly and be injured.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":826408,"ranking":3,"query_text":"is fainting serious","passage_text":"If you faint during exercise or experience dizziness, heart palpitations, or seizure-like episodes, you should see a doctor. While some causes of unexplained fainting are harmless, others may be serious. Heart-related causes, including abnormal heart rhythms, are among the most serious causes of fainting.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":1209446,"ranking":4,"query_text":"is fainting serious","passage_text":"Fainting, which medical professionals call syncope (pronounced SIN-ko-pea), is a temporary loss of consciousness. Fainting is caused by a temporary loss of the brain's blood supply and can be a sign of a more serious condition. People of any age can faint, but elderly persons may have a serious underlying cause. Fainting accounts for a small portion of emergency department visits and 6% of hospital admissions.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":1227965,"ranking":5,"query_text":"is fainting serious","passage_text":"Risk Factors. While some causes of unexplained fainting are harmless, others may be serious. Heart-related causes, including abnormal heart rhythms, are among the most serious causes of fainting. Also, if you do not have any warning signs before you faint, you may fall unexpectedly and be injured.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":4235369,"ranking":6,"query_text":"is fainting serious","passage_text":"1 Fainting, which medical professionals call syncope (pronounced SIN-ko-pea), is a temporary loss of consciousness. Fainting is caused by a temporary loss of the brain's blood supply and can be a sign of a more serious condition.  People of any age can faint, but elderly persons may have a serious underlying cause.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":7407113,"ranking":7,"query_text":"is fainting serious","passage_text":"Fainting Overview. Patient Comments Read 28 Comments Share Your Story. Fainting, which medical professionals call syncope (pronounced SIN-ko-pea), is a temporary loss of consciousness. Fainting is caused by a temporary loss of the brain's blood supply and can be a sign of a more serious condition. People of any age can faint, but elderly persons may have a serious underlying cause. 1  Fainting accounts for a small portion of emergency department visits and 6% of hospital admissions.","bm25_label":"high","relevance_label":1.0},{"query_id":409854,"passage_id":1531083,"ranking":8,"query_text":"is fainting serious","passage_text":"Dizziness and Fainting Spells. Syncope (Dizziness and Fainting Spells) A temporary decrease in blood flow to the brain results in unconsciousness, or fainting. Many disorders, some of them serious, can cause this.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":4400786,"ranking":9,"query_text":"is fainting serious","passage_text":"Dizziness and Fainting Spells. Page Content. Article Body. Syncope (Dizziness and Fainting Spells) A temporary decrease in blood flow to the brain results in unconsciousness, or fainting. Many disorders, some of them serious, can cause this.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":4235365,"ranking":10,"query_text":"is fainting serious","passage_text":"Facts on Fainting. Fainting, which medical professionals call syncope (pronounced SIN-ko-pea), is a temporary loss of consciousness. Fainting is caused by a temporary loss of the brain's blood supply and can be a sign of a more serious condition.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":1334281,"ranking":11,"query_text":"is fainting serious","passage_text":"When to Seek Medical Care. Because fainting can be caused by a serious condition, all episodes of fainting should be taken seriously. Anyone who has a first episode of fainting needs to be evaluated by a health care practitioner as soon as possible.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":8013025,"ranking":12,"query_text":"is fainting serious","passage_text":"Some types of fainting seem to run in families. While fainting may indicate a particular medical condition, sometimes it may occur in an otherwise healthy individual. Fainting is a particular problem for the elderly who may suffer serious injuries from falls when they faint. Most episodes are very brief.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":2221399,"ranking":13,"query_text":"is fainting serious","passage_text":"Fainting usually isnâ\u0080\u0099t a cause for concern, but it can be a symptom of a serious medical problem in some cases. If you have no previous history of fainting and you have fainted more than once in the past month, you should talk to your doctor.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":4044361,"ranking":14,"query_text":"is fainting serious","passage_text":"More serious signs and symptoms include: 1  Anxiety. 2  Weakness, dizziness, and light-headedness. 3  Fainting or nearly fainting. 4  Sweating. Shortness of breath.  Chest pain.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":5432812,"ranking":15,"query_text":"is fainting serious","passage_text":"If severe bradycardia isn't treated, it can lead to serious problems. These may include fainting and injuries from fainting, as well as seizures or even death. What can you do at home for bradycardia?","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":1431534,"ranking":16,"query_text":"is fainting serious","passage_text":"Your doctor may recommend tests to rule out more serious causes of fainting, such as heart disorders. Symptoms Before you faint due to vasovagal syncope, you may experience some of the following:","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":826400,"ranking":17,"query_text":"is fainting serious","passage_text":"Fainting (Unexplained) Some causes of unexplained fainting are harmless, or can be addressed with simple lifestyle changes. Others are more serious. An insertable cardiac monitor (ICM), also known as an insertable loop recorder (ILR), may help your doctor determine if an abnormal heart rhythm is causing you to faint.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":1053668,"ranking":18,"query_text":"is fainting serious","passage_text":"Fainting is caused by a drop in blood flow to the brain. After you lose consciousness and fall or lie down, more blood can flow to your brain so you wake up again. The most common causes of fainting are usually not signs of a more serious illness. In these cases, you faint because of:","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":6531263,"ranking":19,"query_text":"is fainting serious","passage_text":"Cardiogenic syncope is usually related to abnormal heart rhythms. Probably one-fourth of all episodes of syncope are cardiogenic. Fainting. that is triggered by underlying heart problems is usually more serious. than fainting triggered by other causes.","bm25_label":"high","relevance_label":0.0},{"query_id":409854,"passage_id":7313750,"ranking":20,"query_text":"is fainting serious","passage_text":"Many people recover very quickly from a brief loss of consciousness without any harmful consequences. However, on some occasions, fainting can signal a medical emergency. Don't treat fainting as minor unless you're certain there is no serious underlying cause. You may be able to tell when someone is about to faint.","bm25_label":"high","relevance_label":0.0}]