[{"query_id":413404,"passage_id":2940356,"ranking":1,"query_text":"is it adaptive or adapted instruction","passage_text":"1 Adapt instructional techniques to the age and skill levels of students.  Instruct students, using adapted physical education techniques, to improve physical fitness, gross motor skills, perceptual motor skills, or sports and game achievement.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":7590811,"ranking":2,"query_text":"is it adaptive or adapted instruction","passage_text":"Since at least the fourth century BC, adapting has been viewed as a primary factor for the success of instruction (Como & Snow, 1986), and adaptive instruction by tutoring was the common method of education until the mid-1800s (Reiser, 1987).","bm25_label":"high","relevance_label":1.0},{"query_id":413404,"passage_id":5744652,"ranking":3,"query_text":"is it adaptive or adapted instruction","passage_text":"Adaptive behavior is usually assessed using questionnaires completed by parents, teachers, social workers, students (when possible and appropriate) or adult learners. Adaptive behavior can also be assessed based on observations of the child's actual performance of a specific skill. It is not uncommon for students with learning disabilities to require specially designed instruction to learn adaptive behaviors. This instruction will focus on helping these students develop planning, organizational skills and study skills, which are all important adaptive behaviors.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":4147130,"ranking":4,"query_text":"is it adaptive or adapted instruction","passage_text":"Connect your WiDi compatible display adapter to your TV using the instructions that came with the adapter. Make sure both TV and adapter are on. On the TV, select the input source that matches the WiDi adapter connection, such as HDMI or HDMI2. When the adapter is connected properly to the TV, the TV should display a screen stating that it is waiting for a connection (or similar). On the computer, open the Windows 8 Charms bar and select the Devices charm.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":445645,"ranking":5,"query_text":"is it adaptive or adapted instruction","passage_text":"Adaptive behavior can also be assessed based on observations of the child's actual performance of a specific skill. It is not uncommon for students with learning disabilities to require specially designed instruction to learn adaptive behaviors.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":3346253,"ranking":6,"query_text":"is it adaptive or adapted instruction","passage_text":"1 For RCA\/optical connectors [game audio], follow the manufacturer's instructions to connect to the console.). 2  An Xbox 360 Wired Headset with a 2.5-mm audio cable. 3  Connect to the Stereo Headset Adapter by using the 2.5-mm-to-3.5mm adapter that's included with the Xbox One Stereo Headset Adapter.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":2940354,"ranking":7,"query_text":"is it adaptive or adapted instruction","passage_text":"1 Provide adapted physical education services to students with intellectual disabilities, autism, traumatic brain injury, orthopedic impairments, or other disabling condition.  Adapt instructional techniques to the age and skill levels of students.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":2301835,"ranking":8,"query_text":"is it adaptive or adapted instruction","passage_text":"1 Click Go to My Online Account to open your Online Account in a new window. 2  Use Quick Links to go directly to that selection in your Online Account.  Go to My Vonage Adapter for details on the Vonage adapter you are using and find the installation instructions and user guide for your adapter.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":7482342,"ranking":9,"query_text":"is it adaptive or adapted instruction","passage_text":"Adaptive Living Skills Curriculum (ALSC) and Checklist of Adaptive Living Skills (CALS) are part of an integrated systems approach that links assessment, instruction, and evaluation. Statistically linked to the Scales of Independent Behavior-Revised and the Inventory for Client Planning, these two tools provide the link that takes you from global assessment to prescription and then to actual instruction.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":8311576,"ranking":10,"query_text":"is it adaptive or adapted instruction","passage_text":"Each teacher, each student, each classroom isunique and adaptations are specific to each situation.Keep in mind that curriculum does not always need to be modified.By providing multi-level instruction you will find that adapting a lessonmay not always be necessary.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":8250932,"ranking":11,"query_text":"is it adaptive or adapted instruction","passage_text":"The educational implication of Piaget's theory is the adaptation of instruction to the learner's development level. It is important that the content of instruction needs to be consistent with the developmental level of the learner.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":2940361,"ranking":12,"query_text":"is it adaptive or adapted instruction","passage_text":"On the job, you would: 1  Provide adapted physical education services to students with intellectual disabilities, autism, traumatic brain injury, orthopedic impairments, or other disabling condition.  Adapt instructional techniques to the age and skill levels of students.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":7920388,"ranking":13,"query_text":"is it adaptive or adapted instruction","passage_text":"Difference between adaptic and xeroform. Wound VAC â\u0080\u0093 KCI Protocol Emergency General ... - traumaburn.com single layer of non-adherent, porous material such as Adaptic,. Xeroform, or Mepitel to serve as a barrier between the wound base and the foam dressing. F. Read More. Discharge Instructions - Bacitracin - UNC School of Medicine Wrap with Adaptic or xeroform (see below).","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":5460001,"ranking":14,"query_text":"is it adaptive or adapted instruction","passage_text":"Instructions. Confirm whether or not your computer is Bluetooth-enabled. Simply go to your computer's control panel section and then look for a Bluetooth icon (it is shaped like a B and should be blue.) If you find the icon, your computer already has a Bluetooth receiver, and you can go on to step 3.If not, see step 2.Install a Bluetooth adapter. Bluetooth adapters normally plug into a standard USB port. You will need to install some drivers and a management program, for the Bluetooth adapter to work, but these should come on a CD bundled with the adapter. Put your computer in Bluetooth discovery mode.nstall a Bluetooth adapter. Bluetooth adapters normally plug into a standard USB port. You will need to install some drivers and a management program, for the Bluetooth adapter to work, but these should come on a CD bundled with the adapter.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":6596655,"ranking":15,"query_text":"is it adaptive or adapted instruction","passage_text":"With mod-adapt headboard plates you can attach a full size bed frame to a queen size headboard or vice versa.You can also use the mod-adapt headboard plates for attaching an oversized or undersized headboard to your your bed frame.Our instructional video will show you how to attach this versatile piece of bed frame hardware. Shop for headboard adapters at http:\/\/www.thesleepshop.com\/store\/pc\/...ou can also use the mod-adapt headboard plates for attaching an oversized or undersized headboard to your your bed frame. Our instructional video will show you how to attach this versatile piece of bed frame hardware.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":7739321,"ranking":16,"query_text":"is it adaptive or adapted instruction","passage_text":"Differentiated instruction â\u0080\u009cis the practice of modifying and adapting instruction, materials, content, student projects and products, and assessment to meet the learning needs of individual students.â\u0080\u009d.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":5816838,"ranking":17,"query_text":"is it adaptive or adapted instruction","passage_text":"Instructions. Plug the micro SD adapter into your computer or other device. Adapters are fairly cheap---generally under $10 as of March 2010---and can be bought at any store that sells micro SD cards. Insert the micro SD card into the slot of the adapter.lug the micro SD adapter into your computer or other device. Adapters are fairly cheap---generally under $10 as of March 2010---and can be bought at any store that sells micro SD cards.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":6596656,"ranking":18,"query_text":"is it adaptive or adapted instruction","passage_text":"Please try again later. With mod-adapt headboard plates you can attach a full size bed frame to a queen size headboard or vice versa. You can also use the mod-adapt headboard plates for attaching an oversized or undersized headboard to your your bed frame.Our instructional video will show you how to attach this versatile piece of bed frame hardware. Shop for headboard adapters at http:\/\/www.thesleepshop.com\/store\/pc\/...ou can also use the mod-adapt headboard plates for attaching an oversized or undersized headboard to your your bed frame. Our instructional video will show you how to attach this versatile piece of bed frame hardware.","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":6788544,"ranking":19,"query_text":"is it adaptive or adapted instruction","passage_text":"This article provides instructions on how to determine what brand of wireless adapter is installed in your computer. To determine what wireless adapter in installed, refer to the section that matches the Operating System on your computer and follow the instructions. Windows 10. From the Desktop screen, touch and hold or right-click the network icon ( or ) in the notification area (located in the lower right-hand corner).","bm25_label":"high","relevance_label":0.0},{"query_id":413404,"passage_id":1032937,"ranking":20,"query_text":"is it adaptive or adapted instruction","passage_text":"Connect the: â\u0080¢ power cord to the adapter. â\u0080¢ adapter to the printer. â\u0080¢ power cord to the power source. Do not connect the USB cable to the printer until. instructed during software install. b. Remove the plastic film from the LCD and raise the display.","bm25_label":"high","relevance_label":0.0}]