[{"query_id":414155,"passage_id":4412960,"ranking":1,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Many of the body changes and symptoms of pregnancy you experience in the first trimester will begin to fade once you reach the second trimester. For example, morning sickness typically only occurs during the first trimester. Other symptoms, like heartburn, may actually stay the same or get worse.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":4231122,"ranking":2,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Symptoms Dwindle in the Second Trimester. Many of the body changes and symptoms of pregnancy you experience in the first trimester will begin to fade once you reach the second trimester. For example, morning sickness typically only occurs during the first trimester. Other symptoms, like heartburn, may actually stay the same or get worse.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":1089727,"ranking":3,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Other complications of pregnancy, which are not as common, include the following: Severe, persistent nausea and vomiting. Although having some nausea and vomiting is normal during pregnancy, particularly in the first trimester, some women experience more severe symptoms that last into the third trimester.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":5843471,"ranking":4,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Dizziness and lightheadedness are also early symptoms of pregnancy, caused by low blood pressure. In your first trimester, it is normal to experience dizziness during pregnancy as the blood vessels dilate, which reduces blood pressure. The blood pressure gets back to normal during the second trimester.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":5390183,"ranking":5,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Pregnancy increases the risk that a woman may experience heartburn or acid reflux. During the first trimester, muscles in the esophagus push food more slowly into the stomach and the stomach takes longer to empty. This gives your body more time to absorb nutrients for the fetus, but can also result in heartburn.","bm25_label":"high","relevance_label":1.0},{"query_id":414155,"passage_id":6968090,"ranking":6,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"If you are positive that you are pregnant but donâ\u0080\u0099t experience any of the symptoms or major changes, it can be worrying. The reality is that all women respond to pregnancy differently. While many will experience breast tenderness, exhaustion, heartburn, or morning sickness during their first trimester, you may be pregnant but no symptoms at all. There is no reason to think that you will necessarily be nauseous during your entire first trimester.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":925046,"ranking":7,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Prenatal visit coding First, compare and contrast the code choices for a typical prenatal visit for a woman having a normal first pregnancy. In ICD-9-CM, you would report V22.0 (supervision of normal first pregnancy). ICD-10-CM gives you these four choices: Z34.00, Encounter for supervision of normal first pregnancy, unspecified trimester. Z34.01, Encounter for supervision of normal first pregnancy, first trimester.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":7991201,"ranking":8,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Normal, frequent or expectable temporary side effects of pregnancy: 1  exhaustion (weariness common from first weeks). 2  altered appetite and senses of taste and smell. 3  nausea and vomiting (50% of women, first trimester). 4  heartburn and indigestion. 5  constipation. 6  weight gain.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":8380961,"ranking":9,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"By far the most common cause of low platelets in pregnancy is Gestational Thrombocytopenia, which occurs in 5% of normal pregnancies in the third trimester. These women will have normal platelets on their first blood count in early pregnancy.Sometimes the low platelet count is picked up on a routine blood draw in the third trimester, and other times it is not noted until the patient arrives for delivery.y far the most common cause of low platelets in pregnancy is Gestational Thrombocytopenia, which occurs in 5% of normal pregnancies in the third trimester. These women will have normal platelets on their first blood count in early pregnancy.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":8090625,"ranking":10,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Do you know what to expect in the first trimester of pregnancy? We've partnered with the American Institute of Ultrasound Medicine (AIUM), Johns Hopkins, and the March of Dimes to create this unique peak into Baby's development inside the womb during the first trimester. These images reveal all the intricate details of your baby's growth. While most women normally receive one or two ultrasounds during pregnancy, this slideshow of the first trimester of pregnancy gives you a look at each week of development.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":1870038,"ranking":11,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Women who are in the first trimester of pregnancy have normal thyroid levels that are between 0.25 mIU\/L to 2.96 mIU\/L. Women who are in the second trimester of pregnancy have normal thyroid levels that are between 0.45 mIU\/L to 2.94 mIU\/L. Women who are in the third trimester of pregnancy have normal thyroid levels that are between 0.42 mIU\/L to 2.76 mIU\/L.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":4036588,"ranking":12,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Brown spotting during the first trimester of pregnancy is a completely normal phenomenon. Many women experience this during the first 3-6 weeks of pregnancy, without any negative effect. Normal brown spotting will often last around 2-3 days and should not be a heavy flow.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":2324853,"ranking":13,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"It is absolutely safe to make love in the first trimester in a normal pregnancy. However, your gynaecologist may advise you to not have sex if you: You may also be advised to avoid sex during pregnancy if your husband has genital herpes.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":7591792,"ranking":14,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"During the third trimester, the growth of the baby can push the stomach out of its normal position, which can lead to heartburn. However, each woman is different and being pregnant doesn't necessarily mean you'll automatically have heartburn.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":4180167,"ranking":15,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Pink discharge during pregnancy first trimester. A light pink discharge during pregnancy first trimester may have nothing to do with the pregnancy directly. If the discharge is dark pink, or reddish, it could be a lot more serious and may also be an indication of a miscarriage.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":3034720,"ranking":16,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"The clinical implication of this study is that a TSH greater than 2.5 mIU\/L may not be normal during the first trimester of pregnancy. This study suggests that the upper limit of the TSH normal range should be redefined as less than 2.5 mIU\/L during pregnancy.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":2512469,"ranking":17,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"- Both estrogen and progesterone increase rapidly during the first trimester of pregnancy. - slower climb but very high levels during 2nd and 3rd trimester. - estrogen and progesterone levels drop sharply approximately 24hrs. before the onset of labor. - burst of energy - drop from pregnancy levels of progesterone to normal levels.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":2123073,"ranking":18,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Having a high white blood cell count is not always a cause for concern. The normal range of WBC count differs in various laboratories; however, it usually ranges between 4,500 and 10,000 per mcL. During the 3rd trimester of pregnancy, the WBC count can be between 12,000 and 18,000 per mcL and is still considered normal. Given below is the normal range of high white blood cell count during pregnancy. 1st Trimester of Pregnancy: 5.7 to 13.6 x 109\/L. 2nd Trimester of Pregnancy: 5.6 to 14.8 x 109\/L.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":6002648,"ranking":19,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"And although it's generally recommended that a woman of normal weight gain about 25 to 35 pounds during pregnancy (most gain 4 to 6 pounds during the first trimester and 1 pound a week during the second and third trimesters), don't fixate on the scale.","bm25_label":"high","relevance_label":0.0},{"query_id":414155,"passage_id":2784529,"ranking":20,"query_text":"is it normal to have heartburn during the first trimester pregnancy","passage_text":"Some : Some women do have light bleeding during the first trimester when the fetus implants into the uterus. Please contact your gynecologist for an evaluation. White discharge is normal during pregnancy but if it is an excessive amount or you have the itching then it may be an infection.","bm25_label":"high","relevance_label":0.0}]