[{"query_id":415500,"passage_id":7460564,"ranking":1,"query_text":"is keppra medication a barbiturate?","passage_text":"Reports of KEPPRA causing BARBITURATES POSITIVE: 2. Reports of any side effect of KEPPRA : 19758. Percentage of KEPPRA patients where BARBITURATES POSITIVE is a reported side effect: 0.0101%. FDA reports of any drug causing BARBITURATES POSITIVE : 52. Average percentage for all medicated patients where BARBITURATES POSITIVE is reported as a complication: 0.0003%.","bm25_label":"high","relevance_label":1.0},{"query_id":415500,"passage_id":7460567,"ranking":2,"query_text":"is keppra medication a barbiturate?","passage_text":"In doing so, we compare KEPPRA with other drugs that cause BARBITURATES POSITIVE, to help you evaluate whether or not KEPPRA causes BARBITURATES POSITIVE. Likewise, this page shows the most highly-reported side effects of KEPPRA, so you can see if BARBITURATES POSITIVE ranks among KEPPRA's most well-known side effects.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":7460570,"ranking":3,"query_text":"is keppra medication a barbiturate?","passage_text":"Between January 2004 and October 2012, 2 individuals taking KEPPRA reported BARBITURATES POSITIVE to the FDA. A total of 19758 KEPPRA drug adverse event reaction reports were made with the FDA during this time period.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":543386,"ranking":4,"query_text":"is keppra medication a barbiturate?","passage_text":"i am on 3 mg of xanax a day.along with 16mg of subs a day,and i have no adverse reactions at all. ...The people who would be in danger are ...i also take a barbiturate for headaches,and keppra and celexa..","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":3751551,"ranking":5,"query_text":"is keppra medication a barbiturate?","passage_text":"In order to avoid withdrawal symptoms, you should not stop taking Keppra too quickly. Keppra Â® (levetiracetam) is a prescription epilepsy medication used to control certain types of seizures. As with most seizure medications, you should not stop taking Keppra without your healthcare provider's approval.f you suddenly stop taking Keppra, it can cause you to have a different type of seizure or can cause extremely long seizures. Keppra Â® (levetiracetam) is a prescription epilepsy medication used to control certain types of seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":6133482,"ranking":6,"query_text":"is keppra medication a barbiturate?","passage_text":"A: Keppra (levetiracetam) is in an antiepileptic drug. Keppra is used together with other medications to treat certain types of seizures in people with epilepsy. Keppra may also be used in people with other conditions such as bipolar disorder. Keppra may also be used to prevent migraine headaches.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":3751552,"ranking":7,"query_text":"is keppra medication a barbiturate?","passage_text":"If you suddenly stop taking Keppra, it can cause you to have a different type of seizure or can cause extremely long seizures. Keppra Â® (levetiracetam) is a prescription epilepsy medication used to control certain types of seizures.As with most seizure medications, you should not stop taking Keppra without your healthcare provider's approval.f you suddenly stop taking Keppra, it can cause you to have a different type of seizure or can cause extremely long seizures. Keppra Â® (levetiracetam) is a prescription epilepsy medication used to control certain types of seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":5361367,"ranking":8,"query_text":"is keppra medication a barbiturate?","passage_text":"A: Keppra (levetiracetam) is in an antiepileptic drug. Keppra is used together with other medications to treat certain types of seizures in people with epilepsy. Keppra may also be used in people with other conditions such as bipolar disorder.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":3225318,"ranking":9,"query_text":"is keppra medication a barbiturate?","passage_text":"Keppra tablets, liquid, and intravenous solution are now available in generic form. Generic Keppra is available in three strengths and is currently produced by a number of companies. Generic Keppra: An Overview. KeppraÂ® (levetiracetam) is a prescription epilepsy medication. Specifically, Keppra is approved for use in combination with other seizure medications to treat partial seizures, myoclonic seizures, and generalized tonic-clonic seizures (also known as grand mal seizures).","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":7308682,"ranking":10,"query_text":"is keppra medication a barbiturate?","passage_text":"A: Keppra (levetiracetam) is a medication used to treat epilepsy and does list anxiety and nervousness as possible side effects. If they are bothersome and do not go away, you may want to let your doctor know.: Keppra (levetiracetam) is in an antiepileptic drug. Keppra is used together with other medications to treat certain types of seizures in people with epilepsy. Keppra may also be used in people with other conditions such as bipolar disorder.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":719393,"ranking":11,"query_text":"is keppra medication a barbiturate?","passage_text":"Buy Keppra online, including Keppra 750mg medication, from the largest Canadian pharmacy with free shipping on all orders of Keppra and other discount Canada Drugs Call 1-800-796-6202","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":543383,"ranking":12,"query_text":"is keppra medication a barbiturate?","passage_text":"Limiting Keppra Withdrawal. Typically, your healthcare provider will slowly wean you off Keppra in order to avoid seizures or other Keppra withdrawal symptoms. Even if you are switching to another epilepsy medication, your healthcare provider may still recommend slowly stopping Keppra.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":3751556,"ranking":13,"query_text":"is keppra medication a barbiturate?","passage_text":"Keppra Withdrawal Symptoms. Typically, your healthcare provider will slowly wean you off Keppra in order to avoid seizures or other Keppra withdrawal symptoms. Even if you are switching to another epilepsy medication, your healthcare provider may still recommend slowly stopping Keppra.f you suddenly stop taking Keppra, it can cause you to have a different type of seizure or can cause extremely long seizures. Keppra Â® (levetiracetam) is a prescription epilepsy medication used to control certain types of seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":543382,"ranking":14,"query_text":"is keppra medication a barbiturate?","passage_text":"If you suddenly stop taking Keppra, it can cause you to have a different type of seizure or can cause extremely long seizures. To reduce your risk of Keppra withdrawal symptoms, your healthcare provider may decide to slowly wean you off the medication. Keppra Withdrawal: An Introduction. KeppraÂ® (levetiracetam) is a prescription epilepsy medication used to control certain types of seizures. As with most seizure medications, you should not stop taking Keppra without your healthcare provider's approval.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":6246302,"ranking":15,"query_text":"is keppra medication a barbiturate?","passage_text":"A: Keppra (levetiracetam) is in an antiepileptic drug. Keppra is used together with other medications to treat certain types of seizures in people with epilepsy. Keppra may also be used in people with other conditions such as bipolar disorder.ommon side effects of Keppra include dizziness, drowsiness, and headache. Other side effects reported with Keppra include fatigue and sedation, coordination and gait difficulties and abnormal behavior.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":7308677,"ranking":16,"query_text":"is keppra medication a barbiturate?","passage_text":"Keppra is the brand name of levetiracetam, a prescription medication taken in conjunction with other anti-seizure drugs to treat children who have certain types of epilepsy and experience seizures. It's used to treat children 12 and older with juvenile myoclonic epilepsy who get myoclonic seizures.: Keppra (levetiracetam) is in an antiepileptic drug. Keppra is used together with other medications to treat certain types of seizures in people with epilepsy. Keppra may also be used in people with other conditions such as bipolar disorder.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":6133486,"ranking":17,"query_text":"is keppra medication a barbiturate?","passage_text":"Common side effects of Keppra include dizziness, spinning sensation, drowsiness, irritability, and headache. This is not a complete list of side effects that can occur with Keppra. According to the prescribing information for Keppra, anxiety can occur in approximately 2 percent of patients taking the medication.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":646473,"ranking":18,"query_text":"is keppra medication a barbiturate?","passage_text":"Common Questions and Answers about Keppra other uses keppra I am on the off brand of keppra and I was wondering if anyone uses adderal to help with the side effects of this medication. I find myself to be out of it most days and not have a drive to do anything.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":2991135,"ranking":19,"query_text":"is keppra medication a barbiturate?","passage_text":"A: Keppra (levetiracetam) is in an antiepileptic drug. Keppra is used together with other medications to treat certain types of seizures in people with epilepsy. Keppra may also be used in people with other conditions such as bipolar disorder.: Keppra (levetiracetam) is an anticonvulsant or anti-seizure drug. It is used to treat partial onset seizures, tonic-clonic seizures, and myoclonic seizures. Keppra can also be used as a mood stabilizer in bipolar disorder and to treat certain types of pain.","bm25_label":"high","relevance_label":0.0},{"query_id":415500,"passage_id":7308678,"ranking":20,"query_text":"is keppra medication a barbiturate?","passage_text":"A: Keppra (levetiracetam) is an anti-epileptic or anti-seizure drug that is used to treat partial onset seizures, tonic-clonic seizures, and myoclonic seizures. Common side effects of Keppra include dizziness, spinning sensation, drowsiness, irritability, and headache.: Keppra (levetiracetam) is in an antiepileptic drug. Keppra is used together with other medications to treat certain types of seizures in people with epilepsy. Keppra may also be used in people with other conditions such as bipolar disorder.","bm25_label":"high","relevance_label":0.0}]