[{"query_id":423178,"passage_id":7559249,"ranking":1,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Saugatuck Center for the Arts, Saugatuck, Michigan. 3.5K likes. Concerts | Classes | Exhibitions | Film | Farmers Market | Broadway Equity Theatre","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7559251,"ranking":2,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Arts, Culture, and Humanities. SAUGATUCK CENTER FOR THE ARTS INC Download Report","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7559253,"ranking":3,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"The Saugatuck Center for the Arts, located at 400 Culver Street, Saugatuck, is a non-profit organization dedicated to creating a more vibrant lakeshore community in West Michigan and beyond. For more information about the SCA and upcoming events, visit sc4a.org or call 269-857-2399.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7559250,"ranking":4,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"The Saugatuck Center for the Arts won alongside Fortune 100 companies and national non-profits including the Intel Corporation, the Smithsonian, General Motors, MapQuest, Pfister, United Way, and more.","bm25_label":"high","relevance_label":1.0},{"query_id":423178,"passage_id":7559256,"ranking":5,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"At the Saugatuck Center for the Arts we help you experience the JOY of creativity by being * distinct cultural asset for West Michigan * a strong contributor to the local economy * a place of rich social interaction for our entire community We serve West Michigan including Grand Rapids, Holland, Muskegon, South Haven, and the immediate Saugatuck-Douglas and Fennville areas.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7559255,"ranking":6,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Saugatuck Center for the Arts is with Surfrider Foundation and 5 others. Â· 13 hrs Â· This Thursday at 7:00PM, the film Take Every Wave will make it's midwest debut here at the SCA.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7559257,"ranking":7,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"The winners of the 22nd Annual Communicator Awards have been announced by the Academy of Interactive and Visual Arts, and a local winner has emerged. The Saugatuck Center for the Arts (SCA) won â\u0080\u009cBest Branded Contentâ\u0080\u0093Nonprofitâ\u0080\u009d for its 2015 Mason Street Warehouse Cabaret promo video.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7559258,"ranking":8,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"The Saugatuck Center for the Arts (SCA) is a non-profit arts and cultural organization serving West Michiganâ\u0080\u0099s lakeshore community. We offer year-round live performances, classes, and workshops for adults and children, outreach programs, festivals, exhibitions, a Farmerâ\u0080\u0099s Market, and professional theatre in the summer through Mason Street Warehouse (MSW), an Equity theatre company.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7559254,"ranking":9,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Just saw Buyer and Cellar at the Saugatuck Center for the Arts and thought it was great. Very witty and smart. Recommende d. (If you haven't been to a show at the SCA, you will be very pleasantly s... urprised at the high calibre of acting, directing, choice of production s, etc. - think Chicago or Off-Broadw ay. Impressive.) See More","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":3380568,"ranking":10,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Art Center College of Design (stylized as ArtCenter) is a nonprofit, private college located in Pasadena, California.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":1361363,"ranking":11,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"He attended the Latin School of Chicago. He studied at Yale University from 1946 to 1950, then returned to Chicago where he took classes at The School of the Art Institute of â\u0080¦ Chicago.Oxbow Summer School of Painting in Saugatuck.4 people found this useful.e studied at Yale University from 1946 to 1950, then returned to Chicago where he took classes at The School of the Art Institute of â\u0080¦ Chicago.Oxbow Summer School of Painting in Saugatuck. 4 people found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7351523,"ranking":12,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Proceed to Part 3 of the Guadalupe Cultural Arts Center Records inventory. Guadalupe Cultural Arts Center (GCAC) was founded in 1980 as a nonprofit, multidisciplinary organization. Located in the heart of San Antonio's west side, the GCAC is the largest community-based, multi-disciplinary organization in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":6107459,"ranking":13,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Our Mission. The Catskill Art Society (CAS) is a nonprofit organization cultivating public interest, participation, and enjoyment of the arts. Through its multi-arts center, CAS explores contemporary art practices and facilitates creative and professional development for established and emerging artists. The Catskill Art Society is a registered 501(c)3 non-profit organization (EIN 14-1544781).","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":6381957,"ranking":14,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"The highest average temperature in Saugatuck is July at 72.5 degrees. The coldest average temperature in Saugatuck is February at 26 degrees. The most monthly precipitation in Saugatuck occurs in September with 3.2 inches. The Saugatuck weather information is based on the average of the previous 3-7 years of data.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":6381960,"ranking":15,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"1.5. The highest average temperature in Saugatuck is July at 72.5 degrees. The coldest average temperature in Saugatuck is February at 26 degrees. The most monthly precipitation in Saugatuck occurs in September with 3.2 inches. The Saugatuck weather information is based on the average of the previous 3-7 years of data.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":6381959,"ranking":16,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"The highest average temperature in Saugatuck is July at 72.5 degrees. The coldest average temperature in Saugatuck is February at 26 degrees. The most monthly precipitation in Saugatuck occurs in September with 3.2 inches.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":6381958,"ranking":17,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"1.5. The highest average temperature in Saugatuck is July at 72.5 degrees. The coldest average temperature in Saugatuck is February at 26 degrees. The most monthly precipitation in Saugatuck occurs in September with 3.2 inches.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":2284059,"ranking":18,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"In the nonprofit sector, Ressler serves as a member of the Board of Directors of the Cedars-Sinai Medical Center, as Co-Chair of the Board of Directors of the Los Angeles County Museum of Art (â\u0080\u009cLACMAâ\u0080\u009d) and as a member of the Board of Trustees of Georgetown University.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":3832956,"ranking":19,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Despite its emphasis on computer technology, digital storytelling is not a new practice. One of the fieldâ\u0080\u0099s most noted pioneers is Joe Lambert, the co-founder of the Center for Digital Storytelling (CDS), a nonprofit, community arts organization in Berkeley, California.","bm25_label":"high","relevance_label":0.0},{"query_id":423178,"passage_id":7822676,"ranking":20,"query_text":"is saugatuck center for the arts nonprofit","passage_text":"Saugatuck Dunes State Park. Saugatuck. The Saugatuck Dunes State Park is a day-use park along a secluded strip of Lake Michigan shoreline, Saugatuck Dunes State Park offers 2.5 miles of shore line. The park has fresh water coastal dunes that are over 200 feet tall. The park's terrain varies from steep slopes to rolling hills. 3. Silver Lake Sand Dunes.","bm25_label":"high","relevance_label":0.0}]