[{"query_id":424449,"passage_id":7482171,"ranking":1,"query_text":"is spotify a publicly traded company","passage_text":"You cannot buy Spotify stock right now because it is a private company. That means there is no Spotify stock symbol or price because the company is not traded publicly and probably wonâ\u0080\u0099t be until 2017 or later. (The stock symbol is NOT SPTF)","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7562351,"ranking":2,"query_text":"is spotify a publicly traded company","passage_text":"7 Responses to â\u0080\u009cHOW TO BUY SPOTIFY STOCKâ\u0080\u009d. 1  Iâ\u0080\u0099ve heard there are some publicly-traded Business Development Companies (BDCs) that own Spotify stock and investing in them is a way to (in effect) own Spotify on a pre-IPO cost basis. Any comments? 2  I definitely do NOT advise buying Spotify stock.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7482180,"ranking":3,"query_text":"is spotify a publicly traded company","passage_text":"Sure, Spotify is a big company in its own right, but in a completely different sphere. Perhaps more importantly, Spotify's valuation doesn't approach Netflix's or Amazon's. Spotify, which isn't a publicly traded company, is worth around $3 billion, based on its latest round of funding. Meanwhile, Netflix is worth about $10 billion, and Amazon is worth a staggering $84 billion. With billions more dollars, Netflix and Amazon are better positioned to fund high-brow, HBO-esque shows.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7482175,"ranking":4,"query_text":"is spotify a publicly traded company","passage_text":", Musician, climber, lover and observer of life. Spotify is not a publicly traded company, and unless you have been invited by one of the principals (CEO for example) to invest venture capital you cannot currently invest in it. There are rumors that the company may 'go public' sometime in the near future. This is called issuing an IPO.","bm25_label":"high","relevance_label":1.0},{"query_id":424449,"passage_id":236313,"ranking":5,"query_text":"is spotify a publicly traded company","passage_text":"1 Publicly traded companies. 2  Publicly traded companies. 3  Publicly traded companies. 4  Publicly traded company. 5  Publicly traded company. 6  Publicly traded company. 7  Publicly traded corporation. 8  Publicly traded corporation. 9  Publicly traded corporation.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":236310,"ranking":6,"query_text":"is spotify a publicly traded company","passage_text":"1 Publicly traded companies. 2  Publicly traded company. 3  Publicly traded company. 4  Publicly traded company. 5  Publicly traded corporation. 6  Publicly traded corporation. 7  Publicly traded corporation. 8  publicly traded fund. 9  Publicly Traded Partnership.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":3503256,"ranking":7,"query_text":"is spotify a publicly traded company","passage_text":"More Publicly Traded Retail Companies: 1  Publicly Traded Apparel Companies. 2  Publicly Traded Auto, Parts & Accessories Retailers. 3  Publicly Traded Department Store Companies. 4  Publicly Traded Direct Sales and Internet E-commerce Companies. 5  Publicly Traded Discount and Variety Store Chains. 6  Publicly Traded Retail Restaurant Chains.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7049263,"ranking":8,"query_text":"is spotify a publicly traded company","passage_text":"This is a complete list of publicly traded companies in the U.S. retail industry and their stock symbols, arranged according to the type of merchandise sold. 1  Publicly Traded Apparel Companies. 2  Publicly Traded Auto, Parts & Accessories Retailers. 3  Publicly Traded Department Store Companies.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":2039435,"ranking":9,"query_text":"is spotify a publicly traded company","passage_text":"publicly traded. Definition. A company which has issued securities through an offering, and which are now traded on the open market. also called publicly held or public company. opposite of private company. Use publicly traded in a sentence. â\u0080\u009c You should decide if you want your company to be publicly traded or if you would rather just be private.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7723782,"ranking":10,"query_text":"is spotify a publicly traded company","passage_text":"publicly traded. Definition. A company which has issued securities through an offering, and which are now traded on the open market. also called publicly held or public company. opposite of private company. Use publicly traded in a sentence.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":8712038,"ranking":11,"query_text":"is spotify a publicly traded company","passage_text":"Association of Publicly Traded Companies. An Israeli lobbying organization for publicly traded companies. It presses for favorable regulation and legislation for publicly traded companies. Members are listed primarily on NASDAQ and the Tel Aviv Stock Exchange. It is based in Tel Aviv.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7049262,"ranking":12,"query_text":"is spotify a publicly traded company","passage_text":"This is a complete list of publicly traded companies in the U.S. retail industry and their stock symbols, arranged according to the type of merchandise sold. Publicly Traded Apparel Companies. Publicly Traded Auto, Parts & Accessories Retailers.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":720142,"ranking":13,"query_text":"is spotify a publicly traded company","passage_text":"Spotify's Unusual IPO Model Will Test The Company's Strength Spotify's IPO, slated for this spring, gives investment banks a smaller role in the company's trading. It's been seen as a sign of Spotify's strength, but there are many unanswered questions. Accessibility links","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":4176985,"ranking":14,"query_text":"is spotify a publicly traded company","passage_text":"<br \/> <br \/> There are roughly 15000 publicly traded companies in the US, of which about 1\/3 are traded on exchanges and the other 2\/3 traded in various over-the-counter markets. Worldwide, according to a source at Bloomberg LP (which provides news on publicly-trade companies to the financial sector), there are about 63000 publicly-traded companies. There are roughly 15000 publicly traded companies in the US, of which about 1\/3 are traded on exchanges and the other 2\/3 traded in various over-the-counter markets.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":6046260,"ranking":15,"query_text":"is spotify a publicly traded company","passage_text":"Publicly held companies are traded on the stock exchange. John Foxx\/Stockbyte\/Getty Images. A publicly held, or publicly traded, organization offers its securities for sale to the general public and trades it stock on a stock exchange. Securities include stock in the company or shares of the company.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7480813,"ranking":16,"query_text":"is spotify a publicly traded company","passage_text":"AMWS) is a publicly-traded company and is engaged in the beverage bottling industry. Investors can vote on the level of responses and see how other investors have voted on any publicly-traded company. The purpose of the merger is to expedite SDSDC's bid to become a publicly-traded company.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":2983971,"ranking":17,"query_text":"is spotify a publicly traded company","passage_text":"DEFINITION of 'Reverse Takeover-RTO'. A type of merger used by private companies to become publicly traded without resorting to an initial public offering.Initially, the private company buys enough shares to control a publicly traded company.The private company's shareholder then uses their shares in the private company to exchange for shares in the public company. At this point, the private company has effectively become a publicly traded one.he private company's shareholder then uses their shares in the private company to exchange for shares in the public company. At this point, the private company has effectively become a publicly traded one.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":2104242,"ranking":18,"query_text":"is spotify a publicly traded company","passage_text":"A public company, publicly traded company, publicly held company, publicly listed company, or public corporation is a corporation whose ownership is dispersed among the general public in many shares of stock which are freely traded on a stock exchange or in over the counter markets.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":7723780,"ranking":19,"query_text":"is spotify a publicly traded company","passage_text":"publicly traded. Definition. A company which has issued securities through an offering, and which are now traded on the open market. also called publicly held or public company. opposite of private company. â\u0080\u009c You should decide if you want your company to be publicly traded or if you would rather just be private. â\u0080\u009d.","bm25_label":"high","relevance_label":0.0},{"query_id":424449,"passage_id":4647062,"ranking":20,"query_text":"is spotify a publicly traded company","passage_text":"NTT DATA is a publicly traded company, but is about 54 percent owned by NTT.TT DATA is a publicly traded company, but is about 54 percent owned by NTT.","bm25_label":"high","relevance_label":0.0}]