[{"query_id":424509,"passage_id":8733376,"ranking":1,"query_text":"is ssdi income taxed","passage_text":"1 Social Security Disability Income (SSDI) versus Supplemental Security Income (SSI). SSDI is paid from the Social Security Trust Fund to totally disabled individuals who have worked long enough and paid Social Security taxes. 2  Counting Social Security income of tax filers.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":1218185,"ranking":2,"query_text":"is ssdi income taxed","passage_text":"Your monthly SSDI income from the Social Security Administration depends on your earnings record. And even though your SSDI benefits come directly from the federal government, they still may be taxable. Read on to learn how monthly disability income is taxed for individuals as well as for joint income tax returns.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":1367097,"ranking":3,"query_text":"is ssdi income taxed","passage_text":"SSDI stands for Social Security Disability Insurance. SSDI is a federal insurance program that replaces the income a worker loses because of a significant disability. The SSDI system is funded through workersâ\u0080\u0099 payroll taxes.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":498678,"ranking":4,"query_text":"is ssdi income taxed","passage_text":"(Most of the one-third of disability recipients who do pay taxes on benefits receive SSDI benefits, not SSI. SSI recipients rarely have to pay taxes, because if they had enough income to be taxed, they wouldn't qualify for SSI.). If you or your spouse have another source of substantial income, it's likely your SSDI benefits could be taxed by the federal government.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":7350907,"ranking":5,"query_text":"is ssdi income taxed","passage_text":"Social Security Disability Insurance (SSDI). SSDI is a program designed for people who have worked and paid taxes into the Social Security system for years prior to becoming disabled. If an individual is judged disabled, the individual will receive SSDI benefits regardless of the individual's assets or family income. Supplemental Security Income (SSI).","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":5459674,"ranking":6,"query_text":"is ssdi income taxed","passage_text":"IRS was a worksheet to figure this out. You do not include the VA income when calculating this. A report is made to the IRS regarding SSDI income. My wife works and I have retirement and investment income, so I usually pay maximum taxes on my SSDI.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":1218187,"ranking":7,"query_text":"is ssdi income taxed","passage_text":"In fact, yes â\u0080\u0094 Social security disability benefits are taxable. However, most beneficiaries donâ\u0080\u0099t pay taxes on SSDI because they have very little (if any) additional income. Approximately one-fourth of SSDI recipients owed federal income taxes in 2015, usually because of their spouse or other household earnings.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":5642860,"ranking":8,"query_text":"is ssdi income taxed","passage_text":"Social Security disability benefits (SSDI) can be subject to tax, but most people do not end up paying taxes on them because they don't have much other income.About a third of Social Security disability recipients, however, do pay some taxes, because of their spouse's income or other household income.ederal Taxation of Social Security Disability Benefits. Here's how it works. If you are married and you file jointly, and you and your spouse have more than $32,000 per year in income (including SSDI benefits), a portion of your SSDI benefits are subject to tax.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":3225880,"ranking":9,"query_text":"is ssdi income taxed","passage_text":"Best Answer: It is possible for some of your Social Security Disability Insurance (SSDI) benefits can become taxable income to you when you have other sources of worldwide income from 50% to 85% of the SSDI payment could become taxable to you for the tax year.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":4496711,"ranking":10,"query_text":"is ssdi income taxed","passage_text":"Does Lupus Qualify as a Disability for SSI or SSDI? Adults with SLE may be eligible for Supplemental Security Income (SSI, for low-income people) or Social Security disability income (SSDI, for those who paid taxes into the Social Security system). The SSA details how significant the functional impairments caused by lupus must be for it to qualify as a disability.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":3784325,"ranking":11,"query_text":"is ssdi income taxed","passage_text":"Federal Taxation of Social Security Disability Benefits. Here's how it works. If you are married and you file jointly, and you and your spouse have more than $32,000 per year in income (including SSDI benefits), a portion of your SSDI benefits are subject to tax.nter Your Zip Code to Connect with a Lawyer Serving Your Area. Social Security disability benefits (SSDI) can be subject to tax, but most people do not end up paying taxes on them because they don't have much other income.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":8733373,"ranking":12,"query_text":"is ssdi income taxed","passage_text":"For children and tax dependents, Social Security income only counts toward the total household income if the individual is required to file a federal income tax return. For example, a childâ\u0080\u0099s survivor benefits or SSDI, even if the check is made out to the parent or guardian, only count if the child is required to file taxes.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":5642862,"ranking":13,"query_text":"is ssdi income taxed","passage_text":"85%. Keep in mind that if your disability benefits are subject to taxation, they will be taxed at your marginal income tax rate. In other words, your taxes would not be 50% or 85% of your benefits; they would probably be 10-15% of your benefits.ederal Taxation of Social Security Disability Benefits. Here's how it works. If you are married and you file jointly, and you and your spouse have more than $32,000 per year in income (including SSDI benefits), a portion of your SSDI benefits are subject to tax.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":4209367,"ranking":14,"query_text":"is ssdi income taxed","passage_text":"Social Security disability benefits (SSDI) can be subject to tax, but most people do not end up paying taxes on them because they don't have much other income. About a third of Social Security disability recipients, however, do pay some taxes, because of their spouse's income or other household income.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":2541694,"ranking":15,"query_text":"is ssdi income taxed","passage_text":"Not to be confused with Supplemental Security Income. SSDI redirects here. For the death index, see Social Security Death Index. Social Security Disability Insurance (SSD or SSDI) is a payroll tax-funded, federal insurance program of the United States government.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":6390291,"ranking":16,"query_text":"is ssdi income taxed","passage_text":"Social Security disability benefits (SSDI) can be subject to tax, but most people do not end up paying taxes on them because they don't have much other income.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":337573,"ranking":17,"query_text":"is ssdi income taxed","passage_text":"Monthly Social Security Disability Insurance (SSDI) Generally, the IRS can tax up to 50 percent of your Social Security disability benefits. To calculate this amount, add one-half of your SSDI benefits plus all of your other income sources. You will owe taxes on any amount above a base level.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":5642864,"ranking":18,"query_text":"is ssdi income taxed","passage_text":"Supplemental Security Income (SSI) is needs based. If your income and resources are low enough to qualify for SSI, then you are exempt from income tax by definition. However, up to 85 percent of Social Security Disability Insurance (SSDI) payments are taxable.The percentage that is taxable is based on your total provisional income.. Provisional income includes half of your income from Social Security and all other income.f your income and resources are low enough to qualify for SSI, then you are exempt from income tax by definition. However, up to 85 percent of Social Security Disability Insurance (SSDI) payments are taxable. The percentage that is taxable is based on your total provisional income..","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":1215532,"ranking":19,"query_text":"is ssdi income taxed","passage_text":"The Government Giveth and, Occasionally, Taketh Away: SSDI and Federal Income Tax. Social Security beneficiaries may have questions about whether their retroactive benefits and\/or their ongoing monthly benefits are taxable. This article gives general income tax guidance and should not be used as the basis for tax advice in individual cases.","bm25_label":"medium","relevance_label":0.0},{"query_id":424509,"passage_id":1252351,"ranking":20,"query_text":"is ssdi income taxed","passage_text":"If your income and resources are low enough to qualify for SSI, then you are exempt from income tax by definition. However, up to 85 percent of Social Security Disability Insurance (SSDI) payments are taxable.","bm25_label":"medium","relevance_label":0.0}]