[{"query_id":426442,"passage_id":7434231,"ranking":1,"query_text":"is the hawb the tracking number","passage_text":"Air Freight (HAWB) Tracking. The House Air Waybill (HAWB) tracking is a tool which is used to track your air freight or air cargo consignment by using your HAWB number or AMI booking reference number. We are currently in the process of developing an online HAWB Tracking tool which will become available in the coming months. This will allow you to track the progress of your consignment with ease via our website.","bm25_label":"high","relevance_label":1.0},{"query_id":426442,"passage_id":7434235,"ranking":2,"query_text":"is the hawb the tracking number","passage_text":"A House Air Waybill (HAWB) could act as a multimodal transport document. Therefore, HAWB or air consignment refers to a receipt issued by freight forwarder for goods and an evidence of the contract of carriage, but it is not a document of title to the goods. Hence, the HAWB is non-negotiable. There are two reference numbers on HAWB, one is on the top left with eleven digits is the Master Air Waybill and another one is on the top right is the HAWB number. HAWB number is always different from one freight forwarder to another without limitation or standard digit.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5405459,"ranking":3,"query_text":"is the hawb the tracking number","passage_text":"Making the world better, one answer at a time. Mawb has air lines document its has11 digits hawb is console document it has many numbers if house in shipment in mawb has consol address hawb has importer address if one document has 3 places mawb number it is master. 1 person found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5405465,"ranking":4,"query_text":"is the hawb the tracking number","passage_text":"Difference between AWB and HAWB - Air Waybill and House Airway bill. You can also read here - Difference between HAWB and MAWB. This article is a part of series of replies on questions asked by beginners of international trade relates to basics of export and import.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5405461,"ranking":5,"query_text":"is the hawb the tracking number","passage_text":"In documentary letter of credit transactions HAWBs are treated exactly the same as conventional air waybills, provided they indicate the issuer itself assumes the liability as carrier or is acting as the agent of a named carrier, or if the credit expressly permits the acceptance of a HAWB. Sea air waybill; bill of lading.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5405464,"ranking":6,"query_text":"is the hawb the tracking number","passage_text":"Hi Pals, from a strictly UCP 600 point of view difference is only in the signature. MAWB will be signed by issuing carrier or its agent, HAWB will be signed by issuing consolidator or its agent.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":8140382,"ranking":7,"query_text":"is the hawb the tracking number","passage_text":"Difference between Airway bill and Master Airway Bill Difference between AWB and HAWB - Airway bill and House Airway bill What is Combined Bill of Lading \/ Multi model Bill of Lading","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5405463,"ranking":8,"query_text":"is the hawb the tracking number","passage_text":"Airway bill is a document, which is a proof of receipt of goods from shipper issued by air carrier. If a freight forwarder or consolidator involved in a shipment, such forwarder issues a document of receipt of goods to the final shipper which is called House airway bill (HAWB).","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5405462,"ranking":9,"query_text":"is the hawb the tracking number","passage_text":"Could you kindly tell me what is the difference between MAWB & HAWB, about subject i am little bit confuse. Please explain depely if possibel give examples. i shell be very greatful to you all. Looking forward for your favorbale reply.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":6480791,"ranking":10,"query_text":"is the hawb the tracking number","passage_text":"Track by tracking number. 1  In the Tracking Number(s) box, enter a tracking number. To track more than one package, press Enter and then type another tracking number.  Select the Track button to view your results.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5405460,"ranking":11,"query_text":"is the hawb the tracking number","passage_text":"What is HAWB and how House airway bill works? When a shipper books cargo with a freight forwarder by air, he issues a document of reciept of goods from shipper which is called House airway Bill. In turn, the freight forwarder books same cargo with main airline carrier and he obtains MAWB under the said shipment.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":5354681,"ranking":12,"query_text":"is the hawb the tracking number","passage_text":"There are a number of reasons why tracking a particular tracking number may not be working. These vary by type of tracking number:iShip Tracking Numbers. iShip tracking numbers begin with the letters MM, MA, or EM and are 13 characters long.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":287279,"ranking":13,"query_text":"is the hawb the tracking number","passage_text":"Track up to 25 small package shipments at once by sending your tracking numbers in an e-mail message to totaltrack@ups.com. Track a Single Tracking Number. Enter the UPS Tracking Number in the subject line of the e-mail or in the body of the message. A detailed tracking response will be returned to your e-mail address. Track Multiple Tracking Numbers. Enter all UPS Tracking Numbers in the body of the e-mail message.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":148221,"ranking":14,"query_text":"is the hawb the tracking number","passage_text":"Track up to 25 small package shipments at once by sending your tracking numbers in an e-mail message to totaltrack@ups.com. Track a Single Tracking Number. Enter the UPS Tracking Number in the subject line of the e-mail or in the body of the message. A detailed tracking response will be returned to your e-mail address. Track Multiple Tracking Numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":3019857,"ranking":15,"query_text":"is the hawb the tracking number","passage_text":"Track by Tracking\/Reference Number. Enter any combination of up to 30 FedEx tracking, or door tag numbers (one per line). You can also track FedEx Office orders by entering order numbers. Track by any reference number related to your package or freight shipment, in addition to purchase order number. Track.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":4024309,"ranking":16,"query_text":"is the hawb the tracking number","passage_text":"What does it mean 'Ups tracking number has correct format, but wrong check digit'? Ups tracking number contains checkdigit that depends on characters in the tracking number. If calculated checkdigit differs from checkdigit from UPS tracking number, this indicates misprint. Check tracking number and provide correct number.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":4041873,"ranking":17,"query_text":"is the hawb the tracking number","passage_text":"Track by E-mail. Track a single shipment, or up to 25 shipments, by sending your UPS tracking numbers in an e-mail message. A detailed tracking response will be automatically returned to you. To find this e-mail address, select Track by E-mail on the Tracking page, or select the link below. 1  To track a single tracking number, type the number in the subject line of the e-mail or in the body of the message. 2  To track multiple tracking numbers, enter all of the numbers in the body of the e-mail message.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":190653,"ranking":18,"query_text":"is the hawb the tracking number","passage_text":"Track up to 25 small package shipments at once by sending your tracking numbers in an e-mail message to totaltrack@ups.com. Track a Single Tracking Number. Enter the UPS Tracking Number in the subject line of the e-mail or in the body of the message. A detailed tracking response will be returned to your e-mail address. Track Multiple Tracking Numbers. Enter all UPS Tracking Numbers in the body of the e-mail message. You do not need to specify a subject for the e-mail.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":7144945,"ranking":19,"query_text":"is the hawb the tracking number","passage_text":"Track a single shipment, or up to 25 shipments, by sending your UPS tracking numbers in an e-mail message. A detailed tracking response will be automatically returned to you. To find this e-mail address, select Track by E-mail on the Tracking page, or select the link below. 1  To track a single tracking number, type the number in the subject line of the e-mail or in the body of the message.  To track multiple tracking numbers, enter all of the numbers in the body of the e-mail message.","bm25_label":"high","relevance_label":0.0},{"query_id":426442,"passage_id":7406331,"ranking":20,"query_text":"is the hawb the tracking number","passage_text":"Track up to 25 small package shipments at once by sending your tracking numbers in an e-mail message to totaltrack.gb-eng@ups.com. Track a Single Tracking Number. Enter the UPS Tracking Number in the subject line of the e-mail or in the body of the message. A detailed tracking response will be returned to your e-mail address. Track Multiple Tracking Numbers. Enter all UPS Tracking Numbers in the body of the e-mail message. You do not need to specify a subject for the e-mail.","bm25_label":"high","relevance_label":0.0}]