[{"query_id":434462,"passage_id":7943856,"ranking":1,"query_text":"kindle account device serial number","passage_text":"The Serial Number is also shown on the Manage Your Kindle page of your Amazon account (in the Manage Your Devices section). If you've been switched to the new layout, this is now shown in the Your Devices tab of the Manage Your Content and Devices page of your Amazon account. *The Kindle e-Readers have Black & White screens.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":3528423,"ranking":2,"query_text":"kindle account device serial number","passage_text":"Along with the Send to Kindle email address for that device, you will see the device â\u0080\u009cTypeâ\u0080\u009d (of some value in determining your model) and below that you will see â\u0080\u009cSerial Number.â\u0080\u009d Therein lies the answer. The first four characters\/digits in the serial number are model specific. Here is a list that shows you which serial numbers line up with which models: Kindle 1: B001 (of course, Kindle 1 has a unique form factorâ\u0080¦;-) Kindle 2: B002, B003.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":6320740,"ranking":3,"query_text":"kindle account device serial number","passage_text":"You can find this sixteen digit code in the box your Kindle came in or when you click on Settings and go to Device Info. Find your specific generation or type based on the first four characters. The Serial Number is also shown on the Manage Your Kindle page of your Amazon account (in the Manage Your Devices section). If you've been switched to the new layout, this is now shown in the Your Devices tab of the Manage Your Content and Devices page of your Amazon account.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7943859,"ranking":4,"query_text":"kindle account device serial number","passage_text":"Kindle Serial Numbers. To confirm which Kindle model you have, we'll use the serial number of your device. The easiest way to find it is in the Settings page\/menu on your Kindle. On that page, you should find either an entry or a menu called Device Info, which will give you everything you need. (FW >= 2.5 only).","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7543318,"ranking":5,"query_text":"kindle account device serial number","passage_text":"After youâ\u0080\u0099ve added all of the plugins theyâ\u0080\u0099ll be listed in the â\u0080\u009cFile typeâ\u0080\u009d plugins list of Calibre. If youâ\u0080\u0099re running a Kindle device (except Fire) the Kindle and Mobipocket DeDRM plugin can be configured further to pull books directly from the device. Within the plugin settings you can add the Kindleâ\u0080\u0099s serial number. If you donâ\u0080\u0099t know it, you can gather your 16 digit serial number from Amazonâ\u0080\u0099s website under the Manage My Devices area. After youâ\u0080\u0099ve entered it, click OK and Apply to save changes. Note that this serial number is only necessary if you are going to pull DRM protected books directly off of your Kindle device.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7543323,"ranking":6,"query_text":"kindle account device serial number","passage_text":"This is a quick and dirty how-to. Essentially should you need to find the serial number on your Kindle 2, below are the steps. Turn on your Kindle 2 and press the [Home] key. Press the [Menu] key and choose Settings. Press the following keys in order: 411. The device info page will display with your serial number.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7543324,"ranking":7,"query_text":"kindle account device serial number","passage_text":"Essentially should you need to find the serial number on your Kindle 2, below are the steps. 1  Turn on your Kindle 2 and press the [Home] key. 2  Press the [Menu] key and choose Settings. 3  Press the following keys in order: 411.  The device info page will display with your serial number.","bm25_label":"high","relevance_label":1.0},{"query_id":434462,"passage_id":3528425,"ranking":8,"query_text":"kindle account device serial number","passage_text":"1 The Kindle DX also supports simple PDF files.  Kindle 2 & Kindle Keyboard - Refer to the serial number by selecting Settings > Device Info. The Kindle 2â\u0080\u0099s first four digits will be B002 or B003. The Kindle Keyboardâ\u0080\u0099s will be B006, B008, or B00A.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":3528432,"ranking":9,"query_text":"kindle account device serial number","passage_text":"Here are a few key traits. 1  Kindle 2 & Kindle DX - While both look very similar and have a keyboard, the Kindle DX has a larger screen, 9.7â\u0080\u009d diagonally compared to the Kindle 2â\u0080\u0099s 6â\u0080\u009d display.  Kindle 2 & Kindle Keyboard - Refer to the serial number by selecting Settings > Device Info.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":3528426,"ranking":10,"query_text":"kindle account device serial number","passage_text":"1 Kindle 2 & Kindle DX - While both look very similar and have a keyboard, the Kindle DX has a larger screen, 9.7â\u0080\u009d diagonally compared to the Kindle 2â\u0080\u0099s 6â\u0080\u009d display. The Kindle DX also supports simple PDF files.  Kindle 2 & Kindle Keyboard - Refer to the serial number by selecting Settings > Device Info.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":125517,"ranking":11,"query_text":"kindle account device serial number","passage_text":"Or you can find it by powering on your Kindle and going to 'Settings' then 'Device Info'. Find your specific generation or model based on the first four characters of the serial number. Kindle (2007): B001, B101. Kindle 2 (2009): B002, B003. Kindle DX (2010): B004, B005, B009.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7543319,"ranking":12,"query_text":"kindle account device serial number","passage_text":"Why would you need the serial number on your Kindle 2? Well for a few reasons. 1  In the case of loss or theft, to report it to either the police or your insurance company, you would most definitely need the device serial number. 2  To file a claim against the warranty. 3  To register the device online with Amazon.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7543316,"ranking":13,"query_text":"kindle account device serial number","passage_text":"To assign a Fire tablet or Kindle device to a User: 1  From the Groups tab, locate the User and click View Details. 2  Click Register Device. 3  Enter the serial number of the device you wish to assign to the User, and then click Save.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":2895861,"ranking":14,"query_text":"kindle account device serial number","passage_text":"More than one kindle devices to be attached to your account and not only.... 2. 0. There is no specific number for the kindle devices can be attached to your account.Generaly, and according to the rules you will be able to have more than one kindle devices to be attached to your account and not only one kindle device for one account. 73% - How do you add more devices to your nook account? 2  76% - How do i add devices to my amazon account? 3  31% - At&t high speed internet is that a good internet as far as online gaming and multiple wifi devices?","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":3528424,"ranking":15,"query_text":"kindle account device serial number","passage_text":"Check the Serial Number. You can find this sixteen digit code in the box your Kindle came in or when you click on Settings and go to Device Info. Find your specific generation or type based on the first four characters. Kindle 2: B002, B003. Kindle DX: B004, B005, B009.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":6964877,"ranking":16,"query_text":"kindle account device serial number","passage_text":"Oberon Design Secure Genuine Leather Covers for Fire Tablets and Kindle E-readers - Hand crafted in the USA The Easiest Way to I.D. your Kindle: Check the Serial Number You can find this sixteen digit code in the box your Kindle came in or when you click on Settings and go to Device Info.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7943858,"ranking":17,"query_text":"kindle account device serial number","passage_text":"How do I figure out which Kindle Model I have -- are those numbers on the receipt in the box the serial or model number? There is nothing on my Kindle that indicates the serial number. It's not a Kindle Fire. It has a 6 screen, no advertisements.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":7943854,"ranking":18,"query_text":"kindle account device serial number","passage_text":"The Easiest Way to I.D. your Kindle: Check the Serial Number. You can find this sixteen digit code in the box your Kindle came in or when you click on Settings and go to Device Info. Find your specific generation or type based on the first four characters.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":1846367,"ranking":19,"query_text":"kindle account device serial number","passage_text":"Why not share an ebook account, I proposed. We both have multiple Kindle devices and so I signed us up for a joint gmail account that we would attach to our joint Kindle account. This has been a lot of fun for me. I enjoy going into the Kindle account in hopes that sheâ\u0080\u0099s bought something great. From time to time, sheâ\u0080\u0099ll ask me what in our joint account we should read. Kindle permits up to 6 Kindle devices to be attached to one account and any number of apps.","bm25_label":"high","relevance_label":0.0},{"query_id":434462,"passage_id":3528429,"ranking":20,"query_text":"kindle account device serial number","passage_text":"Re the two Kindle-3 photos at the top. Amazon likes to call the latest Kindle just Kindle but that is just not going to work very well these days. FIRST, SERIAL NUMBERS FOR EACH MODELS (This section was updated in Yr 2011.) You can find the serial number on the back of your Kindle. If it starts with: B001...","bm25_label":"high","relevance_label":0.0}]