[{"query_id":436844,"passage_id":2579588,"ranking":1,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Largest Earthquakes in History. The following is a top ten list of the largest earthquakes ever recorded in history by magnitude. While there have been a large number of earthquakes that have measured a magnitude of between 8 and 9, there are only six on record that have measured between 9 and 10.argest Earthquakes in History. The following is a top ten list of the largest earthquakes ever recorded in history by magnitude. While there have been a large number of earthquakes that have measured a magnitude of between 8 and 9, there are only six on record that have measured between 9 and 10.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":2579587,"ranking":2,"query_text":"largest magnitude earthquake ever recorded","passage_text":"The highest magnitude earthquake that ever occured in the US was the 1964 Alaska earthquake on Friday, March 27, 1964. According to the US geological survey, it had a moment m â\u0080¦ agnitude of 9.2 and was the second largest earthquake recorded by seismometers.o. The largest earthquake ever recorded occurred in Valdivia, Chile in 1960 and had a magnitude of 9.5.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":3962292,"ranking":3,"query_text":"largest magnitude earthquake ever recorded","passage_text":"1960 Valdivia earthquake damage, USGS. Largest earthquake ever recorded. The 1960 earthquake in Chile was the largest earthquake ever recorded by seismographs. It was a 9.5 magnitude earthquake off the coast of Chile. The Nazca Plate, an oceanic plate, is subducting beneath the North American Plate, a continental plate.Megathrust earthquake.A megathrust earthquake was caused in the subduction zone by the movement of the plates.960 Chile Earthquake The 1960 Chile earthquake was a magnitude 9.5 the largest earthquake ever recorded! What Causes Earthquakes. Find out what causes earthquakes and other fascinating facts about when our planet shakes, rattles, and rolls.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":5941330,"ranking":4,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Largest Earthquakes in History. The following is a top ten list of the largest earthquakes ever recorded in history by magnitude. While there have been a large number of earthquakes that have measured a magnitude of between 8 and 9, there are only six on record that have measured between 9 and 10.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":2243662,"ranking":5,"query_text":"largest magnitude earthquake ever recorded","passage_text":"The largest earthquake ever recorded on Earth was a magnitude 9.5 that occurred in Chile in 1960, followed in size by the 1964 Good Friday earthquake in Alaska (magnitude 9.2), a magnitude 9.1 earthquake in Alaska during 1957, and a magnitude 9.0 earthquake in Russia during 1952.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":6095532,"ranking":6,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Indonesia, Sri Lanka, India, and Thailand were hardest hit. With a magnitude of between 9.1 and 9.3, it is the second largest earthquake ever recorded on a seismograph.This earthquake had the longest duration of faulting ever observed, between 8.3 and 10 minutes.ndonesia, Sri Lanka, India, and Thailand were hardest hit. With a magnitude of between 9.1 and 9.3, it is the second largest earthquake ever recorded on a seismograph.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":2382511,"ranking":7,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Alaska is home of the the second largest earthquake ever recorded (1964 Great Alaska Earthquake, magnitude 9.2) Alaska has 11 percent of the world's recorded earthquakes; Three of the eight largest earthquakes in the world were in Alaska; Seven of the ten largest earthquakes in the United States were in Alaska; Since 1900, Alaska has had an average of: One great earthquake (magnitude 8 or larger) earthquake every 13 years; One magnitude 7 to 8 earthquake every year","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":553722,"ranking":8,"query_text":"largest magnitude earthquake ever recorded","passage_text":"The 1960 earthquake in Chile was the largest earthquake ever recorded by seismographs. It was a 9.5 magnitude earthquake off the coast of Chile. The Nazca Plate, an oceanic plate, is subducting beneath the North American Plate, a continental plate.960 Chile Earthquake The 1960 Chile earthquake was a magnitude 9.5 the largest earthquake ever recorded! What Causes Earthquakes. Find out what causes earthquakes and other fascinating facts about when our planet shakes, rattles, and rolls.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":4695541,"ranking":9,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Alaska is home of the the second largest earthquake ever recorded (1964 Great Alaska Earthquake, magnitude 9.2) Alaska has 11 percent of the world's recorded earthquakes Three of the eight largest earthquakes in the world were in Alaska","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":2579593,"ranking":10,"query_text":"largest magnitude earthquake ever recorded","passage_text":"The largest earthquake ever recorded was in Chile in 1960 and it was recorded at a magnitude 9.5. It is said that 1,655 people were found dead and over 3,000 were injured. Two million citizens of Chile were left homeless after this natural disaster.his is the largest earthquake that has ever been recorded in Japan. On Honshu, there are still aftershocks from this original earthquake, adding up to more than 50 that have been greater than a magnitude 6.0 and 3 that were higher than magnitude 7.0.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":2382510,"ranking":11,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Alaska Earthquake Statistics. Alaska is home of the the second largest earthquake ever recorded (1964 Great Alaska Earthquake, magnitude 9.2) Alaska has 11 percent of the world's recorded earthquakes; Three of the eight largest earthquakes in the world were in Alaska; Seven of the ten largest earthquakes in the United States were in Alaska; Since 1900, Alaska has had an average of: One great earthquake (magnitude 8 or larger) earthquake every 13 years. One magnitude 7 to 8 earthquake every year. Six magnitude 6 to 7 earthquakes per year. Forty five magnitude 5 to 6 earthquakes per year.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":4734175,"ranking":12,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Alaska is home of the the second largest earthquake ever recorded (1964 Great Alaska Earthquake, magnitude 9.2) Alaska has 11 percent of the world's recorded earthquakes. Three of the eight largest earthquakes in the world were in Alaska. Seven of the ten largest earthquakes in the United States were in Alaska.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":3058560,"ranking":13,"query_text":"largest magnitude earthquake ever recorded","passage_text":"The following is a list of Top 10 Largest Earthquakes Ever Recorded, according to earthquake magnitude and fatalities. 10. Chile Earthquake, 2010. Photo credit: wikimedia. The 2010 Chile earthquake occurred in central Chile on 27th February 2010. It has a magnitude of 8.8 and ranked as one of the largest earthquake ever to be recorded. Due to earthquake a tsunami triggered and damaged several coastal towns in south central Chile. It also generated a blackout that affected 93% of Chile population and damaged US $66 million to the fisheries business.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":4471225,"ranking":14,"query_text":"largest magnitude earthquake ever recorded","passage_text":"The following is a top ten list of the largest earthquakes ever recorded in history by magnitude. While there have been a large number of earthquakes that have measured a magnitude of between 8 and 9, there are only six on record that have measured between 9 and 10.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":717506,"ranking":15,"query_text":"largest magnitude earthquake ever recorded","passage_text":"1960 Chile Earthquake The 1960 Chile earthquake was a magnitude 9.5 the largest earthquake ever recorded! Earthquake Zones Find out where and why earthquakes occur and why there are these zones. What Causes Earthquakes.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":4079989,"ranking":16,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Saturday, April 16th 2011. | Largest. On the following list is a top 10 largest earthquake ever recorded in humanâ\u0080\u0099s history. As information, before 1900, we did not have seismometers or earthquake scaler to count the force of magnitude so the data is debatable.I also included Japan earthquake that happened less than 2 months ago.aturday, April 16th 2011. | Largest. On the following list is a top 10 largest earthquake ever recorded in humanâ\u0080\u0099s history. As information, before 1900, we did not have seismometers or earthquake scaler to count the force of magnitude so the data is debatable.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":6463717,"ranking":17,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Earthquakes are measured based on their magnitude (the Richter scale). There have only been a couple that registered over a magnitude of 9.0 on the seismometer. An earthquake with a magnitude greater than 9.0 is an extreme natural disaster and are very rare. Hereâ\u0080\u0099s a countdown of the 10 largest earthquakes ever recorded: 10.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":8684220,"ranking":18,"query_text":"largest magnitude earthquake ever recorded","passage_text":"Magnitude: 9.2 What: Megathrust earthquake off the south-central coast of Alaska. Why: The second-largest earthquake ever recorded in the world, and the largest ever recorded in North America. Extensive liquefaction occurred and finally caught the attention of scientists. Shaking and underwater landslides produced many tsunamis.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":1861127,"ranking":19,"query_text":"largest magnitude earthquake ever recorded","passage_text":"The largest earthquake ever recorded was a 9.5 in 1960 in Valdivia, Chile. The Valdivia earthquake in Valdivia, Chile, which measured a 9.5 on the Richter scale that would be â\u0080¦ the earthquake in Chile in 1960.rating 9.5 on the magnitude scale killing 6000.he most powerful earthquake recorded in modern times was the 9.5 magnitude quake (moment magnitude) that struck Valdivia, Chile on May 22, 1960.","bm25_label":"medium","relevance_label":0.0},{"query_id":436844,"passage_id":4744514,"ranking":20,"query_text":"largest magnitude earthquake ever recorded","passage_text":"It was the most powerful recorded earthquake in U.S. and North American history, and the second most powerful ever measured by seismograph. It had a magnitude of 9.2, at the time making it the second largest earthquake in recorded history. The shaking lasted about 4 minutes. Landslides in Anchorage caused heavy damage.he 1960 Valdivia earthquake or Great Chilean Earthquake of Sunday, 22 May 1960 is to date the most powerful earthquake ever recorded in Earthâ\u0080\u0099s history, rating 9.5 on the moment magnitude scale.","bm25_label":"medium","relevance_label":0.0}]