[{"query_id":440362,"passage_id":7526863,"ranking":1,"query_text":"linking verb synonym","passage_text":"Synonyms for linking verb. an equating verb (such as 'be' or 'become') that links the subject with the complement of a sentence. Synonyms. copula. copulative.","bm25_label":"high","relevance_label":1.0},{"query_id":440362,"passage_id":7526858,"ranking":2,"query_text":"linking verb synonym","passage_text":"Synonyms and Antonyms for linking_verb. 1. linking verb (n.) an equating verb (such as `be' or `become') that links the subject with the complement of a sentence.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":1082378,"ranking":3,"query_text":"linking verb synonym","passage_text":"Synonyms for tie-in. This thesaurus page is about all possible synonyms, equivalent, same meaning and similar words for the term tie-in. Princeton's WordNet(0.00 \/ 0 votes)Rate these synonyms: link, linkup, tie, tie-in(verb) a fastener that serves to join or connect. Synonyms:","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":7003817,"ranking":4,"query_text":"linking verb synonym","passage_text":"Define Copulas. Copulas synonyms, Copulas pronunciation, Copulas translation, English dictionary definition of Copulas. Linking verbs are used to describe the state of being of the subject of a clause. Unlike action verbs , they connect the subject to the predicate of the...","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":3061211,"ranking":5,"query_text":"linking verb synonym","passage_text":"See more synonyms on Thesaurus.com. verb (used with object) 1. to join, link, or fasten together; unite or bind: to connect the two cities by a bridge; Communication satellites connect the local stations into a network.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":3104860,"ranking":6,"query_text":"linking verb synonym","passage_text":"Synonyms: afraid, alarmed, frightened, terrified More Synonyms of scared. 2. adjective [usually verb-link ADJECTIVE , oft ADJECTIVE that] If you are scared that something unpleasant might happen, you are nervous and worried because you think that it might happen. I was scared that I might be sick. He was scared of letting us down.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":6479246,"ranking":7,"query_text":"linking verb synonym","passage_text":"Princeton's WordNet(0.00 \/ 0 votes)Rate these synonyms: 1  turn, grow(verb) pass into a condition gradually, take on a specific property or attribute; become. Synonyms: 2  grow(verb) become larger, greater, or bigger; expand or gain. Synonyms: 3  grow(verb) increase in size by natural process. Synonyms:  grow(verb) cause to grow or develop. Synonyms:","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":4343702,"ranking":8,"query_text":"linking verb synonym","passage_text":"Wiktionary (0.00 \/ 0 votes) Rate these synonyms: remember (verb). Synonyms: recall, reminisce. remember (verb). To recall from one's memory; to have an image in one's memory. Synonyms: recall, reminisce. remember (verb). To memorize; to put something into memory.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":294217,"ranking":9,"query_text":"linking verb synonym","passage_text":"Linking Verbs continued ... Many important verbs do not express action; some verbs can link a noun or an adjective to the subject. This type of verb is called a linking verb. The linking verb connection between the subject to the noun or adjective is something like an equal sign. She is tall.-- She = tall. In grammar books the linked noun or linked adjective is sometimes called a predicate noun or a predicate adjective.inking Verbs-A List & is it Used as Action or Linking. Linking verbs are verbs that do not show action; instead, the linking verb renames or describes the subject. In this example sentence, . The kitten looked happy  the verb looked is used as a linking verb.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":6136881,"ranking":10,"query_text":"linking verb synonym","passage_text":"A subject complement is the adjective, noun, or pronoun that follows a linking verb. The following verbs are true linking verbs: any form of the verb be [ am, is, are, was, were, has been, are being, might have been, etc.], become, and seem. These true linking verbs are always linking verbs. subject complement is the adjective, noun, or pronoun that follows a linking verb. The following verbs are true linking verbs: any form of the verb be [ am, is, are, was, were, has been, are being, might have been, etc.], become, and seem. These true linking verbs are always linking verbs.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":4488741,"ranking":11,"query_text":"linking verb synonym","passage_text":"Linking Verbs-A List & is it Used as Action or Linking. Linking verbs are verbs that do not show action; instead, the linking verb renames or describes the subject. In this example sentence, . The kitten looked happy  the verb looked is used as a linking verb.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":294218,"ranking":12,"query_text":"linking verb synonym","passage_text":"Many important verbs do not express action; some verbs can link a noun or an adjective to the subject. This type of verb is called a linking verb. The linking verb connection between the subject to the noun or adjective is something like an equal sign.She is tall. -- She = tall. In grammar books the linked noun or linked adjective is sometimes called a predicate noun or a predicate adjective.inking Verbs-A List & is it Used as Action or Linking. Linking verbs are verbs that do not show action; instead, the linking verb renames or describes the subject. In this example sentence, . The kitten looked happy  the verb looked is used as a linking verb.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":6991829,"ranking":13,"query_text":"linking verb synonym","passage_text":"A linking verb is a verb that links (connects) the subject of the sentence to information about that subject. Linking verbs do not describe action. When using linking verbs, the sentence structure will be : SUBJECT--->LINKING VERB---> INFORMATION ABOUT THE SUBJECT (noun)(verb)(adjective, noun, or complement)","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":294214,"ranking":14,"query_text":"linking verb synonym","passage_text":"A linking verb is a verb that connects or (links) a verb to a noun or an adjective.example: I was cold. was, is has been, smelled, looked, are all linking verbs. Linking verbs do not express action. Instead they connect the subject of the verb to additional information about the subject. ___.The key thing about a 'linking verb' is that it is followed by an adjective, not an adverb.inking verbs do not express action. Instead they connect the subject of the verb to additional information about the subject. ___. The key thing about a 'linking verb' is that it is followed by an adjective, not an adverb.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":8305931,"ranking":15,"query_text":"linking verb synonym","passage_text":"All forms of the verb be are always linking verbs. Forms of be: be being been am is are was were. Other verbs can be linking verbs or action verbs: Examples: feel taste smell look grow. To find a linking verb: 1) If the verb is a form of be (be, being, been, am, is, are, was, were), you have a linking verb. 2) For other verbs, if you can replace the verb with a form of be and the sentence makes sense, you have a linking verb.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":1730905,"ranking":16,"query_text":"linking verb synonym","passage_text":"Wiktionary(5.00 \/ 1 vote)Rate these synonyms: 1  instigate(verb) Synonyms: 2  instigate(verb) To goad or urge forward; to set on; to provoke; to incite.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":294212,"ranking":17,"query_text":"linking verb synonym","passage_text":"Search. A linking verb is a verb which connects a subject to its predicate without expressing an action. A linking verb is used to re-identify or describe its subject. The word, phrase, or clause which follows a linking verb to re-identify or describe the subject is called the subject complement.The most common linking verb is the verb to be. linking verb is used to re-identify or describe its subject. The word, phrase, or clause which follows a linking verb to re-identify or describe the subject is called the subject complement. The most common linking verb is the verb to be.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":294213,"ranking":18,"query_text":"linking verb synonym","passage_text":"A linking verb is a verb which connects a subject to its predicate without expressing an action. A linking verb is used to re-identify or describe its subject.The word, phrase, or clause which follows a linking verb to re-identify or describe the subject is called the subject complement.The most common linking verb is the verb to be. linking verb is used to re-identify or describe its subject. The word, phrase, or clause which follows a linking verb to re-identify or describe the subject is called the subject complement. The most common linking verb is the verb to be.","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":918977,"ranking":19,"query_text":"linking verb synonym","passage_text":"Linking Verbs. Linking Verbs are verbs that express a state of being. They are called linking verbs because they link the subject of the sentence to a word or phrase in the predicate that renames or describes the subject (tells us more about the subject's state of being). Examples of Linking Verbs:","bm25_label":"high","relevance_label":0.0},{"query_id":440362,"passage_id":1965435,"ranking":20,"query_text":"linking verb synonym","passage_text":"tread (noun) the part (as of a wheel or shoe) that makes contact with the ground. Synonyms: pace, stride. tread (verb) structural member consisting of the horizontal part of a stair or step. Synonyms: pace, stride. step, tread (verb) put down or press the foot, place the foot For fools rush in where angels fear to tread; step on the brake Synonyms: maltreat, step, tread, pace, abuse, trample, mistreat, ill-use, ill-treat. tread, trample (verb) tread or stomp heavily or roughly The soldiers trampled across the fields Synonyms: tramp down, tread, step, tread down, trample. tread (verb) crush as if by treading on tread grapes to make wine Synonyms: step, trample. tread (verb) brace (an archer's bow) by pressing the foot against the center. Synonyms: step, trample. tread (verb)","bm25_label":"high","relevance_label":0.0}]