[{"query_id":450921,"passage_id":7411800,"ranking":1,"query_text":"median house price for spokane wa","passage_text":"The Spokane housing market continues to benefit from real estate appreciation. In the past year, median home prices have actually increased 3.5 percent. Accordingly, median home prices are now resting at $176,900 in the Spokane housing market.","bm25_label":"high","relevance_label":1.0},{"query_id":450921,"passage_id":6289993,"ranking":2,"query_text":"median house price for spokane wa","passage_text":"Spokane, WA 99218. 22 hours ago. $2.36update. There are 102 Regular gas price reports in the past 5 days in Spokane, WA. The average Regular gas price in Spokane, WA is $2.40, which is $0.38 lower than U.S. national average Regular gas price $2.78.The lowest Regular gas price is $2.18 of Conoco-Gull Industries Inc located at 305 S Thor St, Spokane, WA 99202.pokane, WA 99218. 22 hours ago. $2.36update. There are 102 Regular gas price reports in the past 5 days in Spokane, WA. The average Regular gas price in Spokane, WA is $2.40, which is $0.38 lower than U.S. national average Regular gas price $2.78.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":5589216,"ranking":3,"query_text":"median house price for spokane wa","passage_text":"fuel consumption Spokane,WA - Wenatchee,WA. fuel price Spokane,WA - Wenatchee,WA. Adjustment of fuel consumption and fuel price for Spokane,WA - Wenatchee,WA. You can modify the values â\u0080\u008bâ\u0080\u008bcorresponding to the average consumption value of your vehicle, fuel prices could be as well modified with any desired value.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":1904913,"ranking":4,"query_text":"median house price for spokane wa","passage_text":"Median real estate property taxes paid for housing units with mortgages in 2015: $725 (0.7%) Median real estate property taxes paid for housing units with no mortgage in 2015: $584 (0.7%) Nearest city with pop. 50,000+: Spokane Valley, WA (24.1 miles , pop. 89,755).","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":5589211,"ranking":5,"query_text":"median house price for spokane wa","passage_text":"Cheap Flights from Wenatchee, WA to Spokane, WA. Prices from Wenatchee to Spokane are stable. Prices are Stable. We track the prices of flights between all major cities searched by priceline customers. While prices may fluctuate slightly from day to day, overall we have seen little change in prices for this route. best days to fly from Wenatchee, WA (EAT) to Spokane, WA (GEG)","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":1279992,"ranking":6,"query_text":"median house price for spokane wa","passage_text":"There are 80 Regular gas price reports in the past 5 days in Spokane, WA. The average Regular gas price in Spokane, WA is $2.80, which is $0.43 higher than U.S. national average Regular gas price $2.37. The lowest Regular gas price is $2.67 of Texaco located at 4617 N Nevada St, Spokane, WA 99207.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":2492409,"ranking":7,"query_text":"median house price for spokane wa","passage_text":"Valleyford, WA Real Estate & Homes for Sale Homes for Sale in Valleyford, WA have a median listing price of $499,500 and a price per square foot of $137. There are 10 active homes for sale in Valleyford, Washington, which spend an average of days on the market. Some of the hottest neighborhoods near Valleyford, WA are Lincoln Heights, Latah Valley, East Central, Comstock. You may also be interested in homes for sale in popular zip codes like 99036, 99023, or in neighboring cities, such as Spokane, Spokane Valley, Cheney, Greenacres, Liberty Lake.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":6391419,"ranking":8,"query_text":"median house price for spokane wa","passage_text":"fuel consumption Spokane,WA - Bozeman,MT. fuel price Spokane,WA - Bozeman,MT. Adjustment of fuel consumption and fuel price for Spokane,WA - Bozeman,MT. You can modify the values â\u0080\u008bâ\u0080\u008bcorresponding to the average consumption value of your vehicle, fuel prices could be as well modified with any desired value.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":5589212,"ranking":9,"query_text":"median house price for spokane wa","passage_text":"Change the route for US. After generating the route Spokane,WA - Wenatchee,WA could be changed by simply dragging the line with the mouse. The change can be applied to any intermediate points of that route as well as the points of departure and arrival. fuel price Spokane,WA - Wenatchee,WA.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":4924576,"ranking":10,"query_text":"median house price for spokane wa","passage_text":"Spokane enjoys a lower cost of living than Seattle, making this a great city to explore houses for sale or apartments for rent. Average house price is $125,000, while the median price for apartment rentals is $530 per month.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":188543,"ranking":11,"query_text":"median house price for spokane wa","passage_text":"The total driving time is 1 hour, 25 minutes. Your trip begins in Spokane, Washington. It ends in Pullman, Washington. If you're planning a road trip, you might be interested in seeing the total driving distance from Spokane, WA to Pullman, WA. You can also calculate the cost to drive from Spokane, WA to Pullman, WA based on current local gas prices and an estimate of your car's best gas mileage. If you're meeting a friend, you might be interested in finding the city that is halfway between Spokane, WA and Pullman, WA.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":6391418,"ranking":12,"query_text":"median house price for spokane wa","passage_text":"After generating the route Spokane,WA - Bozeman,MT could be changed by simply dragging the line with the mouse. The change can be applied to any intermediate points of that route as well as the points of departure and arrival. fuel price Spokane,WA - Bozeman,MT.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":1597252,"ranking":13,"query_text":"median house price for spokane wa","passage_text":"Homefacts City Report. Colbert is located in Spokane County, WA. The population is NR. There are 3 public schools in Colbert with an average Homefacts rating of A-. The total crime rate for Colbert is high, and there are 2 registered sex offenders residing in the city. Unemployment in Colbert is high and the median home sales price is $0.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":8025582,"ranking":14,"query_text":"median house price for spokane wa","passage_text":"Spokane, WA: Full Time Home Health Occupational Therapist Assistant: Kindred at Home: Spokane, WA: $67k-$102k: Maintenance Supervisor: FPI Management: Spokane, WA: $41k-$62k: Plant Operations Assistant: Leisure Care: Spokane, WA: $27k-$42k: US-Specialist: Apple: Spokane, WA: $33k-$47k: Loader: Southwest Airlines: Spokane, WA: $22k-$34k: RN\/LPN Skilled Nursing: Pediatric Home Care: Spokane, WA","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":3717963,"ranking":15,"query_text":"median house price for spokane wa","passage_text":"road trip planner the total cost of driving from bismarck nd to spokane wa one way is $ 94 64 at current gas prices the round trip cost would be $ 189 28 to go from bismarck nd to spokane wa and back to bismarck nd againregular fuel costs are around $ 2 48 per gallon for your triphese results are based on the actual driving distance from bismarck nd to spokane wa which is 955 miles or 1 537 kilometers your trip begins in bismarck north dakota the price of regular gas is currently averaging $ 2 47 in north dakota your trip ends in spokane washington","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":7229095,"ranking":16,"query_text":"median house price for spokane wa","passage_text":"The median sales price for homes in Spokane for May 24 to Aug 23 was $199,900 based on 1,629 home sales. Price Per Square Ft. Average price per square foot for Spokane was $157, an increase of 11% compared to the same period last year. Median Rent Per Month The median rent per month for apartments in Spokane for Jul 24 to Aug 24 was $1,250.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":6059843,"ranking":17,"query_text":"median house price for spokane wa","passage_text":"You can also calculate the cost of driving from Spokane, WA to Helena, MT based on current local fuel prices and an estimate of your car's best gas mileage. If you're meeting a friend, you might be interested in finding the city that is halfway between Spokane, WA and Helena, MT.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":3717964,"ranking":18,"query_text":"median house price for spokane wa","passage_text":"these results are based on the actual driving distance from bismarck nd to spokane wa which is 955 miles or 1 537 kilometers your trip begins in bismarck north dakota the price of regular gas is currently averaging $ 2 47 in north dakotayour trip ends in spokane washingtonhese results are based on the actual driving distance from bismarck nd to spokane wa which is 955 miles or 1 537 kilometers your trip begins in bismarck north dakota the price of regular gas is currently averaging $ 2 47 in north dakota your trip ends in spokane washington","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":5589208,"ranking":19,"query_text":"median house price for spokane wa","passage_text":"1 Spokane, WA is 223 miles from Wenatchee. 2  There are 50 daily flights from Spokane, WA to Wenatchee. 3  There are 51 weekly flights from Spokane, WA to Wenatchee.  50 non-stop flights are operating from Spokane, WA to Wenatchee today.","bm25_label":"high","relevance_label":0.0},{"query_id":450921,"passage_id":4849178,"ranking":20,"query_text":"median house price for spokane wa","passage_text":"Spokane, WA Sales Tax Rate. The current total local sales tax rate in Spokane, WA is 8.700%. The December 2015 total local sales tax rate was also 8.700%. Spokane, WA is in Spokane County.","bm25_label":"high","relevance_label":0.0}]