[{"query_id":455456,"passage_id":7641627,"ranking":1,"query_text":"molar mass of phenol","passage_text":"Phenol, #C_6H_5OH#, has a molar mass of #94.91# #g*mol^-1#. #5.5# #mol# has a mass of #5.5*cancel(mol)xx94.91# #g*cancel(mol^-1)# #=# #??g#.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":7641623,"ranking":2,"query_text":"molar mass of phenol","passage_text":"Find the molar mass of phenol - approx 12x6 + 1x6 + 16 = 94 g\/mol (use atomic mass values expected in your course as I have used simple values.) 2.000g releases 64.98 kJ, so. 94g releases (64.98\/2.000) x 94g.","bm25_label":"high","relevance_label":1.0},{"query_id":455456,"passage_id":5419369,"ranking":3,"query_text":"molar mass of phenol","passage_text":"Novolacs are phenol-formaldehyde resins with a formaldehyde to phenol molar ratio of less than one. The polymerization is brought to completion using acid-catalysis such as oxalic acid, hydrochloric acid or sulfonate acids.The phenol units are mainly linked by methylene and\/or ether groups.ovolacs are phenol-formaldehyde resins with a formaldehyde to phenol molar ratio of less than one. The polymerization is brought to completion using acid-catalysis such as oxalic acid, hydrochloric acid or sulfonate acids.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":5419367,"ranking":4,"query_text":"molar mass of phenol","passage_text":"Phenol formaldehyde resins (PF) are synthetic polymers obtained by the reaction of phenol or substituted phenol with formaldehyde.ovolacs are phenol-formaldehyde resins with a formaldehyde to phenol molar ratio of less than one. The polymerization is brought to completion using acid-catalysis such as oxalic acid, hydrochloric acid or sulfonate acids.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":7641626,"ranking":5,"query_text":"molar mass of phenol","passage_text":"Figure 2 shows the elugram of an oligomeric phenol formaldehyde resign, separated into. three different peaks with 1, 2 and 3 repetition units. The mass spectra are then measured. online for each species. Figure 3 shows as example the mass spectrum of Peak n=1, while Table 1 summarizes the. masses possible in theory and identified (green) or not detected (grey). This combined. approach can be used for molar masses up to approx. 2 000 Da, higher degrees of. polymerization have also been investigated.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":3890666,"ranking":6,"query_text":"molar mass of phenol","passage_text":"Molar Mass of Frequently Calculated Chemicals: The mass and molarity of chemical compounds can be calculated based on the molar mass of the compound. The mass (in grams) of a compound is equal to its molarity (in moles) multiply its molar mass: grams = mole Ã\u0097 molar mass. E.g.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":3935450,"ranking":7,"query_text":"molar mass of phenol","passage_text":"molar mass = #1Ca + 2 [ 1N + 3O ] #. Molar mass =# 40 + 2( 14 + 48 ) #. molar mass= #40 + 2 ( 62) #. molar mass= # 40 + 124 #. molar mass= # 164 #.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":5552062,"ranking":8,"query_text":"molar mass of phenol","passage_text":"The mass and molarity of chemical compounds can be calculated based on the molar mass of the compound. The mass (in grams) of a compound is equal to its molarity (in moles) multiply its molar mass: grams = mole Ã\u0097 molar mass.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":7639709,"ranking":9,"query_text":"molar mass of phenol","passage_text":"Molar Mass is the mass of one mole of a substance (6.02 x 10 23 formula units). The unit for molar mass (note it is the mass of a mole) is grams\/mole.Atomic Weight is the molar mass of an element. Formula Weight is the molar mass of an IONIC compound.Molecular Weight is the molar mass of a COVALENT compound.olar Mass is the mass of one mole of a substance (6.02 x 10 23 formula units). The unit for molar mass (note it is the mass of a mole) is grams\/mole.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":7639708,"ranking":10,"query_text":"molar mass of phenol","passage_text":"Definitions. Molar Mass is the mass of one mole of a substance (6.02 x 10 23 formula units). The unit for molar mass (note it is the mass of a mole) is grams\/mole. Atomic Weight is the molar mass of an element. Formula Weight is the molar mass of an IONIC compound.Molecular Weight is the molar mass of a COVALENT compound.olar Mass is the mass of one mole of a substance (6.02 x 10 23 formula units). The unit for molar mass (note it is the mass of a mole) is grams\/mole.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":4788597,"ranking":11,"query_text":"molar mass of phenol","passage_text":"The mass in grams of one mole of substance is called molar mass. Each element has its own unique molar mass. For example, carbonâ\u0080\u0099s molar mass is 12.011 g\/mol, and magnesiumâ\u0080\u0099s molar mass is 24.3050 g\/mol.he number of grams in the molar mass of an element is the same as the atomic mass. Translating atomic masses into molar masses, you can construct conversion factors that convert between the mass of an element and the number of moles of the element.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":1551933,"ranking":12,"query_text":"molar mass of phenol","passage_text":"eg) Molar mass for C is 12.0107 g\/mol Do this for hydrogen and oxygen as well... A. The molar mass is the sum of all the elements in the compound multiplied by their molar masses. In the case of ribose, in one compound there are 5 carbons, 10 hydrogens, and 5 oxygens. So to find the molar mass of the compound: 5x(molar mass of C) + 10x(molar mass of H) + 5x(molar mass of O) = 5x(12.0107) + ...... *the total of all those added together will be the molar mass of the compound. B. The mass of 3.87 moles of ribose: Molar mass is in g\/mol ...the g is the mass. So if you multiply the number of moles by the molar mass of ribose, the moles will cancel leaving you with g (the mass). To find the number of oxygen atoms you need to write the ratio of oxgen to ribose. Look at the compound (C5H10O5) ...notice that in every 1 ribose compound there are 5 oxygens.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":5419376,"ranking":13,"query_text":"molar mass of phenol","passage_text":"Base-catalysed phenol-formaldehyde resins are made with a formaldehyde to phenol ratio of greater than one (usually around 1.5). These resins are called resoles. Phenol, formaldehyde, water and catalyst are mixed in the desired amount, depending on the resin to be formed, and are then heated.ovolacs are phenol-formaldehyde resins with a formaldehyde to phenol molar ratio of less than one. The polymerization is brought to completion using acid-catalysis such as oxalic acid, hydrochloric acid or sulfonate acids.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":3935446,"ranking":14,"query_text":"molar mass of phenol","passage_text":"Molar Mass is the mass of one mole of a substance (6.02 x 1023 formula units). The unit for molar mass (note it is the mass of a mole) is grams\/mole. Atomic Weight is the molar mass of an element. Formula Weight is the molar mass of an IONIC compound.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":7380924,"ranking":15,"query_text":"molar mass of phenol","passage_text":"Stuart W. Share. Nov 20, 2015. Divide the mass of a particular element by the molar mass of that element. Moles# = (mass)\/(Molar Mass)#. You can find the molar mass of an element off of the periodic table. Since molar mass is measured in g\/mol, dividing mass by molar mass cancels the mass unit (grams) leaving only a number of moles as your answer.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":7641629,"ranking":16,"query_text":"molar mass of phenol","passage_text":"Alright so the equation is : C6H5OH(s)+7O2(g) -> 6CO2(g)+3H2O(l) 2.000g of pure phenol is completely burned (^). 64.98kJ of heat was released. What is the molar heat of combustion of phenol in kJ\/mole at 25 Celcius.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":5257703,"ranking":17,"query_text":"molar mass of phenol","passage_text":"1 A substance's molar mass is calculated by multiplying its relative atomic mass by the molar mass constant (1 g\/mol).  The molar mass constant can be used to convert mass to moles. By multiplying a given mass by the molar mass, the amount of moles of the substance can be calculated.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":3055366,"ranking":18,"query_text":"molar mass of phenol","passage_text":"The Ideal Gas Law can be re-arranged to calculate the molar mass of unknown gases. PV = nRT n = mass (g) molar mass (g\/mol) PV = mass (RT) mass x R x T = molar mass molar mass P x V Knowing that the units for density are mass\/volume, re-write this equation so that it equates density with molar mass.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":3220539,"ranking":19,"query_text":"molar mass of phenol","passage_text":"Definitions of molecular mass, molecular weight, molar mass and molar weight. 1  Molecular mass (molecular weight) is the mass of one molecule of a substance and is expressed in the unified atomic mass units (u).  Molar mass (molar weight) is the mass of one mole of a substance and is expressed in g\/mol.","bm25_label":"high","relevance_label":0.0},{"query_id":455456,"passage_id":1467380,"ranking":20,"query_text":"molar mass of phenol","passage_text":"For an element, what is the relationship between atomic mass and molar mass? molar mass is the value of atomic mass with units How do you determine the molar mass of a compound?","bm25_label":"high","relevance_label":0.0}]