[{"query_id":455862,"passage_id":7215799,"ranking":1,"query_text":"monthly average temperature flagstaff az","passage_text":"Flagstaff weather averages and climate Flagstaff, Arizona. The monthly temperature, precipitation and hours of sunshine. A climate graph showing the rainfall data, temperatures and normals. Average weather Flagstaff, AZ.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":5630467,"ranking":2,"query_text":"monthly average temperature flagstaff az","passage_text":"The highest average temperature in Flagstaff is July at 78.2 degrees. The coldest average temperature in Flagstaff is December at 29.6 degrees. The most monthly precipitation in Flagstaff occurs in October with 1 inches.The Flagstaff weather information is based on the average of the previous 3-7 years of data.Loading...he Flagstaff, AZ air quality index is 25.4% less than the Arizona average and 15.5% less than the national average. The Flagstaff, AZ pollution index is the sum of the most hazardous air pollutants displayed in pounds.","bm25_label":"high","relevance_label":1.0},{"query_id":455862,"passage_id":5630468,"ranking":3,"query_text":"monthly average temperature flagstaff az","passage_text":"0.7. The highest average temperature in Flagstaff is July at 78.2 degrees. The coldest average temperature in Flagstaff is December at 29.6 degrees. The most monthly precipitation in Flagstaff occurs in October with 1 inches. The Flagstaff weather information is based on the average of the previous 3-7 years of data.Loading...he Flagstaff, AZ air quality index is 25.4% less than the Arizona average and 15.5% less than the national average. The Flagstaff, AZ pollution index is the sum of the most hazardous air pollutants displayed in pounds.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":6967855,"ranking":4,"query_text":"monthly average temperature flagstaff az","passage_text":"The highest average temperature in Flagstaff is July at 78.2 degrees. The coldest average temperature in Flagstaff is December at 29.6 degrees. The most monthly precipitation in Flagstaff occurs in October with 1 inches.The Flagstaff weather information is based on the average of the previous 3-7 years of data.he Flagstaff, AZ air quality index is a median value which considers the most hazardous air pollutants. The Flagstaff, AZ air quality index is 25.4% less than the Arizona average and 15.5% less than the national average.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":6967856,"ranking":5,"query_text":"monthly average temperature flagstaff az","passage_text":"0.7. The highest average temperature in Flagstaff is July at 78.2 degrees. The coldest average temperature in Flagstaff is December at 29.6 degrees. The most monthly precipitation in Flagstaff occurs in October with 1 inches. The Flagstaff weather information is based on the average of the previous 3-7 years of data.he Flagstaff, AZ air quality index is a median value which considers the most hazardous air pollutants. The Flagstaff, AZ air quality index is 25.4% less than the Arizona average and 15.5% less than the national average.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":6967860,"ranking":6,"query_text":"monthly average temperature flagstaff az","passage_text":"Most \/ Least Educated Cities in AZ. The average temperature of Flagstaff is 48.42Â°F, which is much lower than the Arizona average temperature of 65.97Â°F and is much lower than the national average temperature of 54.45Â°F.ost \/ Least Educated Cities in AZ. The average temperature of Flagstaff is 48.42Â°F, which is much lower than the Arizona average temperature of 65.97Â°F and is much lower than the national average temperature of 54.45Â°F.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":7215795,"ranking":7,"query_text":"monthly average temperature flagstaff az","passage_text":"Average Monthly Temperatures in Flagstaff, Arizona This Flagstaff Weather Chart will help you plan the best time to visit Flagstaff. It shows the average high and low temperatures for each month of the year.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":1912607,"ranking":8,"query_text":"monthly average temperature flagstaff az","passage_text":"Average Monthly Temperatures in Flagstaff, Arizona. This Flagstaff Weather Chart will help you plan the best time to visit Flagstaff. It shows the average high and low temperatures for each month of the year. It also reflects average rainfall, sunrise times and sunset times.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":7215793,"ranking":9,"query_text":"monthly average temperature flagstaff az","passage_text":"Flagstaff. The tables below display average monthly climate and weather indicators in Flagstaff Arizona. Temperature by: Fahrenheit \/ Centigrade","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":7215792,"ranking":10,"query_text":"monthly average temperature flagstaff az","passage_text":"Get Flagstaff, AZ 86001 current weather reports and conditions including temperature, RealFeel and precipitation from AccuWeather.com Get Flagstaff, AZ 86001 current weather reports and conditions including temperature, RealFeel and precipitation from AccuWeather.com my recent locations Â°f Flagstaff, AZ 26Â°","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":2258864,"ranking":11,"query_text":"monthly average temperature flagstaff az","passage_text":"Detailed temperature information for Tucson, Arizona with statistics on average monthly highs and lows plus number of days with hot or cold weather. Monthly temperature information for: Flagstaff Grand Canyon Phoenix Prescott Scottsdale Sedona Yuma.etailed temperature information for Tucson, Arizona with statistics on average monthly highs and lows plus number of days with hot or cold weather. Monthly temperature information for: Flagstaff Grand Canyon Phoenix Prescott Scottsdale Sedona Yuma.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":7215800,"ranking":12,"query_text":"monthly average temperature flagstaff az","passage_text":"Intellicast.com: The Authority in Expert Weather Flagstaff, Arizona historic weather averages and records (86001). Flagstaff, Arizona Climate report for average, high and low temperature, precipitation and snow. Monthly and Daily weather averages and records for Flagstaff, Arizona Intellicast.com The Authority in Expert Weather","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":1912612,"ranking":13,"query_text":"monthly average temperature flagstaff az","passage_text":"What's The Weather Like in Flagstaff, AZ? Because temperatures average 25 degrees Fahrenheit lower than the Phoenix area, Flagstaff is a favorite summer getaway from the desert area down south. Flagstaff, Arizona is high mountain forest country. At 7,000 feet elevation, you can expect four distinct seasons.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":8259790,"ranking":14,"query_text":"monthly average temperature flagstaff az","passage_text":"The Flagstaff, AZ air quality index is 25.4% less than the Arizona average and 15.5% less than the national average. The Flagstaff, AZ pollution index is the sum of the most hazardous air pollutants displayed in pounds.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":4268448,"ranking":15,"query_text":"monthly average temperature flagstaff az","passage_text":"More trip calculations. 1  driving distance from Flagstaff, AZ to Prescott, AZ. 2  reverse driving time from Prescott, AZ to Flagstaff, AZ. 3  halfway between Flagstaff, AZ and Prescott, AZ. 4  hotels near Prescott, AZ. 5  distance to fly from Flagstaff, AZ to Prescott, AZ.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":1154639,"ranking":16,"query_text":"monthly average temperature flagstaff az","passage_text":"$ 78000 average orthopedic physician assistant salaries for job postings in flagstaff az are 2 % higher than average orthopedic physician assistant salaries for job postings nationwide 78000 average orthopedic physician assistant salaries for job postings in flagstaff az are 2 % higher than average orthopedic physician assistant salaries for job postings nationwide","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":1025242,"ranking":17,"query_text":"monthly average temperature flagstaff az","passage_text":"Sedona Weather and Average Temperatures. The elevation of Sedona, AZ is about 4,500 feet. Driving up Oak Creek Canyon from Sedona the elevation gains 2,000 feet from the bottom to the top of the rim on Highway 89A towards Flagstaff.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":7429430,"ranking":18,"query_text":"monthly average temperature flagstaff az","passage_text":"Flagstaff, AZ - Weather forecast from Theweather.com. Weather conditions with updates on temperature, humidity, wind speed, snow, pressure, etc. for Flagstaff, Arizona Today: Sunny intervals, with a maximum temperature of 63Â° and a minimum temperature of 27Â°. Moderate northwest wind with maximum gusts of 24 mph.","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":2006303,"ranking":19,"query_text":"monthly average temperature flagstaff az","passage_text":"Weather.com brings you the most accurate monthly weather forecast for Tucson, AZ with average\/record and high\/low temperatures, precipitation and more. Weather.com brings you the most accurate monthly weather forecast for Tucson, AZ with average\/record and high\/low temperatures, precipitation and more. Connection restored! Show me the weather in... city, zip, or place","bm25_label":"high","relevance_label":0.0},{"query_id":455862,"passage_id":5509424,"ranking":20,"query_text":"monthly average temperature flagstaff az","passage_text":"More trip calculations. 1  driving distance from Flagstaff, AZ to Albuquerque, NM. 2  cost to drive from Flagstaff, AZ to Albuquerque, NM. 3  reverse driving time from Albuquerque, NM to Flagstaff, AZ. 4  halfway between Flagstaff, AZ and Albuquerque, NM. 5  places to stop from Flagstaff, AZ to Albuquerque, NM.","bm25_label":"high","relevance_label":0.0}]