[{"query_id":463230,"passage_id":8362712,"ranking":1,"query_text":"neonatal hemochromatosis causes","passage_text":"In addition to primary hemochromatosis â\u0080\u0093 an inherited disease also known as hereditary and genetic hemochromatosis â\u0080\u0093 and secondary hemochromatosis, there are two other forms of the disease: juvenile hemochromatosis and neonatal hemochromatosis.Hemochromatosis causes the body to absorb and store too much iron.Because the body has no system through which to rid itself of excess iron, it gets stored in the tissue. The surplus iron accumulates in the organs causing them damage. If left untreated, hemochromatosis can cause heart, liver, and pancreatic failure.n addition to primary hemochromatosis â\u0080\u0093 an inherited disease also known as hereditary and genetic hemochromatosis â\u0080\u0093 and secondary hemochromatosis, there are two other forms of the disease: juvenile hemochromatosis and neonatal hemochromatosis.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677230,"ranking":2,"query_text":"neonatal hemochromatosis causes","passage_text":"Research the causes of these diseases that are similar to, or related to, Neonatal hemochromatosis: 1  Neonatal iron storage disease. 2  Neonatal iron storage disorder. 3  Perinatal hemochromatosis fulminant.  Hepatic failure in 1  utero. Hepatic iron disease.  HFE 1  disease. more related diseases...Â».","bm25_label":"high","relevance_label":1.0},{"query_id":463230,"passage_id":7677234,"ranking":3,"query_text":"neonatal hemochromatosis causes","passage_text":"In a detailed review of the neonatal hemochromatosis, Whitington (2007) noted that liver disease is generally apparent within hours of birth and is one of the most commonly recognized causes of liver failure in the neonate.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677237,"ranking":4,"query_text":"neonatal hemochromatosis causes","passage_text":"Neonatal hemochromatosis is not a single disorder but is a syndrome with an unclear etiology. Neonatal hemochromatosis represents disordered iron handling due to injury to the perinatal liverand can be thought of as a form of fulminant hepatic failure.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677235,"ranking":5,"query_text":"neonatal hemochromatosis causes","passage_text":"The exact cause of neonatal hemochromatosis is unknown. There are two schools of thought: one hypothesizes that injury to the liver causes abnormal handling of iron by the liver; the other hypothesizes that the abnormal handling of iron by the liver leads to liver injury and failure.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677233,"ranking":6,"query_text":"neonatal hemochromatosis causes","passage_text":"Because neonatal hemochromatosis moves much more quickly, the best hemochromatosis treatment for babies is a liver transplant. In fact, neneonatal hemochromatosis was the reason for the world's youngest-ever liver transplant on a five-day-old baby girl. Learn about other Liver Disease States.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677238,"ranking":7,"query_text":"neonatal hemochromatosis causes","passage_text":"Whitington (2007) postulated that some cases of neonatal hemochromatosis result from maternal alloimmunity directed at the fetal liver, and therefore do not represent an inherited mendelian disorder. Other causes may result from metabolic disease or perinatal infection.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677232,"ranking":8,"query_text":"neonatal hemochromatosis causes","passage_text":"Neonatal hemochromatosis is a syndrome in which severe liver disease of fetal or perinatal onset is associated with deposition of stainable iron in extrahepatic sites.The distribution of extrahepatic iron mimics that observed in hepatic iron (HFE) disease, the most common form of hemochromatosis known in Europe and the Americas, and liver disease is ...","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677231,"ranking":9,"query_text":"neonatal hemochromatosis causes","passage_text":"Neonatal hemochromatosis (NH) is characterized by hepatic failure in the newborn period and heavy iron staining in the liver. In addition, there is marked siderosis of extrahepatic tissues, including the heart and pancreas (Driscoll et al., 1988).","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":7677239,"ranking":10,"query_text":"neonatal hemochromatosis causes","passage_text":"Symptoms of Neonatal hemochromatosis. Click to Check. Accumulation of iron in fetal liver. Accumulation of iron in fetal body tissues. Fetal death. Death within weeks of birth. Small birth size. more symptoms...Â».","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":8470753,"ranking":11,"query_text":"neonatal hemochromatosis causes","passage_text":"Hereditary hemochromatosis, an iron overload syndrome, does not cause anemia. However, one of the treatments for hemochromatosis (phlebotomy - removal of blood) can cause anemia. In brief: The treatment can... Hereditary hemochromatosis, an iron overload syndrome, does not cause anemia. However, one of the treatments for hemochromatosis (phlebotomy - removal of blood) can cause anemia.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":4252194,"ranking":12,"query_text":"neonatal hemochromatosis causes","passage_text":"Common causes of high iron levels in the blood include: juvenile hemochromatosis (a kind of genetic mutation distinct from primary hemochromatosis), primary hemochromatosis (a genetic mutation that causes increased iron absorption), and secondary hemochromatosis which is an acquired disease.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":553037,"ranking":13,"query_text":"neonatal hemochromatosis causes","passage_text":"Hereditary hemochromatosis isn't the only type of hemochromatosis. Juvenile hemochromatosis. This causes the same problems in young people that hereditary hemochromatosis causes in adults. But iron accumulation begins much earlier, and symptoms usually appear between the ages of 15 and 30.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":553035,"ranking":14,"query_text":"neonatal hemochromatosis causes","passage_text":"Hereditary hemochromatosis isn't the only type of hemochromatosis. Other types include: Juvenile hemochromatosis. This causes the same problems in young people that hereditary hemochromatosis causes in adults. But iron accumulation begins much earlier, and symptoms usually appear between the ages of 15 and 30.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":4943407,"ranking":15,"query_text":"neonatal hemochromatosis causes","passage_text":"The two types of hemochromatosis are primary and secondary. Primary hemochromatosis is caused by a defect in the genes that control how much iron you absorb from food. Secondary hemochromatosis usually is the result of another disease or condition that causes iron overload.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":5453141,"ranking":16,"query_text":"neonatal hemochromatosis causes","passage_text":"Hemochromatosis gene (HFE) testing is a blood test used to check for hereditary hemochromatosis, a disorder that is passed from a parent to a child (inherited) and causes the body to absorb too much iron. This HFE gene test is usually not used to check for other, less common causes of inherited hemochromatosis.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":5388572,"ranking":17,"query_text":"neonatal hemochromatosis causes","passage_text":"Hemochromatosis is an iron metabolism disorder that may be inherited or acquired. People with hemochromatosis accumulate more iron than their body needs. As the body does not have a way to excrete excess iron, there is a progressive buildup of iron in tissues and organs.here are two types of hemochromatosis: primary hemochromatosis, an inherited form that is passed from one generation to the next, and secondary hemochromatosis, which is caused by some other disease or underlying condition. Primary or Hereditary Hemochromatosis (HH).","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":8511308,"ranking":18,"query_text":"neonatal hemochromatosis causes","passage_text":"Hemochromatosis. People with hemochromatosis may exhibit abnormal liver function test results. Hemochromatosis is a recessive genetic disorder that causes people to absorb too much iron from the foods they eat; the extra iron is stored in the liver.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":5453138,"ranking":19,"query_text":"neonatal hemochromatosis causes","passage_text":"What is hemochromatosis? Hemochromatosis is the most common form of iron overload disease. Too much iron in the body causes hemochromatosis. Iron is important because it is part of hemoglobin, a molecule in the blood that transports oxygen from the lungs to all body tissues.","bm25_label":"high","relevance_label":0.0},{"query_id":463230,"passage_id":4602211,"ranking":20,"query_text":"neonatal hemochromatosis causes","passage_text":"Juvenile hemochromatosis. This causes the same problems in young people that hereditary hemochromatosis causes in adults. But iron accumulation begins much earlier, and symptoms usually appear between the ages of 15 and 30. This disorder is caused by mutations in the hemojuvelin or hepcidin genes.","bm25_label":"high","relevance_label":0.0}]