[{"query_id":470982,"passage_id":3874456,"ranking":1,"query_text":"oxnard area code phone number","passage_text":"Population Demographics. The 805 Area Code is one of the telephone area codes supported by Spokeo's Reverse Phone Lookup technology. Spokeo's reverse phone lookup functions much like a personal caller-ID system, and can identify the owner of virtually any phone number in the continental United States.ry searching for any 805 Area Code phone number today, and discover what Spokeo can do for you. Top Cities. Oxnard, Arroyo Grande, Cambria, Simi Valley, Ventura, Thousand Oaks, Paso Robles, Newbury Park, San Luis Obispo and Guadalupe.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":3874453,"ranking":2,"query_text":"oxnard area code phone number","passage_text":"The 805 Area Code (or Area Code 805) is located in the state of CA. Area Code 805 is one of the 269 3-digit telephone area codes in the USA.ry searching for any 805 Area Code phone number today, and discover what Spokeo can do for you. Top Cities. Oxnard, Arroyo Grande, Cambria, Simi Valley, Ventura, Thousand Oaks, Paso Robles, Newbury Park, San Luis Obispo and Guadalupe.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":7490252,"ranking":3,"query_text":"oxnard area code phone number","passage_text":"805. Oxnard, CA has one area code which is area code 805. In addition to Oxnard, CA area code information read more about area code 805 details and California area codes. Oxnard, CA is located in Ventura County and observes the Pacific Time Zone. View our Times by Area Code tool.","bm25_label":"high","relevance_label":1.0},{"query_id":470982,"passage_id":4652525,"ranking":4,"query_text":"oxnard area code phone number","passage_text":"Oxnard, CA ZIP Code Map. Oxnard, CA ZIP Codes. Oxnard is the actual or alternate city name associated with 7 ZIP Codes by the US Postal Service. Select a particular Oxnard ZIP Code to view a more detailed map and the number of Business, Residential, and PO Box addresses for that ZIP Code.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":8778275,"ranking":5,"query_text":"oxnard area code phone number","passage_text":"City of Oxnard, CA Zip Codes. City of Oxnard, CA Demographic Information. * Demographic data is based on information taken from the 2000 Census. City of Oxnard, CA covers 3 Area Codes. City of Oxnard, CA covers 7 Zip Codes. 9 Cities within 15 Miles of the City of Oxnard, CA.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":7490256,"ranking":6,"query_text":"oxnard area code phone number","passage_text":"Spokeo gathers hundreds of millions of listed phone records and potentially presents the owner's full name, address, email, photos, and any other information that may be associated with the record. Try searching for any 805 Area Code phone number today, and discover what Spokeo can do for you. Top Cities. Oxnard, Arroyo Grande, Cambria, Simi Valley, Ventura, Thousand Oaks, Paso Robles, Newbury Park, San Luis Obispo and Guadalupe.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":4652524,"ranking":7,"query_text":"oxnard area code phone number","passage_text":"The Oxnard ZIP Code maps and basic ZIP Code information such as the number of Business, Residential and PO Box addresses in the ZIP Code are updated 4 times per year. Last update: February 1, 2017. The DEMOGRAPHIC DATA for each Oxnard ZIP Code is updated annually.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":5153445,"ranking":8,"query_text":"oxnard area code phone number","passage_text":"The 866 area code is registered in Unknown. 0.12% of phone numbers within the 866 area code are registered as residential\/consumer phone numbers, and 99.88% are registered as commercial\/business phone numbers.The top 3 business types associated with phone numbers with the 866 area code are: retail, construction, medical.he 866 area code is registered in Unknown. 0.12% of phone numbers within the 866 area code are registered as residential\/consumer phone numbers, and 99.88% are registered as commercial\/business phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":7408017,"ranking":9,"query_text":"oxnard area code phone number","passage_text":"International Country Codes. To place a call to an international location, use the following dialing instructions. 1  From U.S. phone number to Canada: 1 + area code + number. * 2 From U.S. phone number to Puerto Rico, Bermuda, and other territories: 1 + area code + number.3  From U.S. phone number to other locations: 011 + country code + area code + ....o place a call to an international location, use the following dialing instructions. 1  From U.S. phone number to Canada: 1 + area code + number. * 2 From U.S. phone number to Puerto Rico, Bermuda, and other territories: 1 + area code + number. 3  From U.S. phone number to other locations: 011 + country code + area code + number.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":1881303,"ranking":10,"query_text":"oxnard area code phone number","passage_text":"The 386 area code is registered in Florida. 88.51% of phone numbers within the 386 area code are registered as residential\/consumer phone numbers, and 11.49% are registered as commercial\/business phone numbers.8.51% of phone numbers within the 386 area code are registered as residential\/consumer phone numbers, and 11.49% are registered as commercial\/business phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":4957665,"ranking":11,"query_text":"oxnard area code phone number","passage_text":"PrivacyStar Rank 255 out of 796. The 325 area code is registered in Texas. 84.95% of phone numbers within the 325 area code are registered as residential\/consumer phone numbers, and 15.05% are registered as commercial\/business phone numbers.rivacyStar Rank 255 out of 796. The 325 area code is registered in Texas. 84.95% of phone numbers within the 325 area code are registered as residential\/consumer phone numbers, and 15.05% are registered as commercial\/business phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":5350376,"ranking":12,"query_text":"oxnard area code phone number","passage_text":"PrivacyStar Rank 19 out of 796. The 916 area code is registered in California. 84.26% of phone numbers within the 916 area code are registered as residential\/consumer phone numbers, and 15.74% are registered as commercial\/business phone numbers.rivacyStar Rank 19 out of 796. The 916 area code is registered in California. 84.26% of phone numbers within the 916 area code are registered as residential\/consumer phone numbers, and 15.74% are registered as commercial\/business phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":4627884,"ranking":13,"query_text":"oxnard area code phone number","passage_text":"International Calling Codes: How to Dial Phone Numbers in Ecuador. Ecuador Phone Numbers: +593 + Area Code + Local Number. Lookup Ecuadorian phone numbers by entering 593 + local number. Search for people, Ecuador area codes, find major cities. All Area Codes NANP Countries. All Area Codes USA, Canada and NANP Countries.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":2776884,"ranking":14,"query_text":"oxnard area code phone number","passage_text":"PrivacyStar Rank 11 out of 796. The 678 area code is registered in Georgia. 82.75% of phone numbers within the 678 area code are registered as residential\/consumer phone numbers, and 17.25% are registered as commercial\/business phone numbers.The top 3 business types associated with phone numbers with the 678 area code are: retail, medical, finance.PrivacyStar web and mobile users have looked up, blocked, and filed complaints on phone numbers in the 678 area code 386,343, 276,242, and 14,615, time(s) respectively.2.75% of phone numbers within the 678 area code are registered as residential\/consumer phone numbers, and 17.25% are registered as commercial\/business phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":4386107,"ranking":15,"query_text":"oxnard area code phone number","passage_text":"- To dial to a Mexican local or long distance landline number: From the U.S: 011 52 + area code (3 digits) + phone number (7 digits). From Mexico: 01 + area code (3 digits) + phone number (7 digits). - To dial to a Mexican cell phone number:From the U.S: Dial 011 52 + 1 + area code (3 digits) + phone number (7 digits). From Mexico: Dial 01 + area code (3 digits) + phone number (7 digits). - To dial to a U.S. phone number: Dial 00 + 1 + area code (3 digits) + phone number (7 digits).Also, to call from a Mexican cell phone while in the US to a Mexican cell phone in Mexico (believe me, it happens): Dial 011 + 52 + 1 + area code (3 digits) + phone number (7 digits). To dial to a Mexican local or long distance landline number: From the U.S: 011 52 + area code (3 digits) + phone number (7 digits). From Mexico: 01 + area code (3 digits) + phone number (7 digits). - To dial to a Mexican cell phone number:","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":7636593,"ranking":16,"query_text":"oxnard area code phone number","passage_text":"PrivacyStar Rank 81 out of 796. The 706 area code is registered in Georgia. 85.39% of phone numbers within the 706 area code are registered as residential\/consumer phone numbers, and 14.61% are registered as commercial\/business phone numbers.5.39% of phone numbers within the 706 area code are registered as residential\/consumer phone numbers, and 14.61% are registered as commercial\/business phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":2337060,"ranking":17,"query_text":"oxnard area code phone number","passage_text":"PrivacyStar Rank 495 out of 796. The 819 area code is registered in QC. 0% of phone numbers within the 819 area code are registered as residential\/consumer phone numbers, and 0% are registered as commercial\/business phone numbers.The top 3 business types associated with phone numbers with the 819 area code are: government, school, medical.PrivacyStar web and mobile users have looked up, blocked, and filed complaints on phone numbers in the 819 area code 732, 82, and 40, time(s) respectively.rivacyStar Rank 495 out of 796. The 819 area code is registered in QC. 0% of phone numbers within the 819 area code are registered as residential\/consumer phone numbers, and 0% are registered as commercial\/business phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":7322939,"ranking":18,"query_text":"oxnard area code phone number","passage_text":"NXX codes are the first three digits of a phone number that follow the area code. There are about 10,000 numbers in each NXX code. The federal body that administers telephone number initially assigns telephone companies whole NXX codes in blocks of 10,000 numbers. Existing numbers keep the old area code, and only new telephone lines are assigned the new area code. 2  Phone numbers for all types of services are included, whether the phone number is for a phone, cell phone, fax machine or ATM.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":6118870,"ranking":19,"query_text":"oxnard area code phone number","passage_text":"202 Area Code 202. At AreaCode.org, you'll find helpful information on the 202 area code, including 202 area code location. Other phone area codes may be found using AreaCode.org's area code locator. Use the search function for area code look up.Visit us to get virtual phone number with an online control center.Virtual Phone Number with TollFreeForwarding.com makes it easier for your customers to reach you.ther phone area codes may be found using AreaCode.org's area code locator. Use the search function for area code look up. Visit us to get virtual phone number with an online control center. Virtual Phone Number with TollFreeForwarding.com makes it easier for your customers to reach you.","bm25_label":"high","relevance_label":0.0},{"query_id":470982,"passage_id":1583572,"ranking":20,"query_text":"oxnard area code phone number","passage_text":"12\/03\/1995: Area code 904 was split, and some of the phone numbers had to be updated to area code 352 on that date. 06\/23\/1997: Area code 904 was split, and some of the phone numbers had to be updated to area code 850 on that date. 02\/15\/2001: Area code 904 was split, and some of the phone numbers had to be updated to area code 386 on that date.","bm25_label":"high","relevance_label":0.0}]