[{"query_id":475402,"passage_id":7661499,"ranking":1,"query_text":"pima cotton definition","passage_text":"Pima cotton is used to make pillow cases and bed sheets. Pima cotton is considered to be a superior blend of cotton. Pima cotton is often used for clothing, like T-shirts. Both pima and regular cotton can be used in the making of towels.","bm25_label":"high","relevance_label":1.0},{"query_id":475402,"passage_id":6893681,"ranking":2,"query_text":"pima cotton definition","passage_text":"Definition of Cotton Percale. Cotton percale, a popular choice for bed linens, varies because of the different materials used to make the... 1  Cotton Sheets: Pima Vs. 2  Percale.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4915214,"ranking":3,"query_text":"pima cotton definition","passage_text":"Pima Cotton. Pima cotton, otherwise known as Extra Long Staple (ELS) cotton, is a premium fiber that can be up to 40% stronger than basic upland cotton. Pima cotton became fashionable years ago when designers started discovering its softness yet durability.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4143096,"ranking":4,"query_text":"pima cotton definition","passage_text":"Pima cotton is the generic name for extra-long staple cotton that is grown in the US, Australia, Peru and a few other countries. A finer cotton fiber, the length of pima cotton is 1 3\/8 inches or longer.Supima cotton is a trademark name used to promote and market the American Pima cotton.Egyptian cotton is cotton grown in egypt but not all fabrics and items termed Egyptian cotton is 100% extra-long staple cotton.hus sheets labeled 100% Egyptian cotton are basically cotton from Egypt but the cotton could be shorter fiber cotton grown in Egypt and long staple cotton grown in Egypt. Supima Cotton is 100% Pima cotton.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4773768,"ranking":5,"query_text":"pima cotton definition","passage_text":"Pima is a fine, long-staple cotton that yields a very soft weave. The word Supima often appears on the labels of Pima sheets as a trademark of the Supima Association, which promotes Pima cotton. Egyptian cotton is the finest, longest-staple of all.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4915211,"ranking":6,"query_text":"pima cotton definition","passage_text":"Pima cotton is a result of these efforts. Pima cotton is extra long staple (ELS) cotton. By law, ELS cotton fibers at least 3\/8 inch longer than short staple cotton. Todayâ\u0080\u0099s Pima cotton crop can top out somewhere around an inch and a half, making it the longest cotton in the world. It can make a material more closely resembling satin than denim.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4541500,"ranking":7,"query_text":"pima cotton definition","passage_text":"Pima is a fine, long-staple cotton that yields a very soft weave. The word Supima often appears on the labels of Pima sheets as a trademark of the Supima Association, which promotes Pima cotton. Egyptian cotton is the finest, longest-staple of all. Grown in the Nile River Valley, Egyptian cotton produces an extremely soft and supple weave.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4143094,"ranking":8,"query_text":"pima cotton definition","passage_text":"What's Supima. Founded in 1954, Supima is the promotional organization of the American Pima cotton growers. The Board of Directors of this non-profit organization is composed of Pima growers from the states of Arizona, California, New Mexico and Texas.Supimaâ\u0080\u0099s primary objective is to promote the increased consumption of American Pima cotton around the world.Supima is a major sponsor of research programs to improve the quality of American Pima.Supima also works closely with cotton industry organizations and government agencies to ensure a fair and viable marketing environment for American Pima cotton growers.upima is a major sponsor of research programs to improve the quality of American Pima. Supima also works closely with cotton industry organizations and government agencies to ensure a fair and viable marketing environment for American Pima cotton growers.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":7661498,"ranking":9,"query_text":"pima cotton definition","passage_text":"What's Supima. Founded in 1954, Supima is the promotional organization of the American Pima cotton growers. The Board of Directors of this non-profit organization is composed of Pima growers from the states of Arizona, California, New Mexico and Texas. Supimaâ\u0080\u0099s primary objective is to promote the increased consumption of American Pima cotton around the world. Supima is a major sponsor of research programs to improve the quality of American Pima. Supima also works closely with cotton industry organizations and government agencies to ensure a fair and viable marketing environment for American Pima cotton growers.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4143100,"ranking":10,"query_text":"pima cotton definition","passage_text":"Pima cotton is a generic name for extra-long staple (ELS) cotton grown mostly in the United States, Australia, and Peru. Pima is from the gossypium barbadense species, compared to gossypium hirsutum.he name SupimaÂ® is a licensed trademark owned by Supima and its members. It is used to promote textile and apparel products made of 100% American Pima cotton. The name Supima is an abbreviation for Superior Pima.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":5143112,"ranking":11,"query_text":"pima cotton definition","passage_text":"If a label only reads 100 percent cotton, it is likely to be American Upland. Pima is a fine, long-staple cotton that yields a very soft weave. The word Supima often appears on the labels of Pima sheets as a trademark of the Supima Association, which promotes Pima cotton. Egyptian cotton is the finest, longest-staple of all. Grown in the Nile River Valley, Egyptian cotton produces an extremely soft and supple weave.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":5333936,"ranking":12,"query_text":"pima cotton definition","passage_text":"American Upland is the most widely used cotton and can be short-to long-staple (staple refers to the length of the individual fibers). If a label only reads 100 percent cotton, it is likely to be American Upland. Pima is a fine, long-staple cotton that yields a very soft weave. The word Supima often appears on the labels of Pima sheets as a trademark of the Supima Association, which promotes Pima cotton. Egyptian cotton is the finest, longest-staple of all.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4541504,"ranking":13,"query_text":"pima cotton definition","passage_text":"Cultivation of Pima cotton became especially popular in the early 20th century. Pima cotton has long threads, similar to Egyptian cotton, which make it a desirable choice for many products. It is used in towels, sheets and clothing.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4541502,"ranking":14,"query_text":"pima cotton definition","passage_text":"pima cotton. A very strong, high-grade cotton of medium staple developed from selected Egyptian cottons in the southwest United States. After Pima, County in southern Arizona, location of the experimental farm on which it was developed in the early 1900s.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4541503,"ranking":15,"query_text":"pima cotton definition","passage_text":"The ELS cotton experiment included pima cotton cultivars released over a period of 90 years (1918-2009) by breeding programs in Arizona, heat-sensitive Sea Island cultivars from the Caribbean, and a recently released commercial pima cotton cultivar.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":3712632,"ranking":16,"query_text":"pima cotton definition","passage_text":"Pima cotton is a long-staple cotton grown primarily in California and Arizona. It is exceptionally strong and fine. Supima (www.supima.com) is a trade name used by a group of Pima growers who adhere to certain standards of quality and labeling. Because Pima is expensive, some mills adulterate it with inferior cottons. Most Supima is DNA coded so that even on a retail shelf, its purity can be proven.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":4860935,"ranking":17,"query_text":"pima cotton definition","passage_text":"Pima cotton production, forecast at 663,000 bales, is down 22 percent from last year. Producers expect to harvest 10.8 million acres ofall cotton, up 14 percent from 2011. This harvested total includes 10.6 million acres of Upland cotton and 233,400 acres of Pima cotton.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":7836532,"ranking":18,"query_text":"pima cotton definition","passage_text":"Pima cotton is extra long staple (ELS) cotton. By law, ELS cotton fibers at least 3\/8 inch longer than short staple cotton. Todayâ\u0080\u0099s Pima cotton crop can top out somewhere around an inch and a half, making it the longest cotton in the world. It can make a material more closely resembling satin than denim.","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":84699,"ranking":19,"query_text":"pima cotton definition","passage_text":"American Pima cotton, like Egyptian cotton, is an Extra-Long Staple (ELS) cotton (the term â\u0080\u009cstapleâ\u0080\u009d refers to fiber length.) All cotton has a staple: Upland cottons tend to be classified as short to medium staple, which is an inch to an inch and three-sixteenths long; SJV Acala is a long staple, or inch and an eighth; and Pima is an extra long ...","bm25_label":"high","relevance_label":0.0},{"query_id":475402,"passage_id":987828,"ranking":20,"query_text":"pima cotton definition","passage_text":"Pima cotton, also called extra long staple (ELS), is a type of cotton grown primarily in Peru, the southwestern United States and Australia. It is considered to be one of the superior blends of cotton and is extremely durable and absorbent. This type of cotton is named after the Pima, a group of American Indians who first cultivated the plant in the U.S., but the cotton's origins are its cultivation in Peru.","bm25_label":"high","relevance_label":0.0}]