[{"query_id":477286,"passage_id":7602332,"ranking":1,"query_text":"population of antigonish","passage_text":"Forming the majority of the Antigonish County census division, the Municipality of the County of Antigonish recorded a population of 14,584 living in 6,001 of its 7,112 total private dwellings in the 2016 Census of Population, a change of 3000300000000000000â\u0099 â\u0088\u00920.7% from its 2011 population of 14,692.","bm25_label":"high","relevance_label":1.0},{"query_id":477286,"passage_id":7602336,"ranking":2,"query_text":"population of antigonish","passage_text":"Antigonish County. Antigonish County is located on the northeastern shore of Nova Scotia and borders on the Northumberland Strait, St.George's Bay and the Strait of Canso. Located halfway between Halifax and Sydney it has a population of approximately 15,000.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":7602333,"ranking":3,"query_text":"population of antigonish","passage_text":"As a census division in the 2016 Census of Population conducted by Statistics Canada, Antigonish County recorded a population of 19,301 living in 8,129 of its 9,842 total private dwellings, a change of 2999850000000000000â\u0099 â\u0088\u00921.5% from its 2011 population of 19,589.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":7602335,"ranking":4,"query_text":"population of antigonish","passage_text":"Antigonish Chamber of Commerce. Over 200 businesses and individuals are members of the Antigonish Chamber of Commerce, making it one of the largest branches in Nova Scotia. The Chamber's objective is to foster a healthy environment for business in Antigonish Town and County. Antigonish County.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":7602331,"ranking":5,"query_text":"population of antigonish","passage_text":"Antigonish County, Nova Scotia is a county in the province of Nova Scotia, Canada. It is located in northern Nova Scotia on the Northumberland Strait. The Town of Antigonish and Municipality of the County of Antigonish are the two largest incorporated municipalities in the county.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":3102386,"ranking":6,"query_text":"population of antigonish","passage_text":"MacDonald Nursing Home, Antigonish, formerly of Little Dover, Guysborough County, died October 4, 1993, in St. Martha's Regional Hospital, Antigonish. Born in Little Dover, she was a daughter of the late John and Margaret (Rhynold) Boudreau.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":2589450,"ranking":7,"query_text":"population of antigonish","passage_text":"Mahoneyâ\u0080\u0099s Beach â\u0080\u0093 Aerial View Google. This entry was posted in Antigonish, Categories, Northumberland Shore, Outdoors and tagged antigonish, birds, herons, kayak, lagoon, Mahoneys Beach, route 337, sunrise trail, tide pools, walking on June 25, 2011.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":7602330,"ranking":8,"query_text":"population of antigonish","passage_text":"(A Hundred Thousand Welcomes!) Welcome to Antigonish, the highland heart of Nova Scotia! Antigonish is a small town, rich in Gaelic history nestled in the north eastern part of the province. Home of one of Canada`s most prestigious universities, St. Francis Xavier University, a picturesque campus known for excellence in both academics and sports.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":6579906,"ranking":9,"query_text":"population of antigonish","passage_text":"How long does it take to drive from Halifax Nova Scotia to Antigonish Nova Scotia? Hi, from downtown Halifax to Antigonish is about 215 kms or 135 miles and depending on traffic, weather and speed it would take about 2 hours 15 minutes to 2 hours 30 minutes.m sorry but 2 hours is to long. I just came back from Sydney NS. Flying from Toronto's main Areoport Lester B. (YYZ) to Halifax is about 1 hour 10 mins.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":6155833,"ranking":10,"query_text":"population of antigonish","passage_text":"How long does it take to drive from Halifax Nova Scotia to Antigonish Nova Scotia? Hi, from downtown Halifax to Antigonish is about 215 kms or 135 miles and depending on traffic, weather and speed it would take about 2 hours 15 minutes to 2 hours 30 minutes.lying from Toronto's main Areoport Lester B. (YYZ) to Halifax is about 1 hour 10 mins. If u want to go to th â\u0080¦ e Cape (Breton) Sydney it takes 1 hour 50 mins non-stop.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":1345797,"ranking":11,"query_text":"population of antigonish","passage_text":"How long does it take to drive from Halifax Nova Scotia to Antigonish Nova Scotia? Hi, from downtown Halifax to Antigonish is about 215 kms or 135 miles and depending on traffic, weather and speed it would take about 2 hours 15 minutes to 2 hours 30 minutes. The distance between Birchtown, Shelburne, NS and Halifax, NS is 215km and will take about 2 hours 30 Minutes to drive.   The distance between Birchtown, Guysborough, â\u0080¦ NS and Halifax, NS is 275km and will take about 3 hours 4 Minutes to drive.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":4742590,"ranking":12,"query_text":"population of antigonish","passage_text":"We would like to gather more data for: Airdrie, Aldergrove, Annapolis Valley, NS, Antigonish, Ardrossan, Armstrong, Auclair, QC, Bathurst, Beaverlodge, AB, Boisbriand, QC, Canada, Bridgewater, NS, ... Update information for Canada!","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":7701233,"ranking":13,"query_text":"population of antigonish","passage_text":"As Sustainable Antigonish strives to build collaborative networks and citizens work together on common goals, our hope is that we have a balanced merging of these four pillars, helping us to become a more sustainable community, enhancing the well-being of all citizens and of the natural world.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":7602329,"ranking":14,"query_text":"population of antigonish","passage_text":"Antigonish, Nova Scotia, Canada. StFX is known for the quality of our teaching, small class sizes creating an intimate and collaborative learning environment, and our valuable hands-on learning and research opportunities for undergraduates. The StFX community spirit is legendary and our family bond is like no other.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":6128695,"ranking":15,"query_text":"population of antigonish","passage_text":"Mike Smith. Mike Smith (born August 27, 1972) is a Canadian actor, most famous for playing Bubbles on Trailer Park Boys. Smith was born in New Glasgow, Nova Scotia. He earned a degree in English from St. Francis Xavier University in Antigonish, Nova Scotia.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":1975052,"ranking":16,"query_text":"population of antigonish","passage_text":"Although Nova Scotia has a somewhat moderated climate, there have been some very intense heatwaves and cold snaps recorded over the past 160 years. The highest temperature ever recorded in the province was 38.3 Â°C (101 Â°F) on August 19, 1935, at Collegeville, which is located about 15 km southwest of Antigonish.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":2567347,"ranking":17,"query_text":"population of antigonish","passage_text":"Although Nova Scotia has a somewhat moderated climate, there have been some very intense heatwaves and cold snaps recorded over the past 160 years. The highest temperature ever recorded in the province was 38.3 Â°C (101 Â°F) on August 19, 1935, at Collegeville, which is located about 15 km southwest of Antigonish. The coldest temperature ever recorded was â\u0088\u009241.1 Â°C (â\u0088\u009242 Â°F) on January 31, 1920, at Upper Stewiacke.","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":4228846,"ranking":18,"query_text":"population of antigonish","passage_text":"Skiatook (population: 14,089), Pawhuska (population: 5,773), Hominy (population: 4,607), Barnsdall (population: 2,354), Fairfax (population: 1,916), Shidler (population: 904), Osage (population: 851), Wynona (population: 633), Prue (population: 591), Burbank (population: 475)","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":7118344,"ranking":19,"query_text":"population of antigonish","passage_text":"Branchland (population: 5,022), Harts (population: 3,463), Hamlin (population: 2,639), West Hamlin (population: 2,196), Ranger (population: 1,746), Sod (population: 1,244), Alkol (population: 1,125), Griffithsville (population: 1,096), Yawkey (population: 965), Sumerco (population: 920)","bm25_label":"high","relevance_label":0.0},{"query_id":477286,"passage_id":4228404,"ranking":20,"query_text":"population of antigonish","passage_text":"Population of Winnipeg April 2016. Prepared by City of Winnipeg. populationWinnipeg population Winnipeg population Winnipeg population City of Winnipeg population. populationWinnipeg population Winnipeg population Winnipeg population City of Winnipeg population. Population of Winnipeg April 2016. Prepared by City of Winnipeg.","bm25_label":"high","relevance_label":0.0}]