[{"query_id":478054,"passage_id":7606661,"ranking":1,"query_text":"population of paducah tx","passage_text":"PADUCAH, TX. PADUCAH, TEXAS. Paducah, the county seat of Cottle County, is on a branch of Salt Creek 115 miles west of Wichita Falls and the same distance northeast of Lubbock in the central part of the county.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481373,"ranking":2,"query_text":"population of paducah tx","passage_text":"The population density in Paducah is 1031% higher than Kentucky. The median age in Paducah is 11% higher than Kentucky. In Paducah 74.01% of the population is Caucasian. In Paducah 21.43% of the population is African American.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481377,"ranking":3,"query_text":"population of paducah tx","passage_text":"One Race Percent in Paducah, KY. At the time of the last census survey, the number of people of one race in Paducah, KY was 25,897. White Population in Paducah, KY. The estimated White population in the Paducah community is 19,145, which is 72.8 percent of the total population (The U.S. average is 75.10%).","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":8785892,"ranking":4,"query_text":"population of paducah tx","passage_text":"The population in 2010 was 25,024. The McCracken County Courthouse in Paducah. Paducah is the home of West Kentucky Community and Technical College (formerly Paducah Community College and founded in 1932 as Paducah Junior College). Murals by Robert Dafford on the floodwall along the Ohio River depict historical scenes of life in Paducah.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481376,"ranking":5,"query_text":"population of paducah tx","passage_text":"Current White Population in Paducah,Kentucky 2016, 2015 with Demographics and Stats by age and gender. Learn more by clicking the Google or Facebook button below. Current White Population demographics in Paducah, Kentucky 2016, 2015 by gender and age.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481375,"ranking":6,"query_text":"population of paducah tx","passage_text":"Compare Paducah, KY Demographics To Other Cities. Paducah population breakdown by race. In Paducah, 2.4% of people are of Hispanic or Latino origin. Please note: Hispanics may be of any race, so also are included in any\/all of the applicable race categories above. Source: The Paducah, KY demographics data displayed above is derived from the United States Census Bureau.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481374,"ranking":7,"query_text":"population of paducah tx","passage_text":"Current Paducah, Kentucky Population, Demographics and stats in 2016, 2017.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481378,"ranking":8,"query_text":"population of paducah tx","passage_text":"According to the U.S. Census Bureau American Community Survey 5-year estimate for 2008-2012, the median household income in Paducah was $32,011. The percentage of Paducah's population that is below the poverty level is 23.2%. For McCracken County, the median household income was $41,630.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7606659,"ranking":9,"query_text":"population of paducah tx","passage_text":"When Cottle County was organized in 1892, Paducah officially became the county seat. A post office was established in the settlement in 1891 with Charles H. Scott as postmaster. The Paducah Post was founded in 1893 and was still published weekly in the 1980s. By the early 1900s the town had a bank, a lumberyard, a telephone company, an Odd Fellows lodge, a school (started about 1893), and Methodist and Baptist churches. The 1903 population of Paducah was 151.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481380,"ranking":10,"query_text":"population of paducah tx","passage_text":"Learn more by clicking the Google or Facebook button below. Population Demographics for Paducah, Kentucky in 2016 and 2017. Other Counties and Cities in Kentucky.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":8785890,"ranking":11,"query_text":"population of paducah tx","passage_text":"McCracken County is a county located in the U.S. state of Kentucky. As of the 2010 census, the population was 65,565. The county seat and only municipality is Paducah. McCracken County was the 78th county formed, having been created in 1825. McCracken County is part of the Paducah, KY-IL Micropolitan Statistical Area. It is part of the Jackson Purchase, located at the extreme western end of Kentucky.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7481379,"ranking":12,"query_text":"population of paducah tx","passage_text":"According to the U.S. Census Bureau, in 2010 Paducah had a population of 25,024. The 2012 estimate is 25,048. McCracken County had a population of 65,565 reported in the 2010 Census. For population changes over the past 40 years and population forecasts, see Chapter Two of the Comprehensive Plan.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7606664,"ranking":13,"query_text":"population of paducah tx","passage_text":"Latest news from Paducah, TX collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: German (12.4%), English (9.5%), Irish (9.1%), United States (8.9%), Subsaharan African (5.9%), Scottish (4.3%). Current Local Time: CST time zone. Land area: 1.52 square miles.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7606660,"ranking":14,"query_text":"population of paducah tx","passage_text":"Paducah is a town in Cottle County, Texas, United States. The population was 1,498 at the 2000 census. It is the county seat of Cottle County. It is just south of the Texas Panhandle. Paducah is located at 34Â°0â\u0080²50â\u0080³N 100Â°18â\u0080²14â\u0080³W \/ 34.01389Â°N 100.30389Â°W \/ 34.01389; -100.30389 (34.013957, -100.303780). According to the United States Census Bureau, the town has a total area of 1.5 square miles (3.9 kmÂ²), all of it land.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":5189601,"ranking":15,"query_text":"population of paducah tx","passage_text":"Paducah, KY Â» Directory Â» Paducah Kentucky Zip Codes - Zip Code Lookup. Below is a list of Paducah KY zip codes. For your research we have also included Paducah Area Code, Time Zone, UTC and the local Mccracken County FIPS Code. Each Paducah Kentucky zip code has a center Longitude \/ Latitude point (the Paducah center is -88.7102 \/ 37.0376).","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7606658,"ranking":16,"query_text":"population of paducah tx","passage_text":"The town was named for Paducah, a city in western Kentucky. As of the census of 2000, there were 1,498 people, 650 households, and 421 families residing in the town. The population density was 985.0 people per square mile (380.5\/kmÂ²).","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":5189606,"ranking":17,"query_text":"population of paducah tx","passage_text":"Paducah KY Zip Code Lookup and List. Below is a list of Paducah KY zip codes. For your research we have also included Paducah Area Code, Time Zone, UTC and the local Mccracken County FIPS Code. Each Paducah Kentucky zip code has a center Longitude \/ Latitude point (the Paducah center is -88.7102 \/ 37.0376).","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":3252172,"ranking":18,"query_text":"population of paducah tx","passage_text":"World \/ North America \/ United States \/ South \/ Kentucky \/ Paducah Paducah The tables below display average monthly climate and weather indicators in Paducah Kentucky.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":2575582,"ranking":19,"query_text":"population of paducah tx","passage_text":"School counselors are vital members of the education team, says Jonathan Durr, a counselor at Paducah Tilghman High School in Paducah, Kentucky. School counselors are vital members of the education team, says Jonathan Durr, a counselor at Paducah Tilghman High School in Paducah, Kentucky.","bm25_label":"high","relevance_label":0.0},{"query_id":478054,"passage_id":7606657,"ranking":20,"query_text":"population of paducah tx","passage_text":"Paducah is a town in Cottle County, Texas, United States. The population was 1,186 at the 2010 census, down from 1,498 at the 2000 census. It is the county seat of Cottle County. It is just south of the Texas Panhandle and east of the Llano Estacado.","bm25_label":"high","relevance_label":1.0}]