[{"query_id":479284,"passage_id":1930856,"ranking":1,"query_text":"pre emption rights definition","passage_text":"Right of First Refusal Definition: A right given to a person to be the first person allowed to purchase a certain object if it is ever offered for sale. First Right and Option. The owner of this right (called the pre-emptioner or the optionee) is the first to be offered the sale if the item is ever to offered for sale.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":2841615,"ranking":2,"query_text":"pre emption rights definition","passage_text":"Right of First Refusal Definition: A right given to a person to be the first person allowed to purchase a certain object if it is ever offered for sale. 1  First Right and Option.  The owner of this right (called the pre-emptioner or the optionee) is the first to be offered the sale if the item is ever to offered for sale.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":934530,"ranking":3,"query_text":"pre emption rights definition","passage_text":"preemptive right-the right granting to shareholders the first opportunity to buy a new issue of stock; provides protection against dilution of the shareholder's ownership interest. preemption, pre-emption-the right to purchase something in advance of others.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":1930857,"ranking":4,"query_text":"pre emption rights definition","passage_text":"A property owner is liable for damages if he conveys to a third person without honoring the right of first refusal. A right of first refusal is known more technically as a preemptive option, as a right of preemption, or simply as a preemption. A right of pre-emption is a right to buy before or ahead of others.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":7450295,"ranking":5,"query_text":"pre emption rights definition","passage_text":"In international law. The right of pre-emption is the right of a nation to detain the merchandise of strangers passing through her territories or seas, in order to afford to her subjects the preference of purchase. 1 Chit. Com. Law, 103. In English law. The first buying of a thing.","bm25_label":"high","relevance_label":1.0},{"query_id":479284,"passage_id":2225219,"ranking":6,"query_text":"pre emption rights definition","passage_text":"The Company refused placing terms at a higher price with preemption rights protected The Board did not disclose to shareholders, nor has yet explained its reasons for rejecting, an offer by Worldview effectively to underwrite the Placing at a higher price which would have respected pre-emption rights.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":1878919,"ranking":7,"query_text":"pre emption rights definition","passage_text":"jus soli - the principle that a person's nationality at birth is determined by the place of birth. preemption, pre-emption - the judicial principle asserting the supremacy of federal over state legislation on the same subject.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":7853508,"ranking":8,"query_text":"pre emption rights definition","passage_text":"pre-emption - the judicial principle asserting the supremacy of federal over state legislation on the same subject. preemption. judicial doctrine, judicial principle, legal principle - (law) a principle underlying the formulation of jurisprudence.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":926809,"ranking":9,"query_text":"pre emption rights definition","passage_text":"borrowing, adoption - the appropriation (of ideas or words etc) from another source; the borrowing of ancient motifs was very apparent. preemption, pre-emption - a prior appropriation of something; the preemption of bandwidth by commercial interests.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":3501378,"ranking":10,"query_text":"pre emption rights definition","passage_text":"We advocate for you in Washington, D.C., before Congress, the administration and, when appropriate, in the courts. We fight to ensure the states are free of unfunded mandates and pre-emption of state laws and that they maintain their authority and independence.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":2663593,"ranking":11,"query_text":"pre emption rights definition","passage_text":"From delegation of command authority to advocacy of pre-emption, Dr. Strangelove makes us laugh at what was and is terrifyingly close to reality. Finally, this guide helps viewers understand some of the jokes and references within the movie, and offers some background on why the movie was made.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":6891307,"ranking":12,"query_text":"pre emption rights definition","passage_text":"APCs can cause pre-emption of the currently running thread; APC routines can be pre-empted; In Windows NT, each running thread is represented by the operating system using a data structure known as the thread structure. Inside this structure is not one but two APC queues. One of these queues is used to store user mode APC objects, and the other of these queues is used to store kernel mode APC objects.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":1695328,"ranking":13,"query_text":"pre emption rights definition","passage_text":"If a federal law contains an express pre-emption clause, it does not immediately end the inquiry because the question of the substance and scope of Congress' displacement of state law still remains. Altria Group v. Good. Implied preemption. Implied preemption can occur in two ways: field preemption or conflict preemption.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":244596,"ranking":14,"query_text":"pre emption rights definition","passage_text":"Nebraska, the 37th state, was admitted to the Union in 1867. York County was organized in 1870, with its seat of government occupying the geographical center of the county. York is also within a few miles of the geographical center of the United States. Pre-emption claims were recorded by Margaret Andrews, Isaiah White, A. M. and E. C. Ghost, in 1868.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":2225213,"ranking":15,"query_text":"pre emption rights definition","passage_text":"preemption - the judicial principle asserting the supremacy of federal over state legislation on the same subject pre-emption judicial doctrine, judicial principle, legal principle - (law) a principle underlying the formulation of jurisprudence law, jurisprudence - the collection of rules imposed by authority; civilization presupposes respect for the law; the great problem for jurisprudence to allow freedom while enforcing order","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":3617848,"ranking":16,"query_text":"pre emption rights definition","passage_text":"Click here for 9 full quotes on War & Peace OR other political leaders on War & Peace. 1  Prevent Iran from building and possessing nuclear weapons. 2  Party should stand by Bush doctrine of pre-emption. 3  Terrorists seek weapons of mass destruction to kill us. 4  Shrink the space in which the terrorists can operate. 5  Total and complete destruction of 6  ... Afgh","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":4599456,"ranking":17,"query_text":"pre emption rights definition","passage_text":"Live Stream Schedule. Watch the latest broadcast from KRQE News 13 live or on replay at any time 24\/7. Here is our regular programming schedule subject to pre-emptions. Monday â\u0080\u0093 Friday | 9+ hours of Local Programming each weekday. 4:30 am â\u0080\u0093 9:00 am | KRQE This Morning. 9:00 am â\u0080\u0093 10:00 am | New Mexico Living. 12:00 pm â\u0080\u0093 12:30 pm | KRQE News 13.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":542957,"ranking":18,"query_text":"pre emption rights definition","passage_text":"The law that applies to situations where state and federal laws disagree is called the supremacy clause, which is part of article VI of the Constitution. The supremacy clause contains what's known as the doctrine of pre-emption, which says that the federal government wins in the case of conflicting legislation. Basically, if a federal and state law contradict, then when you're in the state you can follow the state law, but the feds can decide to stop you. When there is a conflict between a state law and federal law, it is the federal law that prevails.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":4441809,"ranking":19,"query_text":"pre emption rights definition","passage_text":"Right now, Verizon is selling the certified pre-owned Galaxy S5 for $99.99 with 2-year plan and $419.99 off contract. And last but definitely not least on our list of the todayâ\u0080\u0099s Verizon certified pre-owned phones list is the Samsung Galaxy Note 3, which is great proposition for all phablet enthusiasts.","bm25_label":"high","relevance_label":0.0},{"query_id":479284,"passage_id":5628471,"ranking":20,"query_text":"pre emption rights definition","passage_text":"For purposes of the medical and dental expenses deduction, a child of divorced or separated pa-rents can be treated as a dependent of both pa-rents. Each parent can include the medical ex-penses he or she pays for the child, even if the other parent claims the child's dependency ex-emption, if:1.","bm25_label":"high","relevance_label":0.0}]