[{"query_id":486370,"passage_id":5611685,"ranking":1,"query_text":"redbone definition slang","passage_text":"The Meaning of REDBONE. You have found the definitive source for the meaning of REDBONE. This page contains all the definitions of REDBONE, crowd sourced, moderated and curated by real people who care about the true definitions of REDBONE.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":5611684,"ranking":2,"query_text":"redbone definition slang","passage_text":"The meaning of REDBONE. REDBONE means Light skinned colored person. Now you understand the definition of REDBONE-REDBONE means Light skinned colored person. We're glad to be of assistance.","bm25_label":"high","relevance_label":1.0},{"query_id":486370,"passage_id":4696379,"ranking":3,"query_text":"redbone definition slang","passage_text":"Lolly Vegas passed away in his sleep of lung cancer at age 70. He had suffered from bad health since having a stoke 15 years ago. Fronting the Native American band Redbone, Lolly Vegas wrote the hit song â\u0080\u0098Come and Get Your Loveâ\u0080\u0099 which reached number #5 on the Billboard Hot 100 Chart in April 1974. Redbone is a slang term meaning Cajun or mixed race person â\u0080\u0093 Lolly and the other members of Redbone were part Native American. The band Redbone was formed at the urging of Jimi Hendrix who was also part Native American.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":2561024,"ranking":4,"query_text":"redbone definition slang","passage_text":"REDBONE REDBONE. This Redbone blog is dedicated to exploring Redbone history, the Redbone cultures and mixed ethnicities of Redbone pioneers who settled much of the American South before finding themselves concentrated in Mississippi, Louisiana, Texas and Oklahoma.EDBONE REDBONE. This Redbone blog is dedicated to exploring Redbone history, the Redbone cultures and mixed ethnicities of Redbone pioneers who settled much of the American South before finding themselves concentrated in Mississippi, Louisiana, Texas and Oklahoma.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":7550411,"ranking":5,"query_text":"redbone definition slang","passage_text":"REDBONE â\u0080¢ REDBONE (noun) The noun REDBONE has 1 sense: 1. a speedy red or red-and-tan American hound Familiarity information: REDBONE used as a noun is very rare.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":7550412,"ranking":6,"query_text":"redbone definition slang","passage_text":"Redbones are not neccesarily Creole or Cajun--they traditionally speak English. The redbone lived in the Louisiana bayou his whole life. 4. redbone A female or male of African American descent who is light skinned with red undertones. Beyonce, Halle Berry, Ciara, and Sanaa Lathan are redbones. tags redbone redbones beyonce halle berry sanaa lathan ciara 5. Redbone mainly a pretty female who is black and usually mixed with another race, hence she is light skinned, light eyes, good hair, thick etc.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":6308213,"ranking":7,"query_text":"redbone definition slang","passage_text":"Redbones are not neccesarily Creole or Cajun--they traditionally speak English. The redbone lived in the Louisiana bayou his whole life. 4. redbone A female or male of African American descent who is light skinned with red undertones. Beyonce, Halle Berry, Ciara, and Sanaa Lathan are redbones.tags redbone redbones beyonce halle berry sanaa lathan ciara 5.Redbone mainly a pretty female who is black and usually mixed with another race, hence she is light skinned, light eyes, good hair, thick etc.eyonce, Halle Berry, Ciara, and Sanaa Lathan are redbones. tags redbone redbones beyonce halle berry sanaa lathan ciara 5. Redbone mainly a pretty female who is black and usually mixed with another race, hence she is light skinned, light eyes, good hair, thick etc.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":7433422,"ranking":8,"query_text":"redbone definition slang","passage_text":"Redbone Biography. If you would like to share Redbone lyrics with other users of this site, please see the bottom of this page on how to submit Redbone lyrics.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":7758940,"ranking":9,"query_text":"redbone definition slang","passage_text":"The only definition for Redbone that I have ever heard is this. A dog's erection, due to the red fleshy protrusion that comes out of the end of the penis when it is erect. Looks like a red bone.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":4985108,"ranking":10,"query_text":"redbone definition slang","passage_text":"A Redbone or Redbone Girl is a black woman, whose parents are both black, happens to have an extremely light skintone. Tags: redbone, sex. Monday, February 06 2012.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":4240676,"ranking":11,"query_text":"redbone definition slang","passage_text":"SLANG DEFINITION | Slang, Acronyms, & Hashtags Used In Social Media. Slang Definition: Meanings and definitions of slang terms, acronyms, and hashtags used on social networking websites & apps like Instagram, Facebook, etc.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":6976591,"ranking":12,"query_text":"redbone definition slang","passage_text":"Redbone Coonhound Redbone Hound and Reds. Known for its flashy red coat, the Redbone Coonhound is a versatile worker and possesses the ability to hunt and swim over a variety of terrain while still maintaining its speed and agility. Redbones possess a natural treeing instinct and will track game ranging from raccoons to cougars.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":7433423,"ranking":13,"query_text":"redbone definition slang","passage_text":"Redbone Lyrics. Feel free to share Redbone lyrics. Just click on Add a commentâ\u0080¦ below and paste the song name and the lyrics. However, please do not post Redbone lyrics unless you have received permission from the copyright owner. Make sure to include the name of the Redbone album along with the lyrics.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":6275101,"ranking":14,"query_text":"redbone definition slang","passage_text":"has the following definition + add your definition. object. object is used in Slang. The word obj is used in Slang meaning object.as the following definition + add your definition. object. object is used in Slang. The word obj is used in Slang meaning object.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":4412922,"ranking":15,"query_text":"redbone definition slang","passage_text":"A female or male of African American descent who is light skinned with red undertones. Beyonce, Halle Berry, Ciara, and Sanaa Lathan are redbones. #redbone #redbones #beyonce #halle berry #sanaa lathan #ciara.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":2949334,"ranking":16,"query_text":"redbone definition slang","passage_text":"REDBONE TRIBUTE - IN MEMORY OF LOLLY VEGAS AND TONY BELLAMY. REDBONE. Redbone is a rock band from the 1970s. The band was formed in Los Angeles, California by the brothers Pat and Lolly Vegas, two Native Americans, in 1968.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":7433418,"ranking":17,"query_text":"redbone definition slang","passage_text":"Now back to my review for the album live by the group Redbone: Live by the native-american group Redbone is plain and simply pure enjoyment to listen to. Redbone ranks up there as one of my top 3 all time favorite rock groups around. Most people are only aware of Redbone from their hugh hit Come And Get Your Love.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":6976592,"ranking":18,"query_text":"redbone definition slang","passage_text":"The history of the Redbone Coonhound began in Georgia in the 1800s with the mixture of bloodhounds and foxhounds. The original name came from a breeder named Peter Redbone. It is still not decided if the true name came from Peter Redbone or because of their cooler.","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":7758943,"ranking":19,"query_text":"redbone definition slang","passage_text":"Redbone people are people of mixed ancestry that live primarily in the Southeastern United States. Little is known about the ethnic and racial make-up of Redbone people, but during the 1830s they... Redbone people are people of mixed ancestry that live primarily in the Southeastern United States. Little is known about the ethnic and racial make-up of Redbone people, but during the 1830s they... Star Gazing","bm25_label":"high","relevance_label":0.0},{"query_id":486370,"passage_id":1546900,"ranking":20,"query_text":"redbone definition slang","passage_text":"A female Redbone Coonhound. The Redbone Coonhound is an American breed of dog used for hunting raccoon, bear, and cougar. The American Kennel Club standard says, The Redbone mingles handsome looks and an even temperament with a confident air and fine hunting talents..","bm25_label":"high","relevance_label":0.0}]