[{"query_id":488021,"passage_id":7535426,"ranking":1,"query_text":"requirements to become a drill sergeant","passage_text":"To become a drill sergeant or AIT platoon sergeant, soldiers must meet these requirements. â\u0080¢ Obtain a commanderâ\u0080\u0099s evaluation by a lieutenant colonel or higher. â\u0080¢ Demonstrate leadership ability and potential, character, and ability to perform in stressful situations.","bm25_label":"high","relevance_label":1.0},{"query_id":488021,"passage_id":7535425,"ranking":2,"query_text":"requirements to become a drill sergeant","passage_text":"How to Become an Army Drill Sergeant. Becoming a Drill Sergeant is one of the highest honors obtainable as an NCO. After all, only the most qualified NCOs are chosen to attend Drill Sergeant School, where they are trained to fulfill a role of utmost importanceâ\u0080¦turning civilians from all walks of life into Soldiers.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":7535429,"ranking":3,"query_text":"requirements to become a drill sergeant","passage_text":"There are two ways to become a Drill Instructor (DI) (Army calls them Drill Sergeants). A lot of E-6's (Staff Sergeant in the Army) will become a DI, recruiter, or some sort of inspector, to get there E-7 (Sergeant First Class in the Army) promotion. It's usually a three year term.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":6344872,"ranking":4,"query_text":"requirements to become a drill sergeant","passage_text":"The following qualifications are required for appointment to the rank of gunnery sergeant: A candidate for appointment as gunnery sergeant in the United States Marine Corps should be sufficiently proficient in the drill regulations to thoroughly drill recruits and to drill the squad and company.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":2036515,"ranking":5,"query_text":"requirements to become a drill sergeant","passage_text":"Drill sergeant service duties usually last for two years, and can potentially extend for up to three and a half years. In order to qualify for drill sergeant training, a military servicemember is required to serve for at least four years, and be under the age of 40. ARMY DRILL SERGEANTS PAY AND BENEFITS Similar to military basic pay, Army Drill Sergeants receive higher pay rates and benefits depending on their rank.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":7535431,"ranking":6,"query_text":"requirements to become a drill sergeant","passage_text":"Most Drill Sergeants are selected, but you can also volunteer for a vacant Drill Sergeant slot within a Training Command element. Entry into the Drill Sergeant Program is obviously the first step. To be considered, you must be an NCO (E-5 through E-7) and meet the requirements outlined in AR 614-200, Chapter 8.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":7535428,"ranking":7,"query_text":"requirements to become a drill sergeant","passage_text":"Others choose the road to drill sergeant school to have their own personal effect on tomorrowâ\u0080\u0099s Soldiers. â\u0080\u009cIf an NCO has the desire to become a drill sergeant, I recommend he do it,â\u0080\u009d said Williams. â\u0080\u009cItâ\u0080\u0099s just another way for him to do his part in the war on terrorism. I remember when I was a junior Soldier, the first sergeant always picked the Soldier who wore a drill sergeant patch to conduct the dayâ\u0080\u0099s training.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":6959422,"ranking":8,"query_text":"requirements to become a drill sergeant","passage_text":"Meet your drill sergeant and learn the skills it takes to become a Soldier. Basic Combat Training Schedule. ARMY PHYSICAL FITNESS TEST. Youâ\u0080\u0099ll be required to pass the Army Physical Fitness Test (APFT) in order to graduate from BCT.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":5942588,"ranking":9,"query_text":"requirements to become a drill sergeant","passage_text":"First Sergeant for a basic training company consisting of 24 Soldiers, including 12 Drill Sergeants, Drill Sergeant Candidates, Training NCO and 2 Supply Sergeants.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":7535434,"ranking":10,"query_text":"requirements to become a drill sergeant","passage_text":"Without Drill Instructors we wouldn't have a Corps. They make Marines.. Drill Instructor Duty is considered one of the most honored and valuable positions a Marine can hold, and is absolutely vital to the process of making Marines, according to Master Sgt. Andre Robinson, a Marine Corps career planner. If a Marine comes to me and expresses an interest in becoming a Drill Instructor, one of the first things I inquire about is their physical fitness, said Robinson. Marines ages 22 to 37 with the rank of sergeant through gunnery sergeant can request Drill Instructor Duty.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":2769145,"ranking":11,"query_text":"requirements to become a drill sergeant","passage_text":"o Changes the title of the regulation from â\u0080\u009cDrill Sergeant Programâ\u0080\u009d to â\u0080\u009cDrill Sergeant and. Advanced Individual Training Platoon Sergeant Programs.â\u0080\u009d. o Replaces â\u0080\u009cCommandantsâ\u0080\u009d with â\u0080\u009cCommandantâ\u0080\u009d throughout the document. o Removes â\u0080\u009cUnited States Army Reserve Drill Sergeant Schoolâ\u0080\u009d throughout the document.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":2036514,"ranking":12,"query_text":"requirements to become a drill sergeant","passage_text":"For Example, drill sergeant ranks range from (E-5) Sergeants, (E-6) Staff Sergeants, (E-7) Sergeants First-Class, (E-8) Master Sergeants and (E-9) Sergeant Major who do not actually serve as drill sergeants. Due to their higher ranks, Staff Sergeants and Sergeants First Class earn higher pay rates than (E-5) Sergeants.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":267829,"ranking":13,"query_text":"requirements to become a drill sergeant","passage_text":"Meet your drill sergeant and learn the skills it takes to become a Soldier. Basic Combat Training Schedule. ARMY PHYSICAL FITNESS TEST. Youâ\u0080\u0099ll be required to pass the Army Physical Fitness Test (APFT) in order to graduate from BCT. Fitness is of critical importance in the Army, and only those who are in the best shape go further in their careers.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":4736051,"ranking":14,"query_text":"requirements to become a drill sergeant","passage_text":"Most often, our impressions of Drill Sergeants come from the movies and television. Drill Sergeants are not like that! Drill Sergeants are chosen from the top 10% of all Army NCO's, so they are the top in their field. They have usually been in the Army for more than 10 years, so they know their job well.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":3273966,"ranking":15,"query_text":"requirements to become a drill sergeant","passage_text":"The award is authorized by the Commandant of the Drill Sergeant School, and the Drill Sergeant Identification Badge may be worn for the duration of a military memberâ\u0080\u0099s career, including commissioned service.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":4029102,"ranking":16,"query_text":"requirements to become a drill sergeant","passage_text":"First Sergeant. Serves as senior enlisted advisor to the commander of 223rd Transportation Company with an authorized strength of 166 Soldiers. Responsible for training, administration, professional development, personnel accountability, safety, morale and mentoring of all assigned Soldiers.irst Sergeant for a basic training company consisting of 24 Soldiers, including 12 Drill Sergeants, Drill Sergeant Candidates, Training NCO and 2 Supply Sergeants.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":3273959,"ranking":17,"query_text":"requirements to become a drill sergeant","passage_text":"The United States Navy equivalent of the Army's Drill Sergeant Identification Badge is the Recruit Division Commander Badge. As with Army Drill Sergeants, Division Commanders are responsible for basic military training of U.S. Navy recruits.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":3273962,"ranking":18,"query_text":"requirements to become a drill sergeant","passage_text":"The drill sergeant identification badge is worn by all qualified drill sergeants. Each element of the badge has a specific meaning. It consists of 13 stars representing the original colonies. The torch, burning brightly, in the center symbolizes liberty.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":1187557,"ranking":19,"query_text":"requirements to become a drill sergeant","passage_text":"FORT SILL, Okla. (April 24, 2014) -- For most Army Reserve Soldiers, drill time is one weekend a month and two weeks a year. For those who are a part of the Reserve Echo Company Mission, drill time means being a drill sergeant two to 10 weeks a year, or more. We come down here and do the same thing the regular drill sergeants do.","bm25_label":"high","relevance_label":0.0},{"query_id":488021,"passage_id":1851890,"ranking":20,"query_text":"requirements to become a drill sergeant","passage_text":"1:30 PM-First Sergeant;s Call. Company First Sergeant;s were to report to the post headquarters with their Morning Reports on the number of their men sick in the hospital, on guard duty, on drill or fatigue, or on special assignment.:30 PM-First Sergeant;s Call. Company First Sergeant;s were to report to the post headquarters with their Morning Reports on the number of their men sick in the hospital, on guard duty, on drill or fatigue, or on special assignment.","bm25_label":"high","relevance_label":0.0}]