[{"query_id":488345,"passage_id":7664995,"ranking":1,"query_text":"resource bank routing number","passage_text":"COVINGTON, LA 70433. Resource Bank's routing number (the leftmost number on the bottom of a check) is 65405530. Sometimes, banks have multiple routing numbers for different branches or uses. Please make sure this is the correct routing number for your branch! The main phone number for Resource Bank is 985-801-0150. The assigned Federal Reserve Office for Resource Bank is Fed 061000146.","bm25_label":"high","relevance_label":1.0},{"query_id":488345,"passage_id":1072603,"ranking":2,"query_text":"resource bank routing number","passage_text":"Check RESOURCE ONE CREDIT UNION routing numbers for bank transfers. 311080162 is a routing number of RESOURCE ONE CREDIT UNION. Check detailed information about 311080162. This bank routing number is required for electronic funds transfer. Bank routing number of RESOURCE ONE CREDIT UNION is the first nine digits of the number along the bottom left section of your check. The routing number for checking, savings and money market accounts identifies the financial institution where the account was opened and is located.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":7664989,"ranking":3,"query_text":"resource bank routing number","passage_text":"bank routing number lookup Not looking for the Resource Bank routing number? Try searching for your bank's ABA routing number by bank name, location, or phone number. â\u0080¢ st martin bank and trust c teche federal bank fidelity bank","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":556733,"ranking":4,"query_text":"resource bank routing number","passage_text":"We are the best online resource to find bank routing numbers, bank locations and more. Use our website for bank routing look up, ABA routing number search, bank locations search.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":1072604,"ranking":5,"query_text":"resource bank routing number","passage_text":"What is Resource one credit union routing number? Resource one credit union routing number is a nine digit number used to identify bank transfers. Routing numbers will be different based on the account branch. It is based on the bank account origin by state and region. The routing number on check is available for each branch in the table below.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":1399953,"ranking":6,"query_text":"resource bank routing number","passage_text":"Online resources for routing numbers and bank locations ABA Routing Number Search Please enter a bank name in the search box below and click on 'Search' to find an aba routing number.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":5574704,"ranking":7,"query_text":"resource bank routing number","passage_text":"A really good resource for routing numbers is http:\/\/routingnumbers.infocanyon.com. You can search for your bank by routing number, search for a routing number by bank name, as well as some good information.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":7343001,"ranking":8,"query_text":"resource bank routing number","passage_text":"Federal ABA Bank Routing Number Directory and Search. Routing-Numbers.com is a public resource for open access to the ABA Routing Numbers (RTNs) of all financial institutions and banks in America. You can find your bankâ\u0080\u0099s routing number with the routing number lookup tool, or browse the routing numbers directory. The Routing Transit Number of your bank (routing number on check) is found on the front of your bank checks, and is used in virtually all financial transactions to identify the bank that the funds are coming from and going to. More about Routing Numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":4437514,"ranking":9,"query_text":"resource bank routing number","passage_text":"Resource database for routing number by bank name. Enter a bank name to find a routing number. No results found, please try another search term. Please enter a bank name in the search box below and click on 'Search' to find an aba routing number.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":3822761,"ranking":10,"query_text":"resource bank routing number","passage_text":"Online resources for routing numbers and bank locations. Please enter a bank name in the search box below and click on 'Search' to find an aba routing number. Bank Name. If you want to find details information about a routing number, please enter a routing number in the search box below and click on 'Lookup'.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":1086394,"ranking":11,"query_text":"resource bank routing number","passage_text":"Federal ABA Bank Routing Number Directory and Search. Routing-Numbers.com is a public resource for open access to the ABA Routing Numbers (RTNs) of all financial institutions and banks in America. You can find your bankâ\u0080\u0099s routing number with the routing number lookup tool, or browse the routing numbers directory.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":7343002,"ranking":12,"query_text":"resource bank routing number","passage_text":"Federal ABA Bank Routing Number Directory and Search Routing-Numbers.com is a public resource for open access to the ABA Routing Numbers (RTNs) of all financial institutions and banks in America. You can find your bankâ\u0080\u0099s routing number with the routing number lookup tool, or browse the routing numbers directory.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":1731999,"ranking":13,"query_text":"resource bank routing number","passage_text":"Routing-Numbers.com is a public resource for open access to the ABA Routing Numbers (RTNs) of all financial institutions and banks in America. You can find your bankâ\u0080\u0099s routing number with the routing number lookup tool, or browse the routing numbers directory.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":8751993,"ranking":14,"query_text":"resource bank routing number","passage_text":"One number indicates a wire transfer while another points to a check withdrawal, for example. Checks display the institution's routing number next to the bank account number. Some online resources also help you find it. Go to the website Bank Routing Numbers. (See References.) Type the name of the bank in the first box on the page. The system displays the institution's ABA routing number in a table that also includes the bank's address and phone number. Visit your bank's website.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":5574706,"ranking":15,"query_text":"resource bank routing number","passage_text":"Checks display the institution's routing number next to the bank account number. Some online resources also help you find it. Go to the website Bank Routing Numbers. (See References.) Type the name of the bank in the first box on the page. The system displays the institution's ABA routing number in a table that also includes the bank's address and phone number. Visit your bank's website. Some institutions post their routing number online, but you might have to look for it. Check under Customer Service, FAQs and About Us, for example.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":8063243,"ranking":16,"query_text":"resource bank routing number","passage_text":"Routing Number: 264179900 The banking institution's routing number: Bank: EMPLOYEE RESOURCES CREDIT UNION Commonly used abbreviated customer name: Office Code: O - Main Office: Servicing FRB Number: 061000146 Servicing Fed's main office routing number: Record Type Code: 1 The code indicating the ABA number to be used to route or send ACH items to the RFI","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":8063244,"ranking":17,"query_text":"resource bank routing number","passage_text":"View details for routing number - 264179900 - assigned to EMPLOYEE RESOURCES CREDIT UNION in LAWRENCEBURG, TN. The ABA routing\/transit number is used to facilitate the electronic routing of funds (ACH transfer) from one bank account to another.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":2901317,"ranking":18,"query_text":"resource bank routing number","passage_text":"There are several routing numbers for Community Resource Credit Union reported in our bank database. Please call Community Resource Credit Union branch office at (281) 422-3611 to get an accurate routing number for Community Resource Credit Union wire transfer, reorder checks or setting up Community Resource Credit Union direct deposit.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":1072605,"ranking":19,"query_text":"resource bank routing number","passage_text":"ROUTING NUMBER - 311080162 - RESOURCE ONE CREDIT UNION. The code indicating the ABA number to be used to route or send ACH items to the RFI. 0 = Institution is a Federal Reserve Bank. 1 = Send items to customer routing number. 2 = Send items to customer using new routing number field.","bm25_label":"high","relevance_label":0.0},{"query_id":488345,"passage_id":8063238,"ranking":20,"query_text":"resource bank routing number","passage_text":"ROUTING NUMBER - 264179900 - EMPLOYEE RESOURCES CREDIT UNION. The code indicating the ABA number to be used to route or send ACH items to the RFI. 0 = Institution is a Federal Reserve Bank. 1 = Send items to customer routing number. 2 = Send items to customer using new routing number field.","bm25_label":"high","relevance_label":0.0}]