[{"query_id":490802,"passage_id":6670154,"ranking":1,"query_text":"russ simmons net worth","passage_text":"Richard Simmons Net Worth. Richard Simmons Net Worth is $15 Million. Richard Simmons was born in Lousiana and has an estimated net worth of $15 million dollars. A fitness expert and coach, Richard Simmons ...[read more]","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":7728919,"ranking":2,"query_text":"russ simmons net worth","passage_text":"Henry Simmons net worth: Henry Simmons is an American actor who has a net worth of $2 million. Henry Simmons was born in Stamford, Henry Simmons net worth: Henry Simmons is an American actor who has a net worth of $2 million. Henry Simmons was born in Stamford, Connecticut in July 1970. He attended Franklin Pierce College on a basketball scholarship and experimented in theater. From 2000 to 2005 Simmons starred as Det. Baldwin Jones in the television series NYPD Blue.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6670153,"ranking":3,"query_text":"russ simmons net worth","passage_text":"Richard Simmons Net Worth is $15 Million. Richard Simmons Net Worth is $15 Million. Richard Simmons was born in Lousiana and has an estimated net worth of $15 million dollars. A fitness expert and coach, Richard Simmons is most widely recognized for his Sweatin' to the Oldies series.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":7638467,"ranking":4,"query_text":"russ simmons net worth","passage_text":"Russell Simmons Net Worth. Net Worth: $325 Million. About Russell Simmons. American business magnate, Russell Wendell Simmons has an estimated net worth of $325 million. Known as the most important businessman in the history of rap music.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":8619890,"ranking":5,"query_text":"russ simmons net worth","passage_text":"What is Ron Simmons Net Worth? Ron Simmons net worth: Ron Simmons is an American retired professional wrestler and football player who has a net worth of $3 million dollars. Ron Simmons was born in Perry, Georgia, and first made a name for himself as a high school football player.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":4144377,"ranking":6,"query_text":"russ simmons net worth","passage_text":"How much is Tashera Simmons Worth? Tashera Simmons net worth: Tashera Simmons is an author and reality television star who has a net worth of $500 thousand. Tashera Simmons is perhaps most famous for being the ex-wife of controversial rapper DMX. Tashera Simmons shares four children with DMX and appeared on the VH1 show Couples Therapy.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6670156,"ranking":7,"query_text":"russ simmons net worth","passage_text":"Richard Simmons. Richard Simmons Net Worth is $15 Million. Richard Simmons was born in Lousiana and has an estimated net worth of $15 million dollars. A fitness expert and coach, Richard Simmons is most widely recognized for his Sweatin' to the Oldies series.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":809383,"ranking":8,"query_text":"russ simmons net worth","passage_text":"Patrick Simmons Net Worth $10 Million Dollars Patrick Simmons net worth: Patrick Simmons is an American rock singer and guitarist, who made a name for himself as an associate of the Doobie Brothers that has a net worth of $10 million. He was born on October 19, 1948 in â\u0080¦ Read More Â»","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6144391,"ranking":9,"query_text":"russ simmons net worth","passage_text":"Kimora Lee Simmons. Kimora Lee Simmons Net Worth is $50 Million. Kimora Lee Simmons-Hounsou was born in Missouri and has an estimated net worth of $50 million dollars. A model, author, and businesswoman, Kimora Lee Simmons-Hounsou is also the former president and Creat. Kimora Lee Simmons (n'ee Per...","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":1762977,"ranking":10,"query_text":"russ simmons net worth","passage_text":"Net Worth: $300 Million. About Gene Simmons. Israeli-American rock and roll legend and bassist for the band KISS, Gene Simmons has an estimated net worth of $300 million.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6670150,"ranking":11,"query_text":"russ simmons net worth","passage_text":"Richard Simmons Net Worth. Born as Milton Teagle Simmons has an estimated net worth of $15 million. He is known being a fitness personality and actor. Simmons is likewise recognized for his Sweatinâ\u0080\u0099 to the Oldies fitness series as well as his flamboyant personality.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6144395,"ranking":12,"query_text":"russ simmons net worth","passage_text":"Kimora Lee Simmons Net Worth is $50 Million. Kimora Lee Simmons-Hounsou was born in Missouri and has an estimated net worth of $50 million dollars. A model, author, and businessw...[read more]","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6144392,"ranking":13,"query_text":"russ simmons net worth","passage_text":"Kimora Lee Simmons Net Worth is $50 Million. Kimora Lee Simmons-Hounsou was born in Missouri and has an estimated net worth of $50 million dollars. A model, author, and businesswoman, Kimora Lee Simmons-Hounsou is also the former president and Creative Director of Phat Fashions.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":7638465,"ranking":14,"query_text":"russ simmons net worth","passage_text":"Russell Simmons Net Worth is $325 Million. Russell Wendell Simmons was born on October 10, 1957 and is a very successful American entrepreneur, the co-founder of the pioneering hip-hop record label, Def Jam. His personal net worth is reputed to be $ Russell Wendell Simmons is an American business magnate.","bm25_label":"high","relevance_label":1.0},{"query_id":490802,"passage_id":6144389,"ranking":15,"query_text":"russ simmons net worth","passage_text":"About Kimora Lee Simmons. It has been estimated that Kimora Lee Simmons net worth reaches 50 million dollars. Kimora Lee Simmons name is very popular in the fashion industry. The star is known as a fashion model and also the partner of the clothing line called â\u0080\u009cPhat Fashionsâ\u0080\u009d which is one of the major sources of Kimora Lee Simmons net worth.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6670149,"ranking":16,"query_text":"russ simmons net worth","passage_text":"About Richard Simmons. Richard Simmons is a well known man in the entertainment industry. He is known as a coach of aerobics and fitness promoter which increase his net worth a lot. Currently, it has been estimated that the overall amount of Richard Simmons net worth is as high as 15 million dollars. His real birth name is Milton Teagle Simmons, however in the entertainment industry he is mostly known as Richard Simmons.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":7638469,"ranking":17,"query_text":"russ simmons net worth","passage_text":"Russell Simmons Net Worth is $325 Million. Russell Wendell Simmons was born on October 10, 1957 and is a very successful American entrepreneur, the co-founder of the pioneering hip-hop record label, Def Jam. His personal net worth is reputed to be $.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6670155,"ranking":18,"query_text":"russ simmons net worth","passage_text":"What is Richard Simmons Net Worth? Richard Simmons was born in Lousiana and has an estimated net worth of $15 million dollars. A fitness expert and coach, Richard Simmons is most widely recognized for his Sweatin' to the Oldies series. He is a staunch advocate for health and has appeared on numerous talk shows and programs promoting healthy living and fitness.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":6144394,"ranking":19,"query_text":"russ simmons net worth","passage_text":"Celebrities Richest Celebrities. It has been estimated that Kimora Lee Simmons net worth reaches 50 million dollars. Kimora Lee Simmons name is very popular in the fashion industry. The star is known as a fashion model and also the partner of the clothing line called â\u0080\u009cPhat Fashionsâ\u0080\u009d which is one of the major sources of Kimora Lee Simmons net worth.","bm25_label":"high","relevance_label":0.0},{"query_id":490802,"passage_id":8120218,"ranking":20,"query_text":"russ simmons net worth","passage_text":"Larry the Cable Guy Net Worth; Leonardo Del Vecchio Net Worth; Jeff Greene Net Worth; Les Gold Net Worth; Marcel Schmelzer Net Worth; Baron Davis Net Worth; Hank Baskett Net Worth; Michael Crichton Net Worth; Darrelle Revis Net Worth; Joe Strummer Net Worth; Miuccia Prada Net Worth; D'Anthony Smith Net Worth; Russell Simmons Net Worth; Will Smith Net Worth","bm25_label":"high","relevance_label":0.0}]