[{"query_id":495680,"passage_id":7434447,"ranking":1,"query_text":"shelton wa police phone number","passage_text":"Shelton City Police Department in Shelton Washington. Shelton City Police Department, a Police Department, in Shelton, WA 98584, address and phone number. Police departments provide information on public safety, police reports, police dispatch, police impounds, and police services. Shelton City Police Department in Shelton Washington.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":7434446,"ranking":2,"query_text":"shelton wa police phone number","passage_text":"Shelton WA Police Jail's phone number is 360-426-4441 .Friends and family who are attempting to locate a recently detained loved one can use that number to find out if the person is being held at Shelton WA Police Jail If you need to send a fax to the facility, you can use their fax number: 360-426-1338.","bm25_label":"high","relevance_label":1.0},{"query_id":495680,"passage_id":7434448,"ranking":3,"query_text":"shelton wa police phone number","passage_text":"Shelton WA Police Jail is a municipal \/ police jail facility located at 525 West Cota Street Shelton, WA 98584,and servicing Shelton. Municipal \/ Police Jail facilities, often known as city jails or town jails, usually hold pre-trial detainees.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":254235,"ranking":4,"query_text":"shelton wa police phone number","passage_text":"OUR COMMUNITY CREDIT UNION SHELTON-WA: List of OUR COMMUNITY CREDIT UNION routing numbers in SHELTON ( WA ) 325182357","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":188548,"ranking":5,"query_text":"shelton wa police phone number","passage_text":"Des Moines WA Police Jail Facility and Inmate Contact Information: 1  Phone Number to Reach this Facility is: 2  Fax Number for Des Moines WA Police Jail is: 3  Email Address for this Facility: 4  Send Mail to the Facility (not inmates): 5  To Send Mail to an Inmate at Des Moines WA Police Jail:","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":5334846,"ranking":6,"query_text":"shelton wa police phone number","passage_text":"Shelton, Washington. 1  Shelton: Shelton, WA. 2  Shelton: Shelton, WA. 3  Shelton: Shelton, WA.  Shelton: View of Oakland Bay beside 1  Shelton. Shelton: Downtown Shelton overlooking Oakland 2  Bay. Shelton: As the sun is going down in Shelton  Wa. Shelton: Clock Tower in Downtown 1  Shelton. Shelton: Oakland Bay beside Shelton.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":3168598,"ranking":7,"query_text":"shelton wa police phone number","passage_text":"Non Emergency Police in Seattle on YP.com. See reviews, photos, directions, phone numbers and more for the best Police Departments in Seattle, WA. Start your search by typing in the business name below. What do you want to find?","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":254239,"ranking":8,"query_text":"shelton wa police phone number","passage_text":"Details of Routing Number # 325182357. Bank : OUR COMMUNITY CREDIT UNION . Address : PO BOX 1670, SHELTON, WA 98584-9905. Telephone : 360-427-3403.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":2462323,"ranking":9,"query_text":"shelton wa police phone number","passage_text":"151 SE Paulcyn Ln Shelton, WA 98584. Property Overview - 151 Se Paulcyn Ln, Shelton, WA 98584 is a single family home built in 1990. This property was last sold for $235,000 in 2010 and currently has an estimated value of $259,646.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":4457804,"ranking":10,"query_text":"shelton wa police phone number","passage_text":"Shelton has Mayor-Aldermen form of government. The Board of Apportionment and Taxation, also elected, prepares Shelton's annual budget. Shelton City Hall is located at 54 Hill Street. The main phone number is (203) 924-1555 Hearing Impaired TTY Line(203)924-7723. City of Shelton Website The following offices are located at City Hall:","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":7523786,"ranking":11,"query_text":"shelton wa police phone number","passage_text":"wenatchee social security office phone number: Wenatchee Soc Sec office directions: FEDERAL GOVERNMENT PHONE NUMBERS SPOKANE WASHINGTON: ss office wenatchee wa phone number: wenatchee wa social security fax number: usa goverment ssi fax phone number: wenatchee wa ste 212 yakima street: wenatchee social security office number: wenatchee social security office: wenatchee social security office fax number: Social Security Office Phone Number","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":5334848,"ranking":12,"query_text":"shelton wa police phone number","passage_text":"Shelton, WA. Sponsored Topics. Shelton is the county seat, of Mason County, Washington, United States. Shelton is the westernmost city on Puget Sound. The population was 9,834 at the 2010 census. In terms of population, the city is ranked 161 out of approximately 500 municipalities in Washington.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":7971894,"ranking":13,"query_text":"shelton wa police phone number","passage_text":"Shelton Population by Age. The table below shows the Shelton, WA population by age. At the last census, there were 9,834 people living in the city. People aged < 25 were the largest group.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":7523789,"ranking":14,"query_text":"shelton wa police phone number","passage_text":"social security office wenatchee wa fax number social security ste 212 301 yakima street wenatchee, wa 98801 phone fax number for wenatchee social security office wenatchee wa fax number. social security ste 212 301 yakima street wenatchee, wa 98801 phone. fax number for wenatchee . wenatchee wa social security. STE Social security 212 301 Yakima Street Wenatchee, WA 98801.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":7120307,"ranking":15,"query_text":"shelton wa police phone number","passage_text":"Search for recorded documents online. Public Records Request. If you would like to submit a Public Records Request to our office please download the Public Records Request Form and return to Karenh@co.mason.wa.us, or to PO Box 400 Shelton, WA 98584. Karen Herr Mason County Auditor Contact Us. Karenh@co.mason.wa.us. 360-427-9670 ext. 468. Office. 411 N 5th Street Shelton, WA 98584 Hours 9:00 am - 4:00 pm Mon-Fri Except National Holidays. Mail PO Box 400 Shelton, WA 98584","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":5334849,"ranking":16,"query_text":"shelton wa police phone number","passage_text":"Shelton, WA Employment Information. If youâ\u0080\u0099re ready for a new and challenging job, take a look at our wide range of Shelton, Washington jobs. Whatever type of job in Shelton youâ\u0080\u0099re seeking, you can find it on Monster. View our listings of Shelton job opportunities and find your perfect fit today. View More.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":4816660,"ranking":17,"query_text":"shelton wa police phone number","passage_text":"Oh, Blake Shelton. You rascal. Taking his The Voice rivalry with co-mentor Adam Levine a step further, Shelton threatened to -- and then went through with -- tweeting Levine's personal phone number for the world (and a hefty number of adoring tweens) to see. This is how it went down Monday evening, April 28:","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":2462325,"ranking":18,"query_text":"shelton wa police phone number","passage_text":"This Single-Family Home is located at 151 Southeast Paulcyn Lane, Shelton, WA. 151 SE Paulcyn Ln is in the 98584 ZIP code in Shelton, WA. The average listing price for ZIP code 98584 is $168,344. 151 SE Paulcyn Ln has 3 beds, 2 baths, approximately 1,584 square feet, and was built in 1990 View our Foreclosure Guides.","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":254237,"ranking":19,"query_text":"shelton wa police phone number","passage_text":"Routing Number : 325182357 The routing number # 325182357 is assigned to OUR COMMUNITY CREDIT UNION. Routing Number: 325182357: Institution Name: OUR COMMUNITY CREDIT UNION : Office Type: Main office: Delivery Address: PO BOX 1670, SHELTON, WA - 98584 (9905) Telephone: 360-427-3403: Servicing FRB Number: 121000374 Servicing Fed's main office routing number","bm25_label":"high","relevance_label":0.0},{"query_id":495680,"passage_id":910177,"ranking":20,"query_text":"shelton wa police phone number","passage_text":"may 01 2014 06 48 pm edt jonathan lambert j lambert @ classicalite com tag blake shelton miranda lambert divorce adam levine phone number reveal update blake shelton performing at the florida strawberry festival march 2013","bm25_label":"high","relevance_label":0.0}]