[{"query_id":499126,"passage_id":7679351,"ranking":1,"query_text":"skype doesn't work on galaxy s5","passage_text":"http:\/\/forums.androidcentral.com\/samsung-galaxy-s5\/379866-video-calling-galaxy-s5-iphone-5s.html. What program will work for the iPhone to the Samsung S5 for FaceTime. ... Downloaded Skype from the Google play store like you said.kype! An application which is made for people, for people who love to make free calls, for people who want to spend time on chatting with their friends on their mobiles, or any other platform here are the steps which will guide you to download Skype applications on your Samsung Galaxy S5 Mini.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":7679349,"ranking":2,"query_text":"skype doesn't work on galaxy s5","passage_text":"By downloading Skype on your mobiles you will be able to contact to your friends and other relatives by just swiping your fingers on your mobile, itâ\u0080\u0099s very easy to make a call with Skype to your friends or other relatives living anywhere in the world via your Samsung Galaxy S5 Mini handheld.kype! An application which is made for people, for people who love to make free calls, for people who want to spend time on chatting with their friends on their mobiles, or any other platform here are the steps which will guide you to download Skype applications on your Samsung Galaxy S5 Mini.","bm25_label":"high","relevance_label":1.0},{"query_id":499126,"passage_id":7341687,"ranking":3,"query_text":"skype doesn't work on galaxy s5","passage_text":"However, in the event that it doesn't work, you can download Samsung's official file transfer software. It's called Samsung Kies 3. Click this link to download Samsung Kies 3. Do not download the original Samsung Kies, as your Galaxy S5 is not compatible with that old version of the software.owever, in the event that it doesn't work, you can download Samsung's official file transfer software. It's called Samsung Kies 3. Click this link to download Samsung Kies 3. Do not download the original Samsung Kies, as your Galaxy S5 is not compatible with that old version of the software.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":7679350,"ranking":4,"query_text":"skype doesn't work on galaxy s5","passage_text":"The Samsung Galaxy S5 doesn't rock the boat. It doesn't make waves. Instead, it just wants to fit in. Samsung wants the Galaxy S5 to appeal to the widest audience possible, and perhaps that's why it's a bit, well, boring.Samsung didn't take any risks in designing the GS5. It's the Toyota Camry or Honda Accord of smartphones -- ideal for most average users.amsung wants the Galaxy S5 to appeal to the widest audience possible, and perhaps that's why it's a bit, well, boring. Samsung didn't take any risks in designing the GS5.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":6951075,"ranking":5,"query_text":"skype doesn't work on galaxy s5","passage_text":"What program will work for the iPhone to the Samsung S5 for FaceTime ... And you can video chat with ... Read more. Positive: 87 %. Learn how you can make video call on Samsung Galaxy S5. samsung galaxy ... V s V galaxy s V galaxy s5 galaxy s 5 ... Facetime for Android ...","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":7679347,"ranking":6,"query_text":"skype doesn't work on galaxy s5","passage_text":"Skype is the worldâ\u0080\u0099s most popular VoIP service thatâ\u0080\u0099s used both for calling and chatting. This official Skype client app for Android features the same functionality as its PC counterpart and lets you chat and talk with your friends, colleagues, and f... Other apps for Samsung Galaxy S5.1  Wifi Analyzer.his official Skype client app for Android features the same functionality as its PC counterpart and lets you chat and talk with your friends, colleagues, and f... Other apps for Samsung Galaxy S5.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":8713949,"ranking":7,"query_text":"skype doesn't work on galaxy s5","passage_text":"samsung galaxy s5. I an going to buy a new phone and i want the Galaxy s5. but i dont know which is the latest model of it.also i want to know which models work in Europe.thank you.e: samsung galaxy s5. Originally Posted by AC Question I an going to buy a new phone and i want the Galaxy s5. but i dont know which is the latest model of it.also i want to know which models work in Europe. thank you.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":907588,"ranking":8,"query_text":"skype doesn't work on galaxy s5","passage_text":"I have a Samsung Galaxy S5 that has a shattered screen. It doesn't unlock, but the phone works fine. I purchased a new phone, and I want to transfer all my contents from the old phone to the new phone.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":8316663,"ranking":9,"query_text":"skype doesn't work on galaxy s5","passage_text":"Samsung Galaxy S5 specifications Samsung Galaxy S5 price in India Samsung Galaxy S5 price Samsung Galaxy S5 launch in India Samsung Galaxy S5 launch Samsung Galaxy S5 Samsung Not Buy Samsung Galaxy S5 Buy Samsung Galaxy S5.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":8315942,"ranking":10,"query_text":"skype doesn't work on galaxy s5","passage_text":"Interestingly, the 4G variant of the Galaxy S5 doesn't just feature an additional radio for receiving 4G signals. NEW DELHI: Nearly three months after launching its flagship phone, Galaxy S5, in India, Samsung has now announced the availability of its 4G LTE variant.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":8270539,"ranking":11,"query_text":"skype doesn't work on galaxy s5","passage_text":"Here's a video tutorial on how to get free wifi tether hotspot working on your Sprint Galaxy S5 Android smartphone with the hotspot mod.Download and Step-by-Step tutorial here: http:\/\/galaxys5root.com\/galaxy-s5-wif...ere's a video tutorial on how to get free wifi tether hotspot working on your Sprint Galaxy S5 Android smartphone with the hotspot mod.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":7679345,"ranking":12,"query_text":"skype doesn't work on galaxy s5","passage_text":"My final hope for the Galaxy S5's software is that all of Samsung's inevitable software extras work as promised. Too many times, I've seen Samsung roll out a differentiating feature that doesn't work as advertised, or that is so specific in its demands, it becomes downright impractical.n fact, I'd love to see the Galaxy S5 depart from the ultraglossy, high-shine S3 and S4 with antireflective coatings everywhere, and let's make the backing smudge-resistant while Samsung's at it. A matte finish or soft-touch coating could easily take care of the problem.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":907587,"ranking":13,"query_text":"skype doesn't work on galaxy s5","passage_text":"Broken Samsung Galaxy S5 screen help. I broke my screen on my Gaslaxy S5 when I dropped it. The screen is barely visible. But it seems to be working. I went the AT&T store and bought a new Galaxy S5.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":2194721,"ranking":14,"query_text":"skype doesn't work on galaxy s5","passage_text":"This is the second major torture session that TechSmartt has put the Galaxy S5 through in recent days. Last week, TechSmartt dropped the Galaxy S5 from 10 feet in the air and then ran over it with an SUV and the phone still worked perfectly fine. The full Galaxy S5 water torture video follows below.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":8713950,"ranking":15,"query_text":"skype doesn't work on galaxy s5","passage_text":"Re: samsung galaxy s5. Originally Posted by AC Question I an going to buy a new phone and i want the Galaxy s5. but i dont know which is the latest model of it.also i want to know which models work in Europe. thank you.e: samsung galaxy s5. Originally Posted by AC Question I an going to buy a new phone and i want the Galaxy s5. but i dont know which is the latest model of it.also i want to know which models work in Europe. thank you.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":8315945,"ranking":16,"query_text":"skype doesn't work on galaxy s5","passage_text":"Interestingly, the 4G variant of the Galaxy S5 doesn't just feature an additional radio for receiving 4G signals. NEW DELHI: Nearly three months after launching its flagship phone, Galaxy S5, in India, Samsung has now announced the availability of its 4G LTE variant. The new model will be available staring July 20.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":5722849,"ranking":17,"query_text":"skype doesn't work on galaxy s5","passage_text":"A premium ad-free radio service that doesn't cost a dime. In case you can't find what you need from other free Internet Radio services, Samsung has released Milk Music for the Galaxy S3, Galaxy S4, Galaxy S5, Galaxy Note 2, Galaxy Note 3, Galaxy Mega and Galaxy S4 Mini.Powered by Slacker, Milk Music features over 200 genre-based and curated stations, with 13 million songs. premium ad-free radio service that doesn't cost a dime. In case you can't find what you need from other free Internet Radio services, Samsung has released Milk Music for the Galaxy S3, Galaxy S4, Galaxy S5, Galaxy Note 2, Galaxy Note 3, Galaxy Mega and Galaxy S4 Mini.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":4648714,"ranking":18,"query_text":"skype doesn't work on galaxy s5","passage_text":"Press and hold Volume up, Home and Power buttons until the Samsung logo appears on the screen. If your Samsung Galaxy S5 becomes unresponsive or doesn't perform as expected, you can perform a hard reset to return it to the factory default state.f your phone won't turn off, remove and then reinsert the battery. If your Samsung Galaxy S5 becomes unresponsive or doesn't perform as expected, you can perform a hard reset to return it to the factory default state.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":8715356,"ranking":19,"query_text":"skype doesn't work on galaxy s5","passage_text":"Actually besides galaxy s5 kitkat freeze after update, there are also several problems encountered, such as: 1  Samsung Galaxy S5 Device switching off automatically. 2  Samsung Galaxy S5 Device running slowly. 3  Samsung Galaxy S5 Device restarting itself.4  S5 Freezing up and crashing.ctually besides galaxy s5 kitkat freeze after update, there are also several problems encountered, such as: 1  Samsung Galaxy S5 Device switching off automatically. 2  Samsung Galaxy S5 Device running slowly. 3  Samsung Galaxy S5 Device restarting itself.","bm25_label":"high","relevance_label":0.0},{"query_id":499126,"passage_id":2147837,"ranking":20,"query_text":"skype doesn't work on galaxy s5","passage_text":"1 1 Samsung's most powerful for 2014 has arrived! 2  Samsung Galaxy S5 is packed with one of the most powerful processor, camera and health features. 3  We have all the tutorials, instructions and tips on how to get the most out of your phone on this Category:All About Samsung Galaxy S5.ike most Samsung Galaxy devices, Samsung Galaxy S5 can be turned on and off by pressing and holding the Power button. Aside from the usual Power button, we will also discuss a work around on powering your Galaxy S5 on and off.","bm25_label":"high","relevance_label":0.0}]