[{"query_id":503390,"passage_id":6057028,"ranking":1,"query_text":"statute of limitations definition","passage_text":"DEFINITION of 'Statute Of Limitations'. A statute of limitations is a law which sets out the maximum time that parties have to initiate legal proceedings from the date of an alleged offense. The precise form of a statute of limitations differs from one jurisdiction to the next.","bm25_label":"high","relevance_label":1.0},{"query_id":503390,"passage_id":6132398,"ranking":2,"query_text":"statute of limitations definition","passage_text":"DEFINITION of 'Statute Of Limitations'. A statute of limitations is a law which sets out the maximum time that parties have to initiate legal proceedings from the date of an alleged offense. The precise form of a statute of limitations differs from one jurisdiction to the next. In general, the length of time allowed under a statute of limitations varies depending upon the severity of the offense.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":7654076,"ranking":3,"query_text":"statute of limitations definition","passage_text":"Statute of Limitations Definition. Statute of limitations is a blanket term used to describe state statutes that specify the time limit that a plaintiff has to file a complaint or that the prosecutor has to file criminal charges. Thus, if this time has passed, the plaintiff or prosecutor is barred from initiating a case against the defendant.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":5923940,"ranking":4,"query_text":"statute of limitations definition","passage_text":"Definition of statutory. 1  1 : of or relating to statutes. 2  2 : enacted, created, or regulated by statute a statutory age limit.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":4402198,"ranking":5,"query_text":"statute of limitations definition","passage_text":"The definition of employer plays a role similar to the definition of employee in labor and employment law. Each statute sets out a definition of the employer concept which limits the scope of the statute's coverage by determining which entities are liable as employers and which are not.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":1684784,"ranking":6,"query_text":"statute of limitations definition","passage_text":"DEFINITION of 'Statute Of Limitations'. A statute of limitations is a law which sets out the maximum time that parties have to initiate legal proceedings from the date of an alleged offense. The precise form of a statute of limitations differs from one jurisdiction to the next. In general, the length of time allowed under a statute of limitations varies depending upon the severity of the offense. For example, breach of contract cases may only be brought within a few years after the event.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":5952280,"ranking":7,"query_text":"statute of limitations definition","passage_text":"A statute of limitations is said to start running at the time a claim accrues. In case of damages, a claim accrues, by definition in the statute of limitations, at the time that the wrong upon which the claim is based was done, regardless of the time when damage results.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":606533,"ranking":8,"query_text":"statute of limitations definition","passage_text":"However, the benefit actually being conferred by residency statutes is the right to be considered for in-state resident status This is a non-monetary benefit, and this definition lends support to my reading of the statute. Reduction in the statute of limitations and mandatory presuit mediation.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":6581098,"ranking":9,"query_text":"statute of limitations definition","passage_text":"The FindLaw Legal Dictionary -- free access to over 8260 definitions of legal terms. Search for a definition or browse our legal glossaries. : barred by the passage of time under a statute of limitations, statute of repose, or procedural rule [petition for post-conviction relief was ].","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":7181765,"ranking":10,"query_text":"statute of limitations definition","passage_text":"What Are Statutes of Limitations? Yes, there are definite time limits to file a lawsuit. It depends entirely upon the state you're in (or federal law) and what the offense is. Some claims may expire as quickly as a year after the event in question took place. Other claims can be filed decades later (tax fraud, for instance). If you are considering filing a lawsuit, contact an attorney or check the relevant laws to find out what the statute of limitations is in your case. When Do Statutes of Limitations Start? There are several different ways that a statute of limitation may start, but here are the most common three:","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":1296084,"ranking":11,"query_text":"statute of limitations definition","passage_text":"Definition of purview. 1a : the body or enacting part of a statuteb : the limit, purpose, or scope of a statute. 2 : the range or limit of authority, competence, responsibility, concern, or intention.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":3597795,"ranking":12,"query_text":"statute of limitations definition","passage_text":"Definition. Action, agreement, claim, obligation, or right that can no longer be the subject of a legal action because the time limit imposed by the limitations act (see statute of limitations) has been exceeded.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":6581099,"ranking":13,"query_text":"statute of limitations definition","passage_text":"FINDLAW LEGAL DICTIONARY. The FindLaw Legal Dictionary -- free access to over 8260 definitions of legal terms. Search for a definition or browse our legal glossaries. : barred by the passage of time under a statute of limitations, statute of repose, or procedural rule [petition for post-conviction relief was ].","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":7461915,"ranking":14,"query_text":"statute of limitations definition","passage_text":"Virginia Statutes. The following statutes comprise the state's relevant assistance animal and guide dog laws. Provides most recent definitions for terms used throughout the rest of the statute, including but not limited to private and public animal shelters, commercial breeder, shelter, pet shop, and kennel.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":690592,"ranking":15,"query_text":"statute of limitations definition","passage_text":"Webster Dictionary(0.00 \/ 0 votes)Rate this definition: 1  Purview(noun) the body of a statute, or that part which begins with  Be it enacted,  as distinguished from the preamble. 2  Purview(noun) the limit or scope of a statute; the whole extent of its intention or provisions. 3  Purview(noun) limit or sphere of authority; scope; extent.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":190290,"ranking":16,"query_text":"statute of limitations definition","passage_text":"Where it is precisely defined, as in a statute, that definition strictly controls any decision about whether a certain event covered by that statute was in fact an accident. In its most limited sense, the word accident is used only for events that occur without the intervention of a human being.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":1296089,"ranking":17,"query_text":"statute of limitations definition","passage_text":"Legal Definition of purview. 1  1 : the body of a statute or the part that begins with Be it enacted and ends before the repealing clause. 2  2 : the limit or scope of a law.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":5952279,"ranking":18,"query_text":"statute of limitations definition","passage_text":"In case of damages, a claim accrues, by definition in the statute of limitations, at the time that the wrong upon which the claim is based was done, regardless of the time when damage results.","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":4788078,"ranking":19,"query_text":"statute of limitations definition","passage_text":"Here is a brief summary of civil statute of limitation laws in Florida. Civil Statutes of Limitation. In every state, there are time limits for the filing of lawsuits and other civil actions called statutes of limitations.. Florida's civil statute of limitations laws are largely in line with those of other states. Depending on the type of case or procedure, Florida's statutes of limitations range from two to four years. The point at which the clock starts ticking typically is the date of the incident or discovery of a wrong. Below is a summary of civil statutes of limitations in Florida. See Details on State Civil Statute of Limitations and Time Limits to Bring a Case: The Statute of Limitations to learn more. Statutes of Limitation in Florida","bm25_label":"high","relevance_label":0.0},{"query_id":503390,"passage_id":5081216,"ranking":20,"query_text":"statute of limitations definition","passage_text":"Search the Definitions. v. 1) to delay, suspend or hold off the effect of a statute. Examples: a) a minor is injured in an accident when he is 14 years old, and the state law (statute of limitations) allows a person hurt by negligence two years to file suit for damages.","bm25_label":"high","relevance_label":0.0}]