[{"query_id":507381,"passage_id":7454712,"ranking":1,"query_text":"symptoms of congenital heart defects","passage_text":"More information about causes of Congenital heart defects: 1  Underlying causes of Congenital heart defects. 2  Congenital heart defects as a complication caused by other conditions. 3  Congenital heart defects as a symptom. 4  Medical news summaries relating to Causes of Congenital heart defects.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":1041249,"ranking":2,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart defects change the normal flow of blood through the heart. There are many types of congenital heart defects. They range from simple defects with no symptoms to complex defects with severe, life-threatening symptoms.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":905978,"ranking":3,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart defects change the normal flow of blood through the heart. There are many types of congenital heart defects. They range from simple defects with no symptoms to complex defects with severe, life-threatening symptoms. Congenital heart defects are the most common type of birth defect. They affect 8 out of every 1,000 newborns. Each year, more than 35,000 babies in the United States are born with congenital heart defects. Many of these defects are simple conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":48444,"ranking":4,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart defect. A congenital heart defect (CHD), also known as a congenital heart anomaly or congenital heart disease, is a problem in the structure of the heart that is present at birth. Signs and symptoms depend on the specific type of problem. Symptoms can vary from none to life-threatening.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":3325445,"ranking":5,"query_text":"symptoms of congenital heart defects","passage_text":"Hole in the heart (medical condition): A heart defect involving the septum which is present at birth....more Â». See also: Congenital heart septum defect: Â»Introduction: Congenital heart septum defect. Â»Symptoms of Congenital heart septum defect.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":7454711,"ranking":6,"query_text":"symptoms of congenital heart defects","passage_text":"Research symptoms & diagnosis of Congenital heart defects: 1  Overview -- Congenital heart defects. 2  Diagnostic Tests for Congenital heart defects. 3  Home Diagnostic Testing. 4  Doctors & Specialists. 5  Misdiagnosis and Alternative Diagnoses. 6  Hidden Causes of Congenital heart defects.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":7454707,"ranking":7,"query_text":"symptoms of congenital heart defects","passage_text":"There are many types of congenital heart defects. They range from simple defects with no symptoms to complex defects with severe, life-threatening symptoms. Congenital heart defects are the most common type of birth defect. They affect 8 out of every 1,000 newborns. Each year, more than 35,000 babies in the United States are born with congenital heart defects.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":6844412,"ranking":8,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart disease, also known as congenital heart defect, is a heart abnormality present at birth. Learn about its symptoms, causes, and treatment. Congenital heart disease, also known as congenital heart defect, is a heart abnormality present at birth. Learn about its symptoms, causes, and treatment. Newsletter","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":898541,"ranking":9,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart disease, or a congenital heart defect, is a heart abnormality present at birth. There are numerous types of congenital heart defects. They can range from simple conditions that donâ\u0080\u0099t cause symptoms to complex problems that cause severe, life-threatening symptoms.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":8297047,"ranking":10,"query_text":"symptoms of congenital heart defects","passage_text":"In adults, if symptoms of congenital heart disease are present, they may include: Shortness of breath; Limited ability to exercise; Symptoms of heart failure (see above) or valve disease (see above) Congenital Heart Defects in Infants and Children. Symptoms of congenital heart defects in infants and children may include:","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":7153821,"ranking":11,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart disease, also known as congenital heart defect, is a heart abnormality present at birth. Learn about its symptoms, causes, and treatment. Congenital heart disease, also known as congenital heart defect, is a heart abnormality present at birth.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":6193920,"ranking":12,"query_text":"symptoms of congenital heart defects","passage_text":"Symptoms of Congenital Heart Disease. Congenital heart defects may be diagnosed before birth, right after birth, during childhood or not until adulthood. It is possible to have a defect and no symptoms at all.In adults, if symptoms of congenital heart disease are present, they may include: 1  shortness of breath.2  poor exercise tolerance.ongenital heart defects may be diagnosed before birth, right after birth, during childhood or not until adulthood. It is possible to have a defect and no symptoms at all. In adults, if symptoms of congenital heart disease are present, they may include: 1  shortness of breath. 2  poor exercise tolerance.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":3213127,"ranking":13,"query_text":"symptoms of congenital heart defects","passage_text":"Symptoms of Congenital Heart Disease. Congenital heart defects may be diagnosed before birth, right after birth, during childhood or not until adulthood. It is possible to have a defect and no symptoms at all.In adults, if symptoms of congenital heart disease are present, they may include: 1  shortness of breath.reatment is based on the severity of the congenital heart disease. Some mild heart defects do not require any treatment. Others can be treated with medications, invasive procedures or surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":1041248,"ranking":14,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart defect; Synonyms: Congenital heart anomaly, congenital heart disease: The normal structure of the heart (left) in comparison to two common locations for a ventricular septal defect (right), the most common form of congenital heart defect. Specialty: Cardiology: Symptoms: Rapid breathing, bluish skin, poor weight gain, feeling tired","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":4539029,"ranking":15,"query_text":"symptoms of congenital heart defects","passage_text":"The most common form of birth defects are congenital heart defects. This article describes the causes, symptoms, and treatments of congenital heart defects. Cleft Lip and Cleft Palate. The 4th most common birth defect is a cleft lip or palate.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":7454709,"ranking":16,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart defects: Symptom Checkers. Review the available symptom checkers for these symptoms of Congenital heart defects: 1  Cyanosis -- Symptom Checker. 2  Blue skin -- Symptom Checker. 3  Blue lips -- Symptom Checker. 4  Breathing difficulty -- Symptom Checker. 5  Poor growth -- Symptom Checker.","bm25_label":"high","relevance_label":1.0},{"query_id":507381,"passage_id":2617221,"ranking":17,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart defect (CHD), also known as a congenital heart anomaly or congenital heart disease, is a problem in the structure of the heart that is present at birth. Signs and symptoms depend on the specific type of problem.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":905983,"ranking":18,"query_text":"symptoms of congenital heart defects","passage_text":"Congenital heart defect (CHD), also known as a congenital heart anomaly or congenital heart disease, is a problem in the structure of the heart that is present at birth. Signs and symptoms depend on the specific type of problem. Symptoms can vary from none to life-threatening.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":3325441,"ranking":19,"query_text":"symptoms of congenital heart defects","passage_text":"Hole in the heart as a Disease. Hole in the heart: Another name for Congenital heart septum defect (or close medical condition association). Â»Introduction: Congenital heart septum defect. Â»Symptoms of Congenital heart septum defect. Hole in the heart: Hole in the heart is listed as a type of (or associated with) the following medical conditions in our database: 1  Circulatory system conditions. 2  Heart conditions. 3  Chest conditions.  Infant health conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":507381,"passage_id":4997335,"ranking":20,"query_text":"symptoms of congenital heart defects","passage_text":"ventricular septal defect (VSD), n an abnormal opening in the septum separating the ventricles of the heart. It is the most common congenital heart defect. Children with small defects are usually without symptoms.","bm25_label":"high","relevance_label":0.0}]