[{"query_id":513397,"passage_id":7451303,"ranking":1,"query_text":"terry hayes for governor maine","passage_text":"Pop a top on an ice cold beer, kick back, and have a conversation with Terry Hayes, Maine's next Governor at Banded Horn Brewing Co. in Biddeford! Maine's first independent State Treasurer, Terry Hayes is the only candidate for Governor with the experience, independence, and courage to lead Maine in a new direction and create opportunity for all Maine people. The Bangor Daily News has called Terry a maverick with bipartisan gravitas.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451308,"ranking":2,"query_text":"terry hayes for governor maine","passage_text":"Terry Hayes is running for Governor of Maine as an independent. She is currently Maineâ\u0080\u0099s first independent State Treasurer, and she previously served 8 years in the Maine State House. Terry Hayes is running for Governor of Maine as an independent. She is currently Maineâ\u0080\u0099s first independent State Treasurer, and she previously served 8 years in the Maine State House. Donate","bm25_label":"high","relevance_label":1.0},{"query_id":513397,"passage_id":7451311,"ranking":3,"query_text":"terry hayes for governor maine","passage_text":"The latest Tweets from Terry Hayes (@HayesForMaine). #HayesForMaine Independent Clean Elections candidate for Governor. Maine, USA","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451309,"ranking":4,"query_text":"terry hayes for governor maine","passage_text":"Terry Hayes, Maine independent, Clean Elections candidate for Governor, receives endorsement from Representative Norman Higgins Read More More than 1,300 real people contribute to help get big money out of politics","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451306,"ranking":5,"query_text":"terry hayes for governor maine","passage_text":"A licensed pilot, Hayes said she plans to keep working as treasurer while campaigning for governor. â\u0080\u009cThis isnâ\u0080\u0099t the first time that I have held two full-time jobs,â\u0080\u009d she said. scollins@sunjournal.com. State Treasurer Terry Hayes launched her independent bid for governor Monday with a plea for civility in public life and a welcoming attitude toward the new Mainers who are the key to the stateâ\u0080\u0099s future success. â\u0080\u009cI have this vision for Maine that is so optimistic and inclusive â\u0080\u0093 and the only way I canâ\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451304,"ranking":6,"query_text":"terry hayes for governor maine","passage_text":"State Treasurer Terry Hayes launched her independent bid for governor Monday with a plea for civility in public life and a welcoming attitude toward the new Mainers who are the key to the stateâ\u0080\u0099s future success. â\u0080\u009cI have this vision for Maine that is so optimistic and inclusive â\u0080\u0093 and the only way I can get this is to be in charge,â\u0080\u009d she said.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451310,"ranking":7,"query_text":"terry hayes for governor maine","passage_text":"Independent Candidate for Gov in Maine Terry Hayes: I'm Beholden to Maine Voters, Not Parties or Wealthy Donors: http:\/\/ j.mp\/2ys8OXO 4 replies 19 retweets 56 likes Reply","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451302,"ranking":8,"query_text":"terry hayes for governor maine","passage_text":"@HayesForMaine has promised to put the people of Maine over party leaders and special interests https:\/\/ ivn.us\/2017\/10\/16\/ind ependent-terry-hayes-beholden-maine-voters-not-parties-wealthy-donors\/ â\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451307,"ranking":9,"query_text":"terry hayes for governor maine","passage_text":"Terry is commited to getting big money out of politics. By making a $5 Qualifying contribution through the Maine Ethics Commission, you can help Terry to qualify and run a clean campaign for Governor. We need 3,200 Maine voters to make a $5 qualifying contribution by March 31, 2018.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":7451305,"ranking":10,"query_text":"terry hayes for governor maine","passage_text":"URGENT: Take action to help Terry get big money out of politics! Chip-In $5 Today As Governor, Terry will focus on moving the needle on key metrics that we know will have the greatest impact to create opportunity and prosperity for Maine.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":4371216,"ranking":11,"query_text":"terry hayes for governor maine","passage_text":"Main articles: Terry McAuliffe gubernatorial campaign, 2013 and Virginia gubernatorial election, 2013. On November 8, 2012, McAuliffe emailed supporters announcing his intention to run for Governor of Virginia in 2013.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":4816897,"ranking":12,"query_text":"terry hayes for governor maine","passage_text":"Terry McAuliffe, the 72nd Governor of Virginia. Terry McAuliffe is the 72nd Governor of Virginia. Since being sworn-into office, Governor McAuliffe has aggressively focused on building a new Virginia economy.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":6931360,"ranking":13,"query_text":"terry hayes for governor maine","passage_text":"The current Governor of Virginia is Democrat Terry McAuliffe. He was sworn into the Office of Governor on January 11th, 2014. Terry McAuliffe is 59 years old and serving his first elected term as Governor. His Virginia Gubernatorial seat will be up for regular election on November 7th, 2017. Terry McAuliffe is not eligible for re-election in 2017 due to state term restrictions.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":2058813,"ranking":14,"query_text":"terry hayes for governor maine","passage_text":"Terry McAuliffe, the 72nd Governor of Virginia. Terry McAuliffe is the 72nd Governor of Virginia. Since being sworn-into office, Governor McAuliffe has aggressively focused on building a new Virginia economy. Whether traveling to Bedford or Beijing, Governor McAuliffe has made it clear that his number one priority is economic development and he is working hard to create and maintain jobs throughout the Commonwealth.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":4637925,"ranking":15,"query_text":"terry hayes for governor maine","passage_text":"ABC News. Democrat Terry McAuliffe Wins Virginia Governor Race, AP Projects. In the battle for governor of Virginia, Democrat Terry McAuliffe pulled out a narrow victory Tuesday over Republican Attorney General Ken Cuccinelli, the Associated Press projected.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":1603398,"ranking":16,"query_text":"terry hayes for governor maine","passage_text":"President Rutherford B. Hayes, former Republican Governor of Ohio, was the first sitting governor to be elected as President of the United States. That year, 1876, the Democrats also nominated a governor, Samuel Tilden of New York, to run for the office. Seventeen presidents have previously served as governors.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":8279457,"ranking":17,"query_text":"terry hayes for governor maine","passage_text":"Hayes left Congress to run for Governor of Ohio and was elected to two consecutive terms, from 1868 to 1872, and then to a third term, from 1876 to 1877. In 1876, Hayes was elected president in one of the most contentious elections in national history.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":8349665,"ranking":18,"query_text":"terry hayes for governor maine","passage_text":"The Democratic nominee was Samuel J. Tilden, the Governor of New York. Tilden was considered a formidable adversary who, like Hayes, had a reputation for honesty. Also like Hayes, Tilden was a hard-money man and supported civil service reform.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":5235872,"ranking":19,"query_text":"terry hayes for governor maine","passage_text":"Ohio Republicans turned to Hayes, their best vote-getter, to run against the incumbent Democratic governor. Once again, Hayes won a close race, with 5,544 votes out of almost 600,000 cast, and was immediately spoken of as a contender for the 1876 Republican presidential nomination. As the favorite son of Ohio, Rutherford B. Hayes had much in his favor.","bm25_label":"high","relevance_label":0.0},{"query_id":513397,"passage_id":5004111,"ranking":20,"query_text":"terry hayes for governor maine","passage_text":"One of the most prominent people involved with the founding of Ohio State was Rutherford B. Hayes who was Ohio's governor at the time. Hayes insisted that the University be located near Columbus and so it was built near Columbus. See the Related Links for more information.","bm25_label":"high","relevance_label":0.0}]