[{"query_id":523413,"passage_id":7417207,"ranking":1,"query_text":"trade price carpets","passage_text":"â\u0080\u009cI have used Trade Price Carpets for many years in my rental properties. They have always been very professional with competitive prices, trustworthy staff and a very high quality finish.Always respectful and leave the properties in a tidy state. I always recommend to my friends and cannot speak more highly of them.ew carpets to bedroom, lounge and H\/S\/L. â\u0080\u009cVery happy with the carpets, service and price. Told them what we needed, and they gave very helpful advice on which type of carpet to go for.","bm25_label":"high","relevance_label":1.0},{"query_id":523413,"passage_id":7417213,"ranking":2,"query_text":"trade price carpets","passage_text":"\/ Carpet Underlay \/ Duralay Carpet Underlay. Duralay is famous for durability and comfort and doesn't compromise on either. The brand offers a wide choice of sponge rubber, foam and the environmentally friendly crumb rubber underlays.All Duralay carpet underlay is Brand New Perfect Stock, just as you find in the shops but all at Trade Prices! Carpet Underlay \/ Duralay Carpet Underlay. Duralay is famous for durability and comfort and doesn't compromise on either. The brand offers a wide choice of sponge rubber, foam and the environmentally friendly crumb rubber underlays.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":2881506,"ranking":3,"query_text":"trade price carpets","passage_text":"Learn About Installation, Cleaning and Repair Costs. 1  Prices Sorted by Leading Carpet Brands. 2  Prices sorted by Carpet Retailers. 3  Carpeting Prices by Quality.  Price of Carpet 1  Padding. Carpet Installation Prices.  Total Cost of Buying and Installing New 1  Carpet. Homeowner Submitted Prices.  Your Questions Answered!","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":4857573,"ranking":4,"query_text":"trade price carpets","passage_text":"I expect a 25% increase in all flooring product prices and a 35% increase in carpet and flooring installation costs within the next 10 years. Carpet installation cost, Carpet installation prices, Cost to install carpet, Price of carpet installation, Carpet installation charges. Alan's Preferred Carpet Dealers It's getting harder everyday to find an honest and reputable carpet dealer!","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":7417206,"ranking":5,"query_text":"trade price carpets","passage_text":"Quality carpets, rugs, laminates and much more all at trade prices. As a family ran business we are committed to putting the needs of our customers first.Whether it's quality, value or meeting quick response times you can put your trust in us to deliver the right floor coverings on time and at exceptional trade prices.s a family ran business we are committed to putting the needs of our customers first. Whether it's quality, value or meeting quick response times you can put your trust in us to deliver the right floor coverings on time and at exceptional trade prices.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":6188233,"ranking":6,"query_text":"trade price carpets","passage_text":"In other words, take the square foot price and multiply it by 9 to get the square yard price. In example, $3 sq\/ft carpet is the same as $27 sq\/yd. In most of this article, prices are in square feet because we think the smaller numbers are easier to comprehend and compare.ou can read about the carpet materials by going to carpet basics-carpet fibers and then choosing the carpet fiber you want to read about. Below are rough prices you can expect for an average carpet with each fiber: Wool Carpet Price: $9 sq\/ft. ($81 sq. yd.). Nylon Carpet Price: $3 sq\/ft.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":1547228,"ranking":7,"query_text":"trade price carpets","passage_text":"This is important for determining the carpet prices per square foot youâ\u0080\u0099ll be looking at, and also to determine the best type of carpet for you. The Bottom Line For Pricing. In most cases the carpet prices per square foot will range between $1 to $4, depending upon the type of carpet that you choose.There are also a variety of places to find carpeting, from hardware stores, to furniture outlets and even online web stores.his is important for determining the carpet prices per square foot youâ\u0080\u0099ll be looking at, and also to determine the best type of carpet for you. The Bottom Line For Pricing. In most cases the carpet prices per square foot will range between $1 to $4, depending upon the type of carpet that you choose.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":230133,"ranking":8,"query_text":"trade price carpets","passage_text":"Buy Shaw Carpet at Wholesale \/ Discount Prices. Caldwell Carpet offers wholesale \/ Discount prices on almost all Shaw carpets. We have been selling Shaw carpet at wholesale \/ discount carpet prices since 1976. Shaw offers carpet under many name brands including Philadelphia, Queen Carpet, Sutton and more. You will often find the same carpet from Shaw offered under several different names.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":3521254,"ranking":9,"query_text":"trade price carpets","passage_text":"Most of the time they wouldnt pay OP on carpet and repair. but would for drywall repair... and that depends on what % you charge. O & P is typical paid when you supervise other trades. It is common in the industry to only pay O&P if you have at least three other trades besides the emergency cleanup. Just be sure your prices cover what you need for your efforts.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":1444174,"ranking":10,"query_text":"trade price carpets","passage_text":"If we were to tell you that the average price per square foot for carpet cleaning pricing is $0.28 per square foot, it tells very little about the franchise that charges $0.35 per square foot for carpet cleaning or the carpet cleaning price of $0.15 that your mom and pop carpet cleaner may charge for the same service.he average new carpet price is something like $2 per square foot at retail and about $1 per square foot through our Dalton, GA discount carpet wholesalers. Carpet installation prices average about $0.50 per square foot. Carpet cleaning price averages about $0.28 per square foot.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":2644947,"ranking":11,"query_text":"trade price carpets","passage_text":"Step 2: Determining the cost of the carpet. Carpet prices range anywhere from $0.50 to over $10 per square foot. Most homes will want a carpet that is between $2-$4 per square foot, but this is by no means a rule.The carpet specifications you need for your life style and the kind of deal you strike will have a big impact on the carpet price.ou can read about the carpet materials by going to carpet basics-carpet fibers and then choosing the carpet fiber you want to read about. Below are rough prices you can expect for an average carpet with each fiber: Wool Carpet Price: $9 sq\/ft. ($81 sq. yd.). Nylon Carpet Price: $3 sq\/ft.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":4759455,"ranking":12,"query_text":"trade price carpets","passage_text":"Once the carpet is pulled back, inspect its woven backside and the carpet pad and sub-flooring. Tricks of the trade: passing the smell test After you select the type of carpet you want, don't forget the carpet pad or cushion.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":2376589,"ranking":13,"query_text":"trade price carpets","passage_text":"Carpet Cleaning Cost Estimates. Compare Carpet Cleaning Prices by Square Foot, Number of Rooms, Extras and Cleaning Methods. A glance at our carpet prices guide and carpet installation guide quickly reveals that new carpet is a serious home improvement investment.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":510503,"ranking":14,"query_text":"trade price carpets","passage_text":"If we were to tell you that the average price per square foot for carpet cleaning pricing is $0.28 per square foot, it tells very little about the franchise that charges $0.35 per square foot for carpet cleaning or the carpet cleaning price of $0.15 that your mom and pop carpet cleaner may charge for the same service.he average new carpet price is something like $2 per square foot at retail and about $1 per square foot through our Dalton, GA discount carpet wholesalers. Carpet installation prices average about $0.50 per square foot.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":5504555,"ranking":15,"query_text":"trade price carpets","passage_text":"Commercial. Canada. Carpets. Residential. Commercial. TIP: Carpet is quoted either in lineal metres or square metres so ensure that you are comparing like for like. As carpet width is usually 3.66m, a price in lineal metres will be higher than in square metres (please note that some of our carpets are 4 metres wide).To calculate the equivalent square metre price from a lineal metre price, just divide the lineal metre price by the carpet width (either 3.66 or 4 metre).o calculate the equivalent square metre price from a lineal metre price, just divide the lineal metre price by the carpet width (either 3.66 or 4 metre).","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":5503010,"ranking":16,"query_text":"trade price carpets","passage_text":"Canada. Carpets. Residential. Commercial. TIP: Carpet is quoted either in lineal metres or square metres so ensure that you are comparing like for like. As carpet width is usually 3.66m, a price in lineal metres will be higher than in square metres (please note that some of our carpets are 4 metres wide).To calculate the equivalent square metre price from a lineal metre price, just divide the lineal metre price by the carpet width (either 3.66 or 4 metre).anada. Carpets. Residential. Commercial. TIP: Carpet is quoted either in lineal metres or square metres so ensure that you are comparing like for like. As carpet width is usually 3.66m, a price in lineal metres will be higher than in square metres (please note that some of our carpets are 4 metres wide).","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":2376591,"ranking":17,"query_text":"trade price carpets","passage_text":"If we were to tell you that the average price per square foot for carpet cleaning pricing is $0.28 per square foot, it tells very little about the franchise that charges $0.35 per square foot for carpet cleaning or the carpet cleaning price of $0.15 that your mom and pop carpet cleaner may charge for the same service. Carpet Cleaning Franchises","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":5504552,"ranking":18,"query_text":"trade price carpets","passage_text":"If we were to tell you that the average price per square foot for carpet cleaning pricing is $0.28 per square foot, it tells very little about the franchise that charges $0.35 per square foot for carpet cleaning or the carpet cleaning price of $0.15 that your mom and pop carpet cleaner may charge for the same service.dd in the original cost of the carpet $2500 (the carpet will last 13 years with yearly cleaning) and let's see...$3550 for carpet purchase and yearly cleaning over 7 years vs. $5300 for one carpet cleaning and carpet replacement.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":5504553,"ranking":19,"query_text":"trade price carpets","passage_text":"The average new carpet price is something like $2 per square foot at retail and about $1 per square foot through our Dalton, GA discount carpet wholesalers. Carpet installation prices average about $0.50 per square foot. Carpet cleaning price averages about $0.28 per square foot.dd in the original cost of the carpet $2500 (the carpet will last 13 years with yearly cleaning) and let's see...$3550 for carpet purchase and yearly cleaning over 7 years vs. $5300 for one carpet cleaning and carpet replacement.","bm25_label":"high","relevance_label":0.0},{"query_id":523413,"passage_id":8284002,"ranking":20,"query_text":"trade price carpets","passage_text":"Shop Offers from Local Carpet Cleaners. $139 4 Rooms of Truck Mounted Carpet Cleaning and Deodorizing Member price $139.00 Original price: $154.00. $99 3 Rooms of Truck Mounted Carpet Cleaning and Deodorizing Member price $99.00 Original price: $110.00.","bm25_label":"high","relevance_label":0.0}]