[{"query_id":523952,"passage_id":7437138,"ranking":1,"query_text":"translation definition geometry","passage_text":"Geometry Definitions textbook tutorials-definitions-constructions-postulates and theorems-internet activities and resources. Geometry Definition: Translation.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":1022068,"ranking":2,"query_text":"translation definition geometry","passage_text":"Translation Definition Translation is a term used in geometry to describe a function that moves an object a certain distance. The object is not altered in any other way. It is not rotated, reflected or re-sized.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":1022073,"ranking":3,"query_text":"translation definition geometry","passage_text":"Translation Definition. Translation is a term used in geometry to describe a function that moves an object a certain distance. The object is not altered in any other way. It is not rotated, reflected or re-sized.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":3980891,"ranking":4,"query_text":"translation definition geometry","passage_text":"What is the definition of translation in geometry? A: A geometrical translation moves or slides a shape a fixed distance without rotating it, resizing it or performing any other sort of transformation to it. T... Full Answer >","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":8718978,"ranking":5,"query_text":"translation definition geometry","passage_text":"Define geometrize. geometrize synonyms, geometrize pronunciation, geometrize translation, English dictionary definition of geometrize. v. geÂ·omÂ·eÂ·trized , geÂ·omÂ·eÂ·trizÂ·ing , geÂ·omÂ·eÂ·trizÂ·es v. intr. 1. To study geometry. 2. To apply the methods of geometry. v. tr. 1. To present in geometric...","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":4857742,"ranking":6,"query_text":"translation definition geometry","passage_text":"â\u0080º geometry The perimeter is the outer edge of a flat shape or area. â\u0080º geometry Perimeter is also the distance around the outer edge of a flat shape. (Definition of â\u0080\u009cperimeterâ\u0080\u009d from the Cambridge Academic Content Dictionary Â© Cambridge University Press) Translations of â\u0080\u009cperimeterâ\u0080\u009d.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":6879102,"ranking":7,"query_text":"translation definition geometry","passage_text":"Posted By: Admin. Created on: 08-23-2011. Math definition of Rigid Transformations: Rigid Transformations-A transformation that does not alter the size or shape of a figure; rotations, reflections, translations are all rigid transformations. Subject: Math. Topic: Geometry. Posted By: Admin. Created on: 08-23-2011. Math definition of Rigid Transformations: Rigid Transformations-A transformation that does not alter the size or shape of a figure; rotations, reflections, translations are all rigid transformations.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":3504349,"ranking":8,"query_text":"translation definition geometry","passage_text":"Translation. In Geometry, Translation simply means Moving..... without rotating, resizing or anything else, just moving. To Translate a shape:","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":6613560,"ranking":9,"query_text":"translation definition geometry","passage_text":"Geometry terms and definitions. Home > By Subject > Geometry > Terms\/ Definitions. To save you having to refer to a dictionary, weâ\u0080\u0099ve listed below some of the more common geometry terms and geometry definitions to help you help with your childâ\u0080\u0099s geometry homework. This Math Open Reference Project provides additional information with more geometry terms and definitions.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":214956,"ranking":10,"query_text":"translation definition geometry","passage_text":"In geometry, a translation slides a thing by a: Ta(p) = p + a. In physics and mathematics, continuous translational symmetry is the invariance of a system of equations under any translation. Discrete translational symmetry is invariant under discrete translation.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":6613555,"ranking":11,"query_text":"translation definition geometry","passage_text":"Geometry terms and definitions. To save you having to refer to a dictionary, weâ\u0080\u0099ve listed below some of the more common geometry terms and geometry definitions to help you help with your childâ\u0080\u0099s geometry homework.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":1148342,"ranking":12,"query_text":"translation definition geometry","passage_text":"Definition of the geometry of the structure and the idealization of this. geometry for an approximate â\u0080\u009cfinite element mesh.â\u0080\u009d This geometry. definition is very similar to the use of AutoCAD or SolidWorks to. describe a geometrical shape.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":5150842,"ranking":13,"query_text":"translation definition geometry","passage_text":"The most basic transformation is the translation. The formal definition of a translation is every point of the pre-image is moved the same distance in the same direction to form the image.. Take a look at the picture below for some clarification. Each translation follows a rule. In this case, the rule is 5 to the right and 3 up.. You can also translate a pre-image to the left, down, or any combination of two of the four directions. More advanced transformation geometry is done on the coordinate plane. The transformation for this example would be T(x, y) = (x +5, y +3).","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":5166085,"ranking":14,"query_text":"translation definition geometry","passage_text":"This page provides all possible meanings and translations of the word semiperimeter. Wiktionary(0.00 \/ 0 votes)Rate this definition: Half the length of a perimeter. Freebase(0.00 \/ 0 votes)Rate this definition: In geometry, the semiperimeter of a polygon is half its perimeter. Although it has such a simple derivation from the perimeter, the semiperimeter appears frequently enough in formulas for triangles and other figures that it is given a separate name.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":3504345,"ranking":15,"query_text":"translation definition geometry","passage_text":"In mathematics,  translation means moving an object from one location to another. It is a term often used in geometry. In translation, the object is moved without rotating, reflecting or resizing it.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":7437141,"ranking":16,"query_text":"translation definition geometry","passage_text":"A translation moves every point of a figure or a space by the same amount in a given direction. A reflection against an axis followed by a reflection against a second axis parallel to the first one results in a total motion which is a translation. In Euclidean geometry, a translation is a function that moves every point a constant distance in a specified direction. (Also in Euclidean geometry a transformation is a one to one correspondence between two sets of points or a mapping from one plane to another.","bm25_label":"high","relevance_label":1.0},{"query_id":523952,"passage_id":746089,"ranking":17,"query_text":"translation definition geometry","passage_text":"In geometry, a triangular prism is a three-sided prism; it is a polyhedron made of a triangular base, a translated copy, and 3 faces joining corresponding sides.A right triangular prism has rectangular sides, otherwise it is oblique.n geometry, a triangular prism is a three-sided prism; it is a polyhedron made of a triangular base, a translated copy, and 3 faces joining corresponding sides.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":1083433,"ranking":18,"query_text":"translation definition geometry","passage_text":"1.2 Non-Euclidean Geometry: non-Euclidean geometry is any geometry that is different from Euclidean geometry. Each Non-Euclidean geometry is a consistent system of definitions, assumptions, and proofs that describe such objects as points, lines and planes. The two most common non-Euclidean geometries are spherical geometry and hyperbolic geometry.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":3882222,"ranking":19,"query_text":"translation definition geometry","passage_text":"Here are all the possible meanings and translations of the word angle of inclination. Princeton's WordNet(0.00 \/ 0 votes)Rate this definition: inclination, angle of inclination(noun) (geometry) the angle formed by the x-axis and a given line (measured counterclockwise from the positive half of the x-axis) Chaldean Numerology. The numerical value of angle of inclination in Chaldean Numerology is: 5.","bm25_label":"high","relevance_label":0.0},{"query_id":523952,"passage_id":3504346,"ranking":20,"query_text":"translation definition geometry","passage_text":"In mathematics, translation means moving an object from one location to another. It is a term often used in geometry. In translation, the object is moved without rotating, reflecting or resizing it. Continue Reading","bm25_label":"high","relevance_label":0.0}]