[{"query_id":524722,"passage_id":7471187,"ranking":1,"query_text":"tricuspid atresia definition","passage_text":"Freebase(0.00 \/ 0 votes)Rate this definition: Tricuspid atresia. Tricuspid atresia is a form of congenital heart disease whereby there is a complete absence of the tricuspid valve. Therefore, there is an absence of right atrioventricular connection. This leads to a hypoplastic or absent right ventricle.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":7471189,"ranking":2,"query_text":"tricuspid atresia definition","passage_text":"Tricuspid atresia. Definition. Tricuspid atresia is a type of heart disease that is present at birth (congenital heart disease), in which the tricuspid heart valve is missing or abnormally developed. The defect blocks blood flow from the right atrium to the right ventricle.","bm25_label":"high","relevance_label":1.0},{"query_id":524722,"passage_id":6088481,"ranking":3,"query_text":"tricuspid atresia definition","passage_text":"Tricuspid Atresia. A heart with tricuspid atresia is characterized by poorly developed right heart structures and has several other heart defects, including no tricuspid valve and a smaller-than-normal right ventricle. Children with tricuspid atresia require at least two open heart surgeries to repair the defects.ricuspid Atresia. A heart with tricuspid atresia is characterized by poorly developed right heart structures and has several other heart defects, including no tricuspid valve and a smaller-than-normal right ventricle. Children with tricuspid atresia require at least two open heart surgeries to repair the defects.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6088487,"ranking":4,"query_text":"tricuspid atresia definition","passage_text":"Adobe Flash Player. Atresia is defined as the congenital absence of a normal opening. In the case of tricuspid atresia, the tricuspid valve is not present resulting in a lack of communication between the right atrium and the right ventricle.Consequently, the right ventricle is small and underdeveloped.dobe Flash Player. Atresia is defined as the congenital absence of a normal opening. In the case of tricuspid atresia, the tricuspid valve is not present resulting in a lack of communication between the right atrium and the right ventricle.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6088478,"ranking":5,"query_text":"tricuspid atresia definition","passage_text":"Definition. Tricuspid atresia is a heart defect present at birth (congenital) in which one of the valves (tricuspid valve) between two of the heart's chambers â\u0080\u0094 the upper right chamber (right atrium) and the lower right chamber (right ventricle) â\u0080\u0094 isn't formed.efinition. Tricuspid atresia is a heart defect present at birth (congenital) in which one of the valves (tricuspid valve) between two of the heart's chambers â\u0080\u0094 the upper right chamber (right atrium) and the lower right chamber (right ventricle) â\u0080\u0094 isn't formed.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":7471194,"ranking":6,"query_text":"tricuspid atresia definition","passage_text":"Freebase(0.00 \/ 0 votes)Rate this definition: Tricuspid atresia is a form of congenital heart disease whereby there is a complete absence of the tricuspid valve. Therefore, there is an absence of right atrioventricular connection. This leads to a hypoplastic or absent right ventricle.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":5227477,"ranking":7,"query_text":"tricuspid atresia definition","passage_text":"What Is Tricuspid Atresia? Tricuspid atresia is a condition seen in newborns in which theyâ\u0080\u0099re born without an important part of the heart called â\u0080\u009cthe tricuspid valve.â\u0080\u009d This valve plays a part in the heartâ\u0080\u0099s essential function, which is to pump blood between the lungs and body.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6088485,"ranking":8,"query_text":"tricuspid atresia definition","passage_text":"Tricuspid atresia is a form of congenital heart disease whereby there is a complete absence of the tricuspid valve.Therefore, there is an absence of right atrioventricular connection. This leads to a hypoplastic (undersized) or absent right ventricle.ricuspid atresia is a form of congenital heart disease whereby there is a complete absence of the tricuspid valve. Therefore, there is an absence of right atrioventricular connection.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":3697584,"ranking":9,"query_text":"tricuspid atresia definition","passage_text":"Tricuspid atresia occurs when the tricuspid valve fails to develop while the baby is in the womb. This problem is quite rare, affecting 1 in 15,000 births, and it occurs equally in boys and girls. In the normal heart, the tricuspid valve is located on the heartâ\u0080\u0099s right side between the atria (the upper chamber) and the ventricle (the lower chamber). In babies born with tricuspid atresia, the tricuspid valve is absent (1) and the right ventricle is small (2). In about 25% of babies, the position of the great arteries is also reversed. In some babies, there is also a severe narrowing at the pulmonary valve (3), or there can be complete absence of the pulmonary valve. In all babies with tricuspid atresia, there is no direct pathway for blue blood returning from the body to get to the lungs to pick up oxygen.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":5859238,"ranking":10,"query_text":"tricuspid atresia definition","passage_text":"Mentioned in? 1  anal atresia. 2  aortic atresia. 3  Apgar Testing. 4  atresia. 5  atresia folliculi. 6  biliary atresia. 7  choanal atresia. 8  esophageal atresia. 9  follicular atresia. 10  laryngeal atresia. 11  laryngeal cancer. 12  mitral atresia. 13  nose. 14  prepyloric atresia. 15  pulmonary atresia. 16  tricuspid atresia. 17  urethral atresia. 18  urethratresia.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6088483,"ranking":11,"query_text":"tricuspid atresia definition","passage_text":"In tricuspid atresia, however, the following occurs: 1  Improper development of the tricuspid valve prevents oxygen-poor (blue) blood from passing from the right atrium to the right ventricle and on to the lungs as it should. 2  The right ventricle is also underdeveloped.n tricuspid atresia, however, the following occurs: 1  Improper development of the tricuspid valve prevents oxygen-poor (blue) blood from passing from the right atrium to the right ventricle and on to the lungs as it should. 2  The right ventricle is also underdeveloped.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":7471188,"ranking":12,"query_text":"tricuspid atresia definition","passage_text":"In some newborns, the tricuspid valve is missing or hasnâ\u0080\u0099t properly developed. Tricuspid atresia is a rare heart disorder thatâ\u0080\u0099s congenital, or present at birth. Itâ\u0080\u0099s a serious condition, and it can be life-threatening.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6088486,"ranking":13,"query_text":"tricuspid atresia definition","passage_text":"| Symptoms | Diagnosis | Treatment | Postoperative care | Home care | Long-term outlook. Tricuspid atresia (TA) is a congenital (present at birth) heart defect that occurs due to abnormal development of the fetal heart during the first 8 weeks of pregnancy.The tricuspid valve, normally located between the right atrium and the right ventricle, does not develop properly during pregnancy.n tricuspid atresia, however, the following occurs: 1  Improper development of the tricuspid valve prevents oxygen-poor (blue) blood from passing from the right atrium to the right ventricle and on to the lungs as it should. 2  The right ventricle is also underdeveloped.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":1041247,"ranking":14,"query_text":"tricuspid atresia definition","passage_text":"Cyanotic: 1  Ebstein's anomaly. 2  Hypoplastic left heart. 3  Pulmonary atresia. 4  Tetralogy of Fallot. 5  Total anomalous pulmonary venous return. 6  Transposition of the great vessels. 7  Tricuspid atresia. 8  Truncus arteriosus.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6069442,"ranking":15,"query_text":"tricuspid atresia definition","passage_text":"Tricuspid Atresia - There is no tricuspid valve in the heart so blood cannot flow from the body into the heart in the normal way. The blood is not being properly refilled with oxygen so it does not complete the normal cycle of body -heart â\u0080\u0093lungs- heart - body.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6088479,"ranking":16,"query_text":"tricuspid atresia definition","passage_text":"Symptoms. Tricuspid atresia symptoms become evident soon after birth, and can include: 1  Blue tinge to the skin and lips (cyanosis). 2  Difficulty breathing (dyspnea). 3  Tiring easily, especially during feedings.4  Slow growth and poor weight gain.ome babies with tricuspid atresia may also develop symptoms of heart failure, including: 1  Fatigue and weakness. 2  Shortness of breath. 3  Swelling (edema) in the legs, ankles and feet. 4  Swelling of the abdomen (ascites).","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":3727467,"ranking":17,"query_text":"tricuspid atresia definition","passage_text":"In neonates with the most severe form of Ebstein anomaly, the functional right ventricle is hypoplastic, and the patient is usually best treated by closing the tricuspid valve and, in effect, creating a tricuspid atresia physiology (Starnes procedure). In addition, these infants require a systemic arteryâ\u0080\u0093toâ\u0080\u0093pulmonary artery shunt.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":6088482,"ranking":18,"query_text":"tricuspid atresia definition","passage_text":"Some babies with tricuspid atresia may also develop symptoms of heart failure, including: 1  Fatigue and weakness. 2  Shortness of breath.3  Swelling (edema) in the legs, ankles and feet. 4  Swelling of the abdomen (ascites). 5  Sudden weight gain from fluid retention.ome babies with tricuspid atresia may also develop symptoms of heart failure, including: 1  Fatigue and weakness. 2  Shortness of breath. 3  Swelling (edema) in the legs, ankles and feet. 4  Swelling of the abdomen (ascites).","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":2025309,"ranking":19,"query_text":"tricuspid atresia definition","passage_text":"Potts' procedure. Potts' procedure. Pediatric surgery A palliative operation for congenital pulmonary artery stenosis and tricuspid atresia, consisting of creation of an anastomosis between descending aorta and the left pulmonary artery.","bm25_label":"high","relevance_label":0.0},{"query_id":524722,"passage_id":7471190,"ranking":20,"query_text":"tricuspid atresia definition","passage_text":"Some babies with tricuspid atresia may also develop symptoms of heart failure, including: Fatigue and weakness. Shortness of breath. Swelling (edema) in the legs, ankles and feet. Swelling of the abdomen (ascites)","bm25_label":"high","relevance_label":0.0}]