[{"query_id":534305,"passage_id":5791086,"ranking":1,"query_text":"usaa home insurance phone number","passage_text":"USAA Insurance Customer Service Phone Number: 1-800-531-8722 (800-531-USAA) This is customer care toll-free phone number of USAA Banking, Accounts, Auto, Life Insurance, Claims, Whenever you make call to this number at very first the automated system will response you as welcome to USAA.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":6979732,"ranking":2,"query_text":"usaa home insurance phone number","passage_text":"Phone Number: #USAA (or # 8722) Call our shortcut number Shortcut Number (Opens Pop-up Layer) to reach us from a mobile phone 210-531-USAA (or 210-531-8722) Phone Menu Tips for Auto and Property Insurance Claims(Opens Pop-up Layer) 800-531-USAA (or 800-531-8722) Phone Menu Tips for Auto and Property Insurance Claims(Opens Pop-up Layer)","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":1518884,"ranking":3,"query_text":"usaa home insurance phone number","passage_text":"#USAA (or #8722) Call our shortcut number Shortcut Number (Opens Pop-up Layer) to reach. us from a mobile phone. 210-531-USAA (or 210-531-8722) Phone Menu Tips for Auto and Property Insurance Claims(Opens Pop-up Layer) 800-531-USAA (or 800-531-8722) Phone Menu Tips for Auto and Property Insurance Claims(Opens Pop-up Layer)","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":4984629,"ranking":4,"query_text":"usaa home insurance phone number","passage_text":"USAA Insurance Customer Service Phone Number: 1-800-531-8722 (800-531-USAA) If you are the customer USAA and if you are looking information for account type, say insurance, checking, savings, credit card loan. Then you directly the following options.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":5289176,"ranking":5,"query_text":"usaa home insurance phone number","passage_text":"USAA conducted its business through mail till 1960's before shifting to phone to sell and serve. It introduced its toll free number in 1978. USAA started writing life insurance and home insurance in 1960's followed by the brokerage and banking services in 80's. The company opened its headquarters in San Antonio, Texas in 1976 in an area of 232 acres.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":470749,"ranking":6,"query_text":"usaa home insurance phone number","passage_text":"Call our shortcut number Shortcut Number (Opens Pop-up Layer) to reach. us from a mobile phone. 210-531-USAA (or 210-531-8722) Phone Menu Tips for Auto and Property Insurance Claims(Opens Pop-up Layer) 800-531-USAA (or 800-531-8722) Phone Menu Tips for Auto and Property Insurance Claims(Opens Pop-up Layer)","bm25_label":"high","relevance_label":1.0},{"query_id":534305,"passage_id":7711733,"ranking":7,"query_text":"usaa home insurance phone number","passage_text":"12\/14\/2015. I do not have USAA as my insurance company and I will never use them. I do not have USAA as my insurance company and I will never have USAA as my insurance company. I was rear-ended by a person with USAA insurance. I contacted the claims adjuster after I received a letter from them. The letter had the wrong phone number in it. That was when I knew there would be trouble with this claim and this company.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":5791090,"ranking":8,"query_text":"usaa home insurance phone number","passage_text":"And other services like Investing, Real Estate and etc, in this article have USAA customer service information like customer care toll-free number, email address, insurance claim phone number support, if you are the customer of USAA just read the full article. Read also: Farmers Insurance Customer Service.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":1068533,"ranking":9,"query_text":"usaa home insurance phone number","passage_text":"Itâ\u0080\u0099s faster and the app is streamlined, giving users the ability to access their general account, pay bills, transfer funds, start an insurance claim, access USAA Auto Circle and USAA Home Circle, and my new favorite, USAA Deposit@Mobile, which gives you the ability to deposit a check with your cell phone.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":6983753,"ranking":10,"query_text":"usaa home insurance phone number","passage_text":"Auto Insurance Coverage Verification. Enter the USAA number to retrieve verification of insurance coverage. The USAA number is part of the policy number. For example, the policy number USAA12345 67 89 92 A the USAA number is 123456789.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":4984633,"ranking":11,"query_text":"usaa home insurance phone number","passage_text":"The postal and official address, email address and phone number (helpline) of Usaa Contact Service Center and Usaa Contact customer service phone number is given below. The helpline of Usaa Contact customer service phone number may or may not be toll free. Click Here To View Usaa Contact Customer Service Phone Numbers What was the response after calling on specified numbers?","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":6979731,"ranking":12,"query_text":"usaa home insurance phone number","passage_text":"Get USAA Auto and Property Insurance contact information, including phone numbers, addresses and hours of operation, for claims, policy service, auto glass repair, roadside assistance, sticker requests and more.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":4984630,"ranking":13,"query_text":"usaa home insurance phone number","passage_text":"Usaa Contact Customer Service Phone Number Phone Number of Usaa Contact is +1-800-531-8722, +1-210-531-8722. USAA or United Services Automobile Association is the company headquartered in Texas, United States.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":5592238,"ranking":14,"query_text":"usaa home insurance phone number","passage_text":"USAA Phone Number. The number and steps below are voted #1 of 3 by over 4320 USAA customers. 800-531-6095. USAA phone support. Read key steps and hints below. They call you insteadNo waiting on hold. Free. Best number for meTarget your exact issue. More phone numbers & tools. No waiting on hold.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":4984631,"ranking":15,"query_text":"usaa home insurance phone number","passage_text":"Usaa toll free customer service number : 800-531-8722. USAA Life Insurance toll free customer service number : 210-531-8722. USAA Mastercard toll free customer service number : (8722) 210-531. USAA Car Insurance toll free customer service number : 314074269. If you as a customer of the USAA International have any query, complaint, suggestion, feedback and reviews related to USAA International products and services then you can communicate through its customer service detail.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":5288148,"ranking":16,"query_text":"usaa home insurance phone number","passage_text":"Get USAA Bank contact information, including phone numbers, addresses and hours of operation, for mortgages, credit cards, deposit accounts, home equity, auto loans and more.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":4984632,"ranking":17,"query_text":"usaa home insurance phone number","passage_text":"Usaa Contact Customer Service Number, Contact Number Usaa Contact Customer Service Phone Number Helpline Toll Free Contact Number with Office Address Email Address and Website. Get all communications details reviews complaints and helpdesk phone numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":5289180,"ranking":18,"query_text":"usaa home insurance phone number","passage_text":"The postal and official address, email address and phone number (helpline) of Usaa Contact Service Center and Usaa Contact customer service number is given below. The helpline of Usaa Contact customer service number may or may not be toll free.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":4984635,"ranking":19,"query_text":"usaa home insurance phone number","passage_text":"Usaa Contact Address. The address of Usaa Contact is 9800 Fredericksburg Road San Antonio, Texas, USA. The postal and official address, email address and phone number (helpline) of Usaa Contact Service Center and Usaa Contact customer service number is given below. The helpline of Usaa Contact customer service number may or may not be toll free.","bm25_label":"high","relevance_label":0.0},{"query_id":534305,"passage_id":5791085,"ranking":20,"query_text":"usaa home insurance phone number","passage_text":"What is the 1-800 number for USAA? Below is a list of toll free 800 numbers for USAA. Welcome to USAA. Okay so I can get you to the right person please tell me the account type, say insurance, checking, savings, credit card loan or just say the account type you want. Insurance.","bm25_label":"high","relevance_label":0.0}]