[{"query_id":535627,"passage_id":7657976,"ranking":1,"query_text":"vanguard wellesley income","passage_text":"ETF investing, portfolio strategy, dividend investing, retirement. Vanguard Wellesley Income Fund's combination of conservative allocation, low expenses, and a solid long-term performance record makes it an ideal choice for retirees. The fund has returned an average of 10% per year over its 45-year history while maintaining a conservative 40% stock and 60% bond allocation.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":5110469,"ranking":2,"query_text":"vanguard wellesley income","passage_text":"Need Income - Wellesley Income or Wellington Fund. Hi All, I am trying to figure out which fund will give me the most income, Wellesley Income (VWIAX) or the Wellington Fund (VWENX). I like both funds and will be investing approximately $500,000 in a taxable (non-retirement) account.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":5110473,"ranking":3,"query_text":"vanguard wellesley income","passage_text":"Re: Need Income - Wellesley Income or Wellington Fund. equivestor wrote:Hi All, I am trying to figure out which fund will give me the most income, Wellesley Income (VWIAX) or the Wellington Fund (VWENX). I like both funds and will be investing approximately $500,000 in a taxable (non-retirement) account.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":243864,"ranking":4,"query_text":"vanguard wellesley income","passage_text":"Joe is Vanguard's global chief economist and head of Vanguard Investment Strategy Group. He's also a member of the senior portfolio management team in Vanguard Fixed Income Group.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":6656312,"ranking":5,"query_text":"vanguard wellesley income","passage_text":"Guaranteed income with a fixed annuity through Vanguard Annuity Access. Vanguard Annuity Accessâ\u0084¢, a unique web-based service powered by the Income SolutionsÂ® platform, lets you compare fixed income annuities from multiple well-known insurance companies.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":4809600,"ranking":6,"query_text":"vanguard wellesley income","passage_text":"Guaranteed income with a fixed annuity through Vanguard Annuity Access. Vanguard Annuity Accessâ\u0084¢, a unique web-based service powered by the Income SolutionsÂ® platform, lets you compare fixed income annuities from multiple well-known insurance companies. Getting quotes. takes only a few minutes.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":1196929,"ranking":7,"query_text":"vanguard wellesley income","passage_text":"Vanguard Tax-Exempt Bond Index Fund will be managed by Vanguard Fixed Income Group, one of the world's largest fixed income managers, overseeing more than $800 billion, of which $140 billion is invested in tax-exempt bond and money market funds.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":5110465,"ranking":8,"query_text":"vanguard wellesley income","passage_text":"Both are good funds and Wellesley is intended for income and would be more predictable than Wellington. Alternatively, for tax purposes, you could mimic the Wellesley fund by having 60% in an intermediate tax exempt bond fund and 40% in the total market fund or one of the dividend oriented funds (or value indicies).","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":4326492,"ranking":9,"query_text":"vanguard wellesley income","passage_text":"Wellesley \/Ë\u0088wÉ\u009blzliË\u0090\/ is a town in Norfolk County, Massachusetts, United States. It is part of Greater Boston. The population was 27,982 at the time of the 2010 census. It has one of the highest median household and family incomes in Massachusetts. It is best known as the home of Wellesley College, Babson College, and a campus of Massachusetts Bay Community College.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":1196924,"ranking":10,"query_text":"vanguard wellesley income","passage_text":"Expert investment management. Vanguard Tax-Exempt Bond Index Fund will be managed by Vanguard Fixed Income Group, one of the world's largest fixed income managers, overseeing more than $800 billion, of which $140 billion is invested in tax-exempt bond and money market funds.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":8562548,"ranking":11,"query_text":"vanguard wellesley income","passage_text":"When taking withdrawals from an IRA before age 59Â½, you may have to pay ordinary income tax plus a 10% federal penalty tax. Vanguard funds not held in a brokerage account are held by The Vanguard Group, Inc., and are not protected by SIPC.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":7657978,"ranking":12,"query_text":"vanguard wellesley income","passage_text":"Product management. Vanguard WellesleyÂ® Income Fund seeks long-term growth of income, a high and sustainable level of current income, and moderate long-term capital appreciation by investing in high-quality bonds and stocks.","bm25_label":"high","relevance_label":1.0},{"query_id":535627,"passage_id":8448378,"ranking":13,"query_text":"vanguard wellesley income","passage_text":"Vanguard Annuity Access is offered in collaboration with Hueler Investment Services, Inc., through the Income Solutions platform. Income Solutions is a registered trademark of Hueler Investment Services, Inc., and used under license.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":5247350,"ranking":14,"query_text":"vanguard wellesley income","passage_text":"This document provides an important update to the list of Vanguard funds offered by your 403(b) plan, which was included in the Vanguard 403(b) fee disclosure information booklet we recently sent you. The Employee Retirement Income Security Act of 1974 (ERISA) requires plan sponsors to act prudently.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":2793769,"ranking":15,"query_text":"vanguard wellesley income","passage_text":"Wellesley Island, NY. Wellesley Island is located in north New York. Wellesley Island is part of Jefferson County. On average, the public school district that covers Wellesley Island is close to the state average in quality. The Wellesley Island area code is 315.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":5110472,"ranking":16,"query_text":"vanguard wellesley income","passage_text":"PostTue Oct 07, 2014 2:08 am. Hi All, I am trying to figure out which fund will give me the most income, Wellesley Income (VWIAX) or the Wellington Fund (VWENX). I like both funds and will be investing approximately $500,000 in a taxable (non-retirement) account.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":6662293,"ranking":17,"query_text":"vanguard wellesley income","passage_text":"No age or income restrictions. Account service fees. $20 per year for each Vanguard fund held in a Vanguard Individual 401(k) account. If at least one participant qualifies for Flagship Selectâ\u0084¢, FlagshipÂ®, Voyager SelectÂ®, or VoyagerÂ® Services, the account service fee will be waived for all participants in the plan.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":4495426,"ranking":18,"query_text":"vanguard wellesley income","passage_text":"Norfolk County. 1  Town of Wellesley websites: 2  Wellesley online resources: 3  Wellesley information from state agencies:  Regional information from state 1  agencies: Information specific to Wellesley can also be found within the following comprehensive listings:  Other Wellesley community websites:","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":1791578,"ranking":19,"query_text":"vanguard wellesley income","passage_text":"The Town of Wellesley Town of Wellesley - Tax Assessors' Office Office is located in the Wellesley Town Hall building in Wellesley, Massachusetts. Town of Wellesley is a locality in Norfolk County, Massachusetts. Unlike many other areas where property taxes are collected on a county level, Town of Wellesley has its own tax assessor's office. If your property is located in a different Norfolk County locality, see that page for tax assessor's information.","bm25_label":"high","relevance_label":0.0},{"query_id":535627,"passage_id":7657975,"ranking":20,"query_text":"vanguard wellesley income","passage_text":"Summary of this fund. Vanguard WellesleyÂ® Income Fund seeks to provide long-term growth of income and a high and sustainable level of current income, along with moderate long-term capital appreciation. Balanced allocation: 60%â\u0080\u009365% bonds, 35%â\u0080\u009340% stocks.","bm25_label":"high","relevance_label":0.0}]