[{"query_id":539601,"passage_id":7416552,"ranking":1,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln Was Half Black Historians Reveal. WASHINGTON DC - USA - The sixteenth president of the United States of America, Abraham Lincoln has been discovered to have had a black father according to historians and scientists working for the Institute of Historical Science which is linked to Harvard university.","bm25_label":"high","relevance_label":1.0},{"query_id":539601,"passage_id":2258916,"ranking":2,"query_text":"was abraham lincoln half black","passage_text":"What was Abraham Lincoln's middle name? Was Abraham Lincoln really bisexual as a few biographies claim that he shared the beds of quite a few young men? Was Abraham Lincoln a racist? Was Abraham Lincoln part black?","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":2600441,"ranking":3,"query_text":"was abraham lincoln half black","passage_text":"Was Abraham Lincoln self-made or self-invented, especially in the years before he became president? Was Abraham Lincoln a good president? Was Abraham Lincoln part black?","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":5968388,"ranking":4,"query_text":"was abraham lincoln half black","passage_text":"More than a half-million black men became voters in the South during the 1870s (women did not secure the right to vote in the United States until 1920). For the most part, these new black voters cast their ballots solidly for the Republican Party, the party of the Great Emancipator, Abraham Lincoln.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":529430,"ranking":5,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln Democrat or Republican? Democrats all invoked name of Abraham Lincoln when talking of Obama Especially Black Leaders on CNN during DNC interviews Obama is a the senetor from the state of Lincoln. Charlie Wrangle Congressman. When was Lincoln member of theDemocratic Party. Before or after he help defeat the southern Democrats in the... show more Democrats all invoked name of Abraham Lincoln when talking of Obama Especially Black Leaders on CNN during DNC interviews Obama is a the senetor from the state of Lincoln. Charlie Wrangle Congressman.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":6462079,"ranking":6,"query_text":"was abraham lincoln half black","passage_text":"No, Abraham Lincoln did not have children with any black women.  Lincoln had 4 children, all with his wife Mary Todd Lincoln. Mary  Todd was white. + 2 others found this useful. James Kincaid. Edit. Share to: Answered. In Abraham Lincoln.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":5761641,"ranking":7,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln issued the Emancipation Proclamation which began the process of freedom for America's slaves. The document also allowed black soldiers to fight for the Union. Abraham Lincoln was a strong supporter of the Thirteenth Amendment that formally ended slavery in the United States.braham Lincoln's quotes are among the most famous in the world. Abraham Lincoln is one of the reasons that slavery was abolished. Abraham Lincoln's foreign policy was successful in preventing other countries from intervening in America's Civil War. Emancipation Proclamation.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":7495745,"ranking":8,"query_text":"was abraham lincoln half black","passage_text":"3. Abraham Lincoln's foreign policy was successful in preventing other countries from intervening in America's Civil War. 4. Abraham Lincoln issued the Emancipation Proclamation which began the process of freedom for America's slaves.The document also allowed black soldiers to fight for the Union. 5. Abraham Lincoln was a strong supporter of the Thirteenth Amendment that formally ended slavery in the United States.. Abraham Lincoln's foreign policy was successful in preventing other countries from intervening in America's Civil War. 4. Abraham Lincoln issued the Emancipation Proclamation which began the process of freedom for America's slaves.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":4434675,"ranking":9,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln's foreign policy was successful in preventing other countries from intervening in America's Civil War. 4. Abraham Lincoln issued the Emancipation Proclamation which began the process of freedom for America's slaves. The document also allowed black soldiers to fight for the Union. 5. Abraham Lincoln was a strong supporter of the Thirteenth Amendment that formally ended slavery in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":5635209,"ranking":10,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln in the Black Hawk War. Abraham Lincoln served as a volunteer in the Illinois Militia from April 21, 1832 â\u0080\u0093 July 10, 1832 during the Black Hawk War. Lincoln never saw combat during his tour but was elected captain of his first company. He was also present in the aftermath of two of the war's battles, where he helped to bury the militia dead.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":6239240,"ranking":11,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln Was A White Supremacist. As a white person, like Abraham Lincoln, I prefer white power to black power or otherwise. Those who are realists understand why. Those who are liberal racists pretend it doesn't matter who fills the positions of power. Psssttt... Take a look at Black Africa and get back with me.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":4395579,"ranking":12,"query_text":"was abraham lincoln half black","passage_text":"4. Abraham Lincoln issued the Emancipation Proclamation which began the process of freedom for America's slaves. The document also allowed black soldiers to fight for the Union. 5. Abraham Lincoln was a strong supporter of the Thirteenth Amendment that formally ended slavery in the United States.e got the ball rolling with the Emancipation Proclamation. We honor Abraham Lincoln for his actions in preserving the Union and beginning the process of freedom for slaves. SUMMARY OF MAJOR ACCOMPLISHMENTS 1. Abraham Lincoln made the decision to fight to prevent the nation from splitting apart.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":2285922,"ranking":13,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln was born on February 12, 1809. President Abraham Lincoln was born on Feb. 12, 1809. for the first time in my lif e i know the answer okaiie ready here it is abrham Lincoln was born on the 12th of February 1802 and freed all the blacks from slavery. Joseph Maruzzella.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":5933158,"ranking":14,"query_text":"was abraham lincoln half black","passage_text":"Obama honors Lincoln, orders flags at half-staff. U.S. flags across the country are flying at half-staff Wednesday to honor the 150th anniversary of Abraham Lincoln's death, pursuant to an order by President Obama.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":4154698,"ranking":15,"query_text":"was abraham lincoln half black","passage_text":"4. Abraham Lincoln issued the Emancipation Proclamation which began the process of freedom for America's slaves. The document also allowed black soldiers to fight for the Union. 5. Abraham Lincoln was a strong supporter of the Thirteenth Amendment that formally ended slavery in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":7504769,"ranking":16,"query_text":"was abraham lincoln half black","passage_text":"ABRAHAM LINCOLN'S ROCKING CHAIR AT FORD'S THEATRE. National Archives Photograph. This is the black walnut rocking chair Abraham Lincoln was sitting in when he was shot by John Wilkes Booth. It was the president's favorite and was brought from John T. Ford's personal apartment in the theater.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":7416554,"ranking":17,"query_text":"was abraham lincoln half black","passage_text":"Abraham Lincoln's mother was having an affair with a black plantation worker and new DNA evidence suggests that she somehow tricked her husband into believing that Abraham was the couples child.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":880115,"ranking":18,"query_text":"was abraham lincoln half black","passage_text":"George Clooney is distantly related to Abraham Lincoln. On Thursday, Ancestry.com revealed that George Clooney is related to our very own 16th president, one Abraham Lincoln (not the vampire hunter). Indeed, the silver fox (by which I refer to Lincoln, of course) is the half-first cousin five times removed of ERâ\u0080\u0098s most handsome doctor.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":5761637,"ranking":19,"query_text":"was abraham lincoln half black","passage_text":"3. Abraham Lincoln's foreign policy was successful in preventing other countries from intervening in America's Civil War. 4. Abraham Lincoln issued the Emancipation Proclamation which began the process of freedom for America's slaves.The document also allowed black soldiers to fight for the Union. 5. Abraham Lincoln was a strong supporter of the Thirteenth Amendment that formally ended slavery in the United States.lso, Lincoln's contribution in the area of freedom for the slaves is extremely important. He got the ball rolling with the Emancipation Proclamation. We honor Abraham Lincoln for his actions in preserving the Union and beginning the process of freedom for slaves. SUMMARY OF MAJOR ACCOMPLISHMENTS 1.","bm25_label":"high","relevance_label":0.0},{"query_id":539601,"passage_id":2937354,"ranking":20,"query_text":"was abraham lincoln half black","passage_text":"Confidence votes 20. Abraham Lincoln was remembered for freeing slaves who were the black americans in USA.","bm25_label":"high","relevance_label":0.0}]