[{"query_id":540456,"passage_id":7655425,"ranking":1,"query_text":"was mulan based on a true story","passage_text":"Is the Disney movie mulan a true story? It is based off of a true legend. :) It is based on an old Chinese folktake, the story of Hua Mulan, which is a story of a young girly who serves in the army in place of her aâ\u0080¦iling father. The legend has been changed many times to suit the time period that it is being told in.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":7655423,"ranking":2,"query_text":"was mulan based on a true story","passage_text":"Is mulan a true story? It is based on an old Chinese folktake, the story of Hua Mulan, which is a story of a young girly who serves in the army in place of her ailing father. The legend has been chaâ\u0080¦nged many times to suit the time period that it is being told in.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":7655421,"ranking":3,"query_text":"was mulan based on a true story","passage_text":"Mulan, Jr. DISNEYâ\u0080\u0099S animated film Mulan, based on a true story from ancient China, was a modest motion picture success that took a fresh look at the place of women in an ancient paternal society. Now a stage musical version of the film has turned up in childrenâ\u0080\u0099s theaters everywhere.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":7655418,"ranking":4,"query_text":"was mulan based on a true story","passage_text":"Mulan, Jr. By Walt deFaria. DISNEYâ\u0080\u0099S animated film Mulan, based on a true story from ancient China, was a modest motion picture success that took a fresh look at the place of women in an ancient paternal society. Now a stage musical version of the film has turned up in childrenâ\u0080\u0099s theaters everywhere.","bm25_label":"high","relevance_label":1.0},{"query_id":540456,"passage_id":1713029,"ranking":5,"query_text":"was mulan based on a true story","passage_text":"This version is entitled Written In Stone (Reprise), and takes place just after Reflection. Mulan Jr. is a one-act stage musical based on the 1998 Disney animated film Mulan (itself based on the Chinese legend of Hua Mulan) and the story Fa Mulan by Robert D. San Souci.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":4093156,"ranking":6,"query_text":"was mulan based on a true story","passage_text":"The original story of Mulan was based on the fifth century Chinese poem the Ballad of Mulan. The original poem was originally a short fable, designed to show gender equality, but in the following centuries it was developed until Hua Mulan became a legendary figure.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":5259594,"ranking":7,"query_text":"was mulan based on a true story","passage_text":"Mulan: 2-Movie Collection Trailer Mulan See Mulan on Disney Blu-ray for the first time! Watch Now. 1:40. Mulan: Reflection Mulan Mulan seeks the courage to be her true self in the classic Disney song, Reflection.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":5259597,"ranking":8,"query_text":"was mulan based on a true story","passage_text":"Mulan Quiz Challenge | Disney QuizVid Disney Princess Get ready for the ultimate Mulan trivia challenge! Mulan: 2-Movie Collection Trailer Mulan See Mulan on Disney Blu-ray for the first time! Mulan: Reflection Mulan Mulan seeks the courage to be her true self in the classic Disney song, Reflection.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":4093155,"ranking":9,"query_text":"was mulan based on a true story","passage_text":"Mulan: Movie Analysis. Is Mulan a remake of the original story? The Disney Movie Mulan is a remake of an ancient Chinese. poem titled, Ballad of Mulan written in the sixth century. The poem was originally a short legend that had been added on to throughout the years. How is the Disney remake different from the original (i.e. ending, story, characters)?","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":8689192,"ranking":10,"query_text":"was mulan based on a true story","passage_text":"Based on Disneyâ\u0080\u0099s Oscar-nominated film, Disney's Mulan JR. is a heartwarming celebration of culture, honor and the fighting spirit. With hit songs and a story packed with action, humor and heart, Disney's Mulan JR. brings ancient China to life with a modern sensibility. The Huns have invaded, and it is up to the misfit Mulan and her mischievous dragon sidekick, Mushu, to save the Emperor! Defying the village matchmaker, Mulan takes up arms and disguises herself as a boy in order to spare her father from having to serve in the army.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":7655419,"ranking":11,"query_text":"was mulan based on a true story","passage_text":"The Real Story of Mulan. Many people have seen the Disney movie Mulan and do not realize that it is actually telling the story of an ancient Chinese poem titled the Ballad of Mulan. Because it is a legend, it is unknown when Mulan may have lived although she was believed to have lived during the Northern Wei dynasty which lasted from 386CE to 534CE.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":7871403,"ranking":12,"query_text":"was mulan based on a true story","passage_text":"Dream Big, Princess - I Dream | Disney Disney Princess What do you dream of? Mulan Quiz Challenge | Disney QuizVid Disney Princess Get ready for the ultimate Mulan trivia challenge! Mulan: 2-Movie Collection Trailer Mulan See Mulan on Disney Blu-ray for the first time! Mulan: Reflection Mulan Mulan seeks the courage to be her true self in the classic Disney song, Reflection. Shop.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":4079252,"ranking":13,"query_text":"was mulan based on a true story","passage_text":"Is the movie Exit Through The Gift Shop based on a true story? Exit Through the Gift Shop tells the incredible true story of how an eccentric... Is the movie 'The Strangers' based off a true story and if so what is it based off of? The Strangers is based a true event the director experienced as a child (knocking... Is the movie A Christmas Story based on a true story? The movie A Christmas Story is based on a true story.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":290646,"ranking":14,"query_text":"was mulan based on a true story","passage_text":"Fa Mulan is the main protagonist in the Disney film Mulan and its sequel Mulan II. She is the first Disney Princess to be based on a legend and the second not to be based on a fairy tale (Pocahontas). Ming-Na Wen and Lea Salonga provide the voice and singing voice of Mulan in both films, respectively.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":594854,"ranking":15,"query_text":"was mulan based on a true story","passage_text":"Mulan appears as a playable character in Disney's Story Studio: Mulan, an action video game released in December 1999 by Disney Interactive Studios exclusively for the video game console Sony PlayStation.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":3993589,"ranking":16,"query_text":"was mulan based on a true story","passage_text":"Mulan (1998 film) For the franchise, see Mulan (franchise). Mulan is a 1998 American animated musical action-comedy-drama film produced by Walt Disney Feature Animation based on the Chinese legend of Hua Mulan.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":3993597,"ranking":17,"query_text":"was mulan based on a true story","passage_text":"Based on the same Chinese legend as the 1998 animated movie, Mulan will follow in the footsteps of Cinderella, Maleficent, and several already-announced upcoming movies. Scroll down for video. Remake: Disney has announced plans to make a live-action version of its 1998 movie, Mulan. Elizabeth Martin and Lauren Hynek wrote the new script for a story about a young woman who disguises herself as a man in order to go to war in her father's place.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":7871400,"ranking":18,"query_text":"was mulan based on a true story","passage_text":"Fa Mulan is based off the character Hua Mulan from the Epic Poem The Ballad of Hua Mulan. Hua Mulan eventually became a legendary figure. As little evidence exists other than the poem, it is unknown whether she was a real figure.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":7940186,"ranking":19,"query_text":"was mulan based on a true story","passage_text":"No other woman in Chinese history has inspired more admiration than Mulan, who is considered an embodiment of loyalty and filial piety. The ancient story of Mulan enlisting in the military on her aging fatherâ\u0080\u0099s behalf is one of Chinaâ\u0080\u0099s most treasured legends and included in every Chinese school textbook.The story has also become quite well known outside China through a Disney animation film that has popularized this celebrated Chinese heroine.o other woman in Chinese history has inspired more admiration than Mulan, who is considered an embodiment of loyalty and filial piety. The ancient story of Mulan enlisting in the military on her aging fatherâ\u0080\u0099s behalf is one of Chinaâ\u0080\u0099s most treasured legends and included in every Chinese school textbook.","bm25_label":"high","relevance_label":0.0},{"query_id":540456,"passage_id":2147526,"ranking":20,"query_text":"was mulan based on a true story","passage_text":"7 True Facts About Mulan Sara Lynn Hua | April 15, 2015 | | 17 Comments Following the success of the new Cinderella film, Disney recently announced their plans to do a live-action remake of the iconic animated movie Mulan.","bm25_label":"high","relevance_label":0.0}]