[{"query_id":540906,"passage_id":7505469,"ranking":1,"query_text":"was the great wall of china breached","passage_text":"Starbucks breaches Great Wall of China. 1  Starbucks' long march into China has breached the Great Wall itself. Tourists will be able to drink cappuccino, frappuccino and other coffee concoctions at one of China's greatest cultural treasures after the Seattle-based company announced it had opened a shop at Badaling, 47 miles north of Beijing.","bm25_label":"high","relevance_label":1.0},{"query_id":540906,"passage_id":7505463,"ranking":2,"query_text":"was the great wall of china breached","passage_text":"Topics: Destinations â\u0080º Asia â\u0080º Great Wall of China, Beijing, Attractions, China. The wall was designed to stop raids by the Xiongnu raiders, though they were the first to breach it in several places in 206 B.C. Login or Sign Up to answer this question. data-config-site-section=chacha>.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":7505468,"ranking":3,"query_text":"was the great wall of china breached","passage_text":"Actually at the time of the mongol invasion of china there was a a great wall ghengis khan had to send three armies in order to find a sucessful way of breaching it, the wall you mention during the ming era was just an extension of what was already built.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":7505465,"ranking":4,"query_text":"was the great wall of china breached","passage_text":"Great Wall breached: Starbucks sets up shop. Published 10:00 pm, Tuesday, September 20, 2005. In the end, it appears that the Great Wall of China has failed -- at least in stopping one invader. The imposing stone structure attracts millions of tourists, snakes across provinces and makes for gorgeous souvenir photographs.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":7505464,"ranking":5,"query_text":"was the great wall of china breached","passage_text":"News blog. Starbucks' long march into China has breached the Great Wall itself. Tourists will be able to drink cappuccino, frappuccino and other coffee concoctions at one of China's greatest cultural treasures after the Seattle-based company announced it had opened a shop at Badaling, 47 miles north of Beijing.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":7505467,"ranking":6,"query_text":"was the great wall of china breached","passage_text":"Great Wall breached: Starbucks sets up shop. By BRAD WONG, SEATTLE POST-INTELLIGENCER REPORTER. Published 10:00 pm, Tuesday, September 20, 2005. In the end, it appears that the Great Wall of China has failed -- at least in stopping one invader. The imposing stone structure attracts millions of tourists, snakes across provinces and makes for gorgeous souvenir photographs.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":8331571,"ranking":7,"query_text":"was the great wall of china breached","passage_text":"1 Facts About The Great Wall of China-Frequently asked questions & other facts about the Great Wall of China. 2  Great Wall of China Map-Maps of the Great Wall of China. 3  Pictures of The Great Wall of China-Assorted pictures of the Great Wall of China.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":5444811,"ranking":8,"query_text":"was the great wall of china breached","passage_text":"About The Great Wall of China; Where is the great wall of china located? History of the Great Wall of China ; The Wall from space ? How long is the Great Wall of China? Construction of the Wall; Why was it build? How was it defended? How long did it take to build the great wall of China ; How tall is the Great Wall of China; Infographic ; Famous people; Pictures","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":8331572,"ranking":9,"query_text":"was the great wall of china breached","passage_text":"1 History of The Great Wall of China-A history of the Great Wall of China. 2  Facts About The Great Wall of China-Frequently asked questions & other facts about the Great Wall of China.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":7956701,"ranking":10,"query_text":"was the great wall of china breached","passage_text":"Construction of the Great Wall of China. When was the great wall of china built? The construction of the Great Wall of China was a massive feat that took a ton of laborers to build. Its construction and reconstruction spans several centuries. Construction of the Great Wall began around 220 BC. It was built on and off for many centuries until the 1500s. Related article: history of the great wall of china. How it was Made.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":8170305,"ranking":11,"query_text":"was the great wall of china breached","passage_text":"The Great Wall of China belongs not only to China, but also to the world as a great cultural heritage. Due to political unrest, there was a dire need to build the Great Wall of China. Thus, China halted the expeditionary voyages of explorer Zheng He, so that the naval funds could be used in building the Great Wall of China.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":7106494,"ranking":12,"query_text":"was the great wall of china breached","passage_text":"The Great Wall of China is truly one of the great wonders of the world. The History of the Great Wall of China goes back to the Chunqiu period (722-481 B.C.) and the various parts of the Great Wall of China stretch over 4,000 miles.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":1106365,"ranking":13,"query_text":"was the great wall of china breached","passage_text":"Gallery.  1 The First Mound â\u0080\u0093 at Jiayuguan, the western terminus. 2  The Great Wall of China at Badaling. 3  A portion of the Great Wall of China at Simatai, overlooking the gorge. 4  Mutianyu Great Wall, China. 5  The Old Dragon Head, the Great Wall where it meets the sea in the vicinity of Shanhaiguan. 6  Great Wall at Dandong.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":3313498,"ranking":14,"query_text":"was the great wall of china breached","passage_text":"Great wall of china map. Here is a map of the great wall of china with the location of the most popular visiting sites near Beijing. Related article: Mutianyu great wall, Badaling great wall, Jinshanling, Simatai.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":1106367,"ranking":15,"query_text":"was the great wall of china breached","passage_text":"Gallery.  1 The First Mound â\u0080\u0093 at Jiayuguan, the western terminus. 2  The Great Wall of China at Badaling. 3  A portion of the Great Wall of China at Simatai, overlooking the gorge. 4  Mutianyu Great Wall, China. This is atop the wall on a section that has not been restored.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":3356946,"ranking":16,"query_text":"was the great wall of china breached","passage_text":"The Great Wall of China, in Shanhaiguan. The Great Wall of China is an ancient wall in China. The wall is made of cement, rocks, bricks, and powdered dirt. It was built to protect the north of the empire of China from enemy attacks. It is the longest structure humans have ever built.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":1517108,"ranking":17,"query_text":"was the great wall of china breached","passage_text":"3. Where is the Great Wall of China located? The Great Wall stretches across North China from east to west for over 6,000 kilometers. It extends from the Shanhai pass at the seaside in the Hebei province in the east to the Jiayu pass in Gansu province in the west. The sites of the Great Wall stretch across 15 provinces of China. 4. How was the Great Wall of China built?","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":2719143,"ranking":18,"query_text":"was the great wall of china breached","passage_text":"Home Other Information Great Wall Facts. Where is the Great Wall of china locatedï¼\u009f. The Great Wall stretches across North China from east to west for over 6,000 kilometers. It extends from the shanhai pass at the seaside in the Hebei province in the east to the Jiayu pass in Gansu province in the west. The sites of the Great Wall stretch across 15 provinces of China. But since the great wall in Beijing is very long and protected well while most of the great walls in other China areas are not kept well and opened for tourists, it is commonly thought Beijing is the only place to see the Great Wall.","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":3313500,"ranking":19,"query_text":"was the great wall of china breached","passage_text":"Great wall of china map. Here is a map of the great wall of china with the location of the most popular visiting sites near Beijing. Related article: Mutianyu great wall, Badaling great wall, Jinshanling, Simatai. Other popular links:","bm25_label":"high","relevance_label":0.0},{"query_id":540906,"passage_id":44986,"ranking":20,"query_text":"was the great wall of china breached","passage_text":"Why was the Great Wall of China bulit? The Great Wall of China was built to protect China from its enemies and invaders from the North, especially the Mongols. The Mongols were a tribal group that would regularly conduct raids into China. Despite the wall, the Mongols eventually conquered China. The Wall also kept Chinese citizens from leaving China.","bm25_label":"high","relevance_label":0.0}]