[{"query_id":547018,"passage_id":7514855,"ranking":1,"query_text":"webster definition of mourning","passage_text":"Definition of mourning written for English Language Learners from the Merriam-Webster Learner's Dictionary with audio pronunciations, usage examples, and count\/noncount noun labels. Learner's Dictionary mobile search","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":3981813,"ranking":2,"query_text":"webster definition of mourning","passage_text":"The short melancholy definition in the Merriam-Webster dictionary is simply a sad mood or feeling, or a pensive mood. Synonyms for melancholy include dismal, dreary and mournful. But the longer definition is quite interesting and brings into it the history of melancholy, which dates back to ancient and medieval times.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":3835271,"ranking":3,"query_text":"webster definition of mourning","passage_text":"This is the British English definition of mournful. View American English definition of mournful. Change your default dictionary to American English. View the pronunciation for mournful.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":818000,"ranking":4,"query_text":"webster definition of mourning","passage_text":"Definitions for mourning band Here are all the possible meanings and translations of the word mourning band. Princeton's WordNet (0.00 \/ 0 votes) Rate this definition: weed, mourning band (noun)","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":1598570,"ranking":5,"query_text":"webster definition of mourning","passage_text":"An elegy is a poem of mourning; this is often the poet mourning one person, but the definition also includes Thomas Gray's 'Elegy Written in a Country Churchyard', which mourns all the occupants of that churchyard, and looks into the future to mourn the poet's own death.n elegy is a poem of mourning; this is often the poet mourning one person, but the definition also includes Thomas Gray's 'Elegy Written in a Country Churchyard', which mourns all the occupants of that churchyard, and looks into the future to mourn the poet's own death.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":7514853,"ranking":6,"query_text":"webster definition of mourning","passage_text":"Learner's definition of MOURNING. [noncount] 1. : the act of mourning for someone who has died. a day of national mourning. She is still in mourning for her dead husband. The whole town was in mourning. She went into mourning for her dead husband.","bm25_label":"high","relevance_label":1.0},{"query_id":547018,"passage_id":7152767,"ranking":7,"query_text":"webster definition of mourning","passage_text":"An elegiac broadside is A MOURNFUL, PLAINTIVE BALLAD An elegy is a poem of lamentation to mourn the loss of something or someone. And broadside can mean a verbal attack. So the definition, a mournful, plaintive ballad fits best here.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":6689098,"ranking":8,"query_text":"webster definition of mourning","passage_text":"lamented definition: The definition of lamented is someone who is dead and who has been mourned for. (adjective) When your father died and you were mourning for him, this is an example of a time when he was lamented....","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":818009,"ranking":9,"query_text":"webster definition of mourning","passage_text":"Mourning band definition, a piece of black cloth that is worn, especially as a band encircling the upper arm, to indicate mourning. See more.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":8711252,"ranking":10,"query_text":"webster definition of mourning","passage_text":"Webster Dictionary (0.00 \/ 0 votes) Rate this definition: Groan (verb) to give forth a low, moaning sound in breathing; to utter a groan, as in pain, in sorrow, or in derision; to moan. Groan (verb) to strive after earnestly, as with groans. Groan (verb) to affect by groans. Groan (noun) a low, moaning sound; usually, a deep, mournful sound uttered in pain or great distress; sometimes, an expression of strong disapprobation; as, the remark was received with groans. Origin: [OE. gronen, granen, granien, AS. grnian, fr. the root of grennian to grin. 35.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":2770940,"ranking":11,"query_text":"webster definition of mourning","passage_text":"mourn definition: To mourn is to feel or show intensive grief or sadness, usually as a result of a loss. (verb) When a loved one dies and you feel intense grief at his passing, this is an example of a time when you mourn....","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":6689104,"ranking":12,"query_text":"webster definition of mourning","passage_text":"The definition of lamented is someone who is dead and who has been mourned for. When your father died and you were mourning for him, this is an example of a time when he was lamented. mourned for: usually said of someone dead.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":2770937,"ranking":13,"query_text":"webster definition of mourning","passage_text":"Definition of mourn - feel or show sorrow for the death of (someone), typically by following conventions such as the wearing of black clothes Definition of mourn - feel or show sorrow for the death of (someone), typically by following conventions such as the wearing of black clothes dictionary thesaurus","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":8581976,"ranking":14,"query_text":"webster definition of mourning","passage_text":"Best Answer: Dismal or sad. ... Definition: very sad and depressed--mournful Synonyms: sad, gloomy, mournful, melancholy, dismal, morose, dreary, funereal, somber ...","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":4310699,"ranking":15,"query_text":"webster definition of mourning","passage_text":"Definition of mourning for English Language Learners. : 1  the act of mourning for someone who has died. : 2  great sadness felt because someone has died. : 3  black clothing that is worn to show that you are mourning for someone who has died.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":6689096,"ranking":16,"query_text":"webster definition of mourning","passage_text":"The definition of lamented is  someone who is dead and who has been mourned for. When your father died and you were mourning for him, this is an example of a time when he was lamented.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":3686315,"ranking":17,"query_text":"webster definition of mourning","passage_text":"Webster Dictionary. Webster-dictionary.net is a free English online dictionary featuring more than 130,000 definitions and words from multiple dictionaries, including Webster's Dictionary.To get started, use the search box or browse an alphabetical index of terms.Go to the definition of any word on the page just by clicking it!ebster Dictionary. Webster-dictionary.net is a free English online dictionary featuring more than 130,000 definitions and words from multiple dictionaries, including Webster's Dictionary.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":6689103,"ranking":18,"query_text":"webster definition of mourning","passage_text":"The definition of lamented is someone who is dead and who has been mourned for. When your father died and you were mourning for him, this is an example of a time when he was lamented. lamented. lamented.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":6718445,"ranking":19,"query_text":"webster definition of mourning","passage_text":"Perjurious-Definition and More from the Free Merriam-Webster ... Definition of perjurious from the Merriam-Webster Online Dictionary with audio pronunciations, thesaurus, Word of the Day, and word games.","bm25_label":"high","relevance_label":0.0},{"query_id":547018,"passage_id":1567305,"ranking":20,"query_text":"webster definition of mourning","passage_text":"Define sable: the color black; black clothing worn in mourning â\u0080\u0094usually used in plural â\u0080\u0094 sable in a sentence the color black; black clothing worn in mourning â\u0080\u0094usually used in pluralâ\u0080¦ See the full definition","bm25_label":"high","relevance_label":0.0}]