[{"query_id":548099,"passage_id":7538554,"ranking":1,"query_text":"wellcare mike vice president","passage_text":"Mike joined WellCare in May 2005. Before assuming his current position, he served as vice president of corporate initiatives and strategy. He also held positions as senior director of health plan finance, director of health plan operations and director of health business planning and analytics.","bm25_label":"high","relevance_label":1.0},{"query_id":548099,"passage_id":7538552,"ranking":2,"query_text":"wellcare mike vice president","passage_text":"Press Release. WellCare Names Michael Radu Senior Vice President, Clinical Operations and Business Development. TAMPA, Fla., Aug. 31, 2015 \/PRNewswire\/ -- WellCare Health Plans, Inc. (NYSE: WCG) announced it has named Michael Radu to the newly created position of senior vice president, clinical operations and business development, effective today.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":8160363,"ranking":3,"query_text":"wellcare mike vice president","passage_text":"Tampa-based WellCare Health Plans, Inc. appointed Darren Ghanayem as its senior vice president and chief information officer, according to a news release from the company. Previously, Ghanayem worked at Anthem as vice president of business transformation, according to the news release.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":884784,"ranking":4,"query_text":"wellcare mike vice president","passage_text":"Liz Miller has been promoted to the position at WellCare of Florida, the Tampa Bay Business Journal reports. She has been the vice president of product operations at the Tampa-based company since 2012. WellCare is Floridaâ\u0080\u0099s large Medicaid HMO contractor.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":8771895,"ranking":5,"query_text":"wellcare mike vice president","passage_text":"Vice President-Elect Mike Pence Set To Govern At Trump's Side. Vice President-elect Mike Pence arrives at Trump Tower on Tuesday to meet with President-elect Donald Trump about choosing key members of their future administration. President-elect Donald Trump has made it clear that Vice President-elect Mike Pence will have a major role in governing.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":8520812,"ranking":6,"query_text":"wellcare mike vice president","passage_text":"Vice President Mike Pence Announces Andrea Thompson as National Security Advisor. WASHINGTON, DC â\u0080\u0093 Vice President Mike Pence today announced the appointment of Colonel Andrea Thompson (U.S. Army - Retired) as Deputy Assistant to the President and National Security Advisor to the Vice President.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":3560343,"ranking":7,"query_text":"wellcare mike vice president","passage_text":"Former U.S. congressman and governor of Indiana, Mike Pence was elected vice president of the United States with President Donald Trump in 2016. Who Is Mike Pence? Born in Indiana in 1959, U.S. Vice President Mike Pence attended Hanover College and the Indiana University McKinney School of Law.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":938491,"ranking":8,"query_text":"wellcare mike vice president","passage_text":"Vice President Mike Pence to join March for Life. Vice President Mike Pence waves while walking with second lady Karen Pence near the White House during the 58th presidential inauguration parade in Washington, D.C., on Jan. 20, 2017. Vice President Mike Pence will join Friday's March for Life, a move from the White House considered historic by march organizers. President Ronald Reagan made a video for the march in 1988 and President George W. Bush called in to the march in 2008, but no president or vice president has spoken at the march before, according to a march spokeswoman.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":6949485,"ranking":9,"query_text":"wellcare mike vice president","passage_text":"Mike McCready â\u0080\u0093 Vice President of E-Commerce. Mike has been with Safeway for 13 years and is currently the Vice President of E-Commerce. He joined the company in 2001 in corporate finance working on various corporate development projects until his promotion to Vice President of E-Commerce in 2007.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":7726361,"ranking":10,"query_text":"wellcare mike vice president","passage_text":"Courtesy White House Mike and Karen Pence will live at No. 1 Observatory Circle, the vice presidentâ\u0080\u0099s official residence, beginning today. Courtesy White House Vice President-elect Mike and Karen Pence have lunch with Vice President Joe and Jill Biden in November in the sunroom at No. 1 Observatory Circle, the vice presidentâ\u0080\u0099s residence.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":2294995,"ranking":11,"query_text":"wellcare mike vice president","passage_text":"U.S. Vice President Mike Pence Visited Germany to Take Part in the 2017 Munich Security Conference. Vice President of the United States Mike Pence traveled to Germany to take part in the 53rd Munich Security Conference on February 18, 2017. Duringâ\u0080¦.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":8771902,"ranking":12,"query_text":"wellcare mike vice president","passage_text":"Vice President-elect Mike Pence arrives at Trump Tower on Tuesday to meet with President-elect Donald Trump about choosing key members of their future administration. Drew Angerer\/Getty Images. President-elect Donald Trump has made it clear that Vice President-elect Mike Pence will have a major role in governing.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":7726365,"ranking":13,"query_text":"wellcare mike vice president","passage_text":"JGIndiana. 1  Courtesy White House Mike and Karen Pence will live at No. 1 Observatory Circle, the vice presidentâ\u0080\u0099s official residence, beginning today. 2  Courtesy White House Vice President-elect Mike and Karen Pence have lunch with Vice President Joe and Jill Biden in November in the sunroom at No. 1 Observatory Circle, the vice presidentâ\u0080\u0099s residence.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":7101312,"ranking":14,"query_text":"wellcare mike vice president","passage_text":"Mike joined Kroger in 1985 and has held a variety of leadership positions in accounting, including vice president and corporate controller. He was named group vice president and chief financial officer in 2000, and was named senior vice president in 2003.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":1947785,"ranking":15,"query_text":"wellcare mike vice president","passage_text":"Figure skater and future Olympian Adam Rippon is standing by comments in which he lambasted Vice President Mike Pence Figure skater and future Olympian Adam Rippon is standing by comments in which he lambasted Vice President Mike Pence Gay Figure Skater Adam Rippon Stands by Criticism of Mike Pence Ahead of Winter Olympics","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":7538553,"ranking":16,"query_text":"wellcare mike vice president","passage_text":"He joined WellCare in August 2014 as senior vice president. He leads the company's financial activities, including financial and performance management, capital strategy and planning, actuarial, medical economics, internal controls, investment management, corporate development and investor relations.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":4437746,"ranking":17,"query_text":"wellcare mike vice president","passage_text":"The Vice President must meet the same requirements as the President, being born a U.S. citizen, at least 35 years old, and must have lived in the United States for 14 years. The current Vice President is Mike Pence","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":8520810,"ranking":18,"query_text":"wellcare mike vice president","passage_text":"January 25, 2017. WASHINGTON, DC â\u0080\u0093 Vice President Mike Pence today announced the appointment of Colonel Andrea Thompson (U.S. Army - Retired) as Deputy Assistant to the President and National Security Advisor to the Vice President.","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":8665066,"ranking":19,"query_text":"wellcare mike vice president","passage_text":"Today, the Cabinet is comprised of the vice president and 15 department heads, as well as a handful of Cabinet-level positions, such as White House chief of staff. Below are the Cabinet positions and their responsibilities, listed in order of succession to the Presidency: Vice President of the United States Vice President Joe Biden meets with Vice President-elect Mike Pence at the White House. Cliff Owen\/AP","bm25_label":"high","relevance_label":0.0},{"query_id":548099,"passage_id":884778,"ranking":20,"query_text":"wellcare mike vice president","passage_text":"By Health News Florida Staff â\u0080¢ Dec 8, 2015. Tampa-based WellCare Health Plans Inc. announced Monday it is terminating Senior Vice President and Chief Medical Officer Steven Goldberg, according to a document filed with the U.S. Securities and Exchange Commission.","bm25_label":"high","relevance_label":0.0}]