[{"query_id":549738,"passage_id":7625918,"ranking":1,"query_text":"what actress died yesterday?","passage_text":"Pratyusha Banerjee Dies: Indian Television Actress Was 24. Top Stories. Pratyusha Banerjee Dies: Indian Television Actress Was 24. Popular Indian television star Pratyusha Banerjee died yesterday in Mumbai from what local police said was an accidental death, leading to a massive outpouring of grief from shocked peers and fans. She was 24.","bm25_label":"high","relevance_label":1.0},{"query_id":549738,"passage_id":5841462,"ranking":2,"query_text":"what actress died yesterday?","passage_text":"Katharine Hepburn, Spirited Actress, Dies at 96. Katharine Hepburn, the actress whose independent life and strong-willed movie characters made her a role model for generations of women and a beloved heroine to filmgoers for more than 60 years, died yesterday at her home in the Fenwick section of Old Saybrook, Conn. She was 96 and also had a home in Manhattan.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":4173681,"ranking":3,"query_text":"what actress died yesterday?","passage_text":"Audrey Hepburn, Actress, Is Dead at 63. Audrey Hepburn, the actress who epitomized Hollywood chic in the 1950's and 60's, died yesterday at her home in Tolochenaz, near Lausanne, Switzerland. She was 63 years old and had undergone surgery for colon cancer in November.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":1470358,"ranking":4,"query_text":"what actress died yesterday?","passage_text":"The New York Times. Katharine Hepburn, Spirited Actress, Dies at 96. Katharine Hepburn, the actress whose independent life and strong-willed movie characters made her a role model for generations of women and a beloved heroine to filmgoers for more than 60 years, died yesterday at her home in the Fenwick section of Old Saybrook, Conn. She was 96 and also had a home in Manhattan.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":3004348,"ranking":5,"query_text":"what actress died yesterday?","passage_text":"ALLEN LUDEN DIES. Allen Ludden, host of the ''G.E. College Bowl'' and ''Password'' television game shows, died of cancer yesterday at Good Samaritan Hospital in Los Angeles. He was 62 years old. Betty White, the actress and his wife of 17 years, was at his bedside.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":2587691,"ranking":6,"query_text":"what actress died yesterday?","passage_text":"Charlie's Angels actress Farrah Fawcett dies of cancer with her family at her bedside. Charlie's Angels star Farrah Fawcett yesterday lost her two-year battle with cancer. The 62-year-old actress, who became an icon to millions during the 1970s, died in a hospital in Los Angeles surrounded by her family and friends. A devout Catholic, the Charlie's Angels star was read the last rites this morning.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":5272826,"ranking":7,"query_text":"what actress died yesterday?","passage_text":"Betty Hutton, Film Star of â\u0080\u009940s and â\u0080\u009950s, Dies at 86. Betty Hutton, a singer and actress celebrated as a blond bombshell of Hollywood musicals and comedies in the 1940s and 50s, died Sunday night at her home in Palm Springs, Calif., her executor announced yesterday. She was 86.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":4393787,"ranking":8,"query_text":"what actress died yesterday?","passage_text":"Audrey Hepburn dies of cancer. AUDREY Hepburn, one of Hollywood's biggest stars, died yesterday at her home in Lausanne, Switzerland, from cancer of the colon. She was 63. The Belgian-born actress, who charmed audiences with an almost ethereal beauty and sophistication, won an Oscar for her first major film, Roman Holiday.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":3084800,"ranking":9,"query_text":"what actress died yesterday?","passage_text":"Actress Eva Gabor, youngest of the celebrated Gabor sisters and best known for her role as a socialite stuck on a farm on television's Green Acres, died yesterday. She was 74. Miss Gabor died from respiratory distress and infections at 10:05 a.m. at Cedars-Sinai Medical Center, hospital spokesman Ron Wise said.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":2631909,"ranking":10,"query_text":"what actress died yesterday?","passage_text":"By CARYN JAMES. Audrey Hepburn, the actress who epitomized Hollywood chic in the 1950's and 60's, died yesterday at her home in Tolochenaz, near Lausanne, Switzerland. She was 63 years old and had undergone surgery for colon cancer in November.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":7665411,"ranking":11,"query_text":"what actress died yesterday?","passage_text":"Obituaries. Allen Ludden, host of the ''G.E. College Bowl'' and ''Password'' television game shows, died of cancer yesterday at Good Samaritan Hospital in Los Angeles. He was 62 years old. Betty White, the actress and his wife of 17 years, was at his bedside.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":4173679,"ranking":12,"query_text":"what actress died yesterday?","passage_text":"Published: January 21, 1993. Audrey Hepburn, the actress who epitomized Hollywood chic in the 1950's and 60's, died yesterday at her home in Tolochenaz, near Lausanne, Switzerland. She was 63 years old and had undergone surgery for colon cancer in November.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":2885297,"ranking":13,"query_text":"what actress died yesterday?","passage_text":"Geraldine McEwan died yesterday aged 82, her children have confirmed. The actress was best known for playing Agatha Christie's Miss Marple. Ms McEwan played Miss Marple for 12 TV films - with her last one in 2009. She had a long and successful career, winning a Bafta award in 1991. Stars and fans this evening paid tribute to the 'beautiful and funny' actress.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":8811976,"ranking":14,"query_text":"what actress died yesterday?","passage_text":"tamil actress manorama died , manorama actress death , actress manorama died , manorama actress , manorama actress died , actress manorama , nigerian actress dies , tamil actress , manorama tamil actress died , actress sindhu died , Actress Manorama Died , Tamil Actress Sindhu Died , Tamil Actress Died , Nigerian Actress Dies , Grease Actress Dies , ...","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":140644,"ranking":15,"query_text":"what actress died yesterday?","passage_text":"By THE NEW YORK TIMES. Maureen O'Sullivan, a leading Hollywood actress in the 1930's and early 40's best known for playing Jane to Johnny Weissmuller's Tarzan in the series of popular jungle adventure movies, died yesterday at the Scottsdale Memorial Hospital in Scottsdale, Ariz. She was 87.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":6436977,"ranking":16,"query_text":"what actress died yesterday?","passage_text":"kgb answers Â» Arts & Entertainment Â» Music Artists & Songs Â» What famous rapper died yesterday? US rapper Nate Dogg (Nathanial Dwayne Hale), famous for the hits Regulate and Area Codes, died yesterday at the age of 41. Cause of death is not yet known.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":1383211,"ranking":17,"query_text":"what actress died yesterday?","passage_text":"The US president said that Angelou, who has died aged 86, was a a brilliant writer, a fierce friend and a truly phenomenal woman, the BBC reported. PRESIDENT Barack Obama has led tributes to author and poet Dr Maya Angelou, who became one of the most respected civil rights voices in the US. Poet to the presidents dies aged 86. MAYA Angelou - the writer, actress, poet and equal rights campaigner - died yesterday.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":7625920,"ranking":18,"query_text":"what actress died yesterday?","passage_text":"Caroline Aherne, comedian, actress and creator of The Royle Family, dies after 'brave' battle with cancer. Caroline Aherne, who created, wrote and starred in the Royle Family, has died of cancer at the age of 52, prompting a flood of moving tributes yesterday to her â\u0080\u0098comic geniusâ\u0080\u0099. Aherne had spent much of her life battling cancer and other demons, including depression and alcoholism.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":6550275,"ranking":19,"query_text":"what actress died yesterday?","passage_text":"She was nominated for a best actress Oscar six times for roles in films including From Here to Eternity with Lancaster, and The King and I - but never won. However she was awarded an honorary Oscar in 1994 for her services to the film industry. Yesterday, her agent Anne Hutton said: She died on Tuesday.","bm25_label":"high","relevance_label":0.0},{"query_id":549738,"passage_id":4122762,"ranking":20,"query_text":"what actress died yesterday?","passage_text":"Published: December 23, 1995. Butterfly McQueen, the actress best remembered for her portrayal of Prissy in Gone With the Wind, the vexing slave girl who confounded Scarlett O'Hara with the tearful pronouncement, I don't know nothin' 'bout birthin' babies, Miss Scarlett, died yesterday. She was 84 years old.","bm25_label":"high","relevance_label":0.0}]