[{"query_id":55223,"passage_id":7898685,"ranking":1,"query_text":"boisterously definition","passage_text":"boisterous definition, meaning, English dictionary, synonym, see also 'boisterously',boisterousness',Boise',bister', Reverso dictionary, English definition, English vocabulary Translation Context","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":7898682,"ranking":2,"query_text":"boisterously definition","passage_text":"Boisterous definition: Someone who is boisterous is noisy, lively, and full of energy. | Meaning, pronunciation, translations and examples","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":977134,"ranking":3,"query_text":"boisterously definition","passage_text":"Boisterous definition, rough and noisy; noisily jolly or rowdy; clamorous; unrestrained: the sound of boisterous laughter. See more.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":977133,"ranking":4,"query_text":"boisterously definition","passage_text":"dictionary definitions for Twitter language,Sms Speak,txt msgs, txt messages, texting, Text sms phrases, SMS lingo, Tweat, Txt messaging language voiceterous has the following 2 definition(s) + add your definition boisterous boisterous is used in Vocabulary vociferous vociferous is a general term","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":7898678,"ranking":5,"query_text":"boisterously definition","passage_text":"Learn English watching your favourite videos | Learn English with movies | Learn English with TV shows. All English definitions from our dictionary. Search boisterous and thousands of other words in English definition and synonym dictionary from Reverso. You can complete the definition of boisterous given by the English Definition dictionary with other English dictionaries: Wikipedia, Lexilogos, Oxford, Cambridge, Chambers Harrap, Wordreference, Collins Lexibase dictionaries, Merriam Webster...","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":1132274,"ranking":6,"query_text":"boisterously definition","passage_text":"Definition of Holi plural-s : a Hindu spring festival characterized by boisterous and usually ribald revelry including especially the throwing of colored water and powder","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":6650062,"ranking":7,"query_text":"boisterously definition","passage_text":"Definition of GUFFAW. : a loud or boisterous burst of laughter. â\u0080\u0094 gufÂ·faw \\(Ë\u008c)gÉ\u0099-Ë\u0088foÌ\u0087\\ intransitive verb. See guffaw defined for kids. ADVERTISEMENT.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":315053,"ranking":8,"query_text":"boisterously definition","passage_text":"Wiktionary (0.00 \/ 0 votes) Rate this definition: mad as a March hare (Adjective). Crazy, demented. Origin: * Possibly from the boisterous behaviour of hares in their breeding season.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":5239300,"ranking":9,"query_text":"boisterously definition","passage_text":"Sifting through a few dictionaries, I found the following with no further explanation â\u0080\u0093 evidently they felt none was necessary, as I did above â\u0080\u0093 the imagery was of boisterous horses playing: HORSEPLAY noun: Rough, rowdy, rugged, boisterous, playful behavior, which possibly crosses the bounds of propriety. [1589] __________________________. As I mentioned above, standard dictionaries provide the definition of HORSEPLAY and by implication the derivation.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":6111070,"ranking":10,"query_text":"boisterously definition","passage_text":"horseplay definition: Horseplay is defined as boisterous fooling around, or to rough play. (noun) When two kids are tussling around and play-fighting each other, this is an example of horseplay....","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":6111064,"ranking":11,"query_text":"boisterously definition","passage_text":"Horseplay is defined as boisterous fooling around, or to rough play. When two kids are tussling around and play-fighting each other, this is an example of horseplay. YourDictionary definition and usage example.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":7898677,"ranking":12,"query_text":"boisterously definition","passage_text":"Most of the children were noisy and boisterous. Synonyms: unruly, wild, disorderly, loud More Synonyms of boisterous boisterously adverb [ADVERB with verb, ADVERB adjective]","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":7684774,"ranking":13,"query_text":"boisterously definition","passage_text":"The definition of blatant is to be very forward, loud or conspicuous. A man wearing a wedding ring telling a woman he's not married is an example of a blatant lie. disagreeably loud or boisterous; clamorous. glaringly conspicuous or obtrusive: blatant ignorance.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":7898686,"ranking":14,"query_text":"boisterously definition","passage_text":"boisterous Boisterous is a word used to describe someone spirited, loud, and slightly out of control â\u0080\u0094 like someone with a spring in their step and a song in their heart singing to strangers on the street. Boisterous means loud, clamorous, and unrestrained.. Think of children on a playground or a popular restaurant or a litter of puppies as boisterous. This word, which comes from Middle English, can also refer to very intense storms. You could call a hurricane boisterous, but you will most likely hear this word used to describe people.","bm25_label":"high","relevance_label":1.0},{"query_id":55223,"passage_id":4304794,"ranking":15,"query_text":"boisterously definition","passage_text":"A child guffaws. A guffaw is defined as a hearty and enthusiastic burst of laughter. A loud enthusiastic laugh is an example of a guffaw. The definition of guffaw is to laugh in a loud and enthusiastic way. When you laugh out loud boisterously, this is an example of a guffaw.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":2925318,"ranking":16,"query_text":"boisterously definition","passage_text":"Define riotous. riotous synonyms, riotous pronunciation, riotous translation, English dictionary definition of riotous. adj. 1. Of, relating to, or resembling a riot. 2. Participating in or inciting to riot or uproar. 3. Uproarious; boisterous: a riotous party. 4.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":2925312,"ranking":17,"query_text":"boisterously definition","passage_text":"riotous definition: 1. 2. having the nature of a riot 3. engaging in rioting or inciting to riot 4. without restraint; disorderly; boisterous 5. dissolute; profligate: riotous living 6. luxuriant or profuseOrigin of riotousMiddle English from Old Fr...","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":4304798,"ranking":18,"query_text":"boisterously definition","passage_text":"A guffaw is defined as a hearty and enthusiastic burst of laughter. A loud enthusiastic laugh is an example of a guffaw. verb. The definition of guffaw is to laugh in a loud and enthusiastic way. When you laugh out loud boisterously, this is an example of a guffaw. a loud, coarse burst of laughter.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":977131,"ranking":19,"query_text":"boisterously definition","passage_text":"Historical Examples. 1  The accent was gentle; and he feared no boisterous intrusion. 2  The evening was boisterousâ\u0080\u0094scarcely better than the previous night had been. 3  They are not talkative and boisterous as these are, but silent, sullen and revengeful. 4  Fanfulla eyed him, infected by the boisterous gladness of his mood.","bm25_label":"high","relevance_label":0.0},{"query_id":55223,"passage_id":7898679,"ranking":20,"query_text":"boisterously definition","passage_text":"The Sun (2016)There are no clinical trials of its effects on anxious or boisterous children. Times, Sunday Times (2008)Scores of boisterous children make up the first sitting before parents help themselves to what is left. Times, Sunday Times (2010)He was a very boisterous child and was really into his music.","bm25_label":"high","relevance_label":0.0}]