[{"query_id":560419,"passage_id":3049536,"ranking":1,"query_text":"what are inotropic meds","passage_text":"Inotropic agents, or inotropes, are medicines that change the force of your heart's contractions. There are 2 kinds of inotropes: positive inotropes and negative inotropes. Positive inotropes strengthen the force of the heartbeat. Negative inotropes weaken the force of the heartbeat.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":214787,"ranking":2,"query_text":"what are inotropic meds","passage_text":"Inotropic Drugs: What You Need to Know. Positive inotropic drugs improve heart function in cases of heart failure (when the heart is not pumping well enough), heart attacks and various types of heart disease. Doctors very often prescribe one of the digitalis compounds, digoxin, for patients with heart failure.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":1372608,"ranking":3,"query_text":"what are inotropic meds","passage_text":"In general, calcium levels are increased by positive inotropic drugs and decreased by negative inotropic drugs. But different types of inotropic drugs change calcium levels in different ways. Next, we'll learn about the different kinds of inotropic drugs.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":7643652,"ranking":4,"query_text":"what are inotropic meds","passage_text":"Inotrope Therapy. Infusion, LLC is an experienced home infusion provider for patients needing inotrope therapy. The common inotropic medications used include Milrinone (Primacore), Dopamine and Dobutamine. The inotropes work to enlarge the vessels and help the heart contract harder. Both of these actions help more blood to be pumped from the heart into the body. Inotrope therapy is used for heart failure.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":214788,"ranking":5,"query_text":"what are inotropic meds","passage_text":"In general, calcium levels are increased by positive inotropic drugs and decreased by negative inotropic drugs. But different types of inotropic drugs change calcium levels in different ways. Next, we'll learn about the different kinds of inotropic drugs. 1. 2.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":7643647,"ranking":6,"query_text":"what are inotropic meds","passage_text":"In general, calcium levels are increased by positive inotropic drugs and decreased by negative inotropic drugs. But different types of inotropic drugs change calcium levels in different ways.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":1372607,"ranking":7,"query_text":"what are inotropic meds","passage_text":"inotropic Influencing the force or speed of muscular contractility. Inotropic agents, such as dobutamine and dopamine are used to improve the output of the heart in the treatment of HEART FAILURE and sometimes in acute circulatory failure . inotropic affecting or controlling the strength of heart contractions. For example, chemicals that increase the force of contraction have a positive inotropic effect.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":214791,"ranking":8,"query_text":"what are inotropic meds","passage_text":"How are Vasopressors used with Inotropes? Many times inotropes and vasopressors are used together. Inotropes are the compounds which are used for influencing muscle contraction, while the other compounds are used at the same time to relax the muscle. As of today vasopressors along with inotropes are considered a therapeutic cornerstone for controlling many cardiovascular syndromes.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":1372610,"ranking":9,"query_text":"what are inotropic meds","passage_text":"Definition of inotropic. : increasing or decreasing the force of muscular contractions an inotropic drug.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":1372605,"ranking":10,"query_text":"what are inotropic meds","passage_text":"What made you want to look up inotropic? Please tell us where you read or heard it (including the quote, if possible).","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":713063,"ranking":11,"query_text":"what are inotropic meds","passage_text":"Definition of Inotropic. Inotropic: Affecting the force of muscle contraction. An inotropic heart drug is one that affects the force with which the heart muscle contracts. Ionotropic can be negative or positive. Search MedTerms:","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":8415635,"ranking":12,"query_text":"what are inotropic meds","passage_text":"Not to be confused with ionotropic. An inotrope is an agent that alters the force or energy of muscular contractions. Negatively inotropic agents weaken the force of muscular contractions. Positively inotropic agents increase the strength of muscular contraction.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":6120017,"ranking":13,"query_text":"what are inotropic meds","passage_text":"An inotrope (etymology and pronunciation) is an agent that alters the force or energy of muscular contractions. Negatively inotropic agents weaken the force of muscular contractions. Positively inotropic agents increase the strength of muscular contraction. The term inotropic state is most commonly used in reference to various drugs that affect the strength of contraction of heart muscle (myocardial contractility).","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":8415640,"ranking":14,"query_text":"what are inotropic meds","passage_text":"Related to inotropic: inotropic agents. (Ä\u0093â\u0080²nÉ\u0099-trÅ\u008dâ\u0080²pÄ­k, -trÅ\u008fpâ\u0080²Ä­k, Ä«â\u0080²nÉ\u0099-) adj. Affecting the contraction of muscle, especially heart muscle: an inotropic drug.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":214789,"ranking":15,"query_text":"what are inotropic meds","passage_text":"Technically, inotropes can be divided into positive inotropes, which stimulate and increase the force of contraction of the heart muscle, and negative inotropes, which weaken the force of muscular contractions, decreasing how hard the heart has to work.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":214794,"ranking":16,"query_text":"what are inotropic meds","passage_text":"An inotropic drug is a medicine that alters the force or strength of the heart's muscular contractions (heartbeats). There are two different types of inotropic drugs: negative and positive. Negative inotropic drugs make the heart beat less strongly, and positive inotropic drugs make the heart beat more strongly. Both kinds are used in the management of various conditions that affect the function of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":1372609,"ranking":17,"query_text":"what are inotropic meds","passage_text":"-Positive Inotropic--Effect: STRENGTHEN force of heart-Negative Inotropic--Effect: WEAKEN force of heart","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":7679890,"ranking":18,"query_text":"what are inotropic meds","passage_text":"An inotrope (etymology and pronunciation) is an agent that alters the force or energy of muscular contractions. Negatively inotropic agents weaken the force of muscular contractions. Positively inotropic agents increase the strength of muscular contraction. The term inotropic state is most commonly used in reference to various drugs that affect the strength of contraction of heart muscle (myocardial contractility). However, it can also refer to pathological conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":214786,"ranking":19,"query_text":"what are inotropic meds","passage_text":"However, clinically, if the word inotrope is used it typically refers to positive inotropes. Inotropes are given for conditions associated with a low cardiac output (CO) (poor heart contraction), such as cardiogenic shock following a heart attack, severe heart failure, or following cardiac surgery.","bm25_label":"high","relevance_label":0.0},{"query_id":560419,"passage_id":7643649,"ranking":20,"query_text":"what are inotropic meds","passage_text":"Plush Studios\/Riser\/ Getty Images. An inotropic drug is a medicine that alters the force or strength of the heart 's muscular contractions (heartbeats). There are two different types of inotropic drugs: negative and positive. Negative inotropic drugs make the heart beat less strongly, and positive inotropic drugs make the heart beat more strongly. Both kinds are used in the management of various conditions that affect the function of the heart.","bm25_label":"high","relevance_label":1.0}]