[{"query_id":567630,"passage_id":7672256,"ranking":1,"query_text":"what are the best plants for connecticut gardens","passage_text":"Connecticut offers a wide variety of native plants to grow in your garden. According to the Connecticut Botanical Society, plants were nonexistent in this region until changes in the Wisconsin Glacial ice about 20,000 years ago. Plant recommendations for Connecticut gardens range from U.S. Department of Agriculture planting zones 2 to 8.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":7672255,"ranking":2,"query_text":"what are the best plants for connecticut gardens","passage_text":"These evergreens prosper in moist soils, typically in full sun to partial shade. The Connecticut native cinnamon fern does best in full sun with additional watering. The marginal woodfern has the darkest leaves of this plant type and is often added to Connecticut gardens for winter color.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":4316324,"ranking":3,"query_text":"what are the best plants for connecticut gardens","passage_text":"Now that you know your Connecticut hardiness zone, you can better understand what plants will do well in your garden. You can use plants in your garden that are your growing zone or lower. So, if your zone is 6, you can plant plants that are suitable for zones 6, 5, 4, 3, 2, 1.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":4316320,"ranking":4,"query_text":"what are the best plants for connecticut gardens","passage_text":"Advertisement. Now that you know your Connecticut hardiness zone, you can better understand what plants will do well in your garden. You can use plants in your garden that are your growing zone or lower. So, if your zone is 6, you can plant plants that are suitable for zones 6, 5, 4, 3, 2, 1.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":3307105,"ranking":5,"query_text":"what are the best plants for connecticut gardens","passage_text":"Deciding What to Plant in a Garden with Vegetables. At first, when deciding what to plant in a garden with vegetables, it's best to start small. Many gardeners get a little too excited at the beginning of the season and plant more than they need -- and end up wasting food and feeling overwhelmed by their garden.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":7674719,"ranking":6,"query_text":"what are the best plants for connecticut gardens","passage_text":"Guide to gardening in shade. An abundance of shade in your garden doesn't mean you can't plant a stunning oasis. Here's what to plant in the shade in garden beds, borders, and containers. Main. Best plants. Dry shade. Herbs. Containers.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":6000924,"ranking":7,"query_text":"what are the best plants for connecticut gardens","passage_text":"The intervals on the river Connecticut are all a garden. Lombardy is the garden of Italy. Garden, in composition, is used adjectively, as garden-mold, a rich fine mold or soil; garden-tillage,the tillage used in cultivating gardens. G`ARDEN, v.i. To layout and to cultivate a garden; to prepare ground to plant and till it, for the purpose of producing plants, shrubs, flowers and fruits.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":4057621,"ranking":8,"query_text":"what are the best plants for connecticut gardens","passage_text":"In Hydroponic gardening, it is important to know what different types of nutrients are best for the different varieties of Hydroponic plants we will be growing. Hydroponic nutrients are much better for Hydroponic plants as opposed to regular fertilizers.n Hydroponic gardening, it is important to know what different types of nutrients are best for the different varieties of Hydroponic plants we will be growing. Hydroponic nutrients are much better for Hydroponic plants as opposed to regular fertilizers.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":8388040,"ranking":9,"query_text":"what are the best plants for connecticut gardens","passage_text":"Post navigation. October in the Vegetable Garden. September in the Vegetable Garden. Warm Weather Plants. (this is the last month for planting these -- best to get them in the ground as early in the month as possible... like NOW). Cool Weather Plants. What If A Hurricane Comes? Part 2: Aftermath. What If A Hurricane Comes? Memorial Day is more ....","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":962219,"ranking":10,"query_text":"what are the best plants for connecticut gardens","passage_text":"Gardeners should look to Native Plants when choosing what to place in their yards. They are adapted to the landscape and weather in our state. We list many native plants and shrubs and contact your local county agent for the best Arkansas native plants to put in your yard. Gardeners should look to Native Plants when choosing what to place in their yards.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":1095791,"ranking":11,"query_text":"what are the best plants for connecticut gardens","passage_text":"What makes water gardening unique is that the plants you grow are growing in a water filled environment. Things like water depth, water temperature and what to do with plants during the winter now become a consideration.Soils for Aquatics. Water lilies, lotus, and other aquatic plants do best when they are planted in heavy clay loam soils similar to what you would have in a garden setting.hat makes water gardening unique is that the plants you grow are growing in a water filled environment. Things like water depth, water temperature and what to do with plants during the winter now become a consideration.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":7238351,"ranking":12,"query_text":"what are the best plants for connecticut gardens","passage_text":"Spring time is the best time for planting vegetables, the weather is perfect for the growth, after a few months your spring vegetable garden will be full of delicious vegetables. One of the best spring gardening tips is to plant 2 to 4 weeks after the last frost, when the soil is moist and ready. What vegetables to plant in spring? Well, there is a variety; however, below mentioned are top ten vegetables to plant in the spring:","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":8648593,"ranking":13,"query_text":"what are the best plants for connecticut gardens","passage_text":"Gardening with aquatics is similar to other forms of gardening in that you have to be aware of proper soil conditions, kinds of containers, proper planting techniques, fertility needs, and after planting care. What makes water gardening unique is that the plants you grow are growing in a water filled environment. Things like water depth, water temperature and what to do with plants during the winter now become a consideration. Soils for Aquatics. Water lilies, lotus, and other aquatic plants do best when they are planted in heavy clay loam soils similar to what you would have in a garden setting. These types of soils are generally well-balanced nutritionally and will support good growth.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":7258093,"ranking":14,"query_text":"what are the best plants for connecticut gardens","passage_text":"One of the best parts of gardening (next to eating the produce, of course) is planting the garden. As a gardener, you have the option of purchasing started plants from a greenhouse or other retail outlet or buying seeds and starting them yourself. From a budgeting standpoint, it is cheaper to start your own seeds. It is much easier to purchase started plants but you are limited to what the greenhouse or store has to offer.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":7672252,"ranking":15,"query_text":"what are the best plants for connecticut gardens","passage_text":"New England aster flowers are ideal for Connecticut gardens needing a tall, showy plant as the background. Purple flowers look similar to daisies. The average plant height is 3 to 5 feet in sunny-to partial-sun locations.","bm25_label":"high","relevance_label":1.0},{"query_id":567630,"passage_id":1014442,"ranking":16,"query_text":"what are the best plants for connecticut gardens","passage_text":"What makes water gardening unique is that the plants you grow are growing in a water filled environment. Things like water depth, water temperature and what to do with plants during the winter now become a consideration. Soils for Aquatics. Water lilies, lotus, and other aquatic plants do best when they are planted in heavy clay loam soils similar to what you would have in a garden setting. These types of soils are generally well-balanced nutritionally and will support good growth.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":1248277,"ranking":17,"query_text":"what are the best plants for connecticut gardens","passage_text":"Here's what to plant in the shade in garden beds, borders, and containers. 1  Main. 2  Best plants. 3  Dry shade. 4  Herbs. Containers.  Design 1  ideas.  Tips.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":4316319,"ranking":18,"query_text":"what are the best plants for connecticut gardens","passage_text":"This is the Connecticut USDA zone map. This map will help you find the plant hardiness zone for your area. Understanding your plant hardiness zone will help you to create a lasting garden that will survive the winter weather in your area.","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":5220605,"ranking":19,"query_text":"what are the best plants for connecticut gardens","passage_text":"Straw is one of the best mulch materials you can use around your vegetable plants. Itâ\u0080\u0099s clean, itâ\u0080\u0099s light and it breaks down relatively easily, giving your plants more of what they need to grow. Letâ\u0080\u0099s find out more about using straw mulch for gardening. Best Types of Straw Garden Mulch","bm25_label":"high","relevance_label":0.0},{"query_id":567630,"passage_id":5070270,"ranking":20,"query_text":"what are the best plants for connecticut gardens","passage_text":"If you are wondering what plants would do best in your garden and landscape, you can enlarge the New Mexico plant map above to find your growing zone. Once you have determined which zone you are in, you can use that information to make educated decisions regarding the plants that will thrive in your garden.","bm25_label":"high","relevance_label":0.0}]