[{"query_id":569473,"passage_id":8178595,"ranking":1,"query_text":"what are the effects of sediment transport","passage_text":"Q: what transports most of the sediment in a beach environment. A: Longshore currents what transports most of the sediment in a beach environment.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7557849,"ranking":2,"query_text":"what are the effects of sediment transport","passage_text":"Organic sediment transport is will vary by location and season. In one estuarine study, the organic portion of the suspended load fell from 85% to 18% from February to November due to seasonal effects on sediment transport 18.oastline erosion can be tied to sediment starvation â\u0080\u0093 when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7557843,"ranking":3,"query_text":"what are the effects of sediment transport","passage_text":"In addition to the effects that geomorphology has on sediment transport rates, the process itself plays a part in creating the terrain. As sediment is transported down stream, the water flow helps to shape the planetâ\u0080\u0099s surface by carrying away the eroded material away from some regions and depositing it in others 19.oastline erosion can be tied to sediment starvation â\u0080\u0093 when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain.","bm25_label":"high","relevance_label":1.0},{"query_id":569473,"passage_id":1900754,"ranking":4,"query_text":"what are the effects of sediment transport","passage_text":"A study of the sediment delivery to Atlantic estuaries of the United States by Phillips (1991) focused on the bedload transport through these systems. The relative effects of land-use practices or changes were evaluated on the basis of soil erosion and the possible effect that this would have on downstream estuaries. This study did not rely on complex equations to model sediment transport but rather focused on sediment yield and sediment delivery ratios.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":5460115,"ranking":5,"query_text":"what are the effects of sediment transport","passage_text":"CHAPTER 11. MOVEMENT OF SEDIMENT BY THE WIND. INTRODUCTION. 1 Everyone knows that winds on the Earth are commonly strong enough to erode, transport, and deposit sediment. What is perhaps less obvious is that the modes of. sediment transport by the wind are greatly different from those of sediment transport by. water flows.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7557845,"ranking":6,"query_text":"what are the effects of sediment transport","passage_text":"Today, the most pressing sediment-related problems are associated with environmental questions such as the transport and fate of attached pollutants, effects of sediment on aquatic biota and their habitat, and changes in sediment transport related to land use change. A project is under way in Wisconsin to assess the influence of vegetated filter strips on the transport of sediment and nutrients to a stream. 2  Detailed measurements of sediment and water chemistry are being made in several Massachusetts lakes to help assess their trophic state.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7107167,"ranking":7,"query_text":"what are the effects of sediment transport","passage_text":"In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain. Downstream of dammed rivers, it is common to see receding riparian zones and wetlands due to the loss of transported sediment 8.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7219307,"ranking":8,"query_text":"what are the effects of sediment transport","passage_text":"CHAPTER 11 MOVEMENT OF SEDIMENT BY THE WIND INTRODUCTION 1 Everyone knows that winds on the Earth are commonly strong enough to erode, transport, and deposit sediment. What is perhaps less obvious is that the modes of sediment transport by the wind are greatly different from those of sediment transport by water flows. This great difference does not arise from any great difference in the","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":5091888,"ranking":9,"query_text":"what are the effects of sediment transport","passage_text":"Sediment transport is the movement of organic and inorganic particles by water 10. In general, the greater the flow, the more sediment that will be conveyed. Water flow can be strong enough to suspend particles in the water column as they move downstream, or simply push them along the bottom of a waterway 11.rganic sediment transport is will vary by location and season. In one estuarine study, the organic portion of the suspended load fell from 85% to 18% from February to November due to seasonal effects on sediment transport 18.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":5091891,"ranking":10,"query_text":"what are the effects of sediment transport","passage_text":"Whether sediment will be eroded, transported or deposited is depended on the particle size and the flow rate of the water. Flow (ft 3 \/s) =Area (ft 2) * Velocity (ft\/s). OR Flow (ft 3 \/s) =Volume (ft 3)\/ Time (s). The equations describing the relationship of water flow and sediment transport are a bit more complex.rganic sediment transport is will vary by location and season. In one estuarine study, the organic portion of the suspended load fell from 85% to 18% from February to November due to seasonal effects on sediment transport 18.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7557848,"ranking":11,"query_text":"what are the effects of sediment transport","passage_text":"Whether sediment will be eroded, transported or deposited is depended on the particle size and the flow rate of the water. Flow (ft 3 \/s) =Area (ft 2) * Velocity (ft\/s). OR Flow (ft 3 \/s) =Volume (ft 3)\/ Time (s). The equations describing the relationship of water flow and sediment transport are a bit more complex.oastline erosion can be tied to sediment starvation â\u0080\u0093 when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":1949595,"ranking":12,"query_text":"what are the effects of sediment transport","passage_text":"removal and transport of sediment (mainly from the boundary) and deposition involves the. transport and placement of sediment on the boundary. Erosion and deposition are what form the. channel of any alluvial river as well as the floodplain through which it moves.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":6325811,"ranking":13,"query_text":"what are the effects of sediment transport","passage_text":"The effects of attrition can be mistaken for the effects of sorting, in which the grain size of sediments is affected by sediment transport mechanisms e.g. suspension vs. bed load.s rocks are transported downstream along a riverbed, the regular impacts between the grains themselves and between the grains and the bed cause them to be broken up into smaller fragments. This process also makes them rounder and smoother.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7213460,"ranking":14,"query_text":"what are the effects of sediment transport","passage_text":"What is the water's role in erosion and deposition? Water is responsible for transporting the bulk of the world's sediments. The bulk of the world's sediments are deposited from water.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7557844,"ranking":15,"query_text":"what are the effects of sediment transport","passage_text":"Sediment transport is the movement of organic and inorganic particles by water 10. In general, the greater the flow, the more sediment that will be conveyed. Water flow can be strong enough to suspend particles in the water column as they move downstream, or simply push them along the bottom of a waterway 11.oastline erosion can be tied to sediment starvation â\u0080\u0093 when rivers do not bring enough sediment to be deposited on the beach. In addition to the effect on aquatic life, the loss of sediment transport and deposition can cause physical changes to the terrain.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":2357753,"ranking":16,"query_text":"what are the effects of sediment transport","passage_text":"1 The distance the sediment is transported and the energy of the transporting medium all leave clues in the final sediment that tell us something about the mode of transportation. 2  Deposition-Sediment is deposited when the energy of the transporting medium becomes too low to continue the transport process. The distance the sediment is transported and the energy of the transporting medium all leave clues in the final sediment that tell us something about the mode of transportation. 2  Deposition-Sediment is deposited when the energy of the transporting medium becomes too low to continue the transport process.","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":1949592,"ranking":17,"query_text":"what are the effects of sediment transport","passage_text":"Sediment supply refers to the amount and size of sediment available for sediment transport. Capacity transport for a given grain size is only achieved if the supply of that calibre of sediment is not limiting (that is, the maximum amount of sediment a stream is capable of transporting is","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":4870017,"ranking":18,"query_text":"what are the effects of sediment transport","passage_text":"For example, if all the grains in a sediment sample are very nearly the same size, then we say the sample is well-sorted.. If a sediment sample were to contain pieces of gravel, as well as sand and silt, it would be a poorly sorted sample. Sorting is somewhat dependant on the distance of transport, but it is primarily effected by the medium of transport. Water is an excellent medium for sorting of particles by size (and density).","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":1949593,"ranking":19,"query_text":"what are the effects of sediment transport","passage_text":"Sediment supply refers to the amount and size of sediment available for sediment transport. Capacity transport for a given grain size is only achieved if the supply of that calibre of sediment. is not limiting (that is, the maximum amount of sediment a stream is capable of transporting is. actually available).","bm25_label":"high","relevance_label":0.0},{"query_id":569473,"passage_id":7219304,"ranking":20,"query_text":"what are the effects of sediment transport","passage_text":"Sediment transport. Sediment transport is the movement of solid particles (sediment), typically due to a combination of gravity acting on the sediment, and\/or the movement of the fluid in which the sediment is entrained.","bm25_label":"high","relevance_label":0.0}]