[{"query_id":573157,"passage_id":5727471,"ranking":1,"query_text":"what are the restrictions on a california provisional license","passage_text":"The cost for a non-commercial (Class C) California driver's license is $33. A California driver's license is valid for four years. With certain restrictions, an individual can legally drive in California with a learner's license. See more information on provisional licenses here.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":5727472,"ranking":2,"query_text":"what are the restrictions on a california provisional license","passage_text":"A California driver's license is valid for four years. With certain restrictions, an individual can legally drive in California with a learner's license. See more information on provisional licenses here. You can apply for a new driver's license at any DMV office in California.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":7495887,"ranking":3,"query_text":"what are the restrictions on a california provisional license","passage_text":"Provisional drivers license restrictions in the state of California are have been in affect since January 1, 2006 and apply to all that: 1  Are issued a provisional driver license (DL) on or after January 1, 2006, or. 2  Already hold a provisional DL issued on or after January 1, 2005.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":4594563,"ranking":4,"query_text":"what are the restrictions on a california provisional license","passage_text":"Provisional Instruction Permits. If you are under 18 and at least 15 Â½ you can apply for a provisional driver license. The first step to getting your license is to get your instruction permit. Because you are under 18, your permit and driver license are called, Provisional..our provisional instruction permit will have the following restrictions. 1  You must obey the traffic laws. 2  You must drive without a collision. 3  You must drive with your parent, guardian, spouse, or an adult 25 years of age or older, who has a valid California driver license.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":7495889,"ranking":5,"query_text":"what are the restrictions on a california provisional license","passage_text":"Exceptions to Provisional License Restrictions. If reasonable transportation is not available and it is absolutely necessary that you drive, California law allows exceptions for minors to drive between 11 pm and 5 am or to transport an immediate family member unaccompanied and unsupervised:","bm25_label":"high","relevance_label":1.0},{"query_id":573157,"passage_id":3498413,"ranking":6,"query_text":"what are the restrictions on a california provisional license","passage_text":"Minnesota Provisional License Restrictions. A provisional drivers license can be issued to drivers license applicants who are under 18 years of age and successfully met all learners permit requirements.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":4335476,"ranking":7,"query_text":"what are the restrictions on a california provisional license","passage_text":"Once you become 18 years of age, these restrictions no longer apply. Fees: 1  There is no additional fee for the provisional license if you are a new driver in the Rookie Driver program and have a valid learner's permit. 2  There is a fee for the provisional license if you have a license from another state or another country.nce you become 18 years of age, these restrictions no longer apply. Fees: 1  There is no additional fee for the provisional license if you are a new driver in the Rookie Driver program and have a valid learner's permit. 2  There is a fee for the provisional license if you have a license from another state or another country.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":178528,"ranking":8,"query_text":"what are the restrictions on a california provisional license","passage_text":"The North Carolina Level Three Full Provisional License. The time limitation, supervising driver and passenger restrictions that applied to Level 1 and Level 2 licenses are not in effect for drivers that hold the Level 3 full provisional license.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":610996,"ranking":9,"query_text":"what are the restrictions on a california provisional license","passage_text":"If you are under 18 and at least 15 Â½ you can apply for a provisional driver license. The first step to getting your license is to get your instruction permit. This means you have additional restrictions placed on your permit and driver license that adults (18 and over) do not have. Your provisional instruction permit will have the following restrictions.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":6532577,"ranking":10,"query_text":"what are the restrictions on a california provisional license","passage_text":"Provisional Instruction Permits. If you are under 18 and at least 15 Â½ you can apply for a provisional driver license. The first step to getting your license is to get your instruction permit. Because you are under 18, your permit and driver license are called, Provisional..This means you have additional restrictions placed on your permit and driver license that adults (18 and over) do not have. You must drive without a collision. 2  You must drive with your parent, guardian, spouse, or an adult 25 years of age or older, who has a valid California driver license. 3  You must hold your permit for six months before you can take your driving test to get your driver license.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":270525,"ranking":11,"query_text":"what are the restrictions on a california provisional license","passage_text":"Provisional Instruction Permits. If you are under 18 and at least 15 Â½ you can apply for a provisional driver license. The first step to getting your license is to get your instruction permit. Because you are under 18, your permit and driver license are called, Provisional..This means you have additional restrictions placed on your permit and driver license that adults (18 and over) do not have.he first step to getting your license is to get your instruction permit. Because you are under 18, your permit and driver license are called, Provisional.. This means you have additional restrictions placed on your permit and driver license that adults (18 and over) do not have.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":6532580,"ranking":12,"query_text":"what are the restrictions on a california provisional license","passage_text":"Once you become 18 years of age, these restrictions no longer apply. Fees: 1  There is no additional fee for the provisional license if you are a new driver in the Rookie Driver program and have a valid learner's permit.2  There is a fee for the provisional license if you have a license from another state or another country.nce you become 18 years of age, these restrictions no longer apply. Fees: 1  There is no additional fee for the provisional license if you are a new driver in the Rookie Driver program and have a valid learner's permit.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":5908210,"ranking":13,"query_text":"what are the restrictions on a california provisional license","passage_text":"Now you may apply for a provisional driver license. A provisional license allows you drive with more freedom than your learner's permit; however, there are still several important restrictions that you should be aware of.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":5220858,"ranking":14,"query_text":"what are the restrictions on a california provisional license","passage_text":"Provisional Drivers License. Once you pass the road test, youâ\u0080\u0099ll receive a provisional license. For those younger than 21 years old, you must hold this first license for 2 years before graduating to a full license. With your new license, you must follow these restrictions:","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":3942001,"ranking":15,"query_text":"what are the restrictions on a california provisional license","passage_text":"The provisional license you receive will expire 60 days after your 21st birthday. Or if you are 21 years of age or older, 8 years after the license is issued on the month and day of your birth.While you are driving with a provisional license and are less than 18 years of age, the following restrictions apply: There is no additional fee for the provisional license if you are a new driver in the Rookie Driver program and have a valid learner's permit. 2  There is a fee for the provisional license if you have a license from another state or another country.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":6532579,"ranking":16,"query_text":"what are the restrictions on a california provisional license","passage_text":"Restrictions on Time. Provisional license holders under the age of 18 are restricted from driving between 12 midnight and 5 a.m. unless: The driver is accompanied or supervised by a licensed driver, 21 years of age or older, with at least 3 years of driving experience. Provisional license holders under the age of 18, during the first 5 months (151 days) of the provisional period, are not allowed to have passengers under the age of 18, unless accompanied by a qualified supervising driver or the passengers are direct family members.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":8046810,"ranking":17,"query_text":"what are the restrictions on a california provisional license","passage_text":"Driver Licensing - License Classes and Restrictions Before applying for a Maryland Learner's Permit, Provisional License or a Driver's License, you will need to decide which class of license you need.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":6406988,"ranking":18,"query_text":"what are the restrictions on a california provisional license","passage_text":"For example: If the date on your license is May 7, 2005, you will have the above restrictions through May 7, 2006. Violation of either restriction can result in a fine and\/or community service. Exceptions to Restrictions. Questions and Answers about the Changes to Provisional Driver License Restrictions.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":6334098,"ranking":19,"query_text":"what are the restrictions on a california provisional license","passage_text":"You can apply for a provisional driver's license after you have had your learner's permit for at least 9 months and fulfilled the practice requirements above. In order to obtain your provisional license, you will need to pass a driving skills test at the MVA.hen driving with your provisional license, the following restrictions apply: During the first 5 months, provisional license holders are not allowed to have friends under the age of 18 in the car, unless accompanied by a qualified supervising driver.","bm25_label":"high","relevance_label":0.0},{"query_id":573157,"passage_id":6647944,"ranking":20,"query_text":"what are the restrictions on a california provisional license","passage_text":"A driver's permit, learner's permit, learner's license or provisional license, is a restricted license that is given to a person who is learning to drive, but has not yet satisfied the requirement to obtain a driver's license.","bm25_label":"high","relevance_label":0.0}]