[{"query_id":575096,"passage_id":45371,"ranking":1,"query_text":"what are the two largest climate regions in canada?","passage_text":"Vegetation regions are characterized by similar plant life as determined by climate and other factors, such as geology, soil composition and erosion. The boreal forest region is the largest in Canada, followed by the Arctic tundra region.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":8804498,"ranking":2,"query_text":"what are the two largest climate regions in canada?","passage_text":"The humid continental climate that covers a large part of Canada helps the country with which type of business? Which part of Canada has subarctic and arctic climates? What country borders Canada? Which area is known for its rolling, rocky land covering eastern and central Canada? Which country is the second largest in the world in land area? What are the problems related to clear cuttings? 13. Why is the Canadian Shield important to the economy of Canada? 14.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":6266392,"ranking":3,"query_text":"what are the two largest climate regions in canada?","passage_text":"This type of land is often called Tundra. This region does overlap other regions of Canada, including the Cordillera and the Canadian Shield. Land in the Tundra region consists of lowlands, plateaus, mountains, and ice caps. Two main climate types are found in this region.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":2802233,"ranking":4,"query_text":"what are the two largest climate regions in canada?","passage_text":"The climate of Quebec Quebec is one of the provinces in Canada in which French is spoken. It is the second most densely populated area in Canada. One of Canadaâ\u0080\u0099s largest cities is Montreal. Because the province is very large there are differences in temperature. The southern part, which is the most densely populated area, has a continental climate. This type of climate has four distinct seasons. Hot summers and cold winters with large amounts of snow and rain. The central region has longer winters and short and cold summers.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":8402208,"ranking":5,"query_text":"what are the two largest climate regions in canada?","passage_text":"What is the average house price in Canada? The average price of a house in Canada is a meaningless, useless mathematical construct. Canada covers more than 3,511,000 square miles of land, across a huge range of climates and ecological zones, and economic and cultural regions.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":7546570,"ranking":6,"query_text":"what are the two largest climate regions in canada?","passage_text":"The largest climate region of Canada is the Arctic. It covers mainland Nunavut, Northwest Territories, the tip of Yukon, northern Quebec, and in around parts of Hudson Bay, inâ\u0080¦ northern Ontario. Much of the land North of the mainland is also a barren wasteland, almost uninhabitable.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":7546575,"ranking":7,"query_text":"what are the two largest climate regions in canada?","passage_text":"The largest climate region of Canada is the Arctic. It covers mainland Nunavut, Northwest Territories, the tip of Yukon, northern Quebec, and in around parts of Hudson Bay, in â\u0080¦ northern Ontario. Much of the land North of the mainland is also a barren wasteland, almost uninhabitable.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":2515860,"ranking":8,"query_text":"what are the two largest climate regions in canada?","passage_text":"Arctic Tundra: Location, Climate, Species. Location. The Tundra is located in the northern regions of North America, Europe, Asia, as well as a few regions of Antarctica. The Tundra is the second largest vegetation zone in Canada. It can be divided clearly into three different sections: the High Arctic Tundra, the Low Arctic Tundra and the Alpine Tundra.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":7270746,"ranking":9,"query_text":"what are the two largest climate regions in canada?","passage_text":"Taiga is the northernmost forest, occupying regions that fall in between 50-70Â° latitude N, with the largest extensions of taiga located in Canada and Russia. Climate. The taiga biome is characterized by a subarctic climate with very long winters and short mild summers. Temperatures may vary from -50 to 20Â° C (-50 to 68Â° F) throughout the year.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":8354328,"ranking":10,"query_text":"what are the two largest climate regions in canada?","passage_text":"What differentiates the 11 places with the most moderate climate in the world from the 11 countries with the best climate in the world is that we will include regions which donâ\u0080\u0099t have predominantly moderate climates. Climate knows no borders. The largest countries extend into multiple climate zones.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":2891501,"ranking":11,"query_text":"what are the two largest climate regions in canada?","passage_text":"Geographers divide our state into six physiographic regions. These regions are determined by the age and type of rock in the area, by the landscape of the area, such as lowland, hills, or mountains, and by the climate of the area.he Vermont Piedmont. The Vermont Piedmont is an area east of the Green Mountains that runs the entire length of the state from Canada to Massachusetts. It also includes most of Vermont's Connecticut River Valley and is the largest physiographic region in the state.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":537653,"ranking":12,"query_text":"what are the two largest climate regions in canada?","passage_text":"Regions & Towns. Vancouver Island is located in the Pacific Northwest, off the southwest coast of mainland British Columbia. Vancouver Island boasts the warmest climate in BC and Canada, along with the southern Gulf Islands that lie off the southeast coast of the island, the largest of which is Saltspring Island.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":8389093,"ranking":13,"query_text":"what are the two largest climate regions in canada?","passage_text":"As the worldâ\u0080\u0099s second largest country, Canadaâ\u0080\u0099s geography changes significantly depending on which part you are in. And with the differences in each region, there is a very different accompanying landscape and climate. In almost every part of Canada there are lakes and rivers. Canada has over 2 million lakes covering 7% of the land mass. The largest lake is the Northwest Territoriesâ\u0080\u0099 Great Bear Lake. It is estimated that Canada is home to one-seventh of the worldâ\u0080\u0099s fresh water. Canada has a land mass of 9,970,610 square kilometers and occupies the northern half of North America. From east to west, Canada encompasses six time zones.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":7546569,"ranking":14,"query_text":"what are the two largest climate regions in canada?","passage_text":"The five major climate regions of Canada are the Northern region, the Pacific region, the Prairie region, the Core region, and the Atlantic region. Minor edit?","bm25_label":"high","relevance_label":1.0},{"query_id":575096,"passage_id":7611864,"ranking":15,"query_text":"what are the two largest climate regions in canada?","passage_text":"The climate of Yukon Territory (Canada) Yukon Territory is located in the north-west of Canada and is one of the coldest regions in the country. The largest part is covered with taiga and tundra. Donâ\u0080\u0099t be surprised if you run into a bear, a caribou or a wolf. Yukon Territory has a sub-arctic climate. Because of the altitude of the area summers are relatively warm. Temperatures may rise to 25 degrees Celsius on long summer days. During the winter temperatures are between -39 and -58 degrees Celsius. Yukon is known as the country of the midnight sun.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":816055,"ranking":16,"query_text":"what are the two largest climate regions in canada?","passage_text":"The Canadian Shield is the largest landform region in Canada; it covers most of Canada and much of the United States. This region contains some of the oldest rocks in the world (3.96 billion years old).he Canadian Shield is the largest landform region in Canada; it covers most of Canada and much of the United States. This region contains some of the oldest rocks in the world (3.96 billion years old).","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":7546571,"ranking":17,"query_text":"what are the two largest climate regions in canada?","passage_text":"The five major climate regions of Canada are the Northern region, the Pacific region, the Prairie region, the Core region, and the Atlantic region. Go Log In Sign Up","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":7546566,"ranking":18,"query_text":"what are the two largest climate regions in canada?","passage_text":"Geography of Canada. 1  Major Landforms of Regions in Canada 4:40. 2  Evolution of Different Places in Canada 5:57. 3  Mapping the Physical & Human Characteristics of Canada 6:33. 4  Major Climates in Canada's Different Regions 6:31. 5  6:07 Next Lesson. Economic Characteristics of Canada's Different Regions.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":2143507,"ranking":19,"query_text":"what are the two largest climate regions in canada?","passage_text":"The climate of Montreal (Canada) Montreal is the second largest city in Canada and the largest city of Quebec. The city was named after Mont Royal, a hill situated in the middle of the city. The city is the second largest French speaking city in the world after Paris. Montreal was the commercial center of Canada for a long time.","bm25_label":"high","relevance_label":0.0},{"query_id":575096,"passage_id":7276444,"ranking":20,"query_text":"what are the two largest climate regions in canada?","passage_text":"Most of Canada's border with the United States falls into which of Canada's six main climate regions? continental warm summer Where is the majority of Canada's oil found?","bm25_label":"high","relevance_label":0.0}]