[{"query_id":57614,"passage_id":7259551,"ranking":1,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Plasma Membrane Hormone Receptors. Amino acid-derived hormones and polypeptide hormones are not lipid-derived (lipid-soluble or fat-soluble); therefore, they cannot diffuse through the plasma membrane of cells. Lipid-insoluble hormones bind to receptors on the outer surface of the plasma membrane, via plasma membrane hormone receptors. Unlike steroid hormones, lipid-insoluble hormones do not directly affect the target cell because they cannot enter the cell and act directly on DNA.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":8351690,"ranking":2,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Hormones travel to target cells in other parts of the body and cause a variety of changes in the target areas. Changes caused by hormones include changes in gene expression in target cells as well as Steroid hormones are soluble in lipids and can easily pass through cellular and nuclear membranes.n contrast, many other hormones are water soluble. Steroid hormones typically act by affecting gene expression while water-soluble hormones usually act by causing changes in biological processes in the cytoplasm of cells.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":8621233,"ranking":3,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Actions of Hormones on Target Cells Hormones influence their target cells by binding to specific receptors. The hormone-receptor interaction initiates the process of transforming the chemicalmessage into a cell response. Page 2. Goals\/ What You Need to KnowGoals To learn about hormone receptors.Page 3.) Receptors for water-soluble hormones are found on the _____________ of target cells, while receptors for lipid-soluble hormones are found in the ________ or ________ of cells.5. (Page 3.) Target cells tend to ______ _______ the number of theirreceptors when there are sustained high levels of hormone present.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":3451413,"ranking":4,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Hormones are compounds used for long distance signaling in both plants and animals. In animals, specialized cells produce hormones and release them into the circulatory system. Hormones travel to target cells in other parts of the body and cause a variety of changes in the target areas. Changes caused by hormones include changes in gene expression in target cells as well as Steroid hormones are soluble in lipids and can easily pass through cellular and nuclear membranes. In contrast, many other hormones are water soluble. Steroid hormones typically act by affecting gene expression while water-soluble hormones usually act by causing changes in biological processes in the cytoplasm of cells.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":5127455,"ranking":5,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"The target cell has receptors specific to a given hormone and will be activated by either a lipid-soluble (permeable to plasma membrane) or water-soluble hormone (binds to a cell-surface receptor). Lipid-soluble hormones diffuse through the plasma membrane to enter the target cell and bind to a receptor protein.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":7384316,"ranking":6,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Fat-Soluble Hormones are also known as Lipid-Soluble Hormones and are lipophilic. 1  Dissolve in fats rather than in water. 2  Are usually formed from cholesterol (cholesterol molecules being important components of cell membranes) ... ... 3  Affect cells by binding to receptors inside the target cell.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":3297718,"ranking":7,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Lipid-soluble hormones (steroid hormones and hormones of the thyroid gland) diffuse through the cell membranes of target cells. The lipid-soluble hormone then binds to a receptor protein that, in turn, activates a DNA segment that turns on specific genes.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":2354015,"ranking":8,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Hormones activate target cells by diffusing through the plasma membrane of the target cells (lipid-soluble hormones) to bind a receptor protein within the cytoplasm of the cell, or by binding a specific receptor protein in the cell membrane of the target cell (water-soluble proteins).","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":7943869,"ranking":9,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Water-soluble hormones affect target cells by binding to __________. plasma membrane receptors. How do endocrine hormones reach their target cells? Hormones are transported through the blood stream to target cells.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":7913210,"ranking":10,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Since the cell membrane has a lipid bi-layer, it is hydrophobic, or water fearing. This simply means that anything that is water soluble is not getting through. Unlike lipid soluble hormones, water soluble hormones have to bind to receptors on the surface of the target cell.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":853806,"ranking":11,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Hormones travel to target cells in other parts of the body and cause a variety of changes in the target areas. Changes caused by hormones include changes in gene expression in target cells as well as Steroid hormones are soluble in lipids and can easily pass through cellular and nuclear membranes.ormones travel to target cells in other parts of the body and cause a variety of changes in the target areas. Changes caused by hormones include changes in gene expression in target cells as well as Steroid hormones are soluble in lipids and can easily pass through cellular and nuclear membranes.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":6327242,"ranking":12,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"â\u0080¢ Lipophilic Hormones (Hydrophobic Hormones): â\u0080¢Hormones that are not soluble in aqueous medium, but soluble in lipid; â\u0080¢They can easily cross the cell membrane, â\u0080¢Thus, they can enter target cells and bind to intracellular receptors to carryout their action; â\u0080¢Examples: Thyroid hormones, Steroid hormones; Lipophilic Hormones (Hydrophobic Hormones): â\u0080¢Hormones that are not soluble in aqueous medium, but soluble in lipid; â\u0080¢They can easily cross the cell membrane, â\u0080¢Thus, they can enter target cells and bind to intracellular receptors to carryout their action; â\u0080¢Examples: Thyroid hormones, Steroid hormones;","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":7200589,"ranking":13,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Water-soluble hormones: -do NOT pass readily through the lipid-rich plasma membrane that surrounds the target cell. -Instead, they bind with receptors on the surface of the target cell. -The receptors are glycoprotein complexes. Process of water-soluble hormones: -The receptors have a binding domain that projects beyond the outside of the plasma membrane and a catalytic domain that projects into the cytoplasm of the cell. -Directly or indirectly, most receptors initiate cellular responses by activating protein kinases, which catalyze the transfer of phosphate groups from ATP to specific proteins.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":2081556,"ranking":14,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"1 Lipid-soluble hormones (steroid hormones and hormones of the thyroid gland) diffuse through the cell membranes of target cells. 2  The lipid-soluble hormone then binds to a receptor protein that, in turn, activates a DNA segment that turns on specific genes.hey are a means of communication between cells. The endocrine system produces hormones that are instrumental in maintaining homeostasis and regulating reproduction and development. A hormone is a chemical messenger produced by a cell that effects specific change in the cellular activity of other cells (target cells).","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":7384323,"ranking":15,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Lipid-soluble hormones diffuse through the plasma membrane to enter the target cell and bind to a receptor protein. Water-soluble hormones bind to a receptor protein on the plasma membrane of the cell.","bm25_label":"high","relevance_label":1.0},{"query_id":57614,"passage_id":1240478,"ranking":16,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"hormones are classified as amino based (most hormones are amino based) and steroids. Describe the two major mechanisms by which hormones bring about their effects on their target tissues depending upon the chemical nature of the hormone. Lipid-soluble hormones (steroid hormones and hormones of the thyroid gland) diffuse through the cell membranes of target cells. The lipid-soluble hormone then binds to a receptor protein that, in turn, activates a DNA segment that turns on specific genes-----.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":2043708,"ranking":17,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Lipids are molecules that contain hydrocarbons and make up the building blocks of the structure and function of living cells. Examples of lipids include fats, oils, waxes, certain vitamins, hormones and most of the non-protein membrane of cells. What are lipids soluble in? Lipids are not soluble in water. They are non-polar and are thus soluble in nonpolar environments like in choloroform but not soluble in polar environments like water. What do lipids consist of?","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":4066537,"ranking":18,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Amino acidâ\u0080\u0093based hormones (amines and peptide or protein hormones) are water-soluble and act on the surface of target cells via second messengers; steroid hormones, being lipid-soluble, move through the plasma membranes of target cells (both cytoplasmic and nuclear) to act within their nuclei.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":2365041,"ranking":19,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Steroid hormones are derived from cholesterol and are lipid-soluble molecules. Examples of steroid hormones include the sex hormones (androgens, estrogens, and progesterone) produced by male and female gonads and hormones of the adrenal glands (aldosterone, cortisol, and androgens).teroid hormones cause changes within a cell by first passing through the cell membrane of the target cell. Steroid hormones, unlike non-steroid hormones, can do this because they are fat-soluble.","bm25_label":"high","relevance_label":0.0},{"query_id":57614,"passage_id":7375729,"ranking":20,"query_text":"by what process do lipid-soluble hormones affect their target cells","passage_text":"Hormone: Defined as a water or lipid soluble substance. The endocrine system communicates with nearly 50 million target cells in the body using a chemical language called hormones. A hormone is a chemical, synthesized within an organism, which alters the rate of cellular processes. Types: Steroid.","bm25_label":"high","relevance_label":0.0}]