[{"query_id":577131,"passage_id":202006,"ranking":1,"query_text":"what are year quarters","passage_text":"What is a 'Quarter On Quarter - QOQ' Quarter on quarter (QOQ) is a measuring technique that calculates the change between one financial quarter and the previous financial quarter. This is similar to the year-over-year (YOY) measure, which compares the quarter of one year (such as the first quarter of 2005) to the same quarter of the previous year (the first quarter of 2004).","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":2129670,"ranking":2,"query_text":"what are year quarters","passage_text":"Quarter On Quarter - QOQ. What is a 'Quarter On Quarter - QOQ'. Quarter on quarter (QOQ) is a measuring technique that calculates the change between one financial quarter and the previous financial quarter. This is similar to the year-over-year (YOY) measure, which compares the quarter of one year (such as the first quarter of 2005) to the same quarter of the previous year (the first quarter of 2004).","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":7031283,"ranking":3,"query_text":"what are year quarters","passage_text":"Quarter On Quarter - QOQ. What is a 'Quarter On Quarter - QOQ'. Quarter on quarter (QOQ) is a measuring technique that calculates the change between one financial quarter and the previous financial quarter. This is similar to the year-over-year (YOY) measure, which compares the quarter of one year (such as the first quarter of 2005) to the same quarter of the previous year (the first quarter of 2004). The measure gives investors and analysts an idea of how a company is growing over each quarter.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":7243707,"ranking":4,"query_text":"what are year quarters","passage_text":"The NASDAQ Revenue and EPS Summary provides the Revenue, EPS and Dividends of a company by year and quarter for the past three years, on a single page. This allows investors to quickly and easily compare these important financial numbers, quarter-to-quarter, and year-to-year. FAQs. What is the source of the data?","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":3712803,"ranking":5,"query_text":"what are year quarters","passage_text":"Quarter means one year divided by 4 (quartering thâ\u0080¦e year) Some companies have fiscal year not calendar year quarters. In this case, find out what is their year end date. For example, if it's fiscal year end on May 31, the first Q starts June 1 to August 31, and so on.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":2951379,"ranking":6,"query_text":"what are year quarters","passage_text":"What is a 'Quarter - Q1, Q2, Q3, Q4'. A quarter (Q1, Q2, Q3, Q4) is a three-month period on a financial calendar that acts as a basis for the reporting of earnings and the paying of dividends. A quarter refers to one-fourth of a year and is typically expressed as Q.. The four quarters that make up the year are: January, February and March (Q1); April, May and June (Q2); July, August and September (Q3); and October, November and December (Q4). A quarter is often shown with its relevant year, as in Q1 2015 or Q1\/15, which represents the first quarter of the year 2015.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":2573253,"ranking":7,"query_text":"what are year quarters","passage_text":"What Is A Calendar Quarter? Disclaimer. Every calendar year is divided into the following four parts, known as quarters 1st Quarter: January 1 through March 31 2nd Quarter: April 1 through June 30 3rd Quarter: July 1 through September 30 4th Quarter: October 1 through December 31.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":3459747,"ranking":8,"query_text":"what are year quarters","passage_text":"1st quarter (Q) = Jan 1 to March 31, 2nd Q = April 1 to June 30, 3rd Q = July 1 to Sept 30, 4th Q = Oct 1 to Dec 31. Quarter means one year divided by 4 (quartering the year) Some companies have fiscal year not calendar year quarters. In this case, find out what is their year end date. For example, if it's fiscal year end on May 31, the first Q starts June 1 to August 31, and so on.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":5161850,"ranking":9,"query_text":"what are year quarters","passage_text":"What is a 'Quarter - Q1, Q2, Q3, Q4'. A quarter (Q1, Q2, Q3, Q4) is a three-month period on a financial calendar that acts as a basis for the reporting of earnings and the paying of dividends. A quarter refers to one-fourth of a year and is typically expressed as Q..","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":3331286,"ranking":10,"query_text":"what are year quarters","passage_text":"What: Shares of Zebra Technologies Corp. (NASDAQ:ZBRA) jumped 14% Wednesday after the company reported better-than-expected first-quarter results. So what: Quarterly revenue rose 209.8% year over year to $893.2 million.hat: Shares of Zebra Technologies Corp. (NASDAQ:ZBRA) jumped 14% Wednesday after the company reported better-than-expected first-quarter results. So what: Quarterly revenue rose 209.8% year over year to $893.2 million.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":4497443,"ranking":11,"query_text":"what are year quarters","passage_text":"What year did they stop making silver quarters? 1964 was the last year for circulating silver quarters, as well as  dimes. Half-dollars were 40% silver clad until 1971. Since 1992,  though, Proof silver quarters, half-dolâ\u0080¦lars, and dimes have been  offered to collectors through the US Mint. (MORE)","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":7637414,"ranking":12,"query_text":"what are year quarters","passage_text":"What it is: A quarter is a three-month period. There are four in one fiscal year. In the finance world, quarter 1 usually spans January 1-March 31; quarter 2 usually spans April 1-June 30; quarter 3 usually spans July 1-September 30; and quarter 4 usually spans October 1-December 31.","bm25_label":"high","relevance_label":1.0},{"query_id":577131,"passage_id":1538104,"ranking":13,"query_text":"what are year quarters","passage_text":"What is a 'Quarter - Q1, Q2, Q3, Q4'. A quarter (Q1, Q2, Q3, Q4) is a three-month period on a financial calendar that acts as a basis for the reporting of earnings and the paying of dividends. A quarter refers to one-fourth of a year and is typically expressed as Q.. The four quarters that make up the year are: January, February and March (Q1); April, May and June (Q2); July, August and September (Q3); and October, November and December (Q4).","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":1733351,"ranking":14,"query_text":"what are year quarters","passage_text":"In California, the weekly benefits depend on what your earnings were in the highest quarter of the base period of one year. For example, the lowest weekly benefit would be $40 if earnings were $900 in the highest quarter.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":7799486,"ranking":15,"query_text":"what are year quarters","passage_text":"That's so it can compare growth to the previous year. In other words, in any given quarter, the BEA reports what GDP is for the year. That removes the effect of seasons. If the BEA didn't do this, you would see a huge jump in GDP and the growth rate in every fourth quarter.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":586341,"ranking":16,"query_text":"what are year quarters","passage_text":"Posted by Administrator on 23. July 2015. What it is, how itâ\u0080\u0099s calculated and why itâ\u0080\u0099s important to banks and credit unions. Calculation. Asset Growth Rate (Year-over-Year) = (Total Assets - Total Assets from Same Quarter of Prior Year) \/ Total Assets from Same Quarter of Prior Year.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":2549390,"ranking":17,"query_text":"what are year quarters","passage_text":"What we do with 10 pounds of chicken leg quarters. On occasion, a local grocery store will have a sale on chicken leg quarters. For 29 or 39 cents per pound, I can get a 10-pound bag for $3-4. Here is what I make with a 10-pound bag of chicken leg quarters! (Our family has two adults and a two-year-old.)","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":5756909,"ranking":18,"query_text":"what are year quarters","passage_text":"What is a Costco membership really worth? Costco's fiscal year 2014 first-quarter earnings report showed that net sales rose 5% to $24.47 billion as comp sales increased 3% overall. On a year-over-year basis, membership fees for the first quarter jumped to $549 million, up from $511 million in FY 2013's first quarter. Despite the 7.3% increase in membership fees, these fees account for just 2.24% of sales for Costco.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":4497440,"ranking":19,"query_text":"what are year quarters","passage_text":"First, quarters were never pure silver. The silver was always alloyed with about 10% coâ\u0080¦pper. Second, during the changeover to cupronickel clad coinage, silver quarters were struck during calendar 1965 but they still had the date 1964, so there's no way to tell what year a 1964 quarter was actually minted.","bm25_label":"high","relevance_label":0.0},{"query_id":577131,"passage_id":4825541,"ranking":20,"query_text":"what are year quarters","passage_text":"What are in-Law Quarters? In-law quarters can be useful for accomodating elderly relatives. It is not unusual for elderly parents to live with their married children during the later years of the parents' lives. One in three of all baby boomers anticipate that a parent will move in with them.","bm25_label":"high","relevance_label":0.0}]