[{"query_id":586785,"passage_id":7409132,"ranking":1,"query_text":"what causes copper in the pool","passage_text":"What causes copper in your swimming pool? Copper is a metal that can be found in your swimming pool water, improper water. balance is the major cause. Acidic water due from low pH and alkalinity can cause the. heater core to corrode and release copper metals into the water. Another cause is source.","bm25_label":"high","relevance_label":1.0},{"query_id":586785,"passage_id":8105767,"ranking":2,"query_text":"what causes copper in the pool","passage_text":"Most pool supply distributors can offer an astounding selection of algaecides for your swimming pool, and if you do not understand how they work or what each algaecide should be used for making the right choice can be difficult. An algaecide is either a copper based algaecide, or a quat or polyquat algaecide. Copper based algaecides use copper to treat and prevent algae growth, and can be used against all types of algae. Copper algaecides will not cause foam in a swimming pool, which may be a problem with the quat algaecides.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":7409131,"ranking":3,"query_text":"what causes copper in the pool","passage_text":"What is worse is the corrosion process dissolves some of the metal into the pool water. For parts that contain copper, like metal piping in older pools and copper heat exhangers in pool heaters, small amounts of copper from these surfaces will be released into the pool water.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":2385235,"ranking":4,"query_text":"what causes copper in the pool","passage_text":"If you discover excessive copper in your pool, then you need to add a copper sequestering or chelating agent to keep those metals in solution. Cause: Low pool water pH. In my article, lowering swimming pool pH, I discuss how pool water with a low pH can cause metal pool surfaces to corrode.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":7409129,"ranking":5,"query_text":"what causes copper in the pool","passage_text":"Copper, iron or manganese pool problems. Pool water problems - copper, iron or manganese. Copper, iron or manganese in swimming pool water all cause the water to discolor without affecting the water's clarity much. If the water changes color after chlorine (or any other oxidizer) is added, the swimming pool water probably contains a metal.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":7409133,"ranking":6,"query_text":"what causes copper in the pool","passage_text":"Concern: Copper\/Zinc ionizers can introduce copper into the pool. These devices can inject copper into the pool water in the course of their normal operation. If used properly, these devices should not cause a problem. Follow the manufacturers directions to make sure you are not adding to your copper problem.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":7628612,"ranking":7,"query_text":"what causes copper in the pool","passage_text":"Pool Stains & staining caused by metals. Colored water. MOST, but not all, staining on pool surfaces is preventable. The problem is most people dont realize they have metals in their water. Even trace amounts of these metals (iron, copper, manganese, cobalt, silver) can cause staining. In fact theres enough copper in ONE penny to completely stain an average sized swimming pool! Obviously, the conditions have to be right.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":685906,"ranking":8,"query_text":"what causes copper in the pool","passage_text":"The last cause of green water in pool water is metals, usually copper, that have oxidized. Metals can be introduced through source water, from some cheap algaecides, or, if the water is acidic, from the metal components of the pool, most commonly from copper heater elements.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":6270673,"ranking":9,"query_text":"what causes copper in the pool","passage_text":"Know the different types of pool algaecide. 1  Copper-based algaecides use copper to treat algae growth, and are most effective against mustard and green types of algae. 2  Copper algaecides will not cause foam in a swimming pool, which can be a problem when using â\u0080\u009cquat algaecides.. Add preventative algaecide to your swimming pool on a weekly basis if you regularly experience problems with algae growth. If you have never had an algae problem in your swimming pool, there is no need for the algaecide.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":687981,"ranking":10,"query_text":"what causes copper in the pool","passage_text":"Purple is usually indicitative of copper in the water, usually caused by the etching of copper coming from the heat exchanger of your pool heater. I have spoken with manufactuâ\u0080¦rers heater engineers and they tell me that high Cyanuric Acid levels will not cause damage to copper heat exchangers.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":7409135,"ranking":11,"query_text":"what causes copper in the pool","passage_text":"These local deposits of metal could cause a discoloration of the pool surface in that area. Also, some common algaecides used in swimming pools contain moderate amounts of copper, and when used in excess, can cause staining (usually blue or green) of the pool surface. High concentrations of iron can cause general rust spots to develop over large area of the pool surface.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":2385237,"ranking":12,"query_text":"what causes copper in the pool","passage_text":"As you can see, there are numerous ways for copper to find its way into a pool. Even healthy pools with perfectly balanced water can have issues with copper. You need to test your swimming pool copper level, and if your pool test reveals copper present, then you need to lower the copper level in your pool. Source:","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":7409128,"ranking":13,"query_text":"what causes copper in the pool","passage_text":"Cause: Algaecides to control pool algae growth. Algae growth in a pool is inevitable. Warm, uncontaminated swimming pool water is a great place for algae to grow. Algaecides are the preferred method to effectively control algae growth, but some of the most effective ones are copper-based.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":1119217,"ranking":14,"query_text":"what causes copper in the pool","passage_text":"If you have never had an algae problem in your swimming pool, there is no need for the algaecide. 2. Realize that if you have algae right now, you may need to use an algaecide. Some algaecides are preventative and others are used to treat an algae problem. Once algae has grown in your swimming pool, only a treatment algaecide combined with shocking will kill the algae. Know the different types of pool algaecide. Copper-based algaecides use copper to treat algae growth, and are most effective against mustard and green types of algae. Copper algaecides will not cause foam in a swimming pool, which can be a problem when using â\u0080\u009cquat algaecides.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":1127956,"ranking":15,"query_text":"what causes copper in the pool","passage_text":"The answer is: copper! Copper is a metal that is found in some swimming pools, particularly ones that are filled using well water. Copper can also enter the pool water from certain copper-based algaecides.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":2199554,"ranking":16,"query_text":"what causes copper in the pool","passage_text":"Stains from Pool Ionizers. Too much copper in the pool can turn your hair green, especially for blonde swimmers. Too much copper â\u0080\u0093 from copper algaecide, ionizers, copper pipes or heat exchangers can also stain your plaster or white plastic surfaces. Removing heavy mineral staining can require an acid wash for plaster pools.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":794308,"ranking":17,"query_text":"what causes copper in the pool","passage_text":"What goes down the drain affects the wastewater system and the Bay. 1  Residential pollution prevention. 2  What not to flush. 3  Cleaning products.  Copper free 1  pools. Mercury.  Fats, oils and 1  grease. Gardening products.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":6455038,"ranking":18,"query_text":"what causes copper in the pool","passage_text":"I have an above ground non storable pool which needs bonding. From what I have read, I need to connect 8 AWG solid copper wire from the pump housing, then to the pool frame rail, then to the ladder. Here's the part I want to be clear about: The 8 AWG wire is NOT connected to the ground that is servicing the outlet near the pool.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":1127954,"ranking":19,"query_text":"what causes copper in the pool","passage_text":"If you have copper in the water, and the chlorine created by the salt oxidizes it, it may turn your hair green just like a regular chlorine swimming pool. If youâ\u0080\u0099re the pool owner, you can start by getting your pool checked for metals, especially copper.","bm25_label":"high","relevance_label":0.0},{"query_id":586785,"passage_id":2199557,"ranking":20,"query_text":"what causes copper in the pool","passage_text":"Cloudy Water. Cloudy water is a common problem seen in pools that use pool ionizers. The ionizer is used to clean the water in the pool but it cannot do it on its own. The only way to keep the water from getting cloudy is with shock treatments of chlorine used about once a week in the pool. This chlorine shock should clear away the cloudy water, leaving it sparkling. Cloudy water can also be caused by low copper levels, dirty pump filters or by not running the ionizer enough.","bm25_label":"high","relevance_label":0.0}]