[{"query_id":58801,"passage_id":2006975,"ranking":1,"query_text":"calgary population","passage_text":"Calgary Population 2017. The population of Calgary (2017) is 1,235,171. This makes Calgary the third largest city in Canada, the largest city in Alberta, and the 20th largest city in North America. Latest data from Statistics Canada shows that the population of the Calgary Census Metropolitan Area was 1,440,000 in 2015.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":3790414,"ranking":2,"query_text":"calgary population","passage_text":"Calgary Population. The current population of the city of Calgary is estimated to be approximately 1,149,552, which is an increase of about 2.6% from the last record of the population. Calgary is the largest city in Alberta, the third-largest municipality and the fifth-largest metropolitan area in all of the country.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":7374039,"ranking":3,"query_text":"calgary population","passage_text":"Population Rings for Calgary ... To help identify the number of people who live in Calgary and the surrounding area, we have drawn concentric rings centered on Calgary. We counted the number of communities within each ring and summed their populations. <3> We don't have the population of Calgary, so its people haven't been included.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":5101586,"ranking":4,"query_text":"calgary population","passage_text":"Brooks is Alberta's smallest city by area. Calgary is Canada's third-largest city, Alberta's largest city by both population and area, and was Alberta's first city, incorporated on January 1, 1894. The Calgary census metropolitan area (CMA) includes the cities of Airdrie, Calgary and Chestermere.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":5972783,"ranking":5,"query_text":"calgary population","passage_text":"List of Cities near Calgary in Alberta, Canada. The closest cities, towns, suburbs\/localities and places to Calgary in Alberta, Canada are listed below in order of increasing distance. The closest major cities to Calgary in Alberta, Canada based on population are listed below in order of increasing distance.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":6067706,"ranking":6,"query_text":"calgary population","passage_text":"The city is Alberta's fourth largest by population after Calgary, Edmonton, and Red Deer. It is the third largest in area after Calgary and Edmonton and is near the Canadian Rockies, 210 kilometres (130 mi) southeast of Calgary. Lethbridge is split into three geographical areas: north, south and west.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":7374040,"ranking":7,"query_text":"calgary population","passage_text":"The Calgary-Edmonton Corridor is the most urbanized region in the province and one of the densest in Canada. The region covers a distance of roughly 400 kilometres north to south. In 2001, the population of the Calgary-Edmonton Corridor was 2.15 million (72% of Alberta's population). It is also one of the fastest growing regions in the country.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":7374038,"ranking":8,"query_text":"calgary population","passage_text":"Census information for Calgary (San Augustine County, State of Texas). While Calgary didn't participate in the 2010 Census, we have Census information for the neighboring area. Contains: Population Rings, and much more.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":835488,"ranking":9,"query_text":"calgary population","passage_text":"Eau Claire, Calgary â\u0080\u0093 a neighborhood in Calgary, Alberta (Canada), whose name was derived from a relocated Eau Claire, WI sawmill. List of municipalities in Wisconsin by population List of Tree Cities USA","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":4361060,"ranking":10,"query_text":"calgary population","passage_text":"Calgary is a city found in Alberta, Canada. It is located 51.05 latitude and -114.09 longitude and it is situated at elevation 1042 meters above sea level. Calgary has a population of 1,019,942 making it the biggest city in Alberta. It operates on the LMT time zone.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":3244084,"ranking":11,"query_text":"calgary population","passage_text":"High River is a town within the Calgary Region of Alberta, Canada with a population of 12,920 (2011). It is 37 kilometres (23 mi) south of the City of Calgary, at the junction of Alberta Highways 2 and 23. High River is located approximately 54 km (34 mi) south of downtown Calgary.n the 2011 Census, the Town of High River had a population of 12,920 living in 5,261 of its 5,473 total dwellings, a 20.6% change from its 2006 population of 10,716.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":3790418,"ranking":12,"query_text":"calgary population","passage_text":"About 24% of the population of Calgary is immigrants and about 92% of the population is actually a Canadian citizen. About 90% of the population solely speaks English and only 0.06% of the population speaks only French. However, 8% of the population speaks both English and French.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":6067699,"ranking":13,"query_text":"calgary population","passage_text":"Lethbridge \/Ë\u0088lÉ\u009bÎ¸brÉªdÊ\u0092\/ is a city in the province of Alberta, Canada, and the largest city in southern Alberta. It is Alberta's fourth-largest city by population after Calgary, Edmonton and Red Deer, and the third-largest by area after Calgary and Edmonton. The nearby Canadian Rockies contribute to the city's warm summers, mild winters, and windy climate. Lethbridge lies southeast of Calgary on the Oldman River.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":2006979,"ranking":14,"query_text":"calgary population","passage_text":"About 290 km (180 mi) south of the capital is Calgary, the largest city in Alberta. Calgary and Edmonton centre Alberta's two census metropolitan areas, both of which have populations exceeding one million, while the province has 16 census agglomerations.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":1835570,"ranking":15,"query_text":"calgary population","passage_text":"Of this urban Aboriginal population, almost 34% (213,945) lived in five cities: Winnipeg, Edmonton, Vancouver, Calgary and Toronto.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":6210915,"ranking":16,"query_text":"calgary population","passage_text":"The Calgary-Edmonton Corridor is the most urbanized region in the province and one of the densest in Canada. The region covers a distance of roughly 400 kilometres north to south. In 2001, the population of the Calgary-Edmonton Corridor was 2.15 million (72% of Alberta's population).lberta's capital city, Edmonton, is located approximately in the geographic centre of the province. It is the most northerly major city in Canada, and serves as a gateway and hub for resource development in northern Canada.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":3087805,"ranking":17,"query_text":"calgary population","passage_text":"Distance to\/from major markets. The Calgary-Edmonton Corridor. Airdrie is located directly on Alberta's busiest artery, the Queen Elizabeth II Highway (formerly Provincial Highway 2), a major advantage for business and industry.As one of Canada's fastest growing regions, the Calgary-Edmonton Corridor is the most urbanized and heavily populated area in Alberta.he Corridor is defined as the major north\/south transportation route of the Queen Elizabeth II Highway between the cities of Edmonton and Calgary. Airdrie is located just six kilometers north of the Calgary city limits.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":3790417,"ranking":18,"query_text":"calgary population","passage_text":"Calgary's population is still on the rise, according to the latest city census. It shows the city's population at 1,230,915, which is up 35,721 people from the previous year. Mayor Naheed Nenshi says the swiftly rising population presents challenges.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":5441331,"ranking":19,"query_text":"calgary population","passage_text":"For the neighbourhood in Calgary, Alberta, see Coral Springs, Calgary. Coral Springs, officially the City of Coral Springs, is a city in Broward County, Florida, United States, approximately 20 miles (32 km) northwest of Fort Lauderdale. As of the 2010 United States Census, the city had a population of 121,096.","bm25_label":"medium","relevance_label":0.0},{"query_id":58801,"passage_id":7374041,"ranking":20,"query_text":"calgary population","passage_text":"Alberta is also home to a growing Jewish population of about 15,400 people who constituted 0.3% of Alberta's population. Most of Alberta's Jews live in the metropolitan areas of Calgary (8,200) and Edmonton (5,500). Municipalities Edit","bm25_label":"medium","relevance_label":0.0}]