[{"query_id":589423,"passage_id":7538059,"ranking":1,"query_text":"what causes lines underneath the nail","passage_text":"If you have what look like red or brown little streaks underneath the nails, it's likely these are splinter haemorrhages â\u0080\u0093 lines of blood caused by tiny damaged blood vessels. Just a few splinters under one nail are nothing to worry about and most likely due to injury of the nail.","bm25_label":"high","relevance_label":1.0},{"query_id":589423,"passage_id":1834010,"ranking":2,"query_text":"what causes lines underneath the nail","passage_text":"There are many causes of black or dark toenails, but the most common cause is trauma. When trauma occurs to a nail resulting in discoloration it is referred to as a subungual hematoma, which simply means there is a collection of blood underneath the nail.here are many causes of black or dark toenails, but the most common cause is trauma. When trauma occurs to a nail resulting in discoloration it is referred to as a subungual hematoma, which simply means there is a collection of blood underneath the nail.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":165629,"ranking":3,"query_text":"what causes lines underneath the nail","passage_text":"Black toenails are caused by trauma to the nail. Common causes of toenails turning black include ill-fitting shoes, fungus, dropping an object on the toe and cutting the nail too short. Impact to the toenail causes bleeding underneath the nail's surface. Part or all of the toenail may turn black. Subungual hematoma is the medical term for black toenail, literally meaning blood underneath a nail.. Athletes often suffer from black toenails, especially those who run on hills or play soccer.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":2992339,"ranking":4,"query_text":"what causes lines underneath the nail","passage_text":"When: When a toe is traumatized by the nail, a small blood vessel underneath the nail can break and cause bleeding under the nail. Blood collects between the nail plate (the nail itself) and the nail bed (the soft tissue under the nail plate), and pressure from the blood can cause the nail plate to lift off the nail bed.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":531500,"ranking":5,"query_text":"what causes lines underneath the nail","passage_text":"Depending on the cause of onycholysis, the nail may have collected thickened skin underneath the edge of its nail plate, and the nail plate may have a deformed shape with pits or indentations in the nail surface, a bent nail edge or coarse thickening of the nail.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":3568814,"ranking":6,"query_text":"what causes lines underneath the nail","passage_text":"There are many causes of black or dark toenails, but the most common cause is trauma. When trauma occurs to a nail resulting in discoloration it is referred to as a subungual hematoma, which simply means there is a collection of blood underneath the nail.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":2113463,"ranking":7,"query_text":"what causes lines underneath the nail","passage_text":"The infection is generally located underneath the nail. A toenail fungus infection can cause foul smells and discoloration. The fungus that grows under the nail eats keratin, the protein that makes our nails strong and hard.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":2739933,"ranking":8,"query_text":"what causes lines underneath the nail","passage_text":"Black toenails are caused by trauma to the nail. Common causes of toenails turning black include ill-fitting shoes, fungus, dropping an object on the toe and cutting the nail too short. Impact to the toenail causes bleeding underneath the nail's surface. Part or all of the toenail may turn black.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":4876076,"ranking":9,"query_text":"what causes lines underneath the nail","passage_text":"Adorable animal families that will make you aww. Black toenails are caused by trauma to the nail. Common causes of toenails turning black include ill-fitting shoes, fungus, dropping an object on the toe and cutting the nail too short. Impact to the toenail causes bleeding underneath the nail's surface.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":8113631,"ranking":10,"query_text":"what causes lines underneath the nail","passage_text":"Repeated trauma to toenails, caused by ill-fitting shoes, can lead to deformities in the nails. The deformities may resemble a fungal infection; nails can be thickened or discolored and can lift away from the nail bed, which causes cosmetic concerns. Habits such as nail biting and cuticle biting also can cause trauma to the nails. Nail biting is a main cause of acute paronychia, a type of infection in which bacteria get underneath the tissue at the side of the nail and cause swelling and irritation.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":927773,"ranking":11,"query_text":"what causes lines underneath the nail","passage_text":"What would cause horizontal ridges on fingernails? Beau's lines: Beau's lines, which are grooves that run horizontally across the nail plate. They usually develop when nail plate growth, which begins in the nail matrix (located under the cuticle), is temporarily disrupted.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":480677,"ranking":12,"query_text":"what causes lines underneath the nail","passage_text":"Toenail fungus, or onychomycosis, is an infection underneath the surface of the nail caused by fungi. When the tiny organisms take hold, the nail often becomes darker in color and smells foul.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":11778,"ranking":13,"query_text":"what causes lines underneath the nail","passage_text":"Nail Fungus. A fungal infection causes a toenail to become discolored. The nail usually turns a dark color from dirt or debris that has become trapped underneath the nail. Other symptoms of fungal infection include a foul smell, thickened nail, crumbled nail or a dull toenail that is misshapen.njury. Injury to the nail may cause discoloration. Mild trauma to the nail can cause white spots to form on the nail. These white spots usually grow out with the nail and are not serious.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":8113628,"ranking":14,"query_text":"what causes lines underneath the nail","passage_text":"An acute paronychia causes throbbing pain, redness, warmth and swelling in the skin around a nail. In some cases, a small collection of pus forms under the skin next to the nail, or underneath the nail itself. Often, only one nail is affected. A chronic paronychia usually causes less dramatic symptoms than an acute paronychia.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":477015,"ranking":15,"query_text":"what causes lines underneath the nail","passage_text":"Black Toenail â\u0080\u0094 Causes, Treatment, and Prevention. There are many causes of black or dark toenails, but the most common cause is trauma. When trauma occurs to a nail resulting in discoloration it is referred to as a subungual hematoma, which simply means there is a collection of blood underneath the nail.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":1791980,"ranking":16,"query_text":"what causes lines underneath the nail","passage_text":"These 10 animal facts will amaze you. Black toenails are caused by trauma to the nail. Common causes of toenails turning black include ill-fitting shoes, fungus, dropping an object on the toe and cutting the nail too short. Impact to the toenail causes bleeding underneath the nail's surface. Part or all of the toenail may turn black.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":6322539,"ranking":17,"query_text":"what causes lines underneath the nail","passage_text":"Black Toenail â\u0080\u0094 Causes, Treatment, and Prevention. Dr. Dr. There are many causes of black or dark toenails, but the most common cause is trauma. When trauma occurs to a nail resulting in discoloration it is referred to as a subungual hematoma, which simply means there is a collection of blood underneath the nail.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":8734201,"ranking":18,"query_text":"what causes lines underneath the nail","passage_text":"Trending Now. Answers. Best Answer: There are many causes of black or dark toenails, but the most common cause is trauma. When trauma occurs to a nail resulting in discoloration it is referred to as a subungual hematoma, which simply means there is a collection of blood underneath the nail.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":6009924,"ranking":19,"query_text":"what causes lines underneath the nail","passage_text":"The nail sinus (sinus unguis) is where the nail root is; i.e. the base of the nail underneath the skin. It originates from the actively growing tissue below, the matrix. The nail plate (corpus unguis) is the hard part of the nail, made of translucent keratin protein. Several layers of dead, compacted cells cause the nail to be strong but flexible.","bm25_label":"high","relevance_label":0.0},{"query_id":589423,"passage_id":7794277,"ranking":20,"query_text":"what causes lines underneath the nail","passage_text":"Black Toenail â\u0080\u0094 Causes, Treatment, and Prevention. There are many causes of black or dark toenails, but the most common cause is trauma. When trauma occurs to a nail resulting in discoloration it is referred to as a subungual hematoma, which simply means there is a collection of blood underneath the nail. This collection not only causes the nail to become discolored, it also generates a tremendous amount of pressure, leading to intense pain.","bm25_label":"high","relevance_label":0.0}]