[{"query_id":607338,"passage_id":735483,"ranking":1,"query_text":"what county is holliston ma","passage_text":"Norfolk Assessor 1 Liberty Lane Norfolk MA 02056 5.0 miles from Medfield 508-528-1120. Norfolk County Assessor's Office 1 Liberty Lane Norfolk MA 02056 5.0 miles from Medfield 508-528-1120. Holliston Assessor 703 Washington Street Holliston MA 01746 6.7 miles from Medfield 508-429-0604.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7556355,"ranking":2,"query_text":"what county is holliston ma","passage_text":"Start Your Review of Holliston, MA William Holliston, MA Send Message 8\/28\/2009 Quality of life Holliston is a small town in New England - the quality of life is excellent. Highly rated schools and pleasant...","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":5974524,"ranking":3,"query_text":"what county is holliston ma","passage_text":"Holliston Public Schools. 370 Hollis St. Holliston, MA 01746. It is the policy of the Holliston Public Schools not to discriminate on the basis of race, gender, religion, national origin, color, homelessness, sexual orientation, gender identity, age or disability in its educational programs, services, activities or employment practices.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7556353,"ranking":4,"query_text":"what county is holliston ma","passage_text":"The Town of Holliston Town of Holliston - Tax Assessors' Office Office is located in the Holliston Town Hall building in Holliston, Massachusetts. Town of Holliston is a locality in Middlesex County, Massachusetts. Unlike many other areas where property taxes are collected on a county level, Town of Holliston has its own tax assessor's office. If your property is located in a different Middlesex County locality, see that page for tax assessor's information.","bm25_label":"high","relevance_label":1.0},{"query_id":607338,"passage_id":5974519,"ranking":5,"query_text":"what county is holliston ma","passage_text":"List Map. Coldwell Banker Residential Brokerage can help you find Holliston, MA homes for sale, condos, rentals and open houses. Refine your Holliston real estate search results by price, property type, bedrooms, baths and other features.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":6154468,"ranking":6,"query_text":"what county is holliston ma","passage_text":"Welcome to Millis, MA. The Town of Millis is located in western Norfolk County, Massachusetts, along the Charles River. Formerly an industrial town, today we are primarily a suburban community with rural areas remaining on our outskirts. Millis is bordered by Medway on the west, Holliston and Sherborn on the north, Medfield on the east, and Norfolk on the south.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":2686943,"ranking":7,"query_text":"what county is holliston ma","passage_text":"Ant bicycles is a small bicycle fabrication shop run by Mike Flanigan and Betsy Eckel Scola in Holliston, MA. We are dedicated to building bikes for transportation that have the right combination of function and style.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":5311115,"ranking":8,"query_text":"what county is holliston ma","passage_text":"BFIâ\u0080\u0099s Holliston Transfer Station, located at 115 Washington Street, Holliston, MA 01746; BFIâ\u0080\u0099s Auburn Transfer Station, located at 15 Hardscrabble Road, Auburn, MA 01501; and BFIâ\u0080\u0099s Braintree Transfer Station, located at 257 Ivory Street, Braintree, MA 02184; d. Charlotte, NC Alliedâ\u0080\u0099s Charlotte Transfer Station, located at 3130 I-85 Service Road North, Charlotte, NC 28206; e. Chicago, IL BFIâ\u0080\u0099s Melrose Park 73300 Transfer Station, located at 4700 W. Lake Street, Melrose Park, IL 60160; BFIâ\u0080\u0099s Rolling Meadows Transfer Station, located at 3851 Berdnick Street,","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":5974517,"ranking":9,"query_text":"what county is holliston ma","passage_text":"Holliston, Massachusetts. Holliston is a New England town in Middlesex County, Massachusetts, United States in the Greater Boston area. The population was 13,547 at the 2010 census. It is part of the Massachusetts region, located due west of Boston, that is known as the MetroWest.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":530551,"ranking":10,"query_text":"what county is holliston ma","passage_text":"Narducci Corp. is a Massachusetts Domestic Profit Corporation filed on May 30, 1969 . The company's File Number is listed as 042451771. The Registered Agent on file for this company is Mary C. Narducci and is located at 17 North Street, Medway, MA 02053. The company's principal address is 162 Holliston Street, Medway, MA 02053. The company has 2 principals on record. The principals are Mary C Narducci from Medway MA and Michael Narducci from Medway MA.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7556349,"ranking":11,"query_text":"what county is holliston ma","passage_text":"Useful Middlesex County Links: 1  Town of Holliston View by map number. 2  City of Melrose - Property Tax Search. 3  City of Marlborough - Property Tax Search. 4  Town of Holliston View by map number. 5  Town of Wayland - Property Tax Search. 6  Town of Holliston View by map number. 7  Town of Ashland - GIS Map. 8  Town of Arlington - Property Tax Search.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7556352,"ranking":12,"query_text":"what county is holliston ma","passage_text":"NETR Online â\u0080¢ Massachusetts â\u0080¢ Holliston Township Public Records, Search Holliston Township Records, Holliston Township Property Tax, Holliston Township Search, Holliston Township Assessor Home Environmental Data","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7735056,"ranking":13,"query_text":"what county is holliston ma","passage_text":"I have a passion for Real Estate and love to share my marketing expertise! I service the following towns in Metrowest MA: Hopkinton, Milford, Southboro, Westboro, Ashland, Holliston, Upton, Mendon, Hopedale, Medway, Franklin, Framingham, Grafton, Northbridge, Shrewsbury, Northboro, Bellingham, Uxbridge, and Douglas.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":6154463,"ranking":14,"query_text":"what county is holliston ma","passage_text":"Give me a call if you need a top real estate agent in one of these towns: Ashland, Bellingham, Douglas, Framingham, Franklin, Grafton, Holliston, Hopkinton, Hopedale, Medway, Mendon, Milford, Millbury, Millville, Northborough, Northbridge, Shrewsbury, Southborough, Sutton, Wayland, Westborough, Whitinsville, Worcester, Upton and Uxbridge MA.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7020920,"ranking":15,"query_text":"what county is holliston ma","passage_text":"What county is Boston MA in? Boston, MA is in Suffolk County. What is a mas camp? A Mas camp is a camp set up for masquerade costume designers,  costume assemblers, carnival costume order takers to get together a  month or two before a major carnival mardâ\u0080¦i gras event.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":3960018,"ranking":16,"query_text":"what county is holliston ma","passage_text":"Middlesex County, MA Property Tax information Middlesex County, MA Property Tax Search by Address See what the tax bill is for any Middlesex County, MA property by simply typing its address into a search bar!","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7556351,"ranking":17,"query_text":"what county is holliston ma","passage_text":"Suburbs to the west and northwest are covered in the Cambridge-Newton-Framingham metro area (see page TK); northern suburbs to New Hampshire are covered in Essex County (page TK). (Read More about Holliston)","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":2357507,"ranking":18,"query_text":"what county is holliston ma","passage_text":"Worcester County, MA Property Tax Search by Address. See what the tax bill is for any Worcester County, MA property by simply typing its address into a search bar! In-depth Property Tax Information. See Worcester County, MA tax rates, tax exemptions for any property, the tax assessment history for the past years, and more. Interactive Map: Worcester County, MA Tax per Square Foot.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":7020922,"ranking":19,"query_text":"what county is holliston ma","passage_text":"What county is Boston MA in? Boston, MA is in Suffolk County. A Mas camp is a camp set up for masquerade costume designers,  costume assemblers, carnival costume order takers to get together a  month or two before a major carnival mardâ\u0080¦i gras event.","bm25_label":"high","relevance_label":0.0},{"query_id":607338,"passage_id":3960010,"ranking":20,"query_text":"what county is holliston ma","passage_text":"Middlesex County, MA Property Tax Search by Address. See what the tax bill is for any Middlesex County, MA property by simply typing its address into a search bar! In-depth Property Tax Information. See Middlesex County, MA tax rates, tax exemptions for any property, the tax assessment history for the past years, and more.","bm25_label":"high","relevance_label":0.0}]