[{"query_id":608197,"passage_id":4401391,"ranking":1,"query_text":"what county is lake harris florida","passage_text":"Lake Harris (Florida) Lake Harris is a lake in Lake County, Florida, United States, 31 miles (50 km) northwest of Orlando. It is part of the Upper Ocklawaha River Basin a sub-basin of the St. Johns River. It is known by locals as the Harris Chain of Lakes or Ocklawaha Chain of Lakes.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":7576783,"ranking":2,"query_text":"what county is lake harris florida","passage_text":"Harris Chain Bass Fishing Overview. The beautiful and scenic Harris Chain Lakes are located in Central Florida's Lake County about 40 minutes northwest of Orlando. The interconnected lakes of the Harris Chain cover approximately 50,000 acres of water and together make up the second largest lake in the State of Florida.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":4401395,"ranking":3,"query_text":"what county is lake harris florida","passage_text":"Lake Harris is a lake in Lake County, Florida, United States, 31 miles northwest of Orlando. It is part of the Upper Ocklawaha River Basin a sub-basin of the St. Johns River. It is known by locals as the Harris Chain of Lakes or Ocklawaha Chain of Lakes. Lake Harris is the largest lake entirely in Lake County, at 13,788 acres with an irregular shape when viewed from the air. An adjoining bay, Little Lake Harris, east of SR 19, is a smaller version of the lake. The combined area of the two","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":943475,"ranking":4,"query_text":"what county is lake harris florida","passage_text":"Leesburg, Florida. Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau was 19,086. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":8838741,"ranking":5,"query_text":"what county is lake harris florida","passage_text":"Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau was 19,086.[5] Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":943478,"ranking":6,"query_text":"what county is lake harris florida","passage_text":"Sponsored Topics. Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau is 19,086.. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":3559505,"ranking":7,"query_text":"what county is lake harris florida","passage_text":"Lake County last voted for a Democrat in a United States Senate race in 2006, when US Senator Bill Nelson won in Florida and won Lake County 55.57% to Katherine Harris's 42.79%. He lost the county in 2012, but won the election.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":2003866,"ranking":8,"query_text":"what county is lake harris florida","passage_text":"Leesburg, FL. Sponsored Topics. Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau is 19,086.. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":1339018,"ranking":9,"query_text":"what county is lake harris florida","passage_text":"Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau is 19,086.. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system. It is part of the Orlandoâ\u0080\u0093Kissimmee Metropolitan Statistical Area.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":651421,"ranking":10,"query_text":"what county is lake harris florida","passage_text":"Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau is 19,086. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system. It is part of the Orlandoâ\u0080\u0093Kissimmeeâ\u0080\u0093Sanford Metropolitan Statistical Area. Leesburg is the home of Lake-Sumter State College (LSSC) with campuses also in Clermont, Florida and Sumterville, Florida.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":651425,"ranking":11,"query_text":"what county is lake harris florida","passage_text":"Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau is 19,086.. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system. It is part of the Orlandoâ\u0080\u0093Kissimmee Metropolitan Statistical Area. Leesburg is the home of Lake-Sumter Community College (LSCC) with campuses also in Clermont, Florida and Sumterville, Florida.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":8838743,"ranking":12,"query_text":"what county is lake harris florida","passage_text":"Leesburg, Florida. Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau was 19,086. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system. It is part of the Orlandoâ\u0080\u0093Kissimmeeâ\u0080\u0093Sanford Metropolitan Statistical Area. Leesburg is the home of Lake-Sumter State College (LSSC) with campuses also in Clermont, Florida and Sumterville.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":2527511,"ranking":13,"query_text":"what county is lake harris florida","passage_text":"Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau was 19,086.[5] Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system. It is part of the Orlandoâ\u0080\u0093Kissimmeeâ\u0080\u0093Sanford Metropolitan Statistical Area. Leesburg is the home of Lake-Sumter State College (LSSC) with campuses also in Clermont, Florida and Sumterville.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":8838739,"ranking":14,"query_text":"what county is lake harris florida","passage_text":"Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau was 19,086. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system. It is part of the Orlandoâ\u0080\u0093Kissimmeeâ\u0080\u0093Sanford Metropolitan Statistical Area. Leesburg is the home of Lake-Sumter State College with campuses also in Clermont, Florida and Sumterville. It is also ...","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":2527512,"ranking":15,"query_text":"what county is lake harris florida","passage_text":"Leesburg, Florida. Leesburg is a city in Lake County, Florida, United States. The population was 15,956 at the 2000 census. As of 2005, the population recorded by the U.S. Census Bureau was 19,086. Leesburg is located in central Florida, between Lake Harris and Lake Griffin, at the head of the Oklawaha River system. It is part of the Orlandoâ\u0080\u0093Kissimmeeâ\u0080\u0093Sanford Metropolitan Statistical Area. Leesburg is the home of Lake-Sumter State College (LSSC) with campuses also in Clermont, Florida and Sumterville. It is also the home of Beacon College.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":5701137,"ranking":16,"query_text":"what county is lake harris florida","passage_text":"Lake Weir. Lake Weir is a fresh-water lake located in southern Marion County, Florida. Due to its large size and proximity, it is sometimes included with the Harris chain of lakes to the southeast, but is not directly hydrologically connected to them. It is connected to a smaller version of it, Little Lake Weir, to the west by a vegetation-filled canal.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":7576782,"ranking":17,"query_text":"what county is lake harris florida","passage_text":"Lake Harris. (Lake County): Lake Harris is a 13,788-acre lake located south and east of the City of Leesburg in Lake County.","bm25_label":"high","relevance_label":1.0},{"query_id":608197,"passage_id":6362326,"ranking":18,"query_text":"what county is lake harris florida","passage_text":"Lake Dora, Beauclair and Carlton make up the eastern Harris Chain lakes. Located in Central Florida's Lake County, Lake Dora is approximately 6 miles long and about 3\/4 miles wide. Covering 4,502 acres of water, the lake is the connected to Lake Eustis via the Dora Canal and Lake Apopka through the Apopka Beauclair Canal.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":2264529,"ranking":19,"query_text":"what county is lake harris florida","passage_text":"What to do in Mount Dora, Florida. 'Someplace Special' to Play, Shop, Dine, Stay... The City of Mount Dora truly is 'Someplace Special,' a charming, one-hundred plus year old historic village in the heart of Central Florida on the shores of beautiful Lake Dora in the Harris Chain of Lakes.","bm25_label":"high","relevance_label":0.0},{"query_id":608197,"passage_id":2264530,"ranking":20,"query_text":"what county is lake harris florida","passage_text":"What to do in Mount Dora, Florida. 'Someplace Special' to Play, Shop, Dine, Stay... Tweet. The City of Mount Dora truly is 'Someplace Special,' a charming, one-hundred plus year old historic village in the heart of Central Florida on the shores of beautiful Lake Dora in the Harris Chain of Lakes.","bm25_label":"high","relevance_label":0.0}]