[{"query_id":612846,"passage_id":7654090,"ranking":1,"query_text":"what county is soldier grove, wi","passage_text":"This Lot\/Land located at 25050 County Road U, Soldiers Grove WI, 54655 is currently for sale and has been listed on Trulia for 46 days. This property is listed by Weiss Realty LLC for $499,900. The property has a lot size of 179.0 acres. 25050 County Road U is in Soldiers Grove and in ZIP Code 54655. The list price of $499,900 is 136% higher than the average list price of $212,136 for 54655 real estate and 136% higher than the average list price of $212,136 for Soldiers Grove, WI real estate.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":7654094,"ranking":2,"query_text":"what county is soldier grove, wi","passage_text":"Soldiers Grove, WI. Sponsored Topics. Soldiers Grove is a village located alongside the Kickapoo River in Crawford County, Wisconsin, in the United States. As of the 2000 census, the village population was 653. Billing itself as America's First Solar Village, Soldiers Grove was the first community in the United States to mandate the use of solar heating in commercial structures.","bm25_label":"high","relevance_label":1.0},{"query_id":612846,"passage_id":7198576,"ranking":3,"query_text":"what county is soldier grove, wi","passage_text":"The combined sales tax rate for Crawford County, WI is 5.5%. This is the total of state and county sales tax rates. The Wisconsin state sales tax rate is currently 5%. The Crawford County sales tax rate is 0.5%. Cities in Crawford County. Bell Center; Eastman; Ferryville; Gays Mills; Lynxville; Mount Sterling; Prairie Du Chien; Seneca; Soldier Grove; Soldiers Grove","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":7198570,"ranking":4,"query_text":"what county is soldier grove, wi","passage_text":"The Wisconsin state sales tax rate is currently 5%. The Crawford County sales tax rate is 0.5%. Cities in Crawford County. Bell Center; Eastman; Ferryville; Gays Mills; Lynxville; Mount Sterling; Prairie Du Chien; Seneca; Soldier Grove; Soldiers Grove; Steuben; Wauzeka; Zip Codes associated with Crawford County, Wisconsin","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":7654089,"ranking":5,"query_text":"what county is soldier grove, wi","passage_text":"Latest news from Soldiers Grove, WI collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: Norwegian (25.3%), German (21.9%), Irish (15.8%), American (7.9%), English (5.5%), Scottish (2.7%).","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919392,"ranking":6,"query_text":"what county is soldier grove, wi","passage_text":"Distance between ï»¿Union Grove, WI and Milwaukee, WI, How to get from ï»¿Union Grove, WI to Milwaukee, WI, Flight Distance between ï»¿Union Grove, WI and Milwaukee, WI In Km and miles, avarage driving distance and driving time between ï»¿Union Grove, WI and Milwaukee, WI.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":6072612,"ranking":7,"query_text":"what county is soldier grove, wi","passage_text":"PLEASANT GROVE, UTAH COUNTY, UTAH LAND FOR SALE: 1 - 15 of 108 listings. 2455 Acres Utah County, Utah $1,750,000 Elk Haven at Soldier Summit is your opportunity to invest in and enjoy... 20.03 Acres Cedar Valley, Utah County, Utah $59,000 In this uncertain and volatile economy your best investment ... 1. Prime commercial land in Pleasant Grove.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919399,"ranking":8,"query_text":"what county is soldier grove, wi","passage_text":"Calculated car drive distance from ï»¿Union Grove, WI to Milwaukee, WI is 100 mi. To reach Milwaukee, WI from ï»¿Union Grove, WI by car you need 1 hour. The main road to reach Milwaukee, WI from ï»¿Union Grove, WI by car is Main E1. If you are travelling from ï»¿Union Grove, WI to Milwaukee, WI by car, you need to know that 5 gallons gallons of gas is needed to reach the final destination.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919393,"ranking":9,"query_text":"what county is soldier grove, wi","passage_text":"There are 25.33 miles from Milwaukee to Union Grove in southwest direction and 32 miles (51.50 kilometers) by car, following the I-94 route. Milwaukee and Union Grove are 40 minutes far apart, if you drive non-stop. This is the fastest route from Milwaukee, WI to Union Grove, WI. The halfway point is Caledonia, WI. Milwaukee, WI and Union Grove, WI are in the same time zone (Central Daylight Time). Current time in both locations is 6:02 am.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":7087407,"ranking":10,"query_text":"what county is soldier grove, wi","passage_text":"Union Grove, WI. Union Grove is a village in Racine County, Wisconsin, United States. The population was 4,322 at the 2000 census. Union Grove is located at 42Â°41â\u0080²7â\u0080³N 88Â°2â\u0080²58â\u0080³W \/ 42.68528Â°N 88.04944Â°W \/ 42.68528; -88.04944 (42.685287, -88.049390). According to the United States Census Bureau, the village has a total area of 1.7 square miles (4.4 kmÂ²), all of it land.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":5740552,"ranking":11,"query_text":"what county is soldier grove, wi","passage_text":"1981 Green Grove Plat Map Transcription, contributed by Helen Vater Blaha. GREEN GROVE T. 28N. - R. 1 W; ATLAS & PLAT BOOK of CLARK COUNTY, WISCONSIN, 1981, published by Rockford Map Pulbishers, Inc. 4525 Forest View Ave.Rockford, Illinois 61108.ounty Map (shows all the townships). 1880 Green Grove Plat Map *In 1880, Green Grove was the west half of Colby Township. 1893 Green Grove Plat Map--by C. S. Stockwell; Neillsville, WI (Contributed by Alice Braun).","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919394,"ranking":12,"query_text":"what county is soldier grove, wi","passage_text":"You can also find the duration and the roadmap for these transport modes from Union Grove, WI to Milwaukee, WI or contrariwise the return route between Milwaukee and Union Grove. Below is a small summary figure in the roadmap for a trip from Union Grove to Milwaukee.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919395,"ranking":13,"query_text":"what county is soldier grove, wi","passage_text":"Hello from the residents of Union Grove, WI! Visit this site for village happenings, administrative contact info, and general village information. Hello from the residents of Union Grove, WI!","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3808269,"ranking":14,"query_text":"what county is soldier grove, wi","passage_text":"Roads of the Mid-South & West > Highways of the State of Wisconsin > State Highways of the State of Wisconsin > Wisconsin State Route 133 > Wisconsin State Route 133, Grant County. Wisconsin State Route 133 is a east-west highway in Grant County. It runs from near Potosi to the Grant\/Iowa County Line, near Muscoda. WI St Rt 133 passes through the following towns in Grant County. WI St Rt 133 is multi-plexed in Grant County. Wisconsin State Route 35, from Bloomington to near Patch Grove.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919390,"ranking":15,"query_text":"what county is soldier grove, wi","passage_text":"Halfway Point Between Milwaukee, WI and Union Grove, WI If you want to meet halfway between Milwaukee, WI and Union Grove, WI or just make a stop in the middle of your trip, the exact coordinates of the halfway point of this route are 42.832939 and -87.952667, or 42Âº 49' 58.5804 N, 87Âº 57' 9.6012 W.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919397,"ranking":16,"query_text":"what county is soldier grove, wi","passage_text":"Halfway Point Between Milwaukee, WI and Union Grove, WI. If you want to meet halfway between Milwaukee, WI and Union Grove, WI or just make a stop in the middle of your trip, the exact coordinates of the halfway point of this route are 42.832939 and -87.952667, or 42Âº 49' 58.5804 N, 87Âº 57' 9.6012 W.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3919398,"ranking":17,"query_text":"what county is soldier grove, wi","passage_text":"This location is 15.83 miles away from Milwaukee, WI and Union Grove, WI and it would take approximately 20 minutes to reach the halfway point from both locations. Closest City or Town to Halfway Point. The closest town to the halfway point is Caledonia, WI, situated 19.61 miles from Milwaukee, WI and 15.11 miles from Union Grove, WI.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":7435387,"ranking":18,"query_text":"what county is soldier grove, wi","passage_text":"Zip Code 53085 Description. Zip Code 53085 is located in the state of Wisconsin in the Milwaukee metro area. Zip code 53085 is primarily located in Sheboygan County. The official US Postal Service name for 53085 is SHEBOYGAN FALLS, Wisconsin. Portions of zip code 53085 are contained within or border the city limits of Sheboygan Falls, WI, Kohler, WI, and Howards Grove, WI. The area code for zip code 53085 is 920.","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":3930604,"ranking":19,"query_text":"what county is soldier grove, wi","passage_text":"The combined sales tax rate for Racine County, WI is 5.1%. This is the total of state and county sales tax rates. The Wisconsin state sales tax rate is currently 5%. The Racine County sales tax rate is 0%. Cities in Racine County. Burlington; Caledonia; Franksville; Kansasville; Mount Pleasant; Racine; Rochester; Sturtevant; Union Grove; Waterford; Wind Lake; Wind Point","bm25_label":"high","relevance_label":0.0},{"query_id":612846,"passage_id":7654088,"ranking":20,"query_text":"what county is soldier grove, wi","passage_text":"SOLDIERS GROVE, CRAWFORD COUNTY, WISCONSIN LAND FOR SALE: 1 - 15 of 26 listings. 6.6 Acres Crawford County, Wisconsin $54,500 6,5 Acre Land in the unique Driftless Valley, looking from high... 41 Acres De Soto, Crawford County, Wisconsin $399,000 MOVE IN READY RIDGE TOP HOBBY FARM WITH 59 M\/L BIG...","bm25_label":"high","relevance_label":0.0}]