[{"query_id":614069,"passage_id":7682233,"ranking":1,"query_text":"what county is vanderpool tx in","passage_text":"Vanderpool, TX City Data - Population, Homes, Statistics. Vanderpool, TX City Data. Vanderpool, TX is a city with great restaurants, attractions, history and people. There are around 203 people who live in Vanderpool and approximately 17,645 who live in Bandera County.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":2911744,"ranking":2,"query_text":"what county is vanderpool tx in","passage_text":"Bandera County. There are 466 real estate listings found in Bandera County, TX. There are 5 cities in Bandera County which include Bandera , Pipe Creek , Medina , Tarpley , and Vanderpool . There are 5 zip codes in Bandera County which include 78003 , 78063 , 78055 , 78883 , and 78885 .","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":2115249,"ranking":3,"query_text":"what county is vanderpool tx in","passage_text":"Vanderpool Sheriff. Find Vanderpool Texas sheriff's office, department, headquarters, jail and detention center. Sheriffs provide information on records, arrests, inmates, warrants, and mugshots. Name. Real County Sheriff's Office.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":2115250,"ranking":4,"query_text":"what county is vanderpool tx in","passage_text":"Vanderpool, Texas. Vanderpool is a small unincorporated community in Bandera County in the U.S. state of Texas, in the Texas Hill Country, which is part of the Edwards Plateau. It lies 30 miles (48 km) west of Bandera. Hunting, ranching and tourism are chief contributors to the regional economy.","bm25_label":"high","relevance_label":1.0},{"query_id":614069,"passage_id":7682232,"ranking":5,"query_text":"what county is vanderpool tx in","passage_text":"FM337 to Vanderpool. TE Photo, 6-01. Vanderpool is one of those rare places where you can get away from the world and still be in Texas. We would call it the Crossroads of Western Bandera County but you might get the idea there's a lot of traffic through here. There isn't. History in a Pecan Shell.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":2115251,"ranking":6,"query_text":"what county is vanderpool tx in","passage_text":"Location: Vanderpool is located in Sabinal Valley on Edwards Plateau. While being a small town in Bandera County, people are drawn to the wonders of Lost Maples National Park. In 1990 the population was only 22. Vanderpool was first settled in the late 1820's. The main river way is Sabinal River & Canyon. As for the weather it's mostly cooler than other parts of Texas.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":7682234,"ranking":7,"query_text":"what county is vanderpool tx in","passage_text":"New listing - Vanderpool 396 acres- Bandera County Located just north of Station C Road, this is a rare opportunity to purchase a small Cattle and hunting Ranch on the Edwards Plateau in western Bandera County.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":1004954,"ranking":8,"query_text":"what county is vanderpool tx in","passage_text":"Viewing Tweets won't unblock @TravisCountyTX. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TX Retweeted. Travis County TXâ\u0080\u008fVerified account @TravisCountyTX Aug 29. #TravCo speaking with Planning and Budget about budget amendments and transfers, specifically what is happening in wake of #Harvey (Item 12) Thanks. Twitter will use this to make your timeline better.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":1693945,"ranking":9,"query_text":"what county is vanderpool tx in","passage_text":"Galveston County, TX Property Tax information Galveston County, TX Property Tax Search by Address See what the tax bill is for any Galveston County, TX property by simply typing its address into a search bar!","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":8761325,"ranking":10,"query_text":"what county is vanderpool tx in","passage_text":"CB&Q Depot, Beaconsfield, Iowa Courtesy of digital.lib.uiowa.edu\/railraodinan. Beaconsfield was established in 1881 when the Humeston and Shenandoah Railroad came through the northern portion of Ringgold County. Depot agents included Aaron LAMB, Fred BONHAM, Coil MILLER, and Loyd VANDERPOOL.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":6229160,"ranking":11,"query_text":"what county is vanderpool tx in","passage_text":"Grayson County, TX Property Tax Search by Address. See what the tax bill is for any Grayson County, TX property by simply typing its address into a search bar! In-depth Property Tax Information. See Grayson County, TX tax rates, tax exemptions for any property, the tax assessment history for the past years, and more. Create a free account and unlock 1 property report at no cost! Grayson County, TX Property Tax Search by Address.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":1420495,"ranking":12,"query_text":"what county is vanderpool tx in","passage_text":"Popular Property Types in Hartley County, TX. Hartley County, TX Land Info. Hartley County is a mid-size urban county within what is considered a non-metropolitan part of Texas. The most common type of land for sale in Hartley County recently was hunting land, while Dalhart was the city in Hartley County with the most land for sale.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":2965930,"ranking":13,"query_text":"what county is vanderpool tx in","passage_text":"What time is it in Lewisville, Texas right now? Lewisville, Denton County, TX is located in Central Time Zone. Time in Lewisville, Texas - current local time, timezone, daylight savings time 2018 - Lewisville, Denton County, TX, USA.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":4563385,"ranking":14,"query_text":"what county is vanderpool tx in","passage_text":"What time is it in Arlington, Texas right now? Arlington, Tarrant County, TX is located in Central Time Zone. Time in Arlington, Texas - current local time, timezone, daylight savings time 2018 - Arlington, Tarrant County, TX, USA.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":7540621,"ranking":15,"query_text":"what county is vanderpool tx in","passage_text":"What time is it in Plano, Texas right now? Plano, Collin County, TX is located in Central Time Zone. Time in Plano, Texas - current local time, timezone, daylight savings time 2018 - Plano, Collin County, TX, USA.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":2115246,"ranking":16,"query_text":"what county is vanderpool tx in","passage_text":"Find Vanderpool Texas clerk, including county, city, and circuit clerk, and clerk of court. Clerks provide information on public court records and legal documents, criminal, jail, and arrest records, marriage licenses, divorce, judicial, and probate records, businesses liens, notary services, real estate taxes and voter registration services. Name.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":4155675,"ranking":17,"query_text":"what county is vanderpool tx in","passage_text":"Just after having gone through the Twisted Sister from Vanderpool (contributed by The Geezy Rider, Aug 08) On Ranch Road 337 just prior to hitting Vanderpool (contributed by The Geezy Rider, Aug 08) Huge ranch just north of Campwood on Ranch Road 335 (contributed by The Geezy Rider, Aug 08)","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":1809191,"ranking":18,"query_text":"what county is vanderpool tx in","passage_text":"GeoFacts for Dallas County, TX. Dallas County, TX, is a county located in the eastern part of Texas near the city of Dallas. Counties Neighboring Dallas County, TX. The following Counties are next to Dallas County, TX: Tarrant is 29.8 miles west of Dallas County, TX. Collin is 31.5 miles north of Dallas County, TX. Denton is 36.1 miles northwest of Dallas County, TX.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":121382,"ranking":19,"query_text":"what county is vanderpool tx in","passage_text":"GeoFacts for Galveston County, TX. Galveston County, TX, is a county located in the southeastern part of Texas near the city of Texas City. Counties Neighboring Galveston County, TX. The following Counties are next to Galveston County, TX: Harris is 45.8 miles northwest of Galveston County, TX. Brazoria is 37.4 miles southwest of Galveston County, TX.","bm25_label":"high","relevance_label":0.0},{"query_id":614069,"passage_id":3654273,"ranking":20,"query_text":"what county is vanderpool tx in","passage_text":"GeoFacts for Walker County, TX. Walker County, TX, is a county located in the eastern part of Texas near the city of Huntsville. Counties Neighboring Walker County, TX. The following Counties are next to Walker County, TX: Montgomery is 30.6 miles south of Walker County, TX. Grimes is 28 miles southwest of Walker County, TX.","bm25_label":"high","relevance_label":0.0}]