[{"query_id":62411,"passage_id":7980583,"ranking":1,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Grandparents can open 529 plans, which are qualified tuition plans designed to save money for their grandchildren's college costs.In fact, the practice is common. SavingForCollege.com notes that hundreds of thousands of grandparents have adopted the practice and opened 529 plans for their grandchildren.The 529 vehicle provides grandparents with a way to save important funds for their grandchildren in an account that the grandparents can control and manage.ultiple Grandchildren and Multiple Plans. A 529 plan can only have one designated beneficiary, preventing grandparents from opening a single 529 plan for all of their grandchildren. However, they are free to open separate 529 plans for each of their grandchildren.","bm25_label":"high","relevance_label":1.0},{"query_id":62411,"passage_id":1977071,"ranking":2,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"A 529 college savings plan is a tax-advantaged savings vehicle that can be a smart way for grandparents to contribute to their grandchild's college education while paring down their own estate.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980584,"ranking":3,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Multiple Grandchildren and Multiple Plans. A 529 plan can only have one designated beneficiary, preventing grandparents from opening a single 529 plan for all of their grandchildren. However, they are free to open separate 529 plans for each of their grandchildren.ultiple Grandchildren and Multiple Plans. A 529 plan can only have one designated beneficiary, preventing grandparents from opening a single 529 plan for all of their grandchildren. However, they are free to open separate 529 plans for each of their grandchildren.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980585,"ranking":4,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"ANSWER: In some families, grandparents are an important source for helping to fund a grandchild's college education. And even when grandparents don't have a lot of extra money, they may still wish to make small gifts towards a grandchild's college fund.529 plans can be very attractive vehicles for grandparents.NSWER: In some families, grandparents are an important source for helping to fund a grandchild's college education. And even when grandparents don't have a lot of extra money, they may still wish to make small gifts towards a grandchild's college fund.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980589,"ranking":5,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"By. You shouldn't look a gift horse in the mouthâ\u0080\u0094unless it is your grandparents offering to help pay for college via a 529 plan. Grandparents increasingly are opening such accounts to help cover their grandchildren's college costs.But their well-intentioned efforts could hurt students' chances for getting financial aid.y. You shouldn't look a gift horse in the mouthâ\u0080\u0094unless it is your grandparents offering to help pay for college via a 529 plan. Grandparents increasingly are opening such accounts to help cover their grandchildren's college costs.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980592,"ranking":6,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"In 2012, Pennsylvania taxpayers could claim a tax deduction of up to $13,000 per individual or $26,000 for a married couple on 529 contributions. Contributors to 529 plans are not limited to the account owners. In fact, anyone can contribute to a 529 plan, including the grandparents of the beneficiary of an account.n 2012, Pennsylvania taxpayers could claim a tax deduction of up to $13,000 per individual or $26,000 for a married couple on 529 contributions. Contributors to 529 plans are not limited to the account owners. In fact, anyone can contribute to a 529 plan, including the grandparents of the beneficiary of an account.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980587,"ranking":7,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Parents and grandparents can also benefit through tax-free gifting when contributing to a 529 plan. Contributions qualify for the federal $13,000 annual gift exclusion â\u0080\u0093â\u0080\u0093 $26,000 if married, filing jointly. Additionally, there are high maximum contribution limits, up to $340,000 in some state plans.here is no better time than now to start investing in a 529 plan for your child or grandchild. With the 2011 tax deadline coming up fast, making a contribution today can put more tax dollars in your hand. Give your loved one a solid foundation for a future college education before the December 31, 2011 tax deadline.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":753081,"ranking":8,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Grandparents can either contribute to an existing educational IRA or open a new one for the grandchild as long as the account is in the grandchild's name. The total annual contributions for any one grandchild, however, cannot exceed $2,000.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980586,"ranking":9,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Eight reasons why grandparents love 529 plans. If you re a grandparent there are a variety of different ways you can help pay for college. Here are eight reasons why we think saving with a 529 plan could be your best bet.ccording to a 2014 survey released by Fidelity, 72 percent of grandparents feel that it is important to help pay for their grandchildren's college education.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980588,"ranking":10,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Even the experts agree that 529 college savings plans are one of the best ways for families, individuals, and grandparents to save: 1  State Tax Benefits: If you are a Colorado resident, every dollar you contribute to a CollegeInvest 529 can be deducted from your Colorado state income tax return.2  1.he Big Difference a 529 Makes for Grandparents. 529 college savings programs are state-sponsored plans that have a variety of tax benefits and other considerations that help you, as a grandparent, save for college tuition and other eligible expenses.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":3541969,"ranking":11,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Most parents or grandparents can find what they need within a single 529 plan, even when they have more than one child, and it's a lot simpler dealing with only one 529 plan.Even so, there are situations where it makes sense to use a different 529 plan for each child. Occasions that call for multiple 529 plans.If your children are more than a couple of years apart in age, you will most likely have different investment objectives for their college savings.ost parents or grandparents can find what they need within a single 529 plan, even when they have more than one child, and it's a lot simpler dealing with only one 529 plan.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":3832613,"ranking":12,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Thus, a grandparent-owned 529 plan will not be reported as an asset on the FAFSA, but distributions from such a 529 plan will be reported as untaxed income to the beneficiary (the student). This can have a severe impact on the studentâ\u0080\u0099s eligibility for need-based financial aid.ow 529 Plans Affect Financial Aid. Share this page. 529 college savings plans can affect eligibility for need-based federal student aid in one of two ways, as an asset or as a distribution.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":1526631,"ranking":13,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Another approach for parents and grandparents may be to combine the features of custodial accounts and 529 college savings plans. For example, by placing a 529 plan within a custodial account, the parent or grandparent can retain control until the student becomes of age (generally 18 to 21, but varies by state). After that, the student would have control, but must use the money for college expenses or pay a penalty.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":7980591,"ranking":14,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"Gifts from relatives can often make or break college savings. Grandparents considering saving for their grandchildren's education often hear about tax breaks, gift tax limits and how 529 plan money is used.f grandparents are still working, being able to deduct some or all 529 plan contributions on state tax returns is a nice perk. However, each state sets its own rules on who can claim the tax deduction and for how much, Long says.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":1516192,"ranking":15,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"If that adult child gets divorced, the account can be considered part of the adult child's assets, even though the implicit understanding is that it's the parent's money. A grandparent opens a joint bank account with a grandchild to save for college, but sometime later, the grandparent faces a lawsuit or goes bankrupt.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":3832616,"ranking":16,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"As noted in How Do Grandparent-Owned 529 College Savings Plans Affect Financial Aid Eligibility, other 529 plans are not reported as assets on the studentâ\u0080\u0099s FAFSA, but distributions from such 529 plans are reported as untaxed income to the student on the subsequent yearâ\u0080\u0099s FAFSA. 529 college savings plan account that is owned by the student or the studentâ\u0080\u0099s parent must be reported as an investment asset on the Free Application for Federal Student Aid (FAFSA).","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":5698746,"ranking":17,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"In general, a grandparent who wants to ask for visitation with a grandchild must: Figure out if there is a family court case already open. As just explained, you first need to figure out if there is a family court case already open involving your grandchild and his or her parents.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":6399165,"ranking":18,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"529 Plans offer tax-advantaged investments to encourage saving for future higher education expenses of a designated beneficiary (commonly one's child or grandchild). States offer and administer these plans, named after Section 529 of the Internal Revenue Code.ll withdrawals from 529 plans for qualifed higher education expenses remain free from federal income tax. Wisconsin (and most states) mirror the federal rules for state tax purposes. Some states allow additional tax benefits for certain new contributions, usually for that state's plan(s).","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":763450,"ranking":19,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"The Grandparent-Grandchild Bond. The Simplest Form of LoveThe grandparent-grandchild bond is a vital connection, says Arthur Kornhaber, M.D., founder and president of The Foundation for Grandparenting. The bond between grandparents and grandchildren is second only to the parent-child bond.","bm25_label":"high","relevance_label":0.0},{"query_id":62411,"passage_id":4217695,"ranking":20,"query_text":"can a grandparent open a 529 plan for a grandchild","passage_text":"You can change the beneficiary of a plan if the new beneficiary is in the same family. You can open a plan benefiting anyone: a relative, a friend or even yourself. The plan owner or custodian controls the funds until withdrawal, not the beneficiary. How 529 plans are structured.There are two basic types of 529 plans â\u0080\u0094 prepaid tuition plans and savings plans.ou can open a plan benefiting anyone: a relative, a friend or even yourself. The plan owner or custodian controls the funds until withdrawal, not the beneficiary. How 529 plans are structured. There are two basic types of 529 plans â\u0080\u0094 prepaid tuition plans and savings plans.","bm25_label":"high","relevance_label":0.0}]