[{"query_id":628056,"passage_id":7673054,"ranking":1,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"$4,250 2002 Bass Tracker Pro Crappie 175 Mercury Boat (Neosho, MO). Tracker Â· Springfield, MO. Used 17 foot 2002 Tracker Pro Crappie Details. I have for sale a nice 2002 Bass Tracker Pro Crappie boat with 175 2003 Mercury 40HP with trailer & spare tire and... Click for more 2002 Tracker Pro Crappie boats.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673052,"ranking":2,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"I have for sale a nice 2002 Bass Tracker Pro Crappie boat with 175 2003 Mercury 40HP with trailer & spare tire and... Click for more 2002 Tracker Pro Crappie boats. I have for sale a nice 2002 Bass Tracker Pro Crappie boat with 175 2003 Mercury 40HP with trailer & spare tire and Trolling engine.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673055,"ranking":3,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"I have for sale a nice 2002 Bass Tracker Pro Crappie boat with 175 2003 Mercury 40HP with trailer & spare tire and... Click for more 2002 Tracker Pro Crappie boats. I have for sale a nice 2002 Bass Tracker Pro Crappie boat with 175 2003 Mercury 40HP with trailer & spare tire and Trolling engine. Pleas...","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673057,"ranking":4,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Used 17 foot 2002 Tracker Pro Crappie Details. I have for sale a nice 2002 Bass Tracker Pro Crappie boat with 175 2003 Mercury 40HP with trailer & spare tire and... Click for more 2002 Tracker Pro Crappie boats.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673060,"ranking":5,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"2005 Tracker by Tracker Marine Pro Team 185. This Tracker by Tracker Marine outboard bass boat has a aluminum hull, is 18.25 feet long and 83 inches wide at the widest point. The boat weighs approximately 972 pounds with an empty fuel tank and without any gear or passengers.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673053,"ranking":6,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"The 2005, Pro Crappie 175 is a 17.25 foot outboard boat. The weight of the boat is 894 lbs. which does not include passengers, aftermarket boating accessories, or fuel.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673056,"ranking":7,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Boat - 2000 Pro Crappie 175, bought new from the Atlanta BPS\/Tracker store in January 2000 (ordered at the boat show in early January). This was the first year of this model. It rides on the Pro Team 175 Revolution Hull with a deck layout similar to a walleye\/Deep-V boat.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673051,"ranking":8,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"The 2005, Pro Crappie 175 is a 17.25 foot outboard boat. The weight of the boat is 894 lbs. which does not include passengers, aftermarket boating accessories, or fuel. The max rated horsepower of this boat, as listed by the manufacturer, (according to records we have) is 75 hp.","bm25_label":"high","relevance_label":1.0},{"query_id":628056,"passage_id":8219864,"ranking":9,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"In the 2005 Disney movie Herbie: Fully Loaded, Bass Pro Shops is one of two main sponsors of Ray Peyton Jr. (the other being Tracker Boats which Bass Pro Shops owns) Herbie also later receives a Bass Pro Shops sticker on his left rear fender.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673058,"ranking":10,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"It's no surprise that the Pro Crappie 175 fishing boat is a perennial favorite with panfish enthusiasts. If you too have developed an appetite for fresh-caught crappie, perch, red ear or bluegill, we've tricked out the Pro Crappie 175 fishing boat just for you.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":7673059,"ranking":11,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Boat Description. It's no surprise that the Pro Crappie 175 fishing boat is a perennial favorite with panfish enthusiasts. If you too have developed an appetite for fresh-caught crappie, perch, red ear or bluegill, we've tricked out the Pro Crappie 175 fishing boat just for you.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":3350733,"ranking":12,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Lehigh Acres is a great place to enjoy nearly 175 miles of freshwater canals and 16 well stocked lakes. Largemouth bass, crappie, and catfish are plentiful.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":3036063,"ranking":13,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Sun Tracker Pontoon Boats. Sun Tracker pontoon boats are the most popular brand of pontoon boats for sale in the country. Sun Tracker manufacturers the popular Bass Buggy, Party Barge, Fishin Barge, Party Cruiser and Party Hut pontoon boats. They are the largest manufacturer of pontoon boats in the United States and are part of the Tracker Marine Group, a Bass Pro Group company.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":4128434,"ranking":14,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"In addition to largemouth bass and rainbow trout, Diamond Valley Lake is home to blue gill, catfish, crappie, pan fish, smallmouth bass, and striped bass. The record largemouth bass, reeled in back in 2007, weighed in at more than 16 pounds.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":3548412,"ranking":15,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"A tracker may look tempting when the Bank of England base rates is low, but a fixed rate can give you certainty in what you are repaying and some protection from an interest rate rise. We weigh up the pros and cons of fixed rates and trackers below.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":3350727,"ranking":16,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Lehigh Acres is a great place to enjoy nearly 175 miles of freshwater canals and 16 well stocked lakes. Largemouth bass, crappie, and catfish are plentiful. Bluegill, bream, catfish, bowfin, sucker, bullhead and pickerel can be found here as well.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":5653435,"ranking":17,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"New and Used Pontoon Boats For Sale in the Mesa, AZ area. << First < Prev 1 2 3 Next > Last >>. 2017 Sun Tracker Bass Buggy 16 DLX. New Pontoon Boats for sale by Bass Pro Shops \/ Tracker Boat Center MESA in Mesa, AZ. Your Price w\/ options, freight & prep. w\/ Mercury 150L 4S. ","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":3350728,"ranking":18,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Lehigh Acres is a great place to enjoy nearly 175 miles of freshwater canals and 16 well stocked lakes. Largemouth bass, crappie, and catfish are plentiful. Bluegill, bream, catfish, bowfin, sucker, bullhead and pickerel can be found here as well. Boat launching ramps are available throughout the area.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":1107489,"ranking":19,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"Black Crappie will not eat floating fish feed. The diets of black crappie and largemouth bass are very similar. It should also be noted that correctly managed crappie ponds usually will not have big largemouth bass to catch. If you desire big bass, then you should not add crappie to your pond.","bm25_label":"high","relevance_label":0.0},{"query_id":628056,"passage_id":6662748,"ranking":20,"query_text":"what does a 2005 pro crappie 175 bass tracker weigh","passage_text":"In 1977, Bass Pro Shops introduced the first fish-ready complete boat motor and trailer package with the Private Brand boat the Bass Tracker. In 1984, construction began on the Outdoor World Catalog Showroom in Springfield, Missouri. Big Cedar Lodge opened in 1988 on Table Rock Lake.","bm25_label":"high","relevance_label":0.0}]