[{"query_id":632106,"passage_id":1630823,"ranking":1,"query_text":"what does an underactive thyroid cause","passage_text":"Contents. 1  Sweating AND Underactive thyroid gland: Causes of All Symptoms. 2  Sweating OR Underactive thyroid gland: 827 causes. 3  Sweating: 822 causes.  Sweating: 1  Introduction. Underactive thyroid gland: Causes.  Underactive thyroid gland: Introduction.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":938049,"ranking":2,"query_text":"what does an underactive thyroid cause","passage_text":"Underactive Thyroid What You Need to Know Did you know that getting tested routinely helps uncover . thyroid problems? What is underactive thyroid? Underactive thyroid, also called hypothyroidism, occurs when the thyroid gland . does not produce enough thyroid hormone to meet the bodyâ\u0080\u0099s needs. The thyroid gland is a 2-inch-long, butterfly-shaped gland in the front of your neck. Thyroid hormones regulate the way the body uses energy, so they affect nearly every organ in your body, even the way your heart beats. Left untreated, underactive thyroid can lead to . problems with energy, weight, muscles, mood, cholesterol, menstrual cycle, and fertility. Extreme cases of underactive thyroid can result in coma and death. Who is likely to develop underactive thyroid? Women are much more likely than men to develop underactive thyroid. The disease is","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":1630824,"ranking":3,"query_text":"what does an underactive thyroid cause","passage_text":"Underactive thyroid gland: 1  Causes: Underactive thyroid gland. 2  Introduction: Underactive thyroid gland. 3  Underactive thyroid gland: Add a 3rd symptom.  Underactive thyroid gland: Remove a symptom.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":1630822,"ranking":4,"query_text":"what does an underactive thyroid cause","passage_text":"Sweating and Underactive thyroid gland. 1  Sweating AND Underactive thyroid gland - Causes of All Symptoms. 2  Sweating OR Underactive thyroid gland - 827 causes.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":1730081,"ranking":5,"query_text":"what does an underactive thyroid cause","passage_text":"Hypothyroidism, also known as underactive or low thyroid, is a condition in which the thyroid gland does not produce sufficient amounts of thyroid hormones which are important for many functions of the body (metabolism).hyroid hormones direct many of the body's processes. An underactive thyroid does not produce enough hormones. This condition is also referred to as hypothyroidism. It slows down the metabolism, which may cause fatigue, lethargy, or constipation, but these kinds of symptoms can also have a number of other causes.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":6195889,"ranking":6,"query_text":"what does an underactive thyroid cause","passage_text":"Most cases of an underactive thyroid are caused by the immune system attacking the thyroid gland and damaging it, or by damage that occurs as a result of treatments for thyroid cancer or an overactive thyroid. condition called Hashimoto's disease is the most common type of autoimmune reaction that causes an underactive thyroid. It's not clear what causes Hashimotoâ\u0080\u0099s disease, but it runs in families. It's also common in people with another immune system disorder, such as type 1 diabetes and vitiligo.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":1725019,"ranking":7,"query_text":"what does an underactive thyroid cause","passage_text":"If you have had your thyroid gland removed or radioactive iodine treatment for an overactive thyroid, this can cause an underactive thyroid. Radiotherapy for thyroid cancer can also lead to an underactive thyroid. Other causes of underactive thyroid include: some medicines, such as lithium and amiodarone.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":6195887,"ranking":8,"query_text":"what does an underactive thyroid cause","passage_text":"Worldwide, a lack of dietary iodine is a common cause of an underactive thyroid, because the body needs iodine to make thyroxine. However, iodine deficiency is uncommon in the UK. Babies are sometimes born with an underactive thyroid because the thyroid gland doesn't develop properly in the womb. condition called Hashimoto's disease is the most common type of autoimmune reaction that causes an underactive thyroid. It's not clear what causes Hashimotoâ\u0080\u0099s disease, but it runs in families. It's also common in people with another immune system disorder, such as type 1 diabetes and vitiligo.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":1725023,"ranking":9,"query_text":"what does an underactive thyroid cause","passage_text":"Causes Causes of underactive thyroid In the UK, the most common cause of underactive thyroid is autoimmune thyroiditis (Hashimoto's thyroiditis). This is when your immune system attacks your thyroid gland, damaging it and stopping it producing enough thyroid hormone.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":4061578,"ranking":10,"query_text":"what does an underactive thyroid cause","passage_text":"Hypothyroidism. When the thyroid does not produce enough thyroid hormones for the body, that is the definition of hypothyroidism, or underactive thyroid. The most common cause of hypothyroidism is Hasimotoâ\u0080\u0099s disease, a disorder where the immune system actually attacks the thyroid.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":5924972,"ranking":11,"query_text":"what does an underactive thyroid cause","passage_text":"Hypothyroidism. An underactive thyroid means your thyroid gland, located in the neck, does not produce enough hormones. Common signs of an underactive thyroid are tiredness, weight gain and feeling depressed. Medically known as hypothyroidism, an underactive thyroid is not usually serious.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":2849768,"ranking":12,"query_text":"what does an underactive thyroid cause","passage_text":"The symptoms of underactive thyroid. Hypo thyroid symptoms. What are the symptoms of underactive thyroid? An underactive thyroid is usually referred to as myxodema or hypothyroidism and can be identified by the hypo thyroid symptoms that you will find on this page. Keep the following in mind as you read through the symptoms of underactive thyroid on this page:","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":5951280,"ranking":13,"query_text":"what does an underactive thyroid cause","passage_text":"Hypothyroidism, also called underactive thyroid, is a condition in which the thyroid gland does not produce enough hormones. Hypothyroidism can be caused by the autoimmune disorder Hashimoto thyroiditis, irradiation or surgical removal of the thyroid gland, and medications that reduce thyroid hormone levels.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":104481,"ranking":14,"query_text":"what does an underactive thyroid cause","passage_text":"Hypothyroidism, also called underactive thyroid, is a condition in which the thyroid gland does not produce enough hormones. Hypothyroidism can be caused by the autoimmune disorder Hashimotoâ\u0080\u0099s thyroiditis, irradiation or surgical removal of the thyroid gland, and medications that reduce thyroid hormone levels.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":184250,"ranking":15,"query_text":"what does an underactive thyroid cause","passage_text":"hypothyroidism a common endocrine disorder of underactive thyroid or low thyroid in which the thyroidgland does not produce enough hormone it causes several symptoms including tiredness cold intolerance and weight gain","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":7596934,"ranking":16,"query_text":"what does an underactive thyroid cause","passage_text":"What causes lichen sclerosus? The cause of lichen sclerosus is not known. Sometimes it is associated with diseases in which the bodyâ\u0080\u0099s immune system attacks normal tissues such as the thyroid gland (causing an over-or underactive thyroid gland) or the insulin-producing cells in the pancreas (causing diabetes).he cause of lichen sclerosus is not known. Sometimes it is associated with diseases in which the bodyâ\u0080\u0099s immune system attacks normal tissues such as the thyroid gland (causing an over-or underactive thyroid gland) or the insulin-producing cells in the pancreas (causing diabetes).","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":4454339,"ranking":17,"query_text":"what does an underactive thyroid cause","passage_text":"Thyroid hormones direct many of the body's processes. An underactive thyroid does not produce enough hormones. This condition is also referred to as hypothyroidism. It slows down the metabolism, which may cause fatigue, lethargy, or constipation, but these kinds of symptoms can also have a number of other causes.hyroid hormones direct many of the body's processes. An underactive thyroid does not produce enough hormones. This condition is also referred to as hypothyroidism. It slows down the metabolism, which may cause fatigue, lethargy, or constipation, but these kinds of symptoms can also have a number of other causes.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":2387201,"ranking":18,"query_text":"what does an underactive thyroid cause","passage_text":"This is what causes your thyroid to be underactive. Ironically, it is also what causes you to crave sugar as a replacement for natural metabolic energy. As your thyroid gland struggles to convert hormones, your estrogen and progesterone levels are also affected.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":6195886,"ranking":19,"query_text":"what does an underactive thyroid cause","passage_text":"An underactive thyroid (hypothyroidism) is when your thyroid gland doesn't produce enough of the hormone thyroxine (also called T4). condition called Hashimoto's disease is the most common type of autoimmune reaction that causes an underactive thyroid. It's not clear what causes Hashimotoâ\u0080\u0099s disease, but it runs in families. It's also common in people with another immune system disorder, such as type 1 diabetes and vitiligo.","bm25_label":"medium","relevance_label":0.0},{"query_id":632106,"passage_id":8067310,"ranking":20,"query_text":"what does an underactive thyroid cause","passage_text":"What does the medical abbreviation TFT mean? This stands for thyroid function testing. TFT's may be undertaken if a patient is suspected of suffering from hypothyroidism (a thyroid gland that is underactive), or hyperth â\u0080¦ yroidism (overactvie thyroid gland.","bm25_label":"medium","relevance_label":0.0}]