[{"query_id":633635,"passage_id":7646494,"ranking":1,"query_text":"what does buerger allen exercises help","passage_text":"buerger-allen exercises. Does anyone know of a site where I can download how to do buerger-allen exercises - as a patient teaching tool. [font=Verdana,Arial] The physical therapist considers the use of postural exercises, such as Buerger-Allen exercises, to enhance circulation of the feet and help provide a better healing environment for Mr C's foot ulcer.","bm25_label":"high","relevance_label":1.0},{"query_id":633635,"passage_id":7646493,"ranking":2,"query_text":"what does buerger allen exercises help","passage_text":"Buerger Allen exercises. Buerger exercises augmented by active exercises of the feet. These exercises consist in flexion, extension, and circumduction of the ankles and are done during the phase of dependency of the legs, as suggested in 1931 by Arthur W. Allen (1887-1958).","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":859512,"ranking":3,"query_text":"what does buerger allen exercises help","passage_text":"aerobic exercise a type of physical activity that increases the heart rate and promotes increased use of oxygen in order to improve the overall body condition. ballistic stretching e's rapid, jerky movements employed in exercises to stretch muscles and connective tissue. Buerger-Allen e's see buerger-allen exercises.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":4951645,"ranking":4,"query_text":"what does buerger allen exercises help","passage_text":"active assistive exercise voluntary contraction of muscles controlling a part, assisted by a therapist or by some other means. aerobic exercise a type of physical activity that increases the heart rate and promotes increased use of oxygen in order to improve the overall body condition. ballistic stretching e's rapid, jerky movements employed in exercises to stretch muscles and connective tissue. Buerger-Allen e's see buerger-allen exercises.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":7646489,"ranking":5,"query_text":"what does buerger allen exercises help","passage_text":"Buerger exercises. Buerger exercises is a system of exercises for arterial insufficiency of lower limbs, consisting of legs elevation, followed by dependency of the legs, and finally horizontal position of legs for rest.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":2776240,"ranking":6,"query_text":"what does buerger allen exercises help","passage_text":"But new research suggests that exercise may also help increase the production of nitric oxide, a substance that does a variety of important jobs in the body, perhaps none more valuable than to help prevent heart disease. Nitric oxide does a variety of jobs, explains Dr. Jason Allen of Duke University. It tends to be antiatherogenic, which means that it helps prevent your arteries from becoming clogged. That is, it's a function of what you eat, how you exercise, and the stresses you are under.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":4436013,"ranking":7,"query_text":"what does buerger allen exercises help","passage_text":"A nurse is admitting a 45-year-old man to the Medical Surgical unit. The patient has a diagnosis of Buerger's disease. While taking the patient's health history he reveals that he smokes about 2 packs of cigarettes a day, has a history of alcohol abuse, and does not exercise.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":6151434,"ranking":8,"query_text":"what does buerger allen exercises help","passage_text":"I have the same spontaneous ruptures of blood vessels in my fingers and hands. I found a name for it-paroxysmal finger hematoma or Achenbach's Syndrome. It is more common in women and is benign. Treatment is similar as treatment for a bruise-cold and elevation followed by heat in a day or two to help absorb the blood. don't think she is describing Buerger's Disease at all! I have problems with breaking blood vessels in my hands too, most often with opening doors, but sometimes for no apparent reason. Buerger's looks entirely different. What I get are like mini varicose veins on the palm side of my fingers.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":1335137,"ranking":9,"query_text":"what does buerger allen exercises help","passage_text":"Chiropractor Allen TX. Welcome to Tree of Life Health Services located in Allen. Chiropractic is one of the most amazing healthcare professions, but very few people understand what it's all about. We are here to help you gain a basic understanding of how our Allen chiropractors can help you and your family.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":7646490,"ranking":10,"query_text":"what does buerger allen exercises help","passage_text":"Buerger's disease. Buerger's disease In Buerger's disease, your blood vessels swell and can become blocked with blood clots (thrombi). This eventually damages or destroys skin tissues and may lead to infection and gangrene.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":6686408,"ranking":11,"query_text":"what does buerger allen exercises help","passage_text":"Thanks alot for all the reassuring words. It does help. Does anyone know how long a stent will last. Are there any stats. What if you do everything right , take the pills, exercise, proper diet.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":5561969,"ranking":12,"query_text":"what does buerger allen exercises help","passage_text":"Buerger's disease is an inflammation of the arteries, veins, and nerves in the legs, principally, leading to restricted blood flow. Left untreated, Buerger's disease can lead to gangrene of the affected areas. Buerger's disease is also known as thromboangitis obliterans.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":5561972,"ranking":13,"query_text":"what does buerger allen exercises help","passage_text":"Definition. Buerger's disease is an inflammation of the arteries, veins, and nerves in the legs, principally, leading to restricted blood flow. Left untreated, Buerger's disease can lead to gangrene of the affected areas. Buerger's disease is also known as thromboangitis obliterans.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":3575399,"ranking":14,"query_text":"what does buerger allen exercises help","passage_text":"John Allen Chalk, Sr. About John Allen Chalk, Sr. Helping my clients realize their business and personal goals is a distinct privilege and a personal joy. After 40 years of practicing law, John Allen Chalk understands what it is that clients want from their lawyer. As a negotiator, litigator, arbitrator and mediator, John Allen applies cost-benefit and risk analysis to help his clients achieve efficient resolutions to their disputes.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":1966472,"ranking":15,"query_text":"what does buerger allen exercises help","passage_text":"What aerobic exercise does for your health. Regardless of age, weight or athletic ability, aerobic activity is good for you. As your body adapts to regular aerobic exercise, you'll get stronger and fitter. Consider the following 10 ways that aerobic activity can help you feel better and enjoy life to the fullest. Aerobic activity can help you: Keep excess pounds at bay. Combined with a healthy diet, aerobic exercise helps you lose weight and keep it off.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":7405496,"ranking":16,"query_text":"what does buerger allen exercises help","passage_text":"Massage does help prevent cellulite but does not by it's own prevent it. However, massage, healthy diet and exercise, in combination, do prevent cellulite. The use of the verb help makes the distinction. In fact massage does help reduce cellulite too, not just prevent it. The point is not if massage helps, the point is what kind of massage helps cellulite. There are probably hundreds of types of massage around and there is wide variability in effectiveness of each technique, and also between individual therapists.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":7219171,"ranking":17,"query_text":"what does buerger allen exercises help","passage_text":"Popular health advice tells us exercise helps sweat out toxins, but no one ever seems to specify what a toxin is or what it does. Any diet regimen or exercise routine worth its salt will highlight the copious amount of toxins your body will release in the process. If you donâ\u0080\u0099t burn them off, youâ\u0080\u0099ll sweat them out.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":4859929,"ranking":18,"query_text":"what does buerger allen exercises help","passage_text":"Distance from Allen, TX to Plano, TX. The total distance from Allen, TX to Plano, TX is 6 miles. This is equivalent to 10 kilometers or 5 nautical miles. Your trip begins in Allen, Texas. It ends in Plano, Texas. Your flight direction from Allen, TX to Plano, TX is South (-164 degrees from North). The distance calculator helps you figure out how far it is to fly from Allen, TX to Plano, TX. It does this by computing the straight line flying distance (as the crow flies).","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":6314942,"ranking":19,"query_text":"what does buerger allen exercises help","passage_text":"Hall of Famer Allen Iverson does his best impression of the LeBron James kid saying the Kings' name. Iverson proud of Lue, Cavaliers. 11-time All-Star Allen Iverson shares what the NBA Finals mean to him and more so what Tyronn Lue, LeBron James and the Cavaliers winning a championship means to the league.","bm25_label":"high","relevance_label":0.0},{"query_id":633635,"passage_id":5561970,"ranking":20,"query_text":"what does buerger allen exercises help","passage_text":"Buerger's disease is an inflammation of the arteries, veins, and nerves in the legs, principally, leading to restricted blood flow. Left untreated, Buerger's disease can lead to gangrene of the affected areas.","bm25_label":"high","relevance_label":0.0}]