[{"query_id":635647,"passage_id":7493203,"ranking":1,"query_text":"what does debt to gdp ratio tell us","passage_text":"DEFINITION of 'Debt-To-GDP Ratio'. The ratio of a country's national debt to its gross domestic product (GDP). By comparing what a country owes to what it produces, the debt-to-GDP ratio indicates the country's ability to pay back its debt.Often expressed as a percentage, the ratio can be interpreted as the number of years needed to pay back debt if GDP is dedicated entirely to debt repayment. Next Up.f a country were unable to pay its debt, it would default, which could cause a panic in the domestic and international markets. The higher the debt-to-GDP ratio, the less likely the country will pay its debt back, and the higher its risk of default.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":8364016,"ranking":2,"query_text":"what does debt to gdp ratio tell us","passage_text":"The debt-to-GDP ratio itself is an equation with a country's gross debt in the numerator and its gross domestic product (GDP) in the denominator. Therefore, a debt-to-GDP ratio of 1.0 (or 100%) means that a country's debt is equal to its gross domestic product. In general, the debt-to-GDP ratio is used to determine the health of an economy.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":266583,"ranking":3,"query_text":"what does debt to gdp ratio tell us","passage_text":"The debt is greater than what America produces in a whole year. This high debt-to-GDP ratio tells investors that the country might have problems repaying the loans. That's a new and worrying occurrence for the United States. In 1988, the debt was only half of America's economic output.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":1465815,"ranking":4,"query_text":"what does debt to gdp ratio tell us","passage_text":"How much debt does Australia have? Net debt to gross domestic product (GDP) ratio is a way of counting how much national debt a country has when compared with the total value of the economy, as measured by GDP. It is used as one indicator of the economic sustainability of a countryâ\u0080\u0099s debt.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":8364022,"ranking":5,"query_text":"what does debt to gdp ratio tell us","passage_text":"The debt-to-GDP ratio is an equation with a country's gross debt in the numerator and its gross domestic product (GDP) in the denominator. A high debt-to-GDP ratio isn't necessarily bad, as long as the country's economy is growing, since it's a way to use leverage to enhance long-term growth.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":2481989,"ranking":6,"query_text":"what does debt to gdp ratio tell us","passage_text":"Real GDP takes out the effect of inflation. It's used to calculate the GDP growth rate and GDP per capita. Nominal GDP is used to compare GDP to the U.S. debt, which is also not adjusted for inflation. To see the debt to GDP ratio since 1929, go to National Debt by Year.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":2481984,"ranking":7,"query_text":"what does debt to gdp ratio tell us","passage_text":"It's used to calculate the GDP growth rate and GDP per capita. Nominal GDP is used to compare GDP to the U.S. debt, which is also not adjusted for inflation. To see the debt to GDP ratio since 1929, go to National Debt by Year. Article updated March 3, 2015.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":2481987,"ranking":8,"query_text":"what does debt to gdp ratio tell us","passage_text":"Real GDP takes out the effect of inflation. It's used to calculate the GDP growth rate and GDP per capita. Nominal GDP is used to compare GDP to the U.S. debt, which is also not adjusted for inflation. To see the debt to GDP ratio since 1929, go to National Debt by Year. Article updated March 3, 2015.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":410077,"ranking":9,"query_text":"what does debt to gdp ratio tell us","passage_text":"Government debt as percentage of GDP globally (September 2012). In economics, the debt-to-GDP ratio is the ratio between a country's government debt (a cumulative amount) and its gross domestic product (GDP) (measured in years).","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":7493200,"ranking":10,"query_text":"what does debt to gdp ratio tell us","passage_text":"Government debt as percentage of GDP globally (September 2012). In economics, the debt-to-GDP ratio is the ratio between a country's government debt and its gross domestic product (GDP).he debt-to-GDP ratio is generally expressed as a percentage, but properly has units of years, as below. By dimensional analysis these quantities are the ratio of a stock (with dimensions of currency) by a flow (with dimensions of currency\/time), so they have dimensions of time.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":1287698,"ranking":11,"query_text":"what does debt to gdp ratio tell us","passage_text":"See if you can quickly find out. what Canadaâ\u0080\u0099s annual interest. payments on the national debt. amount to today. Interest to Income Ratio. Probably the best way to measure our debt burden is in. relation to the size of the economy or gross domestic. product (GDP) because this indicates our capacity to. manage the debt. See if you can quickly find out. what Canadaâ\u0080\u0099s debt to GDP. ratio is today.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":1590873,"ranking":12,"query_text":"what does debt to gdp ratio tell us","passage_text":"The United States public debt is often expressed as a ratio of public debt to gross domestic product (GDP). The ratio of debt to GDP may decrease as a result of a government surplus as well as due to growth of GDP and inflation.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":594213,"ranking":13,"query_text":"what does debt to gdp ratio tell us","passage_text":"Then you are stabilising your debt to GDP ratio. If your debt increases by 5% a year, but you have negative economic growth of -2%, then your debt to GDP ratio is increasing by 7% a year. Clearly, economic growth is a key factor in determining debt to GDP. GDP growth is just as important to actual debt levels.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":1451032,"ranking":14,"query_text":"what does debt to gdp ratio tell us","passage_text":"America's debt is the largest in the world for a single country. It runs neck and neck with that of the European Union, an economic union of 28 countries. For more, see Sovereign Debt Rankings. The debt is greater than what America produces in a whole year. This high debt-to-GDP ratio tells investors that the country might have problems repaying the loans. That's a new and worrying occurrence for the United States. In 1988, the debt was only half of America's economic output.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":2874864,"ranking":15,"query_text":"what does debt to gdp ratio tell us","passage_text":"The data comes from the IMF and does not include household or corporate debt. Additionally, the graph shows the debt to GDP ratio for each country based on the shade of the piece. All debt was converted to USD for the graph.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":1590874,"ranking":16,"query_text":"what does debt to gdp ratio tell us","passage_text":"Historically, the US public debt as a share of gross domestic product (GDP) has increased during wars and recessions, and subsequently declined. The ratio of debt to GDP may decrease as a result of a government surplus or due to growth of GDP and inflation.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":4356774,"ranking":17,"query_text":"what does debt to gdp ratio tell us","passage_text":"GDP is a measure of the total size and output of the economy. One measure of the debt burden is its size relative to GDP, called the debt-to-GDP ratio.. Mathematically, this is the debt divided by the GDP amount.","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":1393971,"ranking":18,"query_text":"what does debt to gdp ratio tell us","passage_text":"Japan, the worldâ\u0080\u0099s fourth largest economy (as measured by GDP), has a debt-to-GDP ratio of 227%. This is the highest such ratio in the world. The U.S. has a debt-to-GDP ratio of 101% which seems rather modest in comparison. Modest perhaps, but in absolute terms, our debt is rapidly approaching $18 trillion (Chart 1).","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":7274803,"ranking":19,"query_text":"what does debt to gdp ratio tell us","passage_text":"Use Financial Leverage Ratios to Measure the Solvency of Your Business The Debt-to-Equity Ratio: Measuring Financial Risk What the Debt to Asset Ratio Can Tell You About Your Company","bm25_label":"medium","relevance_label":0.0},{"query_id":635647,"passage_id":7580099,"ranking":20,"query_text":"what does debt to gdp ratio tell us","passage_text":"(Source: Debt to the Penny, U.S. Treasury. Debt FAQ, U.S. Treasury.) America's debt is the largest in the world for a single country. It runs neck and neck with that of the European Union, an economic union of 28 countries. For more, see Sovereign Debt Rankings. The debt is greater than what America produces in a whole year. This high debt-to-GDP ratio tells investors that the country might have problems repaying the loans. That's a new and worrying occurrence for the United States. In 1988, the debt was only half of America's economic output.","bm25_label":"medium","relevance_label":0.0}]