[{"query_id":637459,"passage_id":7595501,"ranking":1,"query_text":"what does fdg mean","passage_text":"What does FDG mean? This page is all about the meaning, abbreviation and acronym of FDG. explaining the definition or meaning and giving useful information of similar terms. FDG Stands For : FluoroDeoxyGlucose What is FDG?","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":7595508,"ranking":2,"query_text":"what does fdg mean","passage_text":"FDG definition \/ FDG means? The Definition of FDG is given above so check it out related information. What is the meaning of FDG? The meaning of the FDG is also explained earlier. Till now you might have got some idea about the acronym, abbreviation or meaning of FDG. What does FDG mean? is explained earlier. You might also like some similar terms related to FDG to know more about it.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":7595504,"ranking":3,"query_text":"what does fdg mean","passage_text":"What does F-18 FDG stand for? F-18 FDG stands for 2-(fluorine-18)-fluoro-2-deoxy-D-glucose. Q: A: How to abbreviate 2-(fluorine-18)-fluoro-2-deoxy-D-glucose? 2-(fluorine-18)-fluoro-2-deoxy-D-glucose can be abbreviated as F-18 FDG. Q: A: What is the meaning of F-18 FDG abbreviation? The meaning of F-18 FDG abbreviation is 2-(fluorine-18)-fluoro-2-deoxy-D-glucose. Q: A: What is F-18 FDG abbreviation? One of the definitions of F-18 FDG is 2-(fluorine-18)-fluoro-2-deoxy-D-glucose. Q: A: What does F-18 FDG mean? F-18 FDG as abbreviation means 2-(fluorine-18)-fluoro-2-deoxy-D-glucose. Q: A: What is shorthand of 2-(fluorine-18)-fluoro-2-deoxy-D-glucose? The most common shorthand of 2-(fluorine-18)-fluoro-2-deoxy-D-glucose is F-18 FDG.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":7595500,"ranking":4,"query_text":"what does fdg mean","passage_text":"This page is all about the meaning, abbreviation and acronym of FDG explaining the definition or meaning and giving useful information of similar terms. FDG Stands For : FluoroDeoxyGlucose.","bm25_label":"high","relevance_label":1.0},{"query_id":637459,"passage_id":8645185,"ranking":5,"query_text":"what does fdg mean","passage_text":"Several processes determine FDG uptake in tumor cells. Of major importance is the integrity of the vascular network that is necessary for supply of nutrients to the cell. FDG enters the cells by the same facilitated transport mechanism as glucose. The most common glucose transporters expressed on the cell membrane are Glut-1 which are insulin independent. Once inside the cell, FDG is phosphorylated by hexokinase into FDG-6-phosphate. FDG-6-phosphate does not enter into further metabolism and accumulates intracellularly.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":8067784,"ranking":6,"query_text":"what does fdg mean","passage_text":"This means that when a PET Scan does not show uptake (meaning it is not hot) there is unlikely to be cancer. However, when a PET Scan detects uptake of the FDG tracer, it means that it might be cancer, but is not definite. Like most new technologies, PET Scans are very expensive, often costing thousands of dollars.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":7595505,"ranking":7,"query_text":"what does fdg mean","passage_text":"FDG (the radioactive, sugary koolaid compound you have before the PET\/CT) uptake does in fact increase in areas of the skeleton where there is significant osteoblastic activity versus what is seen in bones with normal osteoblastic \/ osteoclastic activity - just as FDG uptake increases in areas where cancer cells are present (which have increased metabolic activity versus normal cells and therefore suck up more of the radioactive koolaid).","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":8075727,"ranking":8,"query_text":"what does fdg mean","passage_text":"Re: Mild increased FDG uptake on PET\/CT - what's it mean? by Multibilly on Tue Mar 08, 2016 5:17 pm The first time I had a PET\/CT about 3 1\/2 years ago, I had to drink a barium sulfate contrast milkÂ­shake (they offered me different flavors) and then was later injected with FDG via a forÂ­miÂ­dable looking radioactive shielded syringe like this one:","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":5687198,"ranking":9,"query_text":"what does fdg mean","passage_text":"Before your PET scan, you will be given a radioactive medication with glucose (sugar) called a tracer through an intravenous (IV) line in your arm. Your PET scan will use fluorodeoxyglucose (FDG) as the tracer. FDG is taken up by your cells and does not stay in the body long.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":7595502,"ranking":10,"query_text":"what does fdg mean","passage_text":"Re: Mild increased FDG uptake on PET\/CT - what's it mean? by Nancy Shamanna on Tue Mar 08, 2016 2:26 pm Thanks, Tracy, for the detailed explanation of a PET (positron emission tomography) scan's uptake of a form of radioactive sugar.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":6065247,"ranking":11,"query_text":"what does fdg mean","passage_text":"However, the scans are not very specific. This means that it frequently will detect things that are not cancer. A recent infection or injury may show up on PET. This means that when a PET Scan does not show uptake (meaning it is not hot) there is unlikely to be cancer. However, when a PET Scan detects uptake of the FDG tracer, it means that it might be cancer, but is not definite. Like most new technologies, PET Scans are very expensive, often costing thousands of dollars.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":3971562,"ranking":12,"query_text":"what does fdg mean","passage_text":"FDG activity in the testes is mild. Faint FDG activity may be seen in the penis. Bone marrow FDG activity intensity is similar to liver but more homogenous, which is mildly above blood pool FDG activity. FDG activity in the bone marrow may be increased in anemic patients or patients on medications like G-CSF.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":8645184,"ranking":13,"query_text":"what does fdg mean","passage_text":"Assessment for malignancy and metastatic disease with PET FDG imaging is improved when supplemented by CT images . FDG imaging is performed in the fasting state to minimize competitive inhibition of FDG uptake by glucose.. A 4 hour fast is recommended prior to initiation of the PET FDG study.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":2952440,"ranking":14,"query_text":"what does fdg mean","passage_text":"Most PET scans today are performed with an imaging radiopharmaceutical -- most commonly FDG (Fluorodeoxyglucose), which is a tracer that goes into the heart to provide a picture of the organ's function on PET scans. If a person exercises before having a PET\/CT scan, more FDG appears in the heart region, obscuring the view. The researchers found that the same thing happens with caffeine: The heart beats faster when you drink coffee, just as it does when you exercise.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":4651581,"ranking":15,"query_text":"what does fdg mean","passage_text":"Fludeoxyglucose (18F) (INN), or fludeoxyglucose F 18 (USAN and USP), also commonly called fluorodeoxyglucose and abbreviated [18F]FDG, 18F-FDG or FDG, is a radiopharmaceutical used in the medical imaging modality positron emission tomography (PET).lthough in theory all 18 F-FDG is metabolized as above with a radioactivity elimination half-life of 110 minutes (the same as that of fluorine-18), clinical studies have shown that the radioactivity of 18 F-FDG partitions into two major fractions.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":8075734,"ranking":16,"query_text":"what does fdg mean","passage_text":"(d, e) Axial FDG PET images (shown from superior [top left] to inferior [bottom right]) (d) and a coronal FDG PET image (e) show isolated urinary FDG activity in a small extrarenal pelvis (arrows). This finding could be misinterpreted as FDG-avid paraaortic or renal hilar lymph nodes if the relationship to the kidney is not clearly demonstrated.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":4975437,"ranking":17,"query_text":"what does fdg mean","passage_text":"Fludeoxyglucose (18F) (INN), or fludeoxyglucose F 18 (USAN and USP), also commonly called fluorodeoxyglucose and abbreviated [18F]FDG, 18F-FDG or FDG, is a radiopharmaceutical used in the medical imaging modality positron emission tomography (PET).","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":8124967,"ranking":18,"query_text":"what does fdg mean","passage_text":"FDG Metabolic Brain study. What: A PET brain scan is used to either diagnose, stage, restage, or monitor therapy response to primary brain cancers or metastatic brain tumors. FDG PET\/CT brain studies can also differentiate different types of dementia. Images are acquired of just the brain after the same uptake period used in all other PET exams.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":4651585,"ranking":19,"query_text":"what does fdg mean","passage_text":"After 18 F-FDG is injected into a patient, a PET scanner can form two-dimensional or three-dimensional images of the distribution of 18 F-FDG within the body. Since its development in 1976, 18 F-FDG had a profound influence on research in the neurosciences.lthough in theory all 18 F-FDG is metabolized as above with a radioactivity elimination half-life of 110 minutes (the same as that of fluorine-18), clinical studies have shown that the radioactivity of 18 F-FDG partitions into two major fractions.","bm25_label":"high","relevance_label":0.0},{"query_id":637459,"passage_id":3817252,"ranking":20,"query_text":"what does fdg mean","passage_text":"The physiological FDG uptake in the myocardium is common in PET oncology, but noteworthy FDG uptake is sometimes observed (Table 1). Abnormal myocardial FDG uptake may be of clinical significance as it can indicate specific cardiac disorders, even in the fasting condition.","bm25_label":"high","relevance_label":0.0}]