[{"query_id":647260,"passage_id":7673658,"ranking":1,"query_text":"what does rough trade mean","passage_text":"<a href=http:\/\/onlineslangdictionary.com\/meaning-definition-of\/rough-trade>rough trade<\/a> To link to this term in a wiki such as Wikipedia, insert the following. [http:\/\/onlineslangdictionary.com\/meaning-definition-of\/rough-trade rough trade] Some wikis use a different format for links, so be sure to check the documentation. â\u0086\u0090 Previous - rough patch","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":7673654,"ranking":2,"query_text":"what does rough trade mean","passage_text":"Link to this slang definition. To link to this term in a web page or blog, insert the following. <a href=http:\/\/onlineslangdictionary.com\/meaning-definition-of\/rough-trade>rough trade<\/a>. To link to this term in a wiki such as Wikipedia, insert the following.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":7052393,"ranking":3,"query_text":"what does rough trade mean","passage_text":"What does Business & Finance ROM stand for? Hop on to get the meaning of ROM. The Business & Finance Acronym \/Abbreviation\/Slang ROM means Rough Order of Magnitude. by AcronymAndSlang.com","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":7964957,"ranking":4,"query_text":"what does rough trade mean","passage_text":"Definition - What does Scoring mean? Scoring is a type of abrasive wear, referring to a rough surface, usually with cuts. It appears as long scratches in the direction of motion.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":7673650,"ranking":5,"query_text":"what does rough trade mean","passage_text":"Historical Examples. 1  Think what it meant to work out of such a crude, rough trade into one so delicate! 2  He is a simple workman, who toils ten hours a day at his rough trade of iron-worker to supply his wants.'.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":8075012,"ranking":6,"query_text":"what does rough trade mean","passage_text":"Related Spanish Language Questions. What does the Spanish word dura mean in English? Dura is the Spanish word for hard. What else can translate for you today?... What does the word dura mean in Spanish? Duro means hard or rough Dura is the feminine form of the adjective duro. ! what does Quiero mierda dura mas tarde mean? That translates directly to: 'I want excrement lasts later' ! What does 'Yo quiero mi dura verga en tu panocha mojada' mean in English? I want my hard c--- into your wet panocha Panocha however means a type of...","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":2910895,"ranking":7,"query_text":"what does rough trade mean","passage_text":"What does 'Give Up' mean. Give up is a procedure in securities or commodities trading where the executing broker places a trade on behalf of a second broker as if the second broker actually executed the trade.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":7021016,"ranking":8,"query_text":"what does rough trade mean","passage_text":"Definition: Insider trading is the purchase or sale of securities by individuals, usually brokers, who have access to price sensitive information that is not readily available to the public, and are exploiting this information for personal gain. What Does Insider Trading Mean? What is the definition of insider trading?","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":545760,"ranking":9,"query_text":"what does rough trade mean","passage_text":"l.Ft closure does not mean the end of.Iamming- they only took lOO copiesr':.nd. although t3 5 g ir'v et-;-;id round the uK, ir,.o'sot'o,ig'fi'*;;;; iiii).rriil'iy,lr*i*.ilf' B have never used Phoenix anyway. The biggest fanzine distributors at the mor are U f. L Rough Trade.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":918847,"ranking":10,"query_text":"what does rough trade mean","passage_text":"Dictionary entry overview: What does acrimony mean? â\u0080¢ ACRIMONY (noun) The noun ACRIMONY has 1 sense: 1. a rough and bitter manner Familiarity information: ACRIMONY used as a noun is very rare.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":387414,"ranking":11,"query_text":"what does rough trade mean","passage_text":"Who wrote People sleep peaceably in their beds at night only because rough men stand ready to do violence on their behalf and what does it mean? George Orwell is credited for writing this. There are some who will disagree with this though.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":5419955,"ranking":12,"query_text":"what does rough trade mean","passage_text":"Trade (gay slang) This article is about slang term. For related meanings, see Rough Trade (disambiguation). Trade (also known as Chow) is a gay slang term originating from Polari and refers to the (usually) casual partner of a gay man or to the genre of such pairings. Men falling in the category of trade are not gay-identified.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":4790969,"ranking":13,"query_text":"what does rough trade mean","passage_text":"Definition: A trade embargo is a governmental order to restrict trade of certain goods or all goods entirely with a foreign country. This typically stems from political differences between the two nations or economic circumstances that make commercial trade undesirable. What Does Trade Embargo Mean? What is the definition of trade embargo? Trade embargos restrict trade between countries for a variety of reasons. The most common reason is political conflicts between the nations.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":5700811,"ranking":14,"query_text":"what does rough trade mean","passage_text":"Source(s): disposition open market 0 share insiders trade company: https:\/\/trimurl.im\/j48\/what-does-disposition-non-open-market-at-0-per-share-mean-i-see-this-when-insiders-trade-in-a-company.Verena Â· 2 months ago. Thumbs up. 2.n yahoofinance.com. Source(s): disposition open market 0 share insiders trade company: https:\/\/trimurl.im\/j48\/what-does-disposition-non-open-market-at-0-per-share-mean-i-see-this-when-insiders-trade-in-a-company. Verena Â· 2 months ago.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":5700813,"ranking":15,"query_text":"what does rough trade mean","passage_text":"On yahoofinance.com. Source(s): disposition open market 0 share insiders trade company: https:\/\/trimurl.im\/j48\/what-does-disposition-non-open-market-at-0-per-share-mean-i-see-this-when-insiders-trade-in-a-company. Verena Â· 2 months ago.Thumbs up. 2.n yahoofinance.com. Source(s): disposition open market 0 share insiders trade company: https:\/\/trimurl.im\/j48\/what-does-disposition-non-open-market-at-0-per-share-mean-i-see-this-when-insiders-trade-in-a-company. Verena Â· 2 months ago.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":2910899,"ranking":16,"query_text":"what does rough trade mean","passage_text":"What does 'Give Up' mean Give up is a procedure in securities or commodities trading where the executing broker places a trade on behalf of a second broker as if the second broker actually executed the trade. This is usually done because a broker cannot place a trade for a client based on other workplace obligations.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":6045875,"ranking":17,"query_text":"what does rough trade mean","passage_text":"What does 'Churning' mean. Churning means excessive trading by a broker in a client's account largely to generate commissions. Churning is an illegal and unethical practice that violates SEC rules and securities laws.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":6538184,"ranking":18,"query_text":"what does rough trade mean","passage_text":"What does 'Free Trade' mean. Free trade is the economic policy of not discriminating against imports from and exports to foreign jurisdictions. Buyers and sellers from separate economies may voluntarily trade without the domestic government applying tariffs, quotas, subsidies or prohibitions on their goods and services. Free trade is the opposite of trade protectionism or economic isolationism.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":1909769,"ranking":19,"query_text":"what does rough trade mean","passage_text":"Likes (Received) 1. #1 12-Feb-2008, 08:09. what means rough around the edges? the dictionary says: If someone is rough around the edges, they haven't mastered something, though they show promise.. But I have heart this expression in other contexts: 1. if s.o. does not feel well, a bit frayed maybe, for example because of a hang over.","bm25_label":"medium","relevance_label":0.0},{"query_id":647260,"passage_id":162487,"ranking":20,"query_text":"what does rough trade mean","passage_text":"What does 'Free Trade' mean. Free trade is the economic policy of not discriminating against imports from and exports to foreign jurisdictions. Buyers and sellers from separate economies may voluntarily trade without the domestic government applying tariffs, quotas, subsidies or prohibitions on their goods and services.","bm25_label":"medium","relevance_label":0.0}]