[{"query_id":65488,"passage_id":7725406,"ranking":1,"query_text":"can celiac disease cause excessive sweating","passage_text":"Alter your diet can have a celiac disease and hyperhidrosis href=http:\/\/hyperhidrosiscauses.net\/hyperhidrosis-canada\/>less likely chances are you hyperactivity due to social consequences. So yes I went from coffee have any excessive sweating problem celiac disease and hyperhidrosis under $50.","bm25_label":"high","relevance_label":1.0},{"query_id":65488,"passage_id":3877984,"ranking":2,"query_text":"can celiac disease cause excessive sweating","passage_text":"1 Increased sweating from a very hot environment can cause dehydration. 2  Excessive urination can be caused by unrecognized or poorly treated diabetes mellitus (not taking insulin) or diabetes insipidus.  Conditions such as cystic fibrosis or celiac sprue do not allow food to be absorbed and can cause dehydration.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":6601451,"ranking":3,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive sweating. Excessive sweating: Introduction. Excessive sweating: A condition which is characterized by an abnormal excess of sweating. See detailed information below for a list of 100 causes of Excessive sweating, Symptom Checker, including diseases and drug side effect causes. Â» Review Causes of Excessive sweating: Causes | Symptom Checker Â».","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":158342,"ranking":4,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive sweating: Introduction. Excessive sweating: A condition which is characterized by an abnormal excess of sweating. See detailed information below for a list of 100 causes of Excessive sweating, Symptom Checker, including diseases and drug side effect causes. Â» Review Causes of Excessive sweating: Causes | Symptom Checker Â».","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":6592824,"ranking":5,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive Sweating. A person with excessive sweating has a condition called hyperhidrosis. Sweating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body. Hyperhidrosis is excessive sweating that occurs when the body is not exposed to a warm environment. In adults, the most common cause of hyperhidrosis is emotional stress. However, excessive sweating is also caused by heart disease, lung disease, diabetes, and shock.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":671770,"ranking":6,"query_text":"can celiac disease cause excessive sweating","passage_text":"Yellow stool is typically due to an excess of fatty foods and grease in the diet. Mayo Clinic states that it can also be caused by a malabsorption disorder such as celiac disease.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":6807972,"ranking":7,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive sweating may be a symptom of an underlying disease, disorder or condition. The medical term for excessive sweating is hyperhidrosis. Hyperthyroidism (overactive thyroid) and hypoglycemia (low blood sugar) are just two of many conditions that may cause excessive sweating.xcessive sweating may be a symptom of an underlying disease, disorder or condition. The medical term for excessive sweating is hyperhidrosis. Hyperthyroidism (overactive thyroid) and hypoglycemia (low blood sugar) are just two of many conditions that may cause excessive sweating.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":6176551,"ranking":8,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive Sweating. A person with excessive sweating has a condition called hyperhidrosis. Sweating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body.Hyperhidrosis is excessive sweating that occurs when the body is not exposed to a warm environment.In adults, the most common cause of hyperhidrosis is emotional stress.However, excessive sweating is also caused by heart disease, lung disease, diabetes, and shock.xcessive Sweating. A person with excessive sweating has a condition called hyperhidrosis. Sweating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":8613720,"ranking":9,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive Sweating. A person with excessive sweating has a condition called hyperhidrosis. Sweating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body.Hyperhidrosis is excessive sweating that occurs when the body is not exposed to a warm environment. In adults, the most common cause of hyperhidrosis is emotional stress.However, excessive sweating is also caused by heart disease, lung disease, diabetes, and shock.xcessive Sweating. A person with excessive sweating has a condition called hyperhidrosis. Sweating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":4666391,"ranking":10,"query_text":"can celiac disease cause excessive sweating","passage_text":"Tags: Diseases & Conditions Excessive sweating Diabetes Dehydration. Excessive thirst or dipsesis is a condition that causes extreme fluid loss while depleting the water from your body, thereby causing excessive thirst. You can lose large amounts of water from your body through excessive urination, diarrhoea, vomiting and sweating.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":4736093,"ranking":11,"query_text":"can celiac disease cause excessive sweating","passage_text":"Celiac disease can affect genetically predisposed people of all ages, but often begins in middle infancy. Symptoms include chronic diarrhea, weight loss and fatigue, but in some cases the disorder can be asymptomatic (no symptoms).Celiac disease is caused by a reaction to gliadin-a gluten protein found in wheat, barley, rye, and sometimes oats.The inflammation and destruction of the inner lining of the small intestine in celiac disease is caused by an allergic reaction to gluten in the diet.t is also possible to have celiac disease without any symptoms at all. Many adults with subtle disease only have fatigue and anemia, or may have only vague abdominal discomfort such as bloating, abdominal distension and excess gas.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":2715007,"ranking":12,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive Sweating. A person with excessive sweating has a condition called hyperhidrosis. Sweating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body.Hyperhidrosis is excessive sweating that occurs when the body is not exposed to a warm environment.In adults, the most common cause of hyperhidrosis is emotional stress. However, excessive sweating is also caused by heart disease, lung disease, diabetes, and shock.weating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body. Hyperhidrosis is excessive sweating that occurs when the body is not exposed to a warm environment. In adults, the most common cause of hyperhidrosis is emotional stress.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":3310186,"ranking":13,"query_text":"can celiac disease cause excessive sweating","passage_text":"Overweight people are often more heavily endowed with sweating than their thinner counterparts. If you have AIDS, sweating can occur. Other causes of excessive perspiration are symptoms of diseases. Some of these diseases are well known, such as night sweats, flu, tuberculosis, pneumonia, and malaria. Other diseases which can cause more fluids to be released out of the pores are Hodgkinâ\u0080\u0099s disease, abscess, cancer, liver disease, and kidney disease.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":2580683,"ranking":14,"query_text":"can celiac disease cause excessive sweating","passage_text":"Inflammatory Bowel Disease (IBD) These IBDs in one form or another cause inflammation to the lining of the intestinal tract. This inflammation can lead to excess production of mucus that covers the stool. With celiac disease, Crohns disease and ulcerative colitis there can also be symptoms of diarrhea. Although not a inflammatory bowel disease, irritable bowel syndrome could also result in excessive amounts of mucus.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":1679500,"ranking":15,"query_text":"can celiac disease cause excessive sweating","passage_text":"Some people have bothersome symptoms of celiac disease, including diarrhea, weight loss, abdominal discomfort, excessive gas, and other signs and symptoms caused by vitamin and nutrient deficiencies. Some conditions are more common in people with celiac disease, including:","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":6807971,"ranking":16,"query_text":"can celiac disease cause excessive sweating","passage_text":"A person with excessive sweating has a condition called hyperhidrosis. Sweating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body. Hyperhidrosis is excessive sweating that occurs when the body is not exposed to a warm environment.In adults, the most common cause of hyperhidrosis is emotional stress. However, excessive sweating is also caused by heart disease, lung disease, diabetes, and shock.weating is normal when the body is exposed to a warm environment. The evaporation of sweat from the skin surface cools the body. Hyperhidrosis is excessive sweating that occurs when the body is not exposed to a warm environment.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":6997867,"ranking":17,"query_text":"can celiac disease cause excessive sweating","passage_text":"Excessive sweating can be normal, if it is caused by factors like high atmospheric temperature. For some people, sweating could be almost persistent and profuse. This condition (excessive sweating) is called hyperhidrosis. It may affect the whole body or specific body parts like soles of feet, palms and head. Excessive head sweating is called cranial hyperhidrosis. As in case of other types (of hyperhidrosis), cranial hyperhidrosis can also be primary or secondary. The condition is categorized as primary cranial hyperhidrosis, if it is a disease in itself and is not caused by any other underlying medical condition.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":665716,"ranking":18,"query_text":"can celiac disease cause excessive sweating","passage_text":"1 Malabsorption can be caused by conditions such as celiac disease, Crohnâ\u0080\u0099s disease, lactose intolerance, and intestinal damage.  Risk factors include a family history of malabsorption or cystic fibrosis, excessive alcohol consumption, and travel to the Caribbean or Southeast Asia.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":2389483,"ranking":19,"query_text":"can celiac disease cause excessive sweating","passage_text":"Wheat and gluten, which is the naturally derived byproduct of wheat, can cause excess mucus. This becomes even more concerning when people have gluten allergies or sensitivities, such as those with Celiac disease.","bm25_label":"high","relevance_label":0.0},{"query_id":65488,"passage_id":5063842,"ranking":20,"query_text":"can celiac disease cause excessive sweating","passage_text":"Sweating occurs when the sweat glands in your skin secrete a salty fluid called sweat, or perspiration.Sweating is a normal function that serves to cool your body, often in hot or humid environments or when you exercise. Excessive sweating may be a symptom of an underlying disease, disorder or condition.The medical term for excessive sweating is hyperhidrosis.Hyperthyroidism (overactive thyroid) and hypoglycemia (low blood sugar) are just two of many conditions that may cause excessive sweating.xcessive sweating may be a symptom of an underlying disease, disorder or condition. The medical term for excessive sweating is hyperhidrosis. Hyperthyroidism (overactive thyroid) and hypoglycemia (low blood sugar) are just two of many conditions that may cause excessive sweating.","bm25_label":"high","relevance_label":0.0}]