[{"query_id":65583,"passage_id":7392795,"ranking":1,"query_text":"can chewing gum cause ulcers","passage_text":"Chewing gum may help ulcer relief. The bacteria which causes up to 90% of peptic ulcers may soon be eradicated by a type of naturally occurring chewing gum. Scientists have today announced details of a clinical trial on mastic gum, a natural tree resin, which grows in parts of Greece.","bm25_label":"high","relevance_label":1.0},{"query_id":65583,"passage_id":7392800,"ranking":2,"query_text":"can chewing gum cause ulcers","passage_text":"Kay 9 June 08. chewing gum causes ulcers for me. Simone 9 June 08. i also have mouth ulcers and hot drinks and chewing gum help mine as well and they seem to work better for pain relief than bonjela and the millions of things i have tried.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":6441076,"ranking":3,"query_text":"can chewing gum cause ulcers","passage_text":"However, chewing gum contains artificial sweeteners and flavorings, which can be harmful for the baby and the expecting mother. Certain flavors like cinnamon (may cause mouth sores or ulcers), licorice (may cause high blood pressure), sorbitol (may cause diarrhea) are harmful for pregnant women.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":4547435,"ranking":4,"query_text":"can chewing gum cause ulcers","passage_text":"Chewing gum can also lead to stomach ulcers, because you are swallowing saliva with no food in it, and the stomach acids can begin to eat away at the lining of the stomach.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":7392799,"ranking":5,"query_text":"can chewing gum cause ulcers","passage_text":"Chewing gum and acid reflux. Highlights. Chewing gum may reduce inflammation and soothe your esophagus. Chewing gum causes your saliva to become more alkaline. This can neutralize the acid in your stomach. These effects can vary depending on the type of gum youâ\u0080\u0099re chewing.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":7063074,"ranking":6,"query_text":"can chewing gum cause ulcers","passage_text":"Chewing Gum. In some cases, chewing gum constantly can cause stomach bloating. The reason for this is attributed to the fact that when an individual chews gum, he\/she would be swallowing large amounts of saliva and air that would reach the stomach and cause it to bloat.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":7567848,"ranking":7,"query_text":"can chewing gum cause ulcers","passage_text":"Stay away from the very foods which may cause an ulcer under tongue, like tomato sauce, pizza, oranges, lemony based foods, or spicy dishes. Avoid chewing on gum as this will also irritate tongue ulcers. Use over the counter pain medications for any discomfort.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":6498271,"ranking":8,"query_text":"can chewing gum cause ulcers","passage_text":"4. Chew sugar-less gum. Chewing sugar-less gum can be a simple way to reduce bad breath. When sugar-less gum is chewed, saliva production is increased, and it washes away bacteria. Try chewing sugar-less gum after you smoke to remove these bacteria. 1  Try chewing the gum right after you smoke.2  Chewing gum helps prevent dry mouth, which can cause bad breath. 3  You may also want to try sugar-less mints to help freshen your breath.ry chewing sugar-less gum after you smoke to remove these bacteria. 1  Try chewing the gum right after you smoke. 2  Chewing gum helps prevent dry mouth, which can cause bad breath. 3  You may also want to try sugar-less mints to help freshen your breath.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":6332064,"ranking":9,"query_text":"can chewing gum cause ulcers","passage_text":"A large machine filled with chewing gum. It may surprise you, but chewing gum can cause intestinal bloating and gas. Bloating is the result of trapped gas in your digestive system that can cause your waist line to increase up to three inches, according to ABCâ\u0080\u0099s Good Morning America. If you notice that youâ\u0080\u0099re bloated after chewing gum, stop chewing gum for a few days to see if the bloating subsides.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":8195922,"ranking":10,"query_text":"can chewing gum cause ulcers","passage_text":"Before you reach for another stick of gum, consider these gross side effects chewing gum can cause. Before you reach for another stick of gum, consider these gross side effects chewing gum can cause. Call Toll Free: 877-985-2695 Subscribe to Dr. Mercola's Natural Health Newsletter","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":2216417,"ranking":11,"query_text":"can chewing gum cause ulcers","passage_text":"6 Gross Side Effects of Chewing Gum. Before you reach for another stick of gum, consider these rather disturbing side effects that gum chewing can cause. Many people chew on a stick of gum to reduce food cravings and, theoretically, help them avoid eating unhealthy foods.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":7392801,"ranking":12,"query_text":"can chewing gum cause ulcers","passage_text":"Not necessarily: Ulcers on the gum are individual outbreaks of a virus. The ulcer will run its course and can be treated with different medications being put directly on it. These can give the feeling of swollen gums. Gum disease can also cause swollen gums. This disease is caused by bacteria and needs to be treated with cleanings, medication and education by your dentist. ...Read more.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":2216412,"ranking":13,"query_text":"can chewing gum cause ulcers","passage_text":"Before you reach for another stick of gum, consider these rather disturbing side effects that gum chewing can cause. 1. Chewing Gum May Increase Your Junk-Food Intake. Many people chew on a stick of gum to reduce food cravings and, theoretically, help them avoid eating unhealthy foods.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":7392796,"ranking":14,"query_text":"can chewing gum cause ulcers","passage_text":"When it comes to acid reflux, chewing gum works to reduce acid in the esophagus. The act of chewing can increase your saliva production, and cause you to swallow more. This allows any acidity in your mouth to be cleared much more quickly. Gum chewing may provide even more relief if you chew bicarbonate gum.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":7392798,"ranking":15,"query_text":"can chewing gum cause ulcers","passage_text":"People who chewed gum were less likely to eat fruit and instead were more motivated to eat junk food like potato chips and candy. Chewing gum causes you to swallow excess air, which can contribute to abdominal pain and bloating, along with other gastrointestinal issues. Chewing gum (including sugar-free gum) may cause tooth decay and erosion and may cause mercury to be released from your mercury fillings.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":245532,"ranking":16,"query_text":"can chewing gum cause ulcers","passage_text":"Chewing gum can also lead to swallowing air, which can cause bloating. If you've got a gum habit, alternate chewing gum with sucking on a piece of hard candy or eating a healthy, high-fiber snack like fruit, vegetables, or lower-fat popcorn.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":8578279,"ranking":17,"query_text":"can chewing gum cause ulcers","passage_text":"Tips for quick pain relief. 1  If the mouth ulcer is causing a lot of pain, gently rub a small ice cube over the spot or rinse your mouth with ice-cold water. If your gums are bleeding, ensure that you include these foods to treat mouth ulcer. You could also chew on a clove bud (lavang) and direct the juice generated to the area where the ulcer is located. Clove buds for sore throat is an amazing remedy.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":572202,"ranking":18,"query_text":"can chewing gum cause ulcers","passage_text":"In many cases, the symptoms of abdominal bloating can be diminished or even prevented by adopting a few simple lifestyle changes. For example: Donâ\u0080\u0099t chew gum. Chewing gum can cause you to swallow extra air, which in turn can lead to bloating.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":8598274,"ranking":19,"query_text":"can chewing gum cause ulcers","passage_text":"Gum SHOULD be allowed Most people say that gum shouldnÂ´t be allowed to chew gum because they can stick it under the desks or because it causes cavities, however, if students are allowed to chew gum, and it is clearly stated as okay, then students wouldnÂ´t have a reason to stick it under the desks or be sneaky and rebellious.","bm25_label":"high","relevance_label":0.0},{"query_id":65583,"passage_id":2628315,"ranking":20,"query_text":"can chewing gum cause ulcers","passage_text":"Feline stomatitis is a severe, painful inflammation of a catâ\u0080\u0099s mouth and gums. In most cases, the condition causes ulcers to form in the mouth; these ulcers can involve the lips, tongue, gums, and back of the throat.","bm25_label":"high","relevance_label":0.0}]