[{"query_id":660999,"passage_id":1451888,"ranking":1,"query_text":"what foods are high in bad carbs","passage_text":"While the guidelines advocated for more carbs in the form of fruits, vegetables and whole grains, what the average American understood was that carbs â\u0080\u0094 any kind of carbs â\u0080\u0094 were good (even refined carbohydrates!) while fat was bad. The food industry pounced: High-carb, low-fat foods became the norm.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":8641540,"ranking":2,"query_text":"what foods are high in bad carbs","passage_text":"The war on fat had begun. While the guidelines advocated for more carbs in the form of fruits, vegetables and whole grains, what the average American understood was that carbs â\u0080\u0094 any kind of carbs â\u0080\u0094 were good (even refined carbohydrates!) while fat was bad. The food industry pounced: High-carb, low-fat foods became the norm.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":1363386,"ranking":3,"query_text":"what foods are high in bad carbs","passage_text":"Summary: 1.Carbs in their natural state are the good carbs while the processed ones are the bad carbs. 2.The fiber content is high in good carbs and low in bad carbs. 3.In good carbs the energy level remains high for a long time but in the case of bad carbs it comes down quickly.4.Good carbs contain vitamins and minerals in abundance, while bad carbs contain calories.airy products like milk, cheese and butter can also be excellent sources of good carbohydrates. In turn, bad carbs are the food items that are refined and processed before being consumed. In short, any food that is changed from its natural state before it is eaten by a person can be labeled as a bad carbohydrate.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":6668035,"ranking":4,"query_text":"what foods are high in bad carbs","passage_text":"The Good Carb Bad Carb Bottom Line. Unhealthy bad carbs are filled with empty calories that have no nutritional value. And eating a diet high in bad carbohydrate foods, as most everyone does, increases your risk of heart disease, stroke, arthritis, Alzheimer's disease, diabetes and obesity. The bottom line is bad carbs are bad and good carbs are good.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":3393515,"ranking":5,"query_text":"what foods are high in bad carbs","passage_text":"The Good Carb Bad Carb Bottom Line Unhealthy bad carbs are filled with empty calories that have no nutritional value. And eating a diet high in bad carbohydrate foods, as most everyone does, increases your risk of heart disease, stroke, arthritis, Alzheimer's disease, diabetes and obesity.ood carbs are also generally high fiber foods. Besides being nutritious in many other ways, this list of healthy foods rich in fiber give you on-going energy and a sense of feeling full and satisfied.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":5671140,"ranking":6,"query_text":"what foods are high in bad carbs","passage_text":"The Good Carb Bad Carb Bottom Line Unhealthy bad carbs are filled with empty calories that have no nutritional value. And eating a diet high in bad carbohydrate foods, as most everyone does, increases your risk of heart disease, stroke, arthritis, Alzheimer's disease, diabetes and obesity.ad carbs are carbohydrate foods that have been highly refined and processed, removing most of the nutritional value and fiber. They're generally loaded with high-calorie fats, sweeteners, preservatives and other unhealthy additives.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":819617,"ranking":7,"query_text":"what foods are high in bad carbs","passage_text":"The Good Carb Bad Carb Bottom Line Unhealthy bad carbs are filled with empty calories that have no nutritional value. And eating a diet high in bad carbohydrate foods, as most everyone does, increases your risk of heart disease, stroke, arthritis, Alzheimer's disease, diabetes and obesity.he good carbs on the list of carbohydrate foods can provide your body with energy, optimum nutrition, proper brain and organ function and a healthy, attractive appearance. But bad carbs are detrimental to a healthy diet.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":6137403,"ranking":8,"query_text":"what foods are high in bad carbs","passage_text":"And eating a diet high in bad carbohydrate foods, as most everyone does, increases your risk of heart disease, stroke, arthritis, Alzheimer's disease, diabetes and obesity. The bottom line is bad carbs are bad and good carbs are good.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":8527227,"ranking":9,"query_text":"what foods are high in bad carbs","passage_text":"Itâ\u0080\u0099s based on how much fiber is in the food and how fast the foodâ\u0080\u0099s sugars are absorbed into your blood stream. For more info about good, bad, simple and complex carbs, go to the Good Carbs List of Carbohydrates in Food, the Low Glycemic Diet of Low Glycemic Foods and the complete list of healthy High Fiber Foods.More CommonSenseHealth for You: How to Stop Emotional Eating.â\u0080\u009cRefinedâ\u0080\u009d Bad Carb Sweet Sugar Death.tâ\u0080\u0099s based on how much fiber is in the food and how fast the foodâ\u0080\u0099s sugars are absorbed into your blood stream. For more info about good, bad, simple and complex carbs, go to the Good Carbs List of Carbohydrates in Food, the Low Glycemic Diet of Low Glycemic Foods and the complete list of healthy High Fiber Foods.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":948984,"ranking":10,"query_text":"what foods are high in bad carbs","passage_text":"Itâ\u0080\u0099s based on how much fiber is in the food and how fast the foodâ\u0080\u0099s sugars are absorbed into your blood stream. For more info about good, bad, simple and complex carbs, go to the Good Carbs List of Carbohydrates in Food, the Low Glycemic Diet of Low Glycemic Foods and the complete list of healthy High Fiber Foods.More CommonSenseHealth for You:How to Stop Emotional Eating.â\u0080\u009cRefinedâ\u0080\u009d Bad Carb Sweet Sugar Death.tâ\u0080\u0099s based on how much fiber is in the food and how fast the foodâ\u0080\u0099s sugars are absorbed into your blood stream. For more info about good, bad, simple and complex carbs, go to the Good Carbs List of Carbohydrates in Food, the Low Glycemic Diet of Low Glycemic Foods and the complete list of healthy High Fiber Foods.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":552442,"ranking":11,"query_text":"what foods are high in bad carbs","passage_text":"The Good Carb Bad Carb Bottom Line Unhealthy bad carbs are filled with empty calories that have no nutritional value. And eating a diet high in bad carbohydrate foods, as most everyone does, increases your risk of heart disease, stroke, arthritis, Alzheimer's disease, diabetes and obesity.ut bad carbs are detrimental to a healthy diet. And consistently eating from the bad carbs list will rapidly sabotage all your health and weight management goals. So choose all of your carbohydrates from this great list of healthy carbohydrate foods.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":1287605,"ranking":12,"query_text":"what foods are high in bad carbs","passage_text":"The Good Carb Bad Carb Bottom Line Unhealthy bad carbs are filled with empty calories that have no nutritional value. And eating a diet high in bad carbohydrate foods, as most everyone does, increases your risk of heart disease, stroke, arthritis, Alzheimer's disease, diabetes and obesity.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":185315,"ranking":13,"query_text":"what foods are high in bad carbs","passage_text":"The difference in good carbs vs bad carbs is not based on a simple and complex carbohydrates list. Itâ\u0080\u0099s based on how much fiber is in the food and how fast the foodâ\u0080\u0099s sugars are absorbed into your blood stream. For more info about good, bad, simple and complex carbs, go to the Good Carbs List of Carbohydrates in Food, the Low Glycemic Diet of Low Glycemic Foods and the complete list of healthy High Fiber Foods.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":6655829,"ranking":14,"query_text":"what foods are high in bad carbs","passage_text":"Carbohydrates are in nearly every food in your diet. Often, carbohydrates have a bad reputation, but it's not carbohydrates that are bad, it is the processed junk foods that are full of carbs, calories and high levels of fat.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":2503177,"ranking":15,"query_text":"what foods are high in bad carbs","passage_text":"The South Beach Diet is meant to be simple and accessible. The basic premise is to replace bad carbs with good carbs, and bad fats with good fats.. Bad carbs, according to the South Beach Diet, are those with a high glycemic indexâ\u0080\u0094i.e., those foods which increase your blood sugar at an especially fast rate.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":6655828,"ranking":16,"query_text":"what foods are high in bad carbs","passage_text":"Some carbs break down quickly, others take awhile and some carbohydrates don't digest at all. Carbohydrates are in nearly every food in your diet. Often, carbohydrates have a bad reputation, but it's not carbohydrates that are bad, it is the processed junk foods that are full of carbs, calories and high levels of fat.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":2748384,"ranking":17,"query_text":"what foods are high in bad carbs","passage_text":"Bad carbs are carbohydrate foods that have been highly refined and processed, removing most of the nutritional value and fiber. They're generally loaded with high-calorie fats, sweeteners, preservatives and other unhealthy additives. With all the processing and additives, bad carbs can be made to be temptingly tasty.ut bad carbs are detrimental to a healthy diet. And consistently eating from the bad carbs list will rapidly sabotage all your health and weight management goals. So choose all of your carbohydrates from this great list of healthy carbohydrate foods.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":6940081,"ranking":18,"query_text":"what foods are high in bad carbs","passage_text":"If not managed properly, this can result in high-carb foods causing big blood sugar spikes or constantly high blood sugar levels, both of which are bad for your health. 93% of the calories in bananas come from carbs.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":6263982,"ranking":19,"query_text":"what foods are high in bad carbs","passage_text":"Itâ\u0080\u0099s based on how much fiber is in the food and how fast the foodâ\u0080\u0099s sugars are absorbed into your blood stream. For more info about good, bad, simple and complex carbs, go to the Good Carbs List of Carbohydrates in Food, the Low Glycemic Diet of Low Glycemic Foods and the complete list of healthy High Fiber Foods.More CommonSenseHealth for You: How to Stop Emotional Eating.ealthy Carbs and Complex Carbohydrates List. Simple and complex carbohydrates can be misunderstood. Since whole fruit is a simple carb, itâ\u0080\u0099s best to categorize carbs as either bad or good carbs.","bm25_label":"medium","relevance_label":0.0},{"query_id":660999,"passage_id":7525862,"ranking":20,"query_text":"what foods are high in bad carbs","passage_text":"Bad carbs are carbohydrate foods that have been highly refined and processed, removing most of the nutritional value and fiber. They're generally loaded with high-calorie fats, sweeteners, preservatives and other unhealthy additives.he good carbs on the list of carbohydrate foods can provide your body with energy, optimum nutrition, proper brain and organ function and a healthy, attractive appearance. But bad carbs are detrimental to a healthy diet.","bm25_label":"medium","relevance_label":0.0}]