[{"query_id":662282,"passage_id":7941486,"ranking":1,"query_text":"what form of currency does belize","passage_text":"Belize's currency options. Belize accepts two types of currency, but it may be difficult to withdraw more. The official currency of Belize is the Belizean dollar, but many establishments also accept American dollars, so find out what currency vendors are using when they quote rates.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":6109004,"ranking":2,"query_text":"what form of currency does belize","passage_text":"It's always advisable to bring money in a variety of forms on a vacation: a mix of cash, credit cards, debit cards, and, occasionally, traveler's checks. Currency. The Belize dollar, abbreviated BZ$, is the official currency of Belize. It is pegged to the U.S. dollar at a ratio of 2 Belize dollars to 1 U.S. dollar. Both currencies are acceptable at almost any business or establishment around the country.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":6109003,"ranking":3,"query_text":"what form of currency does belize","passage_text":"Belize, Dollar. The Belizean Dollar is the currency of Belize. Our currency rankings show that the most popular Belize Dollar exchange rate is the USD to BZD rate. The currency code for Dollars is BZD, and the currency symbol is BZ$. Below, you'll find Belizean Dollar rates and a currency converter.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":3086487,"ranking":4,"query_text":"what form of currency does belize","passage_text":"Belizeâ\u0080\u0099s Currency. The Belize dollar is the official currency of Belize and is pegged at BZ$2 = US$1. The Central Bank of Belize Act gives the Bank the sole right to issue notes and coins in Belize. Therefore, only such notes and coins issued by the Central Bank of Belize are legal tender in Belize.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":3086486,"ranking":5,"query_text":"what form of currency does belize","passage_text":"Belize dollar. The Belize dollar is the official currency in Belize (currency code BZD). It is normally abbreviated with the dollar sign $, or alternatively BZ$ to distinguish it from other dollar-denominated currencies. It is divided into 100 cents. The official value is pegged at 2 BZ$ = 1 US$.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":3086492,"ranking":6,"query_text":"what form of currency does belize","passage_text":"The Belizean Dollar is the currency of Belize. Our currency rankings show that the most popular Belize Dollar exchange rate is the USD to BZD rate. The currency code for Dollars is BZD, and the currency symbol is BZ$. Below, you'll find Belizean Dollar rates and a currency converter.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":3086490,"ranking":7,"query_text":"what form of currency does belize","passage_text":"Belize Dollar exchange rates against currencies in North and South America for April 14. Exchange rates for the Belize Dollar against foreign currencies from North and South America are displayed in the table above. The values in the Exchange Rate column provide the quantity of foreign currency units that can be purchased with 1 Belize Dollar based on recent exchange rates.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":3086488,"ranking":8,"query_text":"what form of currency does belize","passage_text":"Belize Currency â\u0080\u0093 Print The Money. Belize currency is printed at the British firm of Thomas De La Rue Ltd. All local bank notes feature a prominent image of Queen Elizabeth II on the front. Belize is a member of the British Commonwealth and has the Queen of England as Head of State.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":7590829,"ranking":9,"query_text":"what form of currency does belize","passage_text":"The Belize dollar is the official currency in Belize (currency code BZD). It is normally abbreviated with the dollar sign $, or alternatively BZ$ to distinguish it from other dollar-denominated currencies. It is divided into 100 cents. The official value is pegged at 2 BZ$ = 1 US$ since 1978.","bm25_label":"high","relevance_label":1.0},{"query_id":662282,"passage_id":3086491,"ranking":10,"query_text":"what form of currency does belize","passage_text":"Use the currency converter below to calculate the current exchange rate for the city of Belmopan. The currency used in Belmopan is the Belize Dollar. Belmopan is the capital of Belize. If you are traveling to Belmopan, you will need to exchange your currency for the Belizean Dollar. You may exchange your money for the Belize Dollar at most Belmopan banks or at specialized stores called Foreign Exchange Bureaus. Look for signs that say Bureau De Change, Geld Wechseln or Cambio.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":3086484,"ranking":11,"query_text":"what form of currency does belize","passage_text":"Belize Currency Converter. There is no need for a BZ Currency Converter as the BZ Dollar by law is tied to the U.S. dollar at a fixed rate of Two BZ Dollars for One U.S. Dollar, i.e. One U.S. Dollar equals Two Belize Dollars.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":7941488,"ranking":12,"query_text":"what form of currency does belize","passage_text":"US $1 = BZ $2. U.S. currency is accepted throughout San Pedro. Most hotels quote rates in U.S. dollars. Local currency is the Belize Dollar. U.S. dollars should be exchanged directly in purchasing goods and services, as banks will charge a fee (currently is at .0125) to exchange U.S. to Belize dollars. U.S. dollars are accepted everywhere in Belize.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":6408165,"ranking":13,"query_text":"what form of currency does belize","passage_text":"Belize currency exchange is extremely easy for American visitors. The Belize dollar is locked at $2 Belize = $1 USD. So it's very easy to see how much something is costing in USD when you go shopping. Most accommodations and tours are listed in US$ prices, and most restaurants, shops, etc. are listed in BZ$. Nearly everyplace readily accepts USD currency.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":3086493,"ranking":14,"query_text":"what form of currency does belize","passage_text":"4\/14\/2017 8:59 PM UTC. Exchange rates for the Belize Dollar against foreign currencies from North and South America are displayed in the table above. The values in the Exchange Rate column provide the quantity of foreign currency units that can be purchased with 1 Belize Dollar based on recent exchange rates.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":4753401,"ranking":15,"query_text":"what form of currency does belize","passage_text":"Currency: The Belize dollar is officially pegged to the U.S. dollar at a rate of $1 = 2 BZD. Language: Although English is the official language of Belize, there are many places in the country where Spanish and English are both spoken.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":6109002,"ranking":16,"query_text":"what form of currency does belize","passage_text":"Our currency rankings show that the most popular United States Dollar exchange rate is the USD to EUR rate. The currency code for Dollars is USD, and the currency symbol is $. Our currency rankings show that the most popular Belize Dollar exchange rate is the USD to BZD rate. The currency code for Dollars is BZD, and the currency symbol is BZ$.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":7590830,"ranking":17,"query_text":"what form of currency does belize","passage_text":"Belize currency is printed at the British firm of Thomas De La Rue Ltd. All local bank notes feature a prominent image of Queen Elizabeth II on the front. Belize is a member of the British Commonwealth and has the Queen of England as Head of State.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":6109009,"ranking":18,"query_text":"what form of currency does belize","passage_text":"USD - US Dollar. 1  Our currency rankings show that the most popular United States Dollar exchange rate is the USD to EUR rate. The currency code for Dollars is USD, and the currency symbol is 2  $. Our currency rankings show that the most popular Belize Dollar exchange rate is the USD to BZD rate.","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":1736685,"ranking":19,"query_text":"what form of currency does belize","passage_text":"What currency does Tbilisi Georgia use? Hey, does anyone know what currency is used in Tbilisi Georgia? And it is cheap or expensive there comparing to the uk prices?","bm25_label":"high","relevance_label":0.0},{"query_id":662282,"passage_id":6504322,"ranking":20,"query_text":"what form of currency does belize","passage_text":"Dollar (often represented by the peso and dollar sign $) is the name of several currencies, including those of Australia, Belize, Brunei, Canada, Hong Kong, Jamaica, Namibia, New Zealand, Singapore, Suriname, Taiwan, the United States, and previously Zimbabwe.ollar (often represented by the peso and dollar sign $) is the name of several currencies, including those of Australia, Belize, Brunei, Canada, Hong Kong, Jamaica, Namibia, New Zealand, Singapore, Suriname, Taiwan, the United States, and previously Zimbabwe.","bm25_label":"high","relevance_label":0.0}]