[{"query_id":669288,"passage_id":7539763,"ranking":1,"query_text":"what honey locust are seedless","passage_text":"`Majestic' has nice dark-green foliage. It is seedless and podless. Comments. Native Honey Locust trees are best known for their hazardous thorns and long, flat seed pods. Thornless, podless nursery varieties are highly recommended. Lacy foliage gives a loose, open shade ideal for patios and shade loving plants.","bm25_label":"high","relevance_label":1.0},{"query_id":669288,"passage_id":4819231,"ranking":2,"query_text":"what honey locust are seedless","passage_text":"How to Propagate Honey Locust Trees. The seeds of the honey locust tree grow in long pods. Honey locust trees are a member of the legume family. They are elegant, sun-loving trees that grow fast and prefer rich, moist soil. Native honey locusts have thorns and long brown seed-filled pods, while hybrids, found in most cities, are without thorns.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":1498620,"ranking":3,"query_text":"what honey locust are seedless","passage_text":"Taxonomy and Botany of Sunburst Honey Locust Trees. Plant taxonomy categorizes Sunburst honey locust as Gleditsia triacanthos var. inermis 'Suncole.' Note that, although the cultivar name is Suncole, the plant is usually referred to by its trademark name, Sunburst. Sunburst honey locust is a deciduous tree.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":5580575,"ranking":4,"query_text":"what honey locust are seedless","passage_text":"Honey Locust Trees. Among landscaping trees, honey locust has become very common, and with good reason. The honey locust (Gleditsia triacanthos) is a fast-growing tree. It grows as much as 20 feet in the first 10 years and can eventually grow 70 feet high.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":5609899,"ranking":5,"query_text":"what honey locust are seedless","passage_text":"Sunburst honey locust is a deciduous tree. Characteristics of Sunburst Honey Locust Trees: This tree attains a mature height of 30-40 feet, with a spread a bit less than that.It is slow to leaf out in spring, but, when it does, its foliar display is a sight to behold.unburst honey locust is a deciduous tree. Characteristics of Sunburst Honey Locust Trees: This tree attains a mature height of 30-40 feet, with a spread a bit less than that.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":5609898,"ranking":6,"query_text":"what honey locust are seedless","passage_text":"Plant Type: Sunburst honey locust is a deciduous tree. Characteristics of Sunburst Honey Locust Trees: This tree attains a mature height of 30-40 feet, with a spread a bit less than that. It is slow to leaf out in spring, but, when it does, its foliar display is a sight to behold.unburst honey locust is a deciduous tree. Characteristics of Sunburst Honey Locust Trees: This tree attains a mature height of 30-40 feet, with a spread a bit less than that.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":1503265,"ranking":7,"query_text":"what honey locust are seedless","passage_text":"Hello Zaheerhusain: This type of honey is sold in Europe as Acacia honey, but in the United States it is sold as American Acacia or Locust honey. This type of honey comes from the â\u0080\u009cFalse Acaciaâ\u0080\u009d or Black Locust tree (Robinia pseudoacacia) and seldom from Acacia species at all.his tree is also found in Europe, and in this region, it is called Acacia, although the honey does not come from true acacias. In fact, in America, this honey is sometimes labeled Black Locust or American Acacia.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":3119668,"ranking":8,"query_text":"what honey locust are seedless","passage_text":"Flowers of this species are incredibly attractive to pollinating insects. Timber Wood from the honey locust is very dense, shock resistant and commonly used in the timber industry. Honey locust wood is easily split, capable of obtaining a high luster finish, and is durable when in contact with soil.For these reasons, timber from honey locust has been used as fence posts, railroad ties, furniture, warehouse or shipping pallets, tool handles and fuel.lowers of this species are incredibly attractive to pollinating insects. Timber Wood from the honey locust is very dense, shock resistant and commonly used in the timber industry. Honey locust wood is easily split, capable of obtaining a high luster finish, and is durable when in contact with soil.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":5377435,"ranking":9,"query_text":"what honey locust are seedless","passage_text":"Locusts are a good source of protein, vitamins and minerals. Brother John ate locusts and the gold standard of food â\u0080\u0093 wild honey. GOD SAID that a prophet named John would come to this earth to prepare the way for Jesus Christ and that he would eat locusts and wild honey.ocusts are a good source of protein, vitamins and minerals. Brother John ate locusts and the gold standard of food â\u0080\u0093 wild honey. GOD SAID that a prophet named John would come to this earth to prepare the way for Jesus Christ and that he would eat locusts and wild honey.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":4092291,"ranking":10,"query_text":"what honey locust are seedless","passage_text":"The native species of honey-locust has large thorns on its stems and bark. For this reason, thornless honey locust, also known as Gleditsia triacanthos f. inermis, is most commonly sold.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":1503264,"ranking":11,"query_text":"what honey locust are seedless","passage_text":"Acacia honey is from the black locust tree, (also called â\u0080\u009cfalseâ\u0080\u009d Acacia) native to North America. This tree is also found in Europe, and in this region, it is called Acacia, although the honey does not come from true acacias. In fact, in America, this honey is sometimes labeled Black Locust or American Acacia.his tree is also found in Europe, and in this region, it is called Acacia, although the honey does not come from true acacias. In fact, in America, this honey is sometimes labeled Black Locust or American Acacia.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":5609894,"ranking":12,"query_text":"what honey locust are seedless","passage_text":"Posted by admin in Honey Locust Tree. The honey locust is a fast growing tree graceful in appearance. The leaves are fernlike and turn brilliant yellow in autumn. The blooms give way to large twisted seedpods that resemble flattened beans. The following are tips on how to plant and care for the honey locust tree.urn the soil and mix to an approximate depth of 18 to 20 inches. Space the honey locust tree 20 to 30 feet apart, as the trees do grow rapidly and have a spread of up to 50 feet at full maturity. Remove any garden debris such as branches, rocks and roots.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":2866307,"ranking":13,"query_text":"what honey locust are seedless","passage_text":"Locusts are a good source of protein, vitamins and minerals. Brother John ate locusts and the gold standard of food â\u0080\u0093 wild honey. GOD SAID that a prophet named John would come to this earth to prepare the way for Jesus Christ and that he would eat locusts and wild honey.gatita_63109 A=postolic B=elievers I=n O=ne G=od.rother John ate locusts and the gold standard of food â\u0080\u0093 wild honey. GOD SAID that a prophet named John would come to this earth to prepare the way for Jesus Christ and that he would eat locusts and wild honey.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":3119665,"ranking":14,"query_text":"what honey locust are seedless","passage_text":"Honey locusts produce a high quality, durable wood that polishes well, but the tree does not grow in sufficient numbers to support a bulk industry; however, a niche market exists for honey locust furniture. It is also used for posts and rails since it takes a long time to rot.oney locusts produce a high quality, durable wood that polishes well, but the tree does not grow in sufficient numbers to support a bulk industry; however, a niche market exists for honey locust furniture. It is also used for posts and rails since it takes a long time to rot.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":7539760,"ranking":15,"query_text":"what honey locust are seedless","passage_text":"Plant Taxonomy of Sunburst Honey Locust Trees: Plant taxonomy categorizes Sunburst honey locust as Gleditsia triacanthos var. inermis 'Suncole.' Note that, although the cultivar name is Suncole, the plant is usually referred to by its trademark name, Sunburst.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":2483747,"ranking":16,"query_text":"what honey locust are seedless","passage_text":"The ladies ventured to lean out of the window, to see what was the cause of the uproar. Deerbrook Harriet Martineau. St. John is the lean prophet of the desert, the ascetic, and the eater of locusts and wild honey.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":5377427,"ranking":17,"query_text":"what honey locust are seedless","passage_text":"Much more likely... John The Baptist survived on the edible fruit of the locust TREE year-round! MATTHEW, Chapter 3, Verse 4 (Last Half); ....and his food was locusts and wild honey..KJV John The Baptist did NOT survive YEAR-ROUND by eating bugs, adult locusts, the flying grasshopper-like insect.uch more likely... John The Baptist survived on the edible fruit of the locust TREE year-round! MATTHEW, Chapter 3, Verse 4 (Last Half); ....and his food was locusts and wild honey..","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":6351817,"ranking":18,"query_text":"what honey locust are seedless","passage_text":"Leaves are alternate, compound, with thorns or spines. click on a county. Honey locust (thorny locust, thorn tree) is a medium sized tree with pleasing, graceful foliage. The leaves are alternate, and both compound and double compound leaves on the same plant.oney Locust. Honey locust (thorny locust, thorn tree) is a medium sized tree with pleasing, graceful foliage. The leaves are alternate, and both compound and double compound leaves on the same plant. The leaflets are 3\/4 to 1 1\/2 inches long, with small widely spaced teeth.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":7539761,"ranking":19,"query_text":"what honey locust are seedless","passage_text":"Plant taxonomy categorizes Sunburst honey locust as Gleditsia triacanthos var. inermis 'Suncole.' Note that, although the cultivar name is Suncole, the plant is usually referred to by its trademark name, Sunburst. Plant Type: Sunburst honey locust is a deciduous tree.","bm25_label":"high","relevance_label":0.0},{"query_id":669288,"passage_id":1498621,"ranking":20,"query_text":"what honey locust are seedless","passage_text":"Thornless, Podless, Non-Messy Honey Locusts: Shademaster and Sunburst. First of all, note that there are various kinds of locust trees. For example, black locusts are classified as Robinia pseudoacacia. But even within the Gleditsia genus, we have: Gleditsia triacanthos, thorny locusts. Gleditsia triacanthos var. inermis, thornless locusts.","bm25_label":"high","relevance_label":0.0}]