[{"query_id":67802,"passage_id":3790535,"ranking":1,"query_text":"can green tea cause stomach problems","passage_text":"Avoiding Upset Stomach. 1  1. Know the risks. The tannins in green tea can upset your stomach because they cause your stomach to produce more acid. 2  2. Know who's at risk. The people at highest risk for this problem are those with stomach problems such as acid reflux. 3  3. Drink green tea with meals.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":124539,"ranking":2,"query_text":"can green tea cause stomach problems","passage_text":"In some people, green tea can cause stomach upset and constipation. Green tea extracts have been reported to cause liver problems in rare cases. Green tea is POSSIBLY UNSAFE when taken by mouth long-term or in high-doses. It can cause side effects because of the caffeine.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":7074071,"ranking":3,"query_text":"can green tea cause stomach problems","passage_text":"Green tea is safe for most adults. Green tea extract seems to be safe for most people for short-term use. In some people, green tea can cause stomach upset and constipation. Green tea extracts have been reported to cause liver problems. Too much green tea, such as more than five cups per day, can cause side effects because of the caffeine.","bm25_label":"high","relevance_label":1.0},{"query_id":67802,"passage_id":3213537,"ranking":4,"query_text":"can green tea cause stomach problems","passage_text":"How to Drink Green Tea Without the Side Effects. Though green tea has some health benefits, it can also cause side effects such as nervousness and upset stomach. Some of the problems are due to the caffeine in the tea. Other problems are due to certain substances in the tea.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":6744409,"ranking":5,"query_text":"can green tea cause stomach problems","passage_text":"Four Methods:Avoiding Caffeine ProblemsAvoiding Upset StomachAvoiding Green Tea with Anemia and GlaucomaUnderstanding Medication InteractionsCommunity Q&A. Though green tea has some health benefits, it can also cause side effects such as nervousness and upset stomach. Some of the problems are due to the caffeine in the tea. Other problems are due to certain substances in the tea.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3430339,"ranking":6,"query_text":"can green tea cause stomach problems","passage_text":"Green Tea Benefits for Stomach Problems. People have been drinking tea for thousands of years and it's the most popular beverage after water. Compared to black and oolong teas, green tea has the highest levels of polyphenol antioxidants, which neutralize the free radicals that can cause cancer and heart disease and increase the effects of aging.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3449537,"ranking":7,"query_text":"can green tea cause stomach problems","passage_text":"A common cause of stomach irritation from drinking green tea is its caffeine content. Green tea is not fermented like black tea or oolong tea, so typically it has a lower amount of caffeine, but it can still cause an upset stomach.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3880911,"ranking":8,"query_text":"can green tea cause stomach problems","passage_text":"Caffeine. A common cause of stomach irritation from drinking green tea is its caffeine content. Green tea is not fermented like black tea or oolong tea, so typically it has a lower amount of caffeine, but it can still cause an upset stomach.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":931375,"ranking":9,"query_text":"can green tea cause stomach problems","passage_text":"Green tea contains 2% to 4% caffeine which affects thinking and alertness, increases urine output, and may improve the function of brain messengers important in Parkinson's disease. It also contains antioxidants and other substances that might help protect the heart and blood vessels. Green tea is safe for most adults. Green tea extract seems to be safe for most people for short-term use. In some people, green tea can cause stomach upset and constipation. Green tea extracts have been reported to cause liver problems. Too much green tea, such as more than five cups per day, can cause side effects because of the caffeine.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":4068367,"ranking":10,"query_text":"can green tea cause stomach problems","passage_text":"Opt for decaffeinated green tea. Caffeine, when consumed in large doses, causes stomach irritation and nausea. It also makes your stomach lining secrete more acid. The caffeine found in green tea can worsen the symptoms of esophageal reflux, and cause stomach upset. You may want to consider high quality Japanese green tea such as gyokuro.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":2582653,"ranking":11,"query_text":"can green tea cause stomach problems","passage_text":"Both green tea and many herbal teas may help improve your digestion and limit any adverse digestive effects, such as gas and upset stomach. Check with your doctor before making herbal tea a regular part of your diet, however, as some types of herbal tea can interact with medications or cause other problems.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3213534,"ranking":12,"query_text":"can green tea cause stomach problems","passage_text":"Tea can also be a problem for those prone to heartburn and stomach ulcer. Heartburn results when gastric acids rise up and spill into the oesophagus causing irritation. Here are some tips on how to deal with green tea and stomach gastric irritation. Tea is not the only food that causes the stomach to produce acids. Beverages such as coffee, caffeine or carbonated beverages and alcohol have the same effect. Watch out for foods such as raw onions, garlic, black pepper, chili, vinegar, spicy foods, cloves, nutmeg and all fatty foods such as dairy.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3317285,"ranking":13,"query_text":"can green tea cause stomach problems","passage_text":"The article warned consumers that using large amounts of green tea extract, particularly on an empty stomach, is more likely to cause adverse effects than drinking traditional green tea. According to the University of Maryland Medical Center, the standard recommended adult dosage for green tea extract is 100 to 750 milligrams a day. Intakes above that may be toxic. Liver Problems","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":5284967,"ranking":14,"query_text":"can green tea cause stomach problems","passage_text":"They cause indigestion by stimulating the production of gastric acid. Indigestion is often described as a feeling of fullness, bloating, nausea or gassy discomfort in the chest or abdomen. The symptoms develop during meals or shortly afterwards. Tea can also be a problem for those prone to heartburn and stomach ulcer. Heartburn results when gastric acids rise up and spill into the oesophagus causing irritation. Here are some tips on how to deal with green tea and stomach gastric irritation.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3449536,"ranking":15,"query_text":"can green tea cause stomach problems","passage_text":"The symptoms develop during meals or shortly afterwards. Tea can also be a problem for those prone to heartburn and stomach ulcer. Heartburn results when gastric acids rise up and spill into the oesophagus causing irritation. Here are some tips on how to deal with green tea and stomach gastric irritation. Tea is not the only food that causes the stomach to produce acids. Beverages such as coffee, caffeine or carbonated beverages and alcohol have the same effect. Watch out for foods such as raw onions, garlic, black pepper, chili, vinegar, spicy foods, cloves, nutmeg and all fatty foods such as dairy.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":4068361,"ranking":16,"query_text":"can green tea cause stomach problems","passage_text":"Green tea is LIKELY SAFE for most adults when consumed in moderate amounts. Green tea extract is POSSIBLY SAFE for most people when taken by mouth or applied to the skin for a short time. In some people, green tea can cause stomach upset and constipation.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3430343,"ranking":17,"query_text":"can green tea cause stomach problems","passage_text":"Green Tea Benefits for Stomach Problems By Melanie Avila People have been steeping and drinking tea for thousands of years, and after water it is the world's favorite beverage. In comparison to black and oolong tea, green tea has... ","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":1894896,"ranking":18,"query_text":"can green tea cause stomach problems","passage_text":"1 Green tea and green tea extracts contain caffeine. 2  Caffeine can cause insomnia, anxiety, irritability, upset stomach, nausea, diarrhea, or frequent urination in some people. 3  Green tea contains small amounts of vitamin K, which can make anticoagulant drugs, such as warfarin, less effective.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":3449539,"ranking":19,"query_text":"can green tea cause stomach problems","passage_text":"Drinking green tea only after eating may help reduce the symptoms of an upset stomach because the increased acid production is buffered by the food. Consuming decaffeinated green tea can also help if caffeine is the problem, while drinking tea without dairy products may help if you are lactose-intolerant.","bm25_label":"high","relevance_label":0.0},{"query_id":67802,"passage_id":7652299,"ranking":20,"query_text":"can green tea cause stomach problems","passage_text":"The green tea tannins increase stomach acid. So, if you drink green tea before eating, it may give you a stomachache, a nauseous feeling, or cause constipation. It is best to drink green tea after a meal or in-between meals. People with peptic ulcers or acid reflux should be especially careful. You can try adding milk if it continuously causes stomachaches.","bm25_label":"high","relevance_label":0.0}]