[{"query_id":683045,"passage_id":1092334,"ranking":1,"query_text":"what is a fem pop","passage_text":"For example, a femoral-popliteal bypass (fem-pop) might be used if the femoral artery is occluded. A fem-pop bypass may refer to the above- or below-knee popliteal artery. Other anatomic descriptions of lower extremity bypasses include: fem-fem - femoral to femoral bypass, e.g. from right to left","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":1092327,"ranking":2,"query_text":"what is a fem pop","passage_text":"For example, a femoral-popliteal bypass (fem-pop) might be used if the femoral artery is occluded. 1  A fem-pop bypass may refer to the above- or below-knee popliteal artery. Other anatomic descriptions of lower extremity bypasses include:  2 fem-fem - femoral to femoral bypass, e.g. from right to left.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":8673758,"ranking":3,"query_text":"what is a fem pop","passage_text":"Femoral Popliteal Bypass (Fem-Pop Bypass) Our experts at Stanford perform popliteal bypass surgery to alleviate complications of claudication and peripheral vascular disease. femoral popliteal bypass femoropopliteal femoral popliteal bypass surgery fem-pop bypass fem-pop bypass surgery. Vascular and Endovascular Care in Palo Alto.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":4454910,"ranking":4,"query_text":"what is a fem pop","passage_text":"Surgical Bypass. IN THE LEG, also called lower extremity bypass, leg bypass, fem-pop bypass, fem-tib bypass, fem-distal bypass. IN THE ABDOMEN, also called aortic bypass, aorto-iliac bypass, aorto-femoral bypass, fem-fem bypass, aorto-mesenteric, and ax-fem bypass, depending on which blood vessel is being bypassed.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":4454905,"ranking":5,"query_text":"what is a fem pop","passage_text":"Surgical Bypass. BY DR. JEAN E. STARR. IN THE LEG, also called lower extremity bypass, leg bypass, fem-pop bypass, fem-tib bypass, fem-distal bypass. IN THE ABDOMEN, also called aortic bypass, aorto-iliac bypass, aorto-femoral bypass, fem-fem bypass, aorto-mesenteric, and ax-fem bypass, depending on which blood vessel is being bypassed.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":4454912,"ranking":6,"query_text":"what is a fem pop","passage_text":"Femoro-popliteal bypass surgery - Fem pop bypass. Femoro-popliteal bypass surgery or a fem pop bypass as it is known is surgery that reverts the hardening of arteries. Atherosclerosis is a disease affecting the arteries, which results in them narrowing or â\u0080\u0098hardeningâ\u0080\u0099. This happens when abnormal fatty material (called atheroma) coats the inside of the artery.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":7574925,"ranking":7,"query_text":"what is a fem pop","passage_text":"Femoropopliteal Bypass (Fem-Pop Bypass) for Peripheral Arterial Disease. Femoropopliteal (fem-pop) bypass surgery is used to bypass diseased blood vessels above or below the knee. To bypass the narrowed or blocked blood vessel, blood is redirected through either a healthy blood vessel that has been transplanted or a man-made graft material.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":7574929,"ranking":8,"query_text":"what is a fem pop","passage_text":"Femoropopliteal Bypass (Fem-Pop Bypass) for Peripheral Arterial Disease. Guide. Femoropopliteal (fem-pop) bypass surgery is used to bypass diseased blood vessels above or below the knee. To bypass the narrowed or blocked blood vessel, blood is redirected through either a healthy blood vessel that has been transplanted or a man-made graft material.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":641646,"ranking":9,"query_text":"what is a fem pop","passage_text":"â\u0080¢Femoral\/Popliteal â\u0080\u0093 A single intervention code would be used for this territory, regardless of what segments are treated. â\u0080\u0093There are no add-on codes for additional vessels treated within the fem\/pop territory. â\u0080\u0093When 2 lesions are treated in this territory, code the most complex service.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":6300740,"ranking":10,"query_text":"what is a fem pop","passage_text":"There are 2 procedures used to treat PAD of the femoral arteries. The standard surgical procedure is femoral popliteal bypass surgery (fem-pop bypass), while a newer minimally invasive endovascular intervention is called percutaneous transluminal angioplasty (PTA) of the femoral artery: Femoral popliteal bypass.here are 2 procedures used to treat PAD of the femoral arteries. The standard surgical procedure is femoral popliteal bypass surgery (fem-pop bypass), while a newer minimally invasive endovascular intervention is called percutaneous transluminal angioplasty (PTA) of the femoral artery: Femoral popliteal bypass.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":2327569,"ranking":11,"query_text":"what is a fem pop","passage_text":"Fem-pop bypass is for people who have narrowed or blocked femoral or popliteal arteries, which are near the surface of the legs. Usually the blockage must be causing significant symptoms or be limb-threatening before bypass surgery is considered.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":4454913,"ranking":12,"query_text":"what is a fem pop","passage_text":"Femoropopliteal bypass (fem-pop bypass) surgery, which reroutes blood from the femoral artery to the popliteal arteries above or below the knee. Femorotibial bypass surgery, which reroutes blood between the femoral artery and the tibial artery.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":7574926,"ranking":13,"query_text":"what is a fem pop","passage_text":"Why It Is Done. Fem-pop bypass is for people who have narrowed or blocked femoral or popliteal arteries, which are near the surface of the legs. Usually the blockage must be causing significant symptoms or be limb-threatening before bypass surgery is considered.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":8129578,"ranking":14,"query_text":"what is a fem pop","passage_text":"Femoral Popliteal Bypass. Femoral popliteal (also called femoropopliteal or Fem-Pop) bypass surgery is a procedure used to treat femoral artery disease. It is performed to bypass the blocked portion of main artery in the leg using a piece of another blood vessel.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":7574923,"ranking":15,"query_text":"what is a fem pop","passage_text":"A procedure that can be effective in lieu of a fem-pop bypass is called angioplasty. A hollow catheter is inserted into the blocked femoral artery and inflated with a balloon device. This expands the opening in the vein that is blocked by fatty tissue. A metal stent may be inserted in the artery to keep it clear.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":2327564,"ranking":16,"query_text":"what is a fem pop","passage_text":"Surgery Overview. Femoropopliteal (fem-pop) bypass surgery is used to bypass diseased blood vessels above or below the knee. To bypass the narrowed or blocked blood vessel, blood is redirected through either a healthy blood vessel that has been transplanted or a man-made graft material.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":7574924,"ranking":17,"query_text":"what is a fem pop","passage_text":"A fem-pop bypass, also called a femoral popliteal bypass surgery, is a surgical procedure performed for femoral artery disease when the main vein in the leg becomes blocked with a fatty substance. It involves grafting a vessel around the blockage to allow normal blood flow to the lower extremities.","bm25_label":"high","relevance_label":1.0},{"query_id":683045,"passage_id":1704984,"ranking":18,"query_text":"what is a fem pop","passage_text":"This is a quiz to attempt to determine whether you are feminine or not. Both men and women are suitable. Have lots of fun and truely think about it for best results. Fem or not fem, that is truely the question. The best way to figure out how fem you are is asking your friends.","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":5629504,"ranking":19,"query_text":"what is a fem pop","passage_text":"pestifero (masc.) (fem. pestifera, masc. pl. pestiferi, fem. pl. pestifere) pestilential, pestiferous; noxious (smell) Anagrams. epistrofe","bm25_label":"high","relevance_label":0.0},{"query_id":683045,"passage_id":7081368,"ranking":20,"query_text":"what is a fem pop","passage_text":"Entries with angioproliferative angioproliferativo: angioproliferativo (Italian) Adjective angioproliferativo (masc.) (fem. angioproliferativa, masc. pl. angioproliferativi, fem. pl. angioproliferative) angioproliferativeâ\u0080¦","bm25_label":"high","relevance_label":0.0}]