[{"query_id":686541,"passage_id":6169724,"ranking":1,"query_text":"what is a healthy resting heart rate for men","passage_text":"Before we go on to answer this question, let us know what exactly is the heart rate. Well, heart rate is the number of contractions that the heart makes in a minute to pump the blood. On an average, healthy resting heart rate for men lies in the range of 65 to 70.In most cases, the normal resting heart for most people is usually around 72 beats per minute.efore we go on to answer this question, let us know what exactly is the heart rate. Well, heart rate is the number of contractions that the heart makes in a minute to pump the blood. On an average, healthy resting heart rate for men lies in the range of 65 to 70.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":4535083,"ranking":2,"query_text":"what is a healthy resting heart rate for men","passage_text":"Resting Heart Rate in Men. On an average, healthy resting heart rate for men lies in the range of 65 to 70. In most cases, the normal resting heart for most people is usually around 72 beats per minute.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":6031370,"ranking":3,"query_text":"what is a healthy resting heart rate for men","passage_text":"Well, heart rate is the number of contractions that the heart makes in a minute to pump the blood. On an average, healthy resting heart rate for men lies in the range of 65 to 70.In most cases, the normal resting heart for most people is usually around 72 beats per minute.ell, heart rate is the number of contractions that the heart makes in a minute to pump the blood. On an average, healthy resting heart rate for men lies in the range of 65 to 70.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":4535081,"ranking":4,"query_text":"what is a healthy resting heart rate for men","passage_text":"Before we go on to answer this question, let us know what exactly is the heart rate. Well, heart rate is the number of contractions that the heart makes in a minute to pump the blood. On an average, healthy resting heart rate for men lies in the range of 65 to 70. In most cases, the normal resting heart for most people is usually around 72 beats per minute. However, as a person ages, more often than not, especially in cases where the man begins suffering from hypertension, he usually ends up with a high resting heart rate.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":7681024,"ranking":5,"query_text":"what is a healthy resting heart rate for men","passage_text":"Normal Resting Pulse Rate. For adult men, the healthy heart rate can be anything in between 60-100 beats per minute. As mentioned above, it is not constant for all men and greatly varies according to age, weight as well as activity level in people.ormal Resting Pulse Rate. For adult men, the healthy heart rate can be anything in between 60-100 beats per minute. As mentioned above, it is not constant for all men and greatly varies according to age, weight as well as activity level in people.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":2303935,"ranking":6,"query_text":"what is a healthy resting heart rate for men","passage_text":"What is the normal pulse rate for men? The normal pulse rate range for men and women is 60-100 bpm. Small children (1-10 years) and infants have slightly higher pulse rate than adults.The pulse rate calculated when you are at rest is known as normal or resting pulse rate, or normal \/ resting heart rate (RHR).The resting heart rate for men may vary according to the age, activity, lifestyle and overall health of a man.he pulse rate calculated when you are at rest is known as normal or resting pulse rate, or normal \/ resting heart rate (RHR). The resting heart rate for men may vary according to the age, activity, lifestyle and overall health of a man.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":3985267,"ranking":7,"query_text":"what is a healthy resting heart rate for men","passage_text":"What is the normal pulse rate for men? The normal pulse rate range for men and women is 60-100 bpm. Small children (1-10 years) and infants have slightly higher pulse rate than adults. The pulse rate calculated when you are at rest is known as normal or resting pulse rate, or normal \/ resting heart rate (RHR).The resting heart rate for men may vary according to the age, activity, lifestyle and overall health of a man.he pulse rate calculated when you are at rest is known as normal or resting pulse rate, or normal \/ resting heart rate (RHR). The resting heart rate for men may vary according to the age, activity, lifestyle and overall health of a man.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":6200541,"ranking":8,"query_text":"what is a healthy resting heart rate for men","passage_text":"For healthy adults, a lower heart rate at rest generally implies more efficient heart function and better. cardiovascular fitness. Gender is another factor in resting heart rate norms because women at various fitness levels tend to. have higher pulse rates on average than men of comparable fitness levels.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":6438557,"ranking":9,"query_text":"what is a healthy resting heart rate for men","passage_text":"For healthy adults, a lower heart rate at rest generally implies more efficient heart function and better. cardiovascular fitness. Gender is another factor in resting heart rate norms because women at various fitness levels tend to. have higher pulse rates on average than men of comparable fitness levels. For example, the average. resting heart rate of an elite 30-year-old female athlete ranges from 54-59 beats per minute, while the. resting heart rate for men of the same age and fitness level ranges from 49-54.1. Keep in mind that many factors can influence heart rate, including:","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":1363443,"ranking":10,"query_text":"what is a healthy resting heart rate for men","passage_text":"Pulse rate can be used to measure heat rate for a normal, healthy heart. Resting Heart Rates. Men\/Women: 60-100 bpm (beats per minute); pre-teens and teens (10-20 years old): 60-100 bpm; children 3-9 years old: 70-130 bpm; infants 1 day to age 3: 70-190 bpm; athletes may have resting heartbeat as low as 40 bpm.ulse rate can be used to measure heat rate for a normal, healthy heart. Resting Heart Rates. Men\/Women: 60-100 bpm (beats per minute); pre-teens and teens (10-20 years old): 60-100 bpm; children 3-9 years old: 70-130 bpm; infants 1 day to age 3: 70-190 bpm; athletes may have resting heartbeat as low as 40 bpm.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":6267267,"ranking":11,"query_text":"what is a healthy resting heart rate for men","passage_text":"How fast does a normal horse's heart beat?   A normal resting heart rate (pulse) for a healthy, mature horse is between 35 to 45 beats per minute (bpm)   It varies, depending on the age and physical condition of â\u0080¦ the horse.n general, a normal resting heart rate for an adult is between 70-80 beats per minute with women tending to have a slightly higher heart rate than men.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":7626697,"ranking":12,"query_text":"what is a healthy resting heart rate for men","passage_text":"Your Heart Rate at Rest. The term normal heart rate describes what's technically known as your resting heart rate, which is the rate at which your heart beats when you're inactive. This rate differs for men and women and varies according to other factors, such as your age and how active you are.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":7626696,"ranking":13,"query_text":"what is a healthy resting heart rate for men","passage_text":"While the normal resting heart rate for adults ranges from 60-100 beats per minute, conditioned. athletes and other highly fit individuals might have normal resting heart rates of 40-60 beats per minute. For healthy adults, a lower heart rate at rest generally implies more efficient heart function and better. cardiovascular fitness. Gender is another factor in resting heart rate norms because women at various fitness levels tend to. have higher pulse rates on average than men of comparable fitness levels. For example, the average. resting heart rate of an elite 30-year-old female athlete ranges from 54-59 beats per minute, while the.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":7893033,"ranking":14,"query_text":"what is a healthy resting heart rate for men","passage_text":"What is the normal heart rate for an adult? The typical healthy resting heart rate in adults is 60-80 bpm, with rates below 60 bpm referred to as bradycardia, and rates above 100 bpm referred to as tachycardia.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":4647272,"ranking":15,"query_text":"what is a healthy resting heart rate for men","passage_text":"What does the NST look for? The primary goal of the test is to measure the heart rate of the fetus in response to its own movements. Healthy babies will respond with an increased heart rate during times of movement, and the heart rate will decrease at rest.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":6935539,"ranking":16,"query_text":"what is a healthy resting heart rate for men","passage_text":"Q: What is a healthy resting heart rate, and how can I get mine down? A: The normal range is between 60 to 80 beats per minute (BPM). An athlete could be 40 to 60 BPM. Consult your doctor if your resting heart rate is consistently above 100 BPM. The best way to improve your resting heart rate is with exercise.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":2239511,"ranking":17,"query_text":"what is a healthy resting heart rate for men","passage_text":"A person's pulse (pulse rate or heart rate) is measured in beats per minute. Here is a general standard of pulse rate (PR). Resting Pulse Rate-Below healthy resting heart rates. PR 40-60 BPM-Resting heart rate for sleeping. PR 60-100 BPM-Healthy adult resting heartrate. PR 100 BPM - 220 BPM - - Abnormally high heart rate.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":6333802,"ranking":18,"query_text":"what is a healthy resting heart rate for men","passage_text":"A normal resting heart rate for adults ranges from 60 to 100 beats per minute (bpm), according to The Mayo Clinic. Women tend to have a slightly higher heart rate than men; the average resting heart rate in women is in the mid-70s, while it is only about 70 in men. normal resting heart rate for adults ranges from 60 to 100 beats per minute (bpm), according to The Mayo Clinic. Women tend to have a slightly higher heart rate than men; the average resting heart rate in women is in the mid-70s, while it is only about 70 in men.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":2283876,"ranking":19,"query_text":"what is a healthy resting heart rate for men","passage_text":"Men: The normal rate of heart beats for an adult man is about 70 bpm. Nevertheless, the heart rate measuring between 60 to 100 bpm is considered healthy. In comparison to this, the normal heart rate for well-trained athletes is low, usually between 40 to 60, depending upon the fitness level.omen: For women, the normal range is somewhere around 70 to 80 bpm. For a pregnant woman, the heart rate may increase up to 85-90 bpm. Similar to men, the resting heart rate falling within the range of 60 to 90 bpm is considered to be normal for women.","bm25_label":"medium","relevance_label":0.0},{"query_id":686541,"passage_id":4791831,"ranking":20,"query_text":"what is a healthy resting heart rate for men","passage_text":"A normal resting heart rate (pulse) for a healthy, mature horse is between 35 to 45 beats per minute (bpm) It varies, depending on the age and physical condition of the horse.n general, a normal resting heart rate for an adult is between 70-80 beats per minute with women tending to have a â\u0080¦ slightly higher heart rate than men. Also children and the elderly tend to also have a higher rate that can be as high as 100 bpm. The other factor is if you are physically fit.","bm25_label":"medium","relevance_label":0.0}]