[{"query_id":687375,"passage_id":119893,"ranking":1,"query_text":"what is a hydromyelia","passage_text":"Hydromyelia Information Page What research is being done? The National Institute of Neurological Disorders and Stroke (NINDS) conducts research related to hydromyelia in its clinics and laboratories at The National Institutes of Health (NIH) and supports additional research through grants to major research institutions across the country.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":7506061,"ranking":2,"query_text":"what is a hydromyelia","passage_text":"Diagnosing hydromyelia requires medical imaging studies. Hydromyelia is characterized by a buildup of fluid inside the central canal of the spinal cord. Buildup of fluid inside the central canal of the spinal cord is referred to as hydromyelia. Hydromyelia may cause difficulty walking.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":7506060,"ranking":3,"query_text":"what is a hydromyelia","passage_text":"What is Hydromyelia? Hydromyelia refers to an abnormal widening of the central canal of the spinal cord that creates a cavity in which cerebrospinal fluid (commonly known as spinal fluid) can accumulate. As spinal fluid builds up, it may put abnormal pressure on the spinal cord and damage nerve cells and their connections.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":7506062,"ranking":4,"query_text":"what is a hydromyelia","passage_text":"Introduction: Hydromyelia. Description of Hydromyelia. Hydromyelia: Longitudinal cavities in the spinal cord, most often in the cervical region, which may extend for multiple spinal levels. The cavities are lined by dense, gliogenous tissue and may be associated with SPINAL CORD NEOPLASMS; spinal cord traumatic injuries; and vascular malformations.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":119898,"ranking":5,"query_text":"what is a hydromyelia","passage_text":"0 evaluations from hydromyelia patients report major effectiveness of Epidural Steroid Injection for pain (0%) 1 evaluation from a hydromyelia patient reports moderate effectiveness of Epidural Steroid Injection for pain (100%) 0 evaluations from hydromyelia patients report slight effectiveness of Epidural Steroid Injection for pain (0%)","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":7506066,"ranking":6,"query_text":"what is a hydromyelia","passage_text":"What research is being done? The National Institute of Neurological Disorders and Stroke (NINDS) conducts research related to hydromyelia in its clinics and laboratories at The National Institutes of Health (NIH) and supports additional research through grants to major research institutions across the country.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":785740,"ranking":7,"query_text":"what is a hydromyelia","passage_text":"Related Disorders-Syringomyelia. Syringomyelia (also called syrinx or hydromyelia) is a condition that occurs when spinal fluid collects inside the spinal cord. The spinal cord is connected to the lower part of the brain, called the brainstem.elated Disorders-Syringomyelia. Syringomyelia (also called syrinx or hydromyelia) is a condition that occurs when spinal fluid collects inside the spinal cord. The spinal cord is connected to the lower part of the brain, called the brainstem.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":785739,"ranking":8,"query_text":"what is a hydromyelia","passage_text":"Syringomyelia (â\u0080\u009cSyrinxâ\u0080\u009d). Also known as syringomyelia and hydromyelia are commonly known as syrinx. Essentially, a syrinx is a fluid collection in the spinal cord.There are many causes of this such as hydrocephalus, Chiari Malformation, trauma, tethered spinal cord, tumor and a very large number without any clear cause, the so-called idiopathic.yringomyelia (â\u0080\u009cSyrinxâ\u0080\u009d). Also known as syringomyelia and hydromyelia are commonly known as syrinx. Essentially, a syrinx is a fluid collection in the spinal cord.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":1745252,"ranking":9,"query_text":"what is a hydromyelia","passage_text":"Syringomyelia: Definition, Causes & Treatment Approaches. Definition. Fluid-filled cavity within the spinal cord. Other nomenclature: hydromyelia, syringohydromyelia, spinal cord cyst.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":8333585,"ranking":10,"query_text":"what is a hydromyelia","passage_text":"Hydromyelia and syringomyelia may be difficult to distinguish even after a detailed histologic examination. Characteristics of syringohydromyelia are demonstrated in the images below. [1, 2, 3, 4]","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":515841,"ranking":11,"query_text":"what is a hydromyelia","passage_text":"This type of Chiari malformation is associated with myleomeningocele (spina bifida). In Chiari II the tonsils as well as the cerebellum may extend through the foramen. This type of Chiari is congenital. Syringomyelia or hydromyelia (syrinx)","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":2120844,"ranking":12,"query_text":"what is a hydromyelia","passage_text":"Hydromyelia refers to an abnormal widening of the central canal of the spinal cord that creates a cavity in which cerebrospinal fluid (commonly known as spinal fluid) can accumulate. As spinal fluid builds up, it may put abnormal pressure on the spinal cord and damage nerve cells and their connections.Hydromyelia is sometimes used interchangeably with syringomyelia, the name for a condition that also involves cavitation in the spinal cord.n hydromyelia, the cavity that forms is connected to the fourth ventricle in the brain, and is almost always associated in infants and children with hydrocephalus or birth defects such as Chiari Malformation II and Dandy-Walker syndrome.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":8424409,"ranking":13,"query_text":"what is a hydromyelia","passage_text":"Also known as syringomyelia and hydromyelia are commonly known as syrinx. Essentially, a syrinx is a fluid collection in the spinal cord. There are many causes of this such as hydrocephalus, Chiari Malformation, trauma, tethered spinal cord, tumor and a very large number without any clear cause, the so-called idiopathic.lso known as syringomyelia and hydromyelia are commonly known as syrinx. Essentially, a syrinx is a fluid collection in the spinal cord. There are many causes of this such as hydrocephalus, Chiari Malformation, trauma, tethered spinal cord, tumor and a very large number without any clear cause, the so-called idiopathic.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":7506068,"ranking":14,"query_text":"what is a hydromyelia","passage_text":"Syringomyelia is the development of a fluid-filled cavity or syrinx within the spinal cord. Hydromyelia is a dilatation of the central canal by cerebrospinal fluid (CSF) and may be included within the definition of syringomyelia. The following are types of syringomyelia.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":119897,"ranking":15,"query_text":"what is a hydromyelia","passage_text":"Hydromyelia is a medical condition that involves widening of the intraspinal cavity or is a marked dilatation of the central spinal canal. The central canal of the spinal column is the main area of affectation that results to increased pressure due to fluid accumulation.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":7506067,"ranking":16,"query_text":"what is a hydromyelia","passage_text":"Hydromyelia is a neurological condition characterized by a buildup of fluid inside the central canal of the spinal cord. This puts pressure on the nerves in the spinal cord and leads to neurological symptoms such as weakness in the extremities, difficulty walking, and disordered speech.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":2556960,"ranking":17,"query_text":"what is a hydromyelia","passage_text":"Background: Syringomyelia is the development of a fluid-filled cavity or syrinx within the spinal cord. Hydromyelia is a dilatation of the central canal by cerebrospinal fluid (CSF) and may be included within the definition of syringomyelia. Types of syringomyelia include the following:","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":2556961,"ranking":18,"query_text":"what is a hydromyelia","passage_text":"Background: Syringomyelia is the development of a fluid-filled cavity or syrinx within the spinal cord. Hydromyelia is a dilatation of the central canal by cerebrospinal fluid (CSF) and may be included within the definition of syringomyelia. About 10% of syringomyelia cases are of this type.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":3949416,"ranking":19,"query_text":"what is a hydromyelia","passage_text":"To research the causes of Syringomyelia, consider researching the causes of these these diseases that may be similar, or associated with Syringomyelia: 1  Myelopathy. 2  Hydromyelia. 3  Syringohydromelia. 4  Scoliosis. 5  Spina bifida. 6  Spinal arachnoiditis. 7  Chiari malformation.","bm25_label":"medium","relevance_label":0.0},{"query_id":687375,"passage_id":3982582,"ranking":20,"query_text":"what is a hydromyelia","passage_text":"The pathogenesis of syringomyelia is debated.The cerebrospinal fluid also serves to cushion the brain. Excess cerebrospinal fluid in the central canal of the spinal cord is called hydromyelia. This term refers to increased cerebrospinal fluid that is contained within the ependyma of the central canal.","bm25_label":"medium","relevance_label":0.0}]