[{"query_id":688711,"passage_id":459146,"ranking":1,"query_text":"what is a legal fiction","passage_text":"Merely because the original creator doesnâ\u0080\u0099t like slash fiction or AU fiction that is loosely based on their work doesnâ\u0080\u0099t mean that the fan fiction work is infringing. In other words, the author of the original work does not decide what is infringing. C&D letters are not legal determinations of wrongdoing either.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":326246,"ranking":2,"query_text":"what is a legal fiction","passage_text":"Know What To Call Your Story Or Book. Anna, that sounds like fiction to us, due to all the fictional elements of the story. I am still a bit confused about my situation. Weâ\u0080\u0099re not lawyers, so we cannot offer legal advice.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":7618689,"ranking":3,"query_text":"what is a legal fiction","passage_text":"The legal fiction is described briefly as â\u0080\u0098a means by which something can be done in law, which, without the legal fiction, would not be possible.â\u0080\u0099 Look it up in a law dictionary. There are many applications of the legal fiction concept and only through study will you get to grips with the extent of its functions.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":6159765,"ranking":4,"query_text":"what is a legal fiction","passage_text":"It is usually distinguished from mainstream fiction and other genres such as historical fiction or science fiction, but the boundaries are indistinct. Crime fiction has several subgenres, including detective fiction (such as the whodunit), courtroom drama, hard-boiled fiction, and legal thrillers.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":7683679,"ranking":5,"query_text":"what is a legal fiction","passage_text":"Lawyers and constitutional scholars immediately knew what 2012 presidential candidate Mitt Romney was talking about when he asserted that corporations are people.. The concept that a corporation is an artificial person is a useful legal fiction.. It is a fiction because corporations obviously are not biological entities. However, the law finds it necessary to provide corporations with certain rights and responsibilities commonly held by people.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":7618685,"ranking":6,"query_text":"what is a legal fiction","passage_text":"What is LEGAL FICTION? Believing or assuming something not true is true. Used in judicial reasoning for avoiding issues where a new situation comes up against the law, changing how the law is applied, but not changing the text of the law. Adding A Name To A Property Deed.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":7618680,"ranking":7,"query_text":"what is a legal fiction","passage_text":"Legal English: â\u0080\u009cLegal Fictionâ\u0080\u009d. Todayâ\u0080\u0099s phrase, â\u0080\u009clegal fiction,â\u0080\u009d refers to a fictitious fact that is treated as true under the law for purposes of legal, administrative or other expediency.","bm25_label":"high","relevance_label":1.0},{"query_id":688711,"passage_id":514419,"ranking":8,"query_text":"what is a legal fiction","passage_text":"However, in the truest sense, a work of fiction is a creation of the writerâ\u0080\u0099s imagination. The two main types of fiction are literary and commercial. Commercial fiction attracts a broad audience and may also fall into any subgenre, like mystery, romance, legal thriller, western, science fiction, and so on.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":290978,"ranking":9,"query_text":"what is a legal fiction","passage_text":"The two main types of fiction are literary and commercial. 1  Commercial fiction attracts a broad audience and may also fall into any subgenre, like mystery, romance, legal thriller, western, science fiction, and so on. 2  Literary fiction tends to appeal to a smaller, more intellectually adventurous audience.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":459149,"ranking":10,"query_text":"what is a legal fiction","passage_text":"Legal issues with fan fiction arise due to the prospect that a piece of fan fiction may constitute a derivative work, most prominently (but not exclusively) under United States copyright law.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":7618688,"ranking":11,"query_text":"what is a legal fiction","passage_text":"The examples and perspective in this article may not represent a worldwide view of the subject. You may improve this article, discuss the issue on the talk page, or create a new article, as appropriate. A legal fiction is a fact assumed or created by courts which is then used in order to apply a legal rule. Typically, a legal fiction allows the court to ignore a fact that would prevent it from exercising its jurisdiction, by simply assuming that the fact is different.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":327109,"ranking":12,"query_text":"what is a legal fiction","passage_text":"The person is considered to have received notice even if they were not aware of it. The phrase legal fiction should not be construed to mean that the concept of Constructive Notice is legally invalid.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":459151,"ranking":13,"query_text":"what is a legal fiction","passage_text":"In addition, a significant amount of fan fiction is created in the United States. For these reasons, although every nation's law is different and different laws may apply to different works of fan fiction, U.S. law is often centrally relevant when determining the legality of writing and\/or sharing fan fiction.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":2578156,"ranking":14,"query_text":"what is a legal fiction","passage_text":"Definition of legal. 1 : of or relating to law She has many legal problems. 3 : conforming to or permitted by law or established rules The referee said it was a legal play. Fishing in this lake is legal. 6 : created by the constructions of the law A legal fiction is something assumed in law to be a fact regardless of the truth of that assumption.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":7618682,"ranking":15,"query_text":"what is a legal fiction","passage_text":"December 14, 2012 by @WashULaw. Todayâ\u0080\u0099s phrase, â\u0080\u009clegal fiction,â\u0080\u009d refers to a fictitious fact that is treated as true under the law for purposes of legal, administrative or other expediency.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":4447186,"ranking":16,"query_text":"what is a legal fiction","passage_text":"The day after Grisham completed A Time to Kill, he began work on his second novel, The Firm, the story of an ambitious young attorney lured to an apparently perfect law firm that was not what it appeared. The Firm remained on The New York Times' bestseller list for 47 weeks, and became the bestselling novel of 1991. Beginning with A Painted House in 2001, Grisham broadened his focus from law to the more general rural South but continued to write legal thrillers. He has also written sports fiction and comedy fiction.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":5933431,"ranking":17,"query_text":"what is a legal fiction","passage_text":"Pulp Fiction was released in 1994. When did the movie Pulp Fiction come out Pulp Fiction was released on October 14, 1994. What year what the movie Pulp Fiction filmed? Pulp Fiction was filmed in 1994 and stars John Travolta and Samuel L. Jackson.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":459147,"ranking":18,"query_text":"what is a legal fiction","passage_text":"Under U.S. Copyright law, the legality of a given work of fan fiction will depend principally on three legal doctrines: (1) copyrightability of the underlying source work; (2) the derivative work right; and (3) fair use.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":957244,"ranking":19,"query_text":"what is a legal fiction","passage_text":"Constructive Trust. A constructive trust is not an actual trust by the traditional definition. It is a legal fiction that is used as a remedy for unjust enrichment.Hence, there is no trustee, but the constructive trust orders the person who would otherwise be unjustly enriched to transfer the property to the intended party.wex: COMMERCE.t is a legal fiction that is used as a remedy for unjust enrichment. Hence, there is no trustee, but the constructive trust orders the person who would otherwise be unjustly enriched to transfer the property to the intended party.","bm25_label":"high","relevance_label":0.0},{"query_id":688711,"passage_id":7793288,"ranking":20,"query_text":"what is a legal fiction","passage_text":"Now itâ\u0080\u0099s important to realize that for all of this to work the fiction has to be good fiction. Reading trashy fiction still impacts us, but not necessarily in good ways. And, if what you read shapes what you write, then bad fiction produces bad writers (the writerâ\u0080\u0099s version of â\u0080\u009cyou are what you eatâ\u0080\u009d).","bm25_label":"high","relevance_label":0.0}]