[{"query_id":691055,"passage_id":4374679,"ranking":1,"query_text":"what is a millennium baby","passage_text":"A millennium baby is one born around the turn of the millennium. Jeff Lakes.","bm25_label":"high","relevance_label":1.0},{"query_id":691055,"passage_id":7617048,"ranking":2,"query_text":"what is a millennium baby","passage_text":"The Millennium Baby â\u0080\u0093 A Century of Technology. Having a millennium baby in January 2000 is very different from having a baby in January 1900. Back then, there were no early pregnancy tests to know in a moment that a baby was coming, and no blood tests or amniocentesis or prenatal ultrasounds to know that the baby was okay.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4374674,"ranking":3,"query_text":"what is a millennium baby","passage_text":"And, yes, we know the third millennium begins on Jan. 1 2001, but we, like the rest of the world are calling the babies born on Jan. 1 2000 millennium babies as well as Year 2000 babies. The following is the list of Year 2000 Millenni-moms.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":7617046,"ranking":4,"query_text":"what is a millennium baby","passage_text":"The Millennium Baby. by JAMES TOZER, Daily Mail. He is called Jack, and she's Chloe. They are ten months old. Neither is yet sleeping through the night, but both know how to wave 'bye-bye' to their parents. They are not real babies, however, but 'typical' ones, identifed by a Millennium study.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":7264681,"ranking":5,"query_text":"what is a millennium baby","passage_text":"MDGs 4&5 What are the millennium development goals on child mortality and maternal health all about? What are the millennium development goals on child mortality and maternal health all about? MDG6 What is the millennium development goal on HIV and malaria all about? What is the millennium development goal on HIV and malaria all about?","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":6488915,"ranking":6,"query_text":"what is a millennium baby","passage_text":"How many syllables in millennium? Check our Syllable Dictionary. Learn to divide millennium into syllables. How to pronounce millennium. Find out what rhymes with millennium.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4374676,"ranking":7,"query_text":"what is a millennium baby","passage_text":"The cast of Millennium Baby - 2009 includes: Julie Baber as Ronnie CaTina Murillo as Craigslist Woman Ben Westbrook as Benji Simone Xi as Kitty.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":7264684,"ranking":8,"query_text":"what is a millennium baby","passage_text":"What have the millennium development goals achieved? The UN has called the MDGs â\u0080\u0098the most successful anti-poverty movement in historyâ\u0080\u0099, but what progress has been made on each of the goals? What have the millennium development goals achieved?","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4673490,"ranking":9,"query_text":"what is a millennium baby","passage_text":"Millennium Breakthroughs. A variety of CSA members give different perspectives on the past millennium: What were the most significant breakthroughs in cryogenics during the past millennium? My first response to this question was to suggest that the invention of Dewarâ\u0080\u0099s dewar in 1892 should be on the list.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4374673,"ranking":10,"query_text":"what is a millennium baby","passage_text":"by JAMES TOZER, Daily Mail. He is called Jack, and she's Chloe. They are ten months old. Neither is yet sleeping through the night, but both know how to wave 'bye-bye' to their parents. They are not real babies, however, but 'typical' ones, identifed by a Millennium study. Researchers drew up a picture of them after interviewing the parents of almost 19,000 babies born between September 2000 and January last year to find out what their lives were like two months short of their first birthday.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4374672,"ranking":11,"query_text":"what is a millennium baby","passage_text":"Doctors estimate that 355,500 babies were born on New Year's Day. New Zealand claimed the first Millennium baby, a boy born at Waitakere Hospital in West Auckland at just one minute past midnight.In Fiji, which is in the same time zone, a 23-year-old mother gave birth to the island's first baby of the new century at 12.18am.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":7617050,"ranking":12,"query_text":"what is a millennium baby","passage_text":"Congratulations to you all! One of our moms almost gave birth to the first Millennium Baby in the World! We will still like to hear from you if you gave birth to a New Year's Day or New Year's Eve Baby! Write us at millenniumbaby@everything2000.com. Special Recognition...................................","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":8505134,"ranking":13,"query_text":"what is a millennium baby","passage_text":"The survival and health of newborn babies is a critical part of the push towards lower child mortality in Millennium Development Goal 4, because a large portion of under-five deaths actually occur during the first month of life.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":7264682,"ranking":14,"query_text":"what is a millennium baby","passage_text":"Ban Ki-moon hails achievements of millennium development goals but warns world still riven by inequality UN: 15-year push ends extreme poverty for a billion people MDG1 What is the millennium development goal on poverty and hunger all about?","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4673483,"ranking":15,"query_text":"what is a millennium baby","passage_text":"A variety of CSA members give different perspectives on the past millennium: What were the most significant breakthroughs in cryogenics during the past millennium? Prof. R.G. Scurlock, Kryos Technology, scurlock@soton.ac.uk (â\u0080\u009cBreakthroughâ\u0080\u009d = way through obstacles â\u0080\u0094 Oxford English Dictionary) Introduction.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":3720089,"ranking":16,"query_text":"what is a millennium baby","passage_text":"Nearly a quarter millennium after the Society of Gentlemen in Scotland captured the sum total of extant human knowledge in the first edition of the Encyclopedia Britannica, what was known then, and what was not, will","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":1317143,"ranking":17,"query_text":"what is a millennium baby","passage_text":"He descended into hell.. That's one possible explanation of what Jesus did between Good Friday and Easter. For more than a millennium, Christians have uttered some version of that phrase as part of the Apostles' Creed.e descended into hell.. That's one possible explanation of what Jesus did between Good Friday and Easter. For more than a millennium, Christians have uttered some version of that phrase as part of the Apostles' Creed.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4374677,"ranking":18,"query_text":"what is a millennium baby","passage_text":"Millenniumâ\u0080\u0099s babies are teens today. Born at the turn of the century, their lives wonâ\u0080\u0099t change much. Rohan Porecha is excited to enter his teens this New Year. He is one of the few lucky ones who were born on the dawn of the new millennium.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4374678,"ranking":19,"query_text":"what is a millennium baby","passage_text":"The report is the first of a series which will follow the lives of the 18,819 youngsters - including 246 sets of twins and ten sets of triplets. Dubbed the Millennium Cohort Study, it is the fourth in a series of national birth studies that have followed the lives of babies born in 1946, 1958 and 1970.","bm25_label":"high","relevance_label":0.0},{"query_id":691055,"passage_id":4977943,"ranking":20,"query_text":"what is a millennium baby","passage_text":"The occurrence of babies born addicted to drugs has increased substantiallyâ\u0080\u0094500 percentâ\u0080\u0094in the last half decade or so. The Tennessee Department of Human Services reports that the first decade of the millennium saw the rate of children born with addiction to an opiate-based drug multiply by 10 times.","bm25_label":"high","relevance_label":0.0}]