[{"query_id":693736,"passage_id":7503664,"ranking":1,"query_text":"what is a parking brake","passage_text":"What is the Purpose of a Parking Brake. Posted on August 6, 2013 by Dave Johnson. The parking brake or also known as the emergency brake mechanism on your car is a device that when it is applied it extends the rear shoes or contract the rear pads and holds the weight of the vehicle by the rear brakes.","bm25_label":"high","relevance_label":1.0},{"query_id":693736,"passage_id":4438132,"ranking":2,"query_text":"what is a parking brake","passage_text":"They are just a parking brake so constant contact or super tight clearances are not necessary. Alternatively, you can adjust the cable. But, I prefer to take it apart so I know what is going on inside. - - - Updated - - -. Yes, there is a star adjuster in there.he driver's brakes work fine but the park brake goes all the way to the floor. I'm familiar with older style brakes and for those the park brake cables could be adjusted.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":2494953,"ranking":3,"query_text":"what is a parking brake","passage_text":"The parking brake will press against rear drum brakes mechanically with a force that is less than what is used with the main braking system. With disc brakes, the emergency brake activates the calipers or a small drum brake that is contained within the hub of the disc.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":6631193,"ranking":4,"query_text":"what is a parking brake","passage_text":"If there are no problems detected in the brake hydraulic system, the red light will go out after 1 to 2 seconds. If there is a problem detected, then the red light will stay on.The parking brake light will stay on until the parking brake is completely released.On some vehicles, these lights look very similar, so make sure you know where each light is located in the instrument panel and what its purpose is.f there is a problem detected, then the red light will stay on. The parking brake light will stay on until the parking brake is completely released. On some vehicles, these lights look very similar, so make sure you know where each light is located in the instrument panel and what its purpose is.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":6164694,"ranking":5,"query_text":"what is a parking brake","passage_text":"A loose parking brake is another symptom of bad or failing brake shoes. For vehicles equipped with drum brakes, the brake shoes are what hold the vehicle in place when the brake is engaged. If the shoes become worn or dusty, they may not be able to hold the weight of the vehicle without slipping.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":7503660,"ranking":6,"query_text":"what is a parking brake","passage_text":"Someone told me thatâ\u0080\u0099s what happened. It was in an older Honda Civic (about 10 years old, maybe). â\u0080\u0094 Julia. Yes, it is possible to drive with the parking brake on. It happens all the time. Lots of people apply the parking brake lightly when they park. And unless you really pull (or push, if itâ\u0080\u0099s a foot-operated brake) the parking brake until it almost wonâ\u0080\u0099t move any more, the engine can overcome it and move the wheels. When that happens, you might notice that the car seems a little sluggish.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":8510812,"ranking":7,"query_text":"what is a parking brake","passage_text":"Loosen the parking brake cable adjuster nut with your wrench or pliers. Locate the adjuster nut on the parking brake cable rod stick behind the parking brake lever. Press and release the brake pedal, not the parking brake lever, to ensure the rear brakes adjust correctly.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":5519192,"ranking":8,"query_text":"what is a parking brake","passage_text":"Emergency\/Parking Brake Cable Replacement Service & Cost. The parking brake cable is a thin, steel cable that connects the parking brake lever to the parking brake shoes. It is located underneath the car. When you pull the lever, this cable enables the parking brake shoes to press against the rotor or the drum, creating the friction that keeps the car from rolling. It is just like using the brake pedal, but in this case, you are using the parking brake cable instead of brake fluids to apply the pressure. Over time the cable can rust and break. If the parking brake cable is broken, the car will roll even when the parking brake has been engaged.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":4438135,"ranking":9,"query_text":"what is a parking brake","passage_text":"The driver's brakes work fine but the park brake goes all the way to the floor. I'm familiar with older style brakes and for those the park brake cables could be adjusted.he driver's brakes work fine but the park brake goes all the way to the floor. I'm familiar with older style brakes and for those the park brake cables could be adjusted.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":6631197,"ranking":10,"query_text":"what is a parking brake","passage_text":"A. If the parking brake warning is on and the brake lever is fully released, you may need to adjust the contact switch for the parking brake warning light. Remove the parking brake lever boot (the boot has an internal frame that snaps out of the console).. If the parking brake warning is on and the brake lever is fully released, you may need to adjust the contact switch for the parking brake warning light. Remove the parking brake lever boot (the boot has an internal frame that snaps out of the console).","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":1687674,"ranking":11,"query_text":"what is a parking brake","passage_text":"When you release the parking brake switch, the parking brake will be released. While moving, the parking brake is applied at a lower force than when stationery. How The Parking\/ Emergency Brake Works. The parking\/emergency brake system consists of two drum brakes, one on each rear hub. The rear service brake's rotor resembles a hat (5). The crown of the hat serves as the drum brake's (2) housing. The drum brakes' shoes are actuated by cables.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":4438137,"ranking":12,"query_text":"what is a parking brake","passage_text":"The parking brake on our 2002 Yukon does not hold once the rear brakes have warmed up. When the vehicle is allowed to sit for a few hours and the brakes cool, the parking brake holds. Since new, the parking brake pedal has gone all the way to the floor, and the dealer told me this is normal.on-working parking brake. If the vehicle is left in neutral (automatic or manual) with the parking brake applied the vehicle can roll. See 05v161000. This is caused by a design flaw from the manufacturer that causes the parking brake to not fully disengage while driving causing wear on the parking brake components.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":7246063,"ranking":13,"query_text":"what is a parking brake","passage_text":"So there you have it, it's a Parking brake. The Parking brake actuates the rear wheel brakes, whether front or rear drive. I have never seen car with a parking brake that actuated the front brakes. Possibly a few may have had a parking brake as part of the transmission. On a car with rear drum brakes, FWD, AWD, 4WD all use the rear brakes for parking brake. There are some cars, older Saabs for one that the parking brake works the front disk brake. A Toyota Camry Hybrid could be a whole other animal. There are lots of unique aspects of the braking systems for a hybrid. My guess is it works the rear wheels.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":8192139,"ranking":14,"query_text":"what is a parking brake","passage_text":"Always Set the Parking Brake. The parking brake is called the parking brake for a reason: you should use it when you park your car. Many people think you only need to use your parking brake (also called the emergency brake) when parking on a hill or if your car has a manual transmission. This is incorrect; whether your car is a manual or automatic, the terrain is hilly or flat, you should use your parking brake every time you park.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":1072052,"ranking":15,"query_text":"what is a parking brake","passage_text":"Test the Parking Brake(s) 1  Fasten the safety belt. 2  Set the parking brake (power unit only). 3  Release the trailer parking brake (if applicable). 4  Place the vehicle into a low gear. 5  Gently pull forward against the parking brake to make sure the parking brake holds.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":8651422,"ranking":16,"query_text":"what is a parking brake","passage_text":"An air brake endorsement is only. required if your vehicle needs a CDL. Air brakes use compressed air to make the brakes. work. Air brakes are a good and safe way of. stopping large and heavy vehicles, but the brakes. must be well maintained and used properly. Air brakes are really three different braking. systems: service brake, parking brake, and. emergency brake. The service brake system applies and releases the. brakes when you use the brake pedal during. normal driving. The parking brake system applies and releases the. parking brakes when you use the parking brake.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":1009533,"ranking":17,"query_text":"what is a parking brake","passage_text":"PARKING BRAKE. An e-brake - also known as the emergency brake, hand brake or parking brake - is attached to a cable that is directly connected to the brake system. When you engage the e-brake, the cable is immediately pulled and the e-brake is activated. The e-brake is used to keep your vehicle stationary when parked and in emergency stopping situations.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":5778871,"ranking":18,"query_text":"what is a parking brake","passage_text":"The parking brake is called the parking brake for a reason: you should use it when you park your car. Many people think you only need to use your parking brake (also called the emergency brake) when parking on a hill or if your car has a manual transmission.o set the brake, push firmly on the pedal. Depending on your vehicle, there are two ways to release the parking brake. In some vehicles, the pedal is pushed down until you hear a click. In other vehicles, you must pull on a brake release lever located near the parking brake pedal.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":2285208,"ranking":19,"query_text":"what is a parking brake","passage_text":"Make sure that the parking brake is fully released and the brake warning light is off before driving. To release the parking brake, hold the regular brake pedal down, then push down momentarily on the parking brake pedal until you feel the pedal release. Slowly pull your foot up off the park brake pedal.","bm25_label":"high","relevance_label":0.0},{"query_id":693736,"passage_id":6631195,"ranking":20,"query_text":"what is a parking brake","passage_text":"Brake Hydraulic System Red Warning Light. An illuminated brake hydraulic system red warning light means that there is a problem with the brake hydraulic system. If the light is intermittent and seems to come on and off depending on whether the vehicle is turning, it may mean that the brake fluid level is getting low.f there is a problem detected, then the red light will stay on. The parking brake light will stay on until the parking brake is completely released. On some vehicles, these lights look very similar, so make sure you know where each light is located in the instrument panel and what its purpose is.","bm25_label":"high","relevance_label":0.0}]