[{"query_id":694561,"passage_id":5520871,"ranking":1,"query_text":"what is a phantom color poodle","passage_text":"Phantom Poodles. Overview. While it is the solid Poodle that is the most common, there is much to discuss regarding Phantom Poodle coloring (pronounced fantom) , which is different than mismarks, the Tuxedo and partis. Let's take a closer look into the world of Poodle colors to help explain what these colors are and why they exist. Phantom Poodles. A phantom Poodle is not a different breed or type of dog, this is simply a term to describe a particular coloring of the dog.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":2837660,"ranking":2,"query_text":"what is a phantom color poodle","passage_text":"Definition of a Parti Poodle. Unlike phantom Poodles, a parti Poodle is one with a white base coat of more than 50% and a secondary color. That secondary coat color may fall anywhere on the dog. This is one element that makes parti Poodles so interesting.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":2837663,"ranking":3,"query_text":"what is a phantom color poodle","passage_text":"While very rare, there are Poodles with mulit color patterns. These dogs will have more than 1 of the acceptable color patterns. For example: A parti Poodle (this is 1 acceptable color pattern) with phantom markings (a secondary acceptable color pattern). These dogs are not accepted into the AKC show ring.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":5520873,"ranking":4,"query_text":"what is a phantom color poodle","passage_text":"All phantom Poodles are born with their markings. This does not occur as the dog ages. Phantoms are genetically linked to brindle Poodles. For this reason, a phantom Poodle dam or sire can produce a litter of brindle puppies and likewise a brindle Poodle dam or sire can produce a litter of phantom puppies.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":1876275,"ranking":5,"query_text":"what is a phantom color poodle","passage_text":"The Aussiedoodle comes in a wide range of colors and patterns! * Phantom is a term used in the poodle breed to describe the tan markings on the face, chest and legs. In the Aussie breed this Tan is called copper, and puppies are refered to as Tri color! Below are some pictures of adult F1 - F1B dogs.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":1244120,"ranking":6,"query_text":"what is a phantom color poodle","passage_text":"Baby Sarah the Standard Poodle at 1 year old â\u0080\u0094 Sarah is a gorgeous blue and silver phantom Standard Poodle. Two Standard French Poodles, mother and daughterâ\u0080\u0094the one on top is Chanel, and is the daughter. This is 9-year-old Merlin. He has titles in obedience, Flyball and therapy.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":1176465,"ranking":7,"query_text":"what is a phantom color poodle","passage_text":"Multiple colors on a poodle does NOT mean it is a mixed breed dog, DNA tests can prove this. Working in the Veterinary field for over 15 years and have a specialty in reproduction, I've learned what certain color and genetic combinations can produce. You can have a poodle of several colors and have a purebred poodle pedigree\/genes.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":1176469,"ranking":8,"query_text":"what is a phantom color poodle","passage_text":"Poodle Colors come in a very big variety and some times is difficult to choose which color we want. The most common colors on poodles are White poodles or Black poodles, but poodles exist in almost any color you can imagine. Our Gingy was a perfect example of an Apricot Poodle We found poodle colors in many shades of solid colors to Parti-Colored poodles.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":6411540,"ranking":9,"query_text":"what is a phantom color poodle","passage_text":"Baily the black Standard Poodle at 8 years old. Baby Sarah the Standard Poodle at 1 year old â\u0080\u0094 Sarah is a gorgeous blue and silver phantom Standard Poodle. She has been shown and she is very full of herself and thinks she is a princess.. Photo courtesy of Teampink Kennels. Baby Sarah the Standard Poodle at 1 year old, photo courtesy of Teampink Kennels.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":7174452,"ranking":10,"query_text":"what is a phantom color poodle","passage_text":"The Phantom is not a low profile car, though that has never been a problem for Donald Trump. There is no confirmation on what color he selected for his phantom, but with 44, 000 colors available, even the demanding Mr. Trump must be satisfied.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":1176466,"ranking":11,"query_text":"what is a phantom color poodle","passage_text":"Solids are the colors people are most comfortable with because it's what they know and it's what looks 'normal'. There are several different colors of solid poodles. Solid means exactly that, no other color whatsoever on the dog.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":4356797,"ranking":12,"query_text":"what is a phantom color poodle","passage_text":"Weight: The Toy Poodle should average 4 - 8 pounds. The weight of the Toy Poodle is to be in balance with the height of the breed. Toy Poodles are solid but should not be heavy. Color: The Toy Poodle comes in many colors including solid colors and multi colored or parti colored (two or more colors).","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":7405528,"ranking":13,"query_text":"what is a phantom color poodle","passage_text":"Phantom coloring is a dog that has one main color, and then has 'tips' of another color. If you can picture the coloring of a Rottweiler, Dachshund or a Doberman, this is the same color scheme. Phantom can occur with any color, A Silver Phantom with White points, A Chocolate phantom with Cream points, A black phantom with tan points, etc etc.","bm25_label":"high","relevance_label":1.0},{"query_id":694561,"passage_id":1176470,"ranking":14,"query_text":"what is a phantom color poodle","passage_text":"Parti Poodles could very well be the most popular multicolored poodle available. Parti is a term that means 'Particularly' colored. A Parti Poodle is a dog that has a white base with large irregular patches of another color. Parti Poodles can come as any color or pattern in the poodle family.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":4725545,"ranking":15,"query_text":"what is a phantom color poodle","passage_text":"Faults: Thin pads, splay foot or feet that turn either in or out.Height: The Miniature Poodle is 11 - 15 inches at the shoulders. Weight: The Miniature Poodle should average 12 - 17 pounds. The weight of the Miniature Poodle is to be in balance with the height of the breed.Miniature Poodles are solid but should not be heavy. Color: The Miniature Poodle comes in many colors including solid colors and multi colored or parti colored (two or more colors).aults: Thin pads, splay foot or feet that turn either in or out.Height: The Miniature Poodle is 11 - 15 inches at the shoulders. Weight: The Miniature Poodle should average 12 - 17 pounds. The weight of the Miniature Poodle is to be in balance with the height of the breed.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":4725547,"ranking":16,"query_text":"what is a phantom color poodle","passage_text":"Faults: Thin pads, splay foot or feet that turn either in or out.Height: The Toy Poodle is 10 inches or less at the shoulders.Weight: The Toy Poodle should average 4 - 8 pounds. The weight of the Toy Poodle is to be in balance with the height of the breed.Toy Poodles are solid but should not be heavy.Color: The Toy Poodle comes in many colors including solid colors and multi colored or parti colored (two or more colors).aults: Thin pads, splay foot or feet that turn either in or out.Height: The Toy Poodle is 10 inches or less at the shoulders.Weight: The Toy Poodle should average 4 - 8 pounds. The weight of the Toy Poodle is to be in balance with the height of the breed.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":1176473,"ranking":17,"query_text":"what is a phantom color poodle","passage_text":"There is a big variety when we start to talk about Poodle Colors. The most common colors on poodles are white, or black, but poodles exist in almost any color you can imagine.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":7709704,"ranking":18,"query_text":"what is a phantom color poodle","passage_text":"1 Merle is NOT a naturally occurring color in the poodle. 2  Merle is NOT a naturally occurring color in the poodle. 3  Merle is NOT a naturally occurring color in the poodle added a new photo. 4  Merle is NOT a naturally occurring color in the poodle. 5  Merle is NOT a naturally occurring color in the poodle. Â· December 4, 2014 Â·. PLEASE PM me( the page ) if you would like to be sent the info needed to report the first unethical merle  poodle breeder on our long list to the ACK\/UKC . I will be starting to send the information today .","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":2837657,"ranking":19,"query_text":"what is a phantom color poodle","passage_text":"This is an example of the infamous Parti, or Multi Colored, Poodle. trying to rid the Poodle gene pool of these dramatically colored dogs. everything from mutts to mistakes. Poodles have the original Poodle coat of two or more colors. new, as evidenced by art work dating back to the 1700's and before.","bm25_label":"high","relevance_label":0.0},{"query_id":694561,"passage_id":4500432,"ranking":20,"query_text":"what is a phantom color poodle","passage_text":"Height: The Standard Poodle is above 15 inches usually about 22-27 inches tall. Coat: The coat of the Poodle is very abundant, curly and dense with a harsh texture. Color: The Poodles come in many colors including solid colors and multi colored or parti colored.","bm25_label":"high","relevance_label":0.0}]