[{"query_id":697983,"passage_id":1472695,"ranking":1,"query_text":"what is a resolution by its board of directors","passage_text":"What is the difference between a resolution and minutes? A resolution is written documentation describing an action authorized by the board of directors of a corporation. The minutes are a written document that describes items discussed by the directors during a board meeting, including actions taken and resolutions passed.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":4950739,"ranking":2,"query_text":"what is a resolution by its board of directors","passage_text":"Sony Corporation is governed by its Board of Directors, which is elected at the annual shareholders' meeting. The Board has three committees (the Nominating Committee, Audit Committee and Compensation Committee), each consisting of Directors named by the Board of Directors.Corporate Executive Officers are appointed by resolution of the Board of Directors.he Board has three committees (the Nominating Committee, Audit Committee and Compensation Committee), each consisting of Directors named by the Board of Directors. Corporate Executive Officers are appointed by resolution of the Board of Directors.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":4217065,"ranking":3,"query_text":"what is a resolution by its board of directors","passage_text":"What is a banking resolution document? At the first meeting of the members (for an LLC) or the Board of Directors (for a corporation) establishing a company, a resolution about banking details is often included.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":229848,"ranking":4,"query_text":"what is a resolution by its board of directors","passage_text":"Directors Resolution FAQ-Canada. A Directors' Resolution is an official internal document for a corporation describing a decision or an action of the board of directors. Where a Directors' meeting can not be held the same matters can be authorized by a Directors' resolution that is signed by all the Directors.irectors Resolution FAQ-Canada. A Directors' Resolution is an official internal document for a corporation describing a decision or an action of the board of directors. Where a Directors' meeting can not be held the same matters can be authorized by a Directors' resolution that is signed by all the Directors.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":7475434,"ranking":5,"query_text":"what is a resolution by its board of directors","passage_text":"The point of a Board Resolution is to address a specific issue that the board needs to decide on. The formal decision is documented on a Board Resolution or a Board of Directors Resolution. This can be anything from a logo redesign to switching janitorial vendors.he point of a Board Resolution is to address a specific issue that the board needs to decide on. The formal decision is documented on a Board Resolution or a Board of Directors Resolution. This can be anything from a logo redesign to switching janitorial vendors.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":7535293,"ranking":6,"query_text":"what is a resolution by its board of directors","passage_text":"A Directors' Resolution is a document used to record actions or decisions made by the board of directors in a corporation. When is a Directors' Resolution used? A Directors' Resolution is also referred to as a Consent to Action Without Meeting. It can be used in place of a corporate meeting to formally record the binding decisions of the board, so long as all directors agree and authorize the resolution.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":281383,"ranking":7,"query_text":"what is a resolution by its board of directors","passage_text":"resolution. n. a determination of policy of a corporation by the vote of its board of directors. Legislative bodies also pass resolutions, but they are often statements of policy, belief or appreciation, and not always enactment of statutes or ordinances.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":7535290,"ranking":8,"query_text":"what is a resolution by its board of directors","passage_text":"Answer A corporation lives only through the actions of its board of directors, making votes or resolutions to empower the officers and other employees to car â\u0080¦ ry out the business. The board resolution is the documentation that proves the corporation is being run according to the laws, the charter and the bylaws, and within the bounds of ordinary competence of the board members.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":229851,"ranking":9,"query_text":"what is a resolution by its board of directors","passage_text":"DEFINITION of 'Corporate Resolution'. A written statement made by the board of directors detailing which officers are authorized to act on behalf of the corporation.The corporate resolution will be found in the board minutes detailing decisions made by the board during the meeting. Next Up.EFINITION of 'Corporate Resolution'. A written statement made by the board of directors detailing which officers are authorized to act on behalf of the corporation.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":4134562,"ranking":10,"query_text":"what is a resolution by its board of directors","passage_text":"1. Hold a Board of Directors meeting and record a resolution to Dissolve the California Corporation. If a Board of Directors has been appointed for the California Corporation then the Board is required to adopt a resolution to Dissolve the CA Corporation. Minutes of the meeting must be recorded and retained in the business records.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":3850152,"ranking":11,"query_text":"what is a resolution by its board of directors","passage_text":"(2) The Board of Directors of a company may, if so authorised by its articles or by a. resolution passed by the company in general meeting, appoint a person, not being a person. holding any alternate directorship for any other director in the company, to act as an alternate.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":229847,"ranking":12,"query_text":"what is a resolution by its board of directors","passage_text":"Corporate Resolution. A written legal document, issued by the board of directors of a corporation, documenting a binding decision made on behalf of the corporation.The corporate resolution will be adopted at a board meeting, and can be found in the minutes of the meeting detailing the decisions made by the board. written legal document, issued by the board of directors of a corporation, documenting a binding decision made on behalf of the corporation. The corporate resolution will be adopted at a board meeting, and can be found in the minutes of the meeting detailing the decisions made by the board.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":4217062,"ranking":13,"query_text":"what is a resolution by its board of directors","passage_text":"Corporate Resolution. DEFINITION of 'Corporate Resolution'. A written statement made by the board of directors detailing which officers are authorized to act on behalf of the corporation. The corporate resolution will be found in the board minutes detailing decisions made by the board during the meeting.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":2345479,"ranking":14,"query_text":"what is a resolution by its board of directors","passage_text":"corporate\/LLC officials, or employees (if any), who are authorized by the articles of incorporation, the bylaws, or the board of directors in adopted. resolutions or motions, to act on behalf of the corporation or to sign its name.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":4928143,"ranking":15,"query_text":"what is a resolution by its board of directors","passage_text":"Most importantly, the Zions Resolution Plan was developed under the oversight of members of the Risk Oversight Committee, and approved by the Zions Bancorporation Board of Directors. The Zions Resolution Plan has been approved by the Zions Bancorporation Risk Oversight Committee and the Board of Directors.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":7535292,"ranking":16,"query_text":"what is a resolution by its board of directors","passage_text":"A Directors' Resolution form is used by the board of directors in a corporation to document decisions and actions in place of a Directors' Meeting. Alternatively, a Shareholders' Resolution is used by shareholders in a corporation to propose amendments, decisions or changes to the corporation at a Shareholders' Meeting.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":813538,"ranking":17,"query_text":"what is a resolution by its board of directors","passage_text":"Desert Water Agency's Board of Directors passed a resolution committing to sustainable management of the groundwater resources within its jurisdiction and calling on all customers to achieve additional reductions in water conservation.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":229849,"ranking":18,"query_text":"what is a resolution by its board of directors","passage_text":"Definition. A written legal document, issued by the board of directors of a corporation, documenting a binding decision made on behalf of the corporation.The corporate resolution will be adopted at a board meeting, and can be found in the minutes of the meeting detailing the decisions made by the board. written legal document, issued by the board of directors of a corporation, documenting a binding decision made on behalf of the corporation. The corporate resolution will be adopted at a board meeting, and can be found in the minutes of the meeting detailing the decisions made by the board.","bm25_label":"high","relevance_label":0.0},{"query_id":697983,"passage_id":7535285,"ranking":19,"query_text":"what is a resolution by its board of directors","passage_text":"Generally speaking a resolution by a board of directors in any organization that has a board, is to announce a plan of action or inaction on an important matter. For example, the Board of Directors at a major hospital might resolve to establish a special ward for pediatric cancer.","bm25_label":"high","relevance_label":1.0},{"query_id":697983,"passage_id":4217061,"ranking":20,"query_text":"what is a resolution by its board of directors","passage_text":"A corporate resolution is a formal record of action taken by the board of a corporation, usually in the form of a signed document. A corporate resolution immortalizes the authorization of a certain action. The resolution identifies those who may take the action on the corporation's behalf and is authorized by the corporation's board of directors.","bm25_label":"high","relevance_label":0.0}]