[{"query_id":700641,"passage_id":3443193,"ranking":1,"query_text":"what is a soft close toilet seat","passage_text":"Tags: Pp Soft Close Toilet Seat Adjustment | Round Pp Soft Close Toilet Seat Adjustment | View larger image.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":3443189,"ranking":2,"query_text":"what is a soft close toilet seat","passage_text":"Tags: Soft Close Toilet Seat Adjustment | Intelligent Seat Toilet | Toilet Seat Smart Toilet | View larger image.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7607803,"ranking":3,"query_text":"what is a soft close toilet seat","passage_text":"First, you have to determine the shape of your existing toilet bowl. Second, what characteristics or features you want to have: soft close toilet seat or conventional toilet seat, plastic or wooden, with fancy design or not, and other considerations.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7218177,"ranking":4,"query_text":"what is a soft close toilet seat","passage_text":"Toilet seat options. Soft close. Many new toilets these days come with a soft close seat as standard, which uses a spring mechanism to ensure that the seat, along with the seat cover doesn't come down with one almighty clatter. It also helps minimise wear and tear on both the toilet pan and the seat itself.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7045433,"ranking":5,"query_text":"what is a soft close toilet seat","passage_text":"Please try again later. How to change the soft close cylinders on a Pressalit toilet seat http:\/\/tinyurl.com\/bhv432n to buy your soft close cylinders.Category. License.ow to change the soft close cylinders on a Pressalit toilet seat http:\/\/tinyurl.com\/bhv432n to buy your soft close cylinders. 1  Howto & Style.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":4499354,"ranking":6,"query_text":"what is a soft close toilet seat","passage_text":"Soft close toilet seats have several advantages over standard toilet seats, including decreasing the risk of damage to the toilet and seat, reducing the incidence of injury, especially among children, and eliminating slamming of the toilet seat. Continue Reading.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":4499355,"ranking":7,"query_text":"what is a soft close toilet seat","passage_text":"Soft close toilet seats have several advantages over standard toilet seats, including decreasing the risk of damage to the toilet and seat, reducing the incidence of injury, especially among children, and eliminating slamming of the toilet seat. Keep Learning.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":3443194,"ranking":8,"query_text":"what is a soft close toilet seat","passage_text":"It is possible to adjust soft-close toilet seats. The hinged part of the toilet seat has three holes that can be used to adjust the seat to your desired position.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":92525,"ranking":9,"query_text":"what is a soft close toilet seat","passage_text":"It is possible to adjust soft-close toilet seats. The hinged part of the toilet seat has three holes that can be used to adjust the seat to your desired position. Continue Reading.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7333404,"ranking":10,"query_text":"what is a soft close toilet seat","passage_text":"When a user opens the soft-close toilet seat, it remains in an upright position until the user gently pushes it slightly downward. Once the closing motion is begun, the seat and lid close slowly, gently resting on the toilet bowl.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":2059532,"ranking":11,"query_text":"what is a soft close toilet seat","passage_text":"Here is the top pick when it comes to a soft close toilet seat. This is our top choice in the â\u0080\u009cslam-freeâ\u0080\u009d category. Soft close toilet has become a popular choice as a toilet accessory as such; several manufacturers of toilet and bathroom accessories are constantly improving their product line up.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7333403,"ranking":12,"query_text":"what is a soft close toilet seat","passage_text":"When a user opens the soft-close toilet seat, it remains in an upright position until the user gently pushes it slightly downward. Once the closing motion is begun, the seat and lid close slowly, gently resting on the toilet bowl. Adjustment is easy.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7607806,"ranking":13,"query_text":"what is a soft close toilet seat","passage_text":"Of course, it should be affordable and fortunately, the market right now on toilet seat is loaded with very reasonably priced models. Let our top picks for the highest rated toilet seats this year 2015 help you decide which type to purchase (Soft Close, Elongated, Round, Wooden, Black) and what brand or model.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7607802,"ranking":14,"query_text":"what is a soft close toilet seat","passage_text":"This is also more stable compared with conventional soft close toilet or toilet seat in general as it has four ring bumpers in the hinge system. Complemented with self-alignment mechanism, you have a wiggle and wobble stylish toilet seat.","bm25_label":"high","relevance_label":1.0},{"query_id":700641,"passage_id":3443188,"ranking":15,"query_text":"what is a soft close toilet seat","passage_text":"These toilet seats are adjustable and easily fit in most toilets. Soft-close toilet seats are also durable and require little in terms of maintenance. They may need to be adjusted from time to time especially when the seat comes out of alignment or the hinges become loose. Additional adjustment will be required if the seat begins to slip around the top of the toilet bowl.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7045430,"ranking":16,"query_text":"what is a soft close toilet seat","passage_text":"1 The benefits of a slow close toilet seat are numerous. 2  The biggest of course is that youâ\u0080\u0099ll never have a seat slam down again with a soft close toilet seat. 3  Kids or adults not paying attention can let go of the seat without the consequences of a loud noise when the seat hits the stool. Additionally, a seat that canâ\u0080\u0099t slam closed is a safer one. 2  This is especially true for little ones with tiny hands and fingers, not to mention, a pet who likes to drink from the bowl! 3  Slow close toilet seats are more sanitary too.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7333402,"ranking":17,"query_text":"what is a soft close toilet seat","passage_text":"These hinges are installed directly onto the back of the toilet bowl, then the seat and lid assembly click into the hinges. When a user opens the soft-close toilet seat, it remains in an upright position until the user gently pushes it slightly downward.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":92523,"ranking":18,"query_text":"what is a soft close toilet seat","passage_text":"How to adjust a soft close toilet seat - Toto Round Maple SoftClose Toilet Seat With Lifekoat Polished Brass Hinges. Posted by Anonymous on Feb 08, 2014. You can't post conmments that contain an email address.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":7607804,"ranking":19,"query_text":"what is a soft close toilet seat","passage_text":"For more great innovative bathroom products, you simply can't overlook the Soft Close Toilet Seat. Not only does it prevent slamming of the toilet seat and lid, it is also removable for easy cleaning. A must-have for any bathroom build or renovation.","bm25_label":"high","relevance_label":0.0},{"query_id":700641,"passage_id":1010066,"ranking":20,"query_text":"what is a soft close toilet seat","passage_text":"TOTO Ultramax II Elongated One Piece Toilet. The Toto Ultramax II Het Double Cyclone is a smooth curved one-piece toilet with a single, lever operated flush. Unlike many other toilets, this toilet is supplied complete with a soft close seat.","bm25_label":"high","relevance_label":0.0}]