[{"query_id":711759,"passage_id":7663817,"ranking":1,"query_text":"what is an ankle dislocation","passage_text":"What is ankle dislocation? A joint dislocation is when there is an abnormal separation between the bones of a joint. When this happens in your ankle joint, itâ\u0080\u0099s known as an ankle dislocation. It is a severe injury. Three bones make up the ankle joint. These are your tibia (shinbone), your fibula (the smaller bone in your leg), and your talus (a bone in your foot).","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":7663814,"ranking":2,"query_text":"what is an ankle dislocation","passage_text":"Dislocated Ankle A dislocated ankle is a severe injury which usually happens in conjunction with a fracture or complete rupture of the lateral ankle ligaments. A dislocated ankle can be a posterior, anterior or superior dislocation.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":7663815,"ranking":3,"query_text":"what is an ankle dislocation","passage_text":"Dislocated Ankle. A dislocated ankle is a severe injury which usually happens in conjunction with a fracture or complete rupture of the lateral ankle ligaments. A dislocated ankle can be a posterior, anterior or superior dislocation.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":6605364,"ranking":4,"query_text":"what is an ankle dislocation","passage_text":"Featured: Dislocated Ankle (Ankle Dislocation) Main Article. Symptoms and signs of a dislocated ankle include pain, swelling, bruising, ankle deformity, and possible numbness and tingling in the foot. Treatment of an ankle dislocation involves putting the ankle bones back in their normal positions, possible using gentle traction.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":7663818,"ranking":5,"query_text":"what is an ankle dislocation","passage_text":"Ankle dislocations usually occur along with a break in one of the bones of your ankle. In some cases, an ankle dislocation can happen without a break in the bones of the ankle. In these cases, the ankle dislocation occurs along with a severe ankle sprain. A severe sprain is when the ligaments are torn.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":8139431,"ranking":6,"query_text":"what is an ankle dislocation","passage_text":"Dislocations can only occur to joints. You can sustain dislocations in any joint of the body, but the more common sites of dislocation include the shoulder, hip, patella, ankle, and finger. What Can Cause a Dislocation? Dislocations can occur because of anatomical issues or blunt force trauma.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":661920,"ranking":7,"query_text":"what is an ankle dislocation","passage_text":"Ankle dislocations are more often associated with fractures of the bones that make up the joint. Common causes of dislocations are include falls, motor-vehicle crashes, and sports injuries. The most common type of ankle dislocation is posterior, where the talus moves backward in relation to the tibia.islocated ankle facts. 1  An isolated dislocated ankle is a rare injury. 2  Usually, there is an associated fracture of the bones that make up the ankle. 3  The ankle dislocates as a result of a fall, motor-vehicle crash, or sporting injury.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":1807160,"ranking":8,"query_text":"what is an ankle dislocation","passage_text":"Foot And Ankle Dislocation Treatment, Closed; Foot And Ankle DislocationTreatment, Open; Foot And Ankle Fracture And Dislocation Treatment; Foot And Ankle Fracture Treatment, Closed; Foot And Ankle Fracture Treatment, Open; Foot And Ankle Ligament And Tendon Repair; Fracture Care; Hand And Wrist Fracture And Dislocation Treatment","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":6605368,"ranking":9,"query_text":"what is an ankle dislocation","passage_text":"Recovery period to complete healing of the dislocated ankle or ankle dislocation is about 6 to 8 weeks. The recovery period is longer if joint dislocation is associated with fracture of tibia or talus bone. The recovery period is often 8 to 12 weeks when complete ankle dislocation is associated with anklebone fracture.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":7663816,"ranking":10,"query_text":"what is an ankle dislocation","passage_text":"0 evaluations from dislocation of ankle patients report major effectiveness of Chiropractic Therapy for pain (0%) 1 evaluation from a dislocation of ankle patient reports moderate effectiveness of Chiropractic Therapy for pain (100%) 0 evaluations from dislocation of ankle patients report slight effectiveness of Chiropractic Therapy for pain (0%) 0 evaluations from dislocation of ankle patients report none effectiveness of Chiropractic Therapy for pain (0%) 0 evaluations from dislocation of ankle patients report that they could not tell effectiveness of Chiropractic Therapy for pain (0%)","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":317277,"ranking":11,"query_text":"what is an ankle dislocation","passage_text":"An isolated dislocated ankle is a rare injury. Usually, there is an associated fracture of the bones that make up the ankle. The ankle dislocates as a result of a fall, motor-vehicle crash, or sporting injury.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":661918,"ranking":12,"query_text":"what is an ankle dislocation","passage_text":"Most commonly, a dislocated ankle is associated with fractures of the distal ends of the tibia and fibula (called the malleolus) in association with damage to the ligaments that help support the ankle joint. Less commonly, isolated ligament injuries can result in the dislocation.islocated ankle facts. 1  An isolated dislocated ankle is a rare injury. 2  Usually, there is an associated fracture of the bones that make up the ankle. 3  The ankle dislocates as a result of a fall, motor-vehicle crash, or sporting injury.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":293357,"ranking":13,"query_text":"what is an ankle dislocation","passage_text":"What causes an ankle lump? Ankle lumps have many possible causes, including trauma, infections, inflammatory diseases, benign (noncancerous) cysts and tumors, and (rarely) cancer. Minor to severe injuries and trauma can result in localized swelling or a lump in the ankle. Injuries include: 1  Ankle dislocation.  Ankle sprain.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":7663813,"ranking":14,"query_text":"what is an ankle dislocation","passage_text":"Key points about ankle dislocation An ankle dislocation is a severe injury in which there is an abnormal separation between one or more of the bones of your ankle joint. These bones are the tibia, the fibula, and the talus. It most often happens with a fracture of your ankle joint.","bm25_label":"high","relevance_label":1.0},{"query_id":711759,"passage_id":6605363,"ranking":15,"query_text":"what is an ankle dislocation","passage_text":"Dislocated ankle or ankle dislocation is a serious injury if associated with fracture of tibia or talus bone. Patient is often unable to walk for several weeks and abnormal healing can result in deformed ankle as well as prolonged pain.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":2498523,"ranking":16,"query_text":"what is an ankle dislocation","passage_text":"Fracture and\/or Dislocation Procedures on the Leg (Tibia and Fibula) and Ankle Joint Closed treatment of ankle dislocation ajax_class. Closed treatment of bimalleolar ankle fracture (eg, lateral and medial malleoli, or lateral and posterior malleoli or medial and posterior malleoli) ajax_class.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":6605367,"ranking":17,"query_text":"what is an ankle dislocation","passage_text":"Symptoms of a Dislocated Ankle or Ankle Dislocation. 1  Abrupt severe pain. 2  Inability to use the ankle. 3  The ankle appears crooked or deformed as the tibia and fibula lose contact with each other.  Tenderness is 1  present. Swelling is present.  In case of nerve damage, numbness and tingling in the foot is present.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":1408959,"ranking":18,"query_text":"what is an ankle dislocation","passage_text":"A fracture usually creates pain with every step, and may be accompanied by swelling, bruising, and tenderness. A fracture can be caused by sports injury, trauma, aging, or from overuse. Dislocated Ankle. The ankle joint becomes dislocated (separates) due to trauma from a sports injury or a high fall.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":6448843,"ranking":19,"query_text":"what is an ankle dislocation","passage_text":"Hawkins classification 1: 1  type I: non displaced fracture. 2  type II: displaced fracture with subluxation or dislocation of the subtalar joint and a normal ankle joint. 3  type III: displaced fracture with body of talus dislocated from both subtalar and ankle joint.","bm25_label":"high","relevance_label":0.0},{"query_id":711759,"passage_id":8715010,"ranking":20,"query_text":"what is an ankle dislocation","passage_text":"An ankle sprain can cause both the ankle and foot to become red and swollen, as can a fracture in the foot or ankle. A dislocation in the ankle or foot may cause the foot and ankle to become red and swollen. There will also be pain at the site of the injury.","bm25_label":"high","relevance_label":0.0}]