[{"query_id":724121,"passage_id":7416503,"ranking":1,"query_text":"what is bioflavonoids","passage_text":"Citrus bioflavonoids can be found in tangerines. Grapefruits are a good source of citrus bioflavonoids. Bioflavonoid supplements can provide relief to people with varicose veins. Sweet limes are packed with citrus bioflavonoids. Lemons, a popular type of citrus fruit. Apricots are a bioflavonoid source.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":6719944,"ranking":2,"query_text":"what is bioflavonoids","passage_text":"Citrus bioflavonoids are similar to vitamin C in many ways. Both citrus bioflavonoids and vitamin C are soluble in water. Both citrus bioflavonoids and vitamin C are measured in milligrams per liter of juice, not micrograms or grams. Both citrus bioflavonoids and vitamin C are stable even when they are dried, exposed to the air, or heated, but both citrus bioflavonoids and vitamin C are easily destroyed by light.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":2414490,"ranking":3,"query_text":"what is bioflavonoids","passage_text":"5. Incorporate foods abundant in bioflavonoids into your diet. Bioflavonoids help to strengthen your blood vessels and connective tissue. Foods rich in bioflavonoids include oranges, berries, grapes and green beans.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":8794457,"ranking":4,"query_text":"what is bioflavonoids","passage_text":"1 Bioflavonoids Bioflavonoids (citrus, hesperidin and rutin), sometimes called vitamin P, are substances that are found wherever vitamin C is found in nature. For example, the white material found under the skin of an orange actually contains bioflavonoids.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7536675,"ranking":5,"query_text":"what is bioflavonoids","passage_text":"Bioflavonoid Complex. Technical Background. ï\u0082· ï\u0082· ï\u0082· Bioflavonoids comprise a diverse class of polyphenolic compounds with antioxidant activity. They are found naturally in the leaves, bark, roots, flowers, and seeds of plants.1 There are thousands of naturally-occurring bioflavonoids.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7544210,"ranking":6,"query_text":"what is bioflavonoids","passage_text":"Bioflavonoids are present in all botanical supplement products and foods. In fact, many medicinal herbs owe their curative actions to the bioflavonoids they contain. Besides the important antioxidant effects, bioflavonoids help the body maintain health and function in many ways.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":6701317,"ranking":7,"query_text":"what is bioflavonoids","passage_text":"Flavanols, such as catechin and epicatechin, are thought to be highly beneficial for blood circulation, helping both the heart, and cognitive function. Foods high in flavanol bioflavonoids include cocoa, green tea, red wine, apples, and berries.Flavanones are found in citrus fruit, in the the white material and pulp. These bioflavonoids are what the body uses to lower blood cholesterol. They also act as antibacterial and anticancer compounds.lavanols, such as catechin and epicatechin, are thought to be highly beneficial for blood circulation, helping both the heart, and cognitive function. Foods high in flavanol bioflavonoids include cocoa, green tea, red wine, apples, and berries. Flavanones are found in citrus fruit, in the the white material and pulp.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7544209,"ranking":8,"query_text":"what is bioflavonoids","passage_text":"9 Foods Rich in Bioflavonoids. Bioflavonoids, also sometimes referred to as vitamin P, are super-antioxidants found in many natural foods. Scientists have found that bioflavonoids have specific capabilities to increase bodily health in many different ways.","bm25_label":"high","relevance_label":1.0},{"query_id":724121,"passage_id":7416510,"ranking":9,"query_text":"what is bioflavonoids","passage_text":"Bioflavonoids encompass a large group of nutrients with antioxidant activity. Citrus bioflavonoids, which are part of that group, are derived from the rind and pulp of citrus products. Because they have vitamin-like properties, they are sometimes referred to as vitamin P. Citrus bioflavonoids work synergistically with vitamin C. Each substance enhances the action of the other. Citrus bioflavonoids are needed for vitamin C to be used effectively by the body.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":6719948,"ranking":10,"query_text":"what is bioflavonoids","passage_text":"Although the optimum daily bioflavonoid intake has not been determined, some supplement advocates recommend 2,000 to 6,000 mg of citrus bioflavonoids per day. Citrus bioflavonoids appear to have very low toxicity, and appear to be safe at this dosage range.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7544215,"ranking":11,"query_text":"what is bioflavonoids","passage_text":"Bioflavonoids, or flavonoids, are a large class of powerful phytochemicals. Not only are bioflavonoids impressive in and of themselves, but they also help maximize the benefits of vitamin C by inhibiting its breakdown in the body. The great thing is that bioflavonoids are often found in many of the top vitamin C foods.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":8794452,"ranking":12,"query_text":"what is bioflavonoids","passage_text":"Bioflavonoids are plant-based elements present along with other plant-specific nutrients like vitamin C. Bioflavonoids contain a large amount of antioxidant value. Many in the nutritional community refer to these as super antioxidants.. The antioxidants in bioflavonoids help to combat free radicals in the body.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":8794456,"ranking":13,"query_text":"what is bioflavonoids","passage_text":"Vitamin C with bioflavonoids. Bioflavonoids or flavonoids are polyphenolic compounds found in plants. Vitamin C-rich fruit and vegetables, especially citrus fruit, are often rich sources of flavonoids as well. The effect of bioflavonoids on the bioavailability of ascorbic acid has been recently reviewed (7) .","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":8794458,"ranking":14,"query_text":"what is bioflavonoids","passage_text":"Bioflavonoids are a large family of substances found in most of the same foods that are good sources of vitamin C. In fact, researchers have identified more than 8,000 naturally occurring bioflavonoid structures. Bioflavonoids (also called flavonoids) are the natural pigments that give fruits and vegetables their color.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7544211,"ranking":15,"query_text":"what is bioflavonoids","passage_text":"Fresh fruits and vegetables are the best sources of bioflavonoids. Bioflavonoids are also found in herbs, spices, beans, nuts, seeds, tea and wine. Theyâ\u0080\u0099re excellent for the overall health of your entire body at any age. Bioflavonoids are best absorbed from fruits, vegetables and herbs in their raw forms.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7544208,"ranking":16,"query_text":"what is bioflavonoids","passage_text":"The Benefits of Bioflavonoids. Nature's Oldest Healers. Everyone knows that eating lots of fruits and vegetables is a good idea. But it's not just because they're full of vitamins, minerals and fiber. It's also because they give you the benefits of bioflavonoids â\u0080\u0094 the nutrients that give them their color and taste. There are literally thousands of different bioflavonoids.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":6719951,"ranking":17,"query_text":"what is bioflavonoids","passage_text":"\/ Ingredients \/ Citrus Bioflavonoid Complex Ingredients Bioflavonoid is a generic term used to describe biologically active members of the group of plant-derived compounds known as flavonoids.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":5895639,"ranking":18,"query_text":"what is bioflavonoids","passage_text":"Bioflavonoids are found in the rind of green citrus fruits and in rose hips and black currants. Bioflavonoids have been used in alternative medicine as an aid to enhance the action of vitamin C, to support blood circulation, as an antioxidant, and to treat allergies, viruses, or arthritis and other inflammatory conditions. Not all uses for bioflavonoids have been approved by the FDA.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7536671,"ranking":19,"query_text":"what is bioflavonoids","passage_text":"There are over 4000 known bioflavonoids; this page will focus on four main categories including proanthocyanidins, quercetin, , and green tea polyphenols.. As a group, bioflavonoids have anti-inflammatory, antiallergic, antiviral, and anticarcinogenic properties. They are also powerful antioxidants. In fact, high bioflavonoid intake has been associated with a decrease risk of heart attack due to their antioxidant effects on cholesterol.","bm25_label":"high","relevance_label":0.0},{"query_id":724121,"passage_id":7416509,"ranking":20,"query_text":"what is bioflavonoids","passage_text":"A typical dosage of citrus bioflavonoids is 500 mg twice daily. The most studied citrus bioflavonoid treatment is a special micronized (finely ground) combination of diosmin (90%) and hesperidin (10%).","bm25_label":"high","relevance_label":0.0}]