[{"query_id":727551,"passage_id":8455635,"ranking":1,"query_text":"what is capital restructuring","passage_text":"What Is Debt Capital Markets (DCM)? The team within Debt Capital Markets (DCM) is responsible for providing advice on the raising debt for acquisitions, refinancing of existing debt, or restructuring of existing debt. A Debt Capital Markets group will work with a client to organize borrowing and to help provide access to a global pool of investors who are looking for opportunities.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":4844910,"ranking":2,"query_text":"what is capital restructuring","passage_text":"What is 'Recapitalization' Recapitalization is restructuring a company's debt and equity mixture, often with the aim of making a company's capital structure more stable or optimal. Essentially, the process involves the exchange of one form of financing for another, such as removing preferred shares from the company's capital structure and replacing them with bonds.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":7443797,"ranking":3,"query_text":"what is capital restructuring","passage_text":"These 10 animal facts will amaze you. Capital restructuring is a type of business operational strategy that is employed to make changes to the capital structure of a company, usually as a way to deal with shifts in the marketplace that have impacted the financial stability of the business.hese 10 animal facts will amaze you. Capital restructuring is a type of business operational strategy that is employed to make changes to the capital structure of a company, usually as a way to deal with shifts in the marketplace that have impacted the financial stability of the business.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":7443799,"ranking":4,"query_text":"what is capital restructuring","passage_text":"Capital is generally the assets, often monetary, that are available to generate more assets. Thus the liquidity of capital should be high. Restructuring them means reallocating them to improve their availability (liquidity).sset restructuring is the purchase or sale of assets that are worth more than 50% of a listed of a company's total or net amount of assets. 1 person found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":7443790,"ranking":5,"query_text":"what is capital restructuring","passage_text":"Sometimes capital restructuring is a viable response to these marketplace realities and conditions. Capital Restructuring can be considered when a company explores business expansion, asset divestitures, debt modifications, changes in corporate control, as well as modifications in the ownership framework.apital Restructuring can make your business more appealing to prospective stakeholders because this financial management tactic most often: 1  decreases expenses. 2  improves operational efficiency, 3  raises the EPS of the business and. 4  provides a base for much better overall operational results.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":5125307,"ranking":6,"query_text":"what is capital restructuring","passage_text":"Stallion Oilfield Services required only 100 days under bankruptcy protection to restructure its operations and its board of directors and secure the capital needed to remerge as a well-capitalized company.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":2756407,"ranking":7,"query_text":"what is capital restructuring","passage_text":"Growth capital. Growth capital (also called expansion capital and growth equity) is a type of private equity investment, usually a minority investment, in relatively mature companies that are looking for capital to expand or restructure operations, enter new markets or finance a significant acquisition without a change of control of the business.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":7443792,"ranking":8,"query_text":"what is capital restructuring","passage_text":"Capital Restructuring is much like remodeling your own home, it makes it more appealing. Capital Restructuring can make your business more appealing to prospective stakeholders because this financial management tactic most often:1  decreases expenses. 2  improves operational efficiency,3  raises the EPS of the business and.4  provides a base for much better overall operational results.apital Restructuring can make your business more appealing to prospective stakeholders because this financial management tactic most often: 1  decreases expenses. 2  improves operational efficiency, 3  raises the EPS of the business and. 4  provides a base for much better overall operational results.","bm25_label":"high","relevance_label":1.0},{"query_id":727551,"passage_id":1579359,"ranking":9,"query_text":"what is capital restructuring","passage_text":"Debt Tender Offer. What is a 'Debt Tender Offer'. A debt tender offer is when a firm retires all or a portion of its debt securities by making an offer to its debtholders to repurchase a predetermined number of bonds at a specified price and during a set period of time. Firms may use a debt tender offer as a mechanism for capital restructuring or refinancing.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":5898884,"ranking":10,"query_text":"what is capital restructuring","passage_text":"Chrysler. Walter Chrysler founded the company that bears his name in 1925, after restructuring the Maxwell Motor Company. Between 1998 and 2007, Chrysler operated as part of the German-based DaimlerChrysler AG. Starting in May of 2007, the American private equity firm Cerberus Capital Management acquired a stake of 80.1 percent in what became Chrysler LLC.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":2514200,"ranking":11,"query_text":"what is capital restructuring","passage_text":"In private equity, you start with the numbers, and then you try to fit everything into the numbers. In venture capital, you start with people, and then you try to figure out what numbers you can make.â\u0080\u009d. In other words, private equity is usually about taking an existing company with existing products and existing cash flows, then restructuring that company to optimize its financial performance.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":7482126,"ranking":12,"query_text":"what is capital restructuring","passage_text":"Allied Capital was a private equity investment firm and mezzanine capital lender providing debt and equity capital for leveraged buyouts, acquisitions and restructurings of established businesses.llied and Short Sellers [edit]. Between 2002 and 2008, David Einhorn, the manager of Greenlight Capital, a hedge fund engaged in heavy short selling of Allied's stock as he tried to demonstrate that the company's valuation of its illiquid securities was inflated.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":8276621,"ranking":13,"query_text":"what is capital restructuring","passage_text":"Restructuring costs under the new rules should be recorded as a charge to the post acquisition earnings, previously these costs were capitalized as a part of the purchase price resulting in a higher amount of Goodwill being recorded.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":2192989,"ranking":14,"query_text":"what is capital restructuring","passage_text":"What is 'Restructuring'. Restructuring is a type of corporate action taken when significantly modifying the debt, operations or structure of a company as a means of potentially eliminating financial harm and improving the business.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":7476804,"ranking":15,"query_text":"what is capital restructuring","passage_text":"Generally it has been observed that cross border merger and acquisitions are a restructuring of industrial assets and production structures on a worldwide basis. It enables the global transfer of technology, capital, goods and services and integrates for universal networking.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":325635,"ranking":16,"query_text":"what is capital restructuring","passage_text":"Growth capital is a type of private equity investment, usually a minority investment, in relatively mature companies that are looking for capital to expand or restructure operations, enter new markets or finance a significant acquisition without a change of control of the business. Companies that seek growth capital will often do so in order to finance a transformational event in their lifecycle. These companies are likely to be more mature than venture capital funded companies, able to generate","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":1896879,"ranking":17,"query_text":"what is capital restructuring","passage_text":"Since the 2001 Argentine sovereign debt default, the country has experienced more than an aftermath of lawsuits and bond restructures, with the U.S. Supreme Court most recently siding with â\u0080\u009choldoutâ\u0080\u009d hedge funds NML Capital and Aurelius Capital in a 7-1 ruling, ordering that Argentina pay the hedge funds full principal plus interest, amounting to a ...","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":7795562,"ranking":18,"query_text":"what is capital restructuring","passage_text":"Furthermore, in times of crisis in either system, the other system can perform the function of the famous spare wheel. The financial system is also particularly important in reallocating capital and thus providing the basis for the continuous restructuring of the economy that is needed to support growth.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":1920333,"ranking":19,"query_text":"what is capital restructuring","passage_text":"1 Cost cutting due to restructuring of operations will give many companies the chance to price products more competitively. 2  One area in the industry that is ever changing is research and development. The strong departments will surely capitalize on the trends of tomorrow if their efforts are successful.","bm25_label":"high","relevance_label":0.0},{"query_id":727551,"passage_id":2264188,"ranking":20,"query_text":"what is capital restructuring","passage_text":"Navis Capital Partners was founded in 1998 to make private equity investments in buyouts, recapitalisations and financial restructurings in Asia, particularly in enterprises with a strong or developing presence in Southeast Asia, Australia and Hong Kong. Navis acquires control of its portfolio companies.","bm25_label":"high","relevance_label":0.0}]