[{"query_id":729697,"passage_id":8538146,"ranking":1,"query_text":"what is chattahoochee","passage_text":"Find 124 listings related to Florida State Hospital in Chattahoochee on YP.com. See reviews, photos, directions, phone numbers and more for Florida State Hospital locations in Chattahoochee, FL. Start your search by typing in the business name below. What do you want to find?","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":3152681,"ranking":2,"query_text":"what is chattahoochee","passage_text":"(770) 463-8550. Chattahoochee Hills is a city in southern Fulton County. It is the incorporated part of a region called Chattahoochee Hill Country, an area encompassing approximately 60,000 acres southwest of Atlanta, bordered on the northwest side by the Chattahoochee River.770) 463-8550. Chattahoochee Hills is a city in southern Fulton County. It is the incorporated part of a region called Chattahoochee Hill Country, an area encompassing approximately 60,000 acres southwest of Atlanta, bordered on the northwest side by the Chattahoochee River.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":4106006,"ranking":3,"query_text":"what is chattahoochee","passage_text":"White water Rafting in Georgia on the Chattahoochee River. Another notable attraction for whitewater rafting in Georgia is the Chattahoochee. Like the Chestatee, the Chattahoochee River starts by running to Lake Sidney Lanier near the northern mountains.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1012794,"ranking":4,"query_text":"what is chattahoochee","passage_text":"Chattahoochee Hill Country became a city on December 1, 2007, with the first elected officials taking office a few days later. Chattahoochee Hills is a city in southern Fulton County. It is the incorporated part of a region called Chattahoochee Hill Country, an area encompassing approximately 60,000 acres southwest of Atlanta, bordered on the northwest side by the Chattahoochee River.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":2808979,"ranking":5,"query_text":"what is chattahoochee","passage_text":"The Chattahoochee River runs from the Chattahoochee Spring in the Appalachian Mountains of north-eastern Georgia.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1012787,"ranking":6,"query_text":"what is chattahoochee","passage_text":"Fax Number: Chattahoochee Hills is a city in southern Fulton County. It is the incorporated part of a region called Chattahoochee Hill Country, an area encompassing approximately 60,000 acres southwest of Atlanta, bordered on the northwest side by the Chattahoochee River.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1012785,"ranking":7,"query_text":"what is chattahoochee","passage_text":"Chattahoochee Hills. Chattahoochee Hills (formerly Chattahoochee Hill Country) is a city in southern Fulton County, Georgia, United States. As of the 2010 census, it had a population of 2,378 living in an area of just over 32,000 acres (130 km2).","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1012790,"ranking":8,"query_text":"what is chattahoochee","passage_text":"(770) 463-8550. Chattahoochee Hills is a city in southern Fulton County. It is the incorporated part of a region called Chattahoochee Hill Country, an area encompassing approximately 60,000 acres southwest of Atlanta, bordered on the northwest side by the Chattahoochee River.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1760842,"ranking":9,"query_text":"what is chattahoochee","passage_text":"Chattahoochee and Flint rivers are part of a larger Apalachicola-Chattahoochee-Flint (ACF) river basin, which flows through the states of Georgia, Alabama, and Florida. The Chattahoochee River drains an area of 8,770 square miles and is the most heavily used water resource in Georgia.hattahoochee and Flint rivers are part of a larger Apalachicola-Chattahoochee-Flint (ACF) river basin, which flows through the states of Georgia, Alabama, and Florida. The Chattahoochee River drains an area of 8,770 square miles and is the most heavily used water resource in Georgia.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1012789,"ranking":10,"query_text":"what is chattahoochee","passage_text":"Chattahoochee Hills, Georgia. Chattahoochee Hills (formerly Chattahoochee Hill Country) is a city in southern Fulton County, Georgia, United States. As of the 2010 census, it had a population of 2,378 living in an area of just over 32,000 acres (130 km2).","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":2269700,"ranking":11,"query_text":"what is chattahoochee","passage_text":"In it he claimed the last battle of the Civil War began across the Chattahoochee River in what was then Girard, Alabama and ended at the foot of the 14th Street bridge on the Georgia side in Columbus.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1012793,"ranking":12,"query_text":"what is chattahoochee","passage_text":"Chattahoochee Hills, Georgia topic. Chattahoochee Hills (formerly Chattahoochee Hill Country ) is a city in southern Fulton County , Georgia , United States. As of the 2010 census , it had a population of 2,378 living in an area of just over 32,000 acres (130 km ).","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":2474602,"ranking":13,"query_text":"what is chattahoochee","passage_text":"Flora and Fauna of the Chattahoochee River By Michelle Stripling . The Chattahoochee River begins as a bubbling spring in the North Georgia mountains. The headwaters, which begin at the base of the Appalachian Trail, carry the river through the Chattahoochee National Forest. From there the river flows south and west through Atlanta.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":2808986,"ranking":14,"query_text":"what is chattahoochee","passage_text":"Where does the Chattahoochee River start and end? The Chattahoochee River runs from the Chattahoochee Spring in the Appalachian Mountains of north-eastern Georgia until it merges with the Flint River and other tributaries atâ\u0080¦ Lake Seminole, near Bainbridge to form the Florida panhandle's Apalachicola River.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":7615909,"ranking":15,"query_text":"what is chattahoochee","passage_text":"Chattahoochee, Chattahoochee River(noun) a river rising in northern Georgia and flowing southwest and south to join the Flint River at the Florida border where they form the Apalachicola River. Chattahoochee. Chattahoochee is the title of a song co-written and recorded by American country music artist Alan Jackson. It was released in May 1993 as the third single from his album A Lot About Livin'. The album is named for a line in the song itself. Jackson wrote the song with Jim McBride.","bm25_label":"high","relevance_label":1.0},{"query_id":729697,"passage_id":2808985,"ranking":16,"query_text":"what is chattahoochee","passage_text":"Chattahoochee River brings life, conflict to Alabama, Georgia, Florida. Chattahoochee River. GAINESVILLE, Ga. -- Bending over the backs of the North Georgia mountains, before sinking down the eastern edge of Alabama through Florida's spring-fed swamps, the Chattahoochee River forms the spine of three Southern states.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":2474596,"ranking":17,"query_text":"what is chattahoochee","passage_text":"Fishing The Chattahoochee River. Fishing for Rainbow Trout in the cold waters in the Chattahoochee River is a great way to spend the day. Last updated: December 12, 2017","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":1258432,"ranking":18,"query_text":"what is chattahoochee","passage_text":"Find Chattahoochee Florida sheriff's office, department, headquarters, jail and detention center. Sheriffs provide information on records, arrests, inmates, warrants, and mugshots. Chattahoochee Sheriff. Find Chattahoochee Florida sheriff's office, department, headquarters, jail and detention center. Sheriffs provide information on records, arrests, inmates, warrants, and mugshots.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":769805,"ranking":19,"query_text":"what is chattahoochee","passage_text":"Chattahoochee River. About North Georgia. The Chattahoochee River begins as a spring in the fittingly name Chattahoochee Gap, little more than a trickle of water at 3200 feet. Over the first 100 miles the river falls almost 2400 feet, forms a major Southeast lake (Lanier) and provides water for millions of Georgians.","bm25_label":"high","relevance_label":0.0},{"query_id":729697,"passage_id":5027561,"ranking":20,"query_text":"what is chattahoochee","passage_text":"Situated on the Chattahoochee River, Columbus offers a mixture of old and new with the lovely 12-mile Columbus Riverwalk, which includes the Chattahoochee Promenade, a walking tour of historical markers.","bm25_label":"high","relevance_label":0.0}]