[{"query_id":73257,"passage_id":5185729,"ranking":1,"query_text":"can seizure meds cause low sodium?","passage_text":"Doctors give trusted, helpful answers on causes, diagnosis, symptoms, treatment, and more: Dr. Kurzweil on can low sodium cause confusion: Low sodium can be the cause of unsteady gait, falls if really low can even cause seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":6624709,"ranking":2,"query_text":"can seizure meds cause low sodium?","passage_text":"said that too low of a sodium level can cause seizures and sometimes. when too acute it can even cause death.And you will not believe it,but, the websites also stated that carbamazepine or tegretol either one will. cause low sodium,fluoxetine and keppra can also.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":6233475,"ranking":3,"query_text":"can seizure meds cause low sodium?","passage_text":"Diarrhea can disrupt this delicate balance by excreting too much sodium in the stool. Symptoms of mild low sodium levels include tiredness, disorientation, headache, muscle cramps and nausea. Severely low sodium levels can lead to seizures or coma. Severely low levels of potassium can cause abnormal heart function.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":5390069,"ranking":4,"query_text":"can seizure meds cause low sodium?","passage_text":"chemical imbalance for seizures, chemical seizure causes, what causes seizures, seizure triggers alcohol, cocaine, low blood sugar, low oxygen, low blood sodium, low blood calcium, kidney failure, liver failure, idiopathic nervous system, neurological, quick tips, seizures, epilepsy, electrical signals, neurons, nerves.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":585581,"ranking":5,"query_text":"can seizure meds cause low sodium?","passage_text":"Low sodium levels can cause a number of symptoms. Generally, symptoms include disorientation, tiredness, and headache. Muscle cramps, and nausea are other common signs of low sodium levels. If the condition remains for a prolonged period of time, coma and seizures can occur.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":7075398,"ranking":6,"query_text":"can seizure meds cause low sodium?","passage_text":"Low sodium: Low serum sodium concentrations in circulating blood sure can lead to seizures. If serum sodium concentrations drop fast, then brain sweiling happens rapidly with compression of brain matter. Seizure, coma, brain herniation can result. Low serum sodium concentrations are not induced by low sodium diets. Please don't confuse these.","bm25_label":"high","relevance_label":1.0},{"query_id":73257,"passage_id":585587,"ranking":7,"query_text":"can seizure meds cause low sodium?","passage_text":"Symptoms. Low sodium levels can cause a number of symptoms. Generally, symptoms include disorientation, tiredness, and headache. Muscle cramps, and nausea are other common signs of low sodium levels. If the condition remains for a prolonged period of time, coma and seizures can occur.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":3727400,"ranking":8,"query_text":"can seizure meds cause low sodium?","passage_text":"pulled him off the diuretic too which was causing low sodium, potassium, chloride and electrolyte levels in general. All of these levels being low will tire him out too. Seeing Trileptal (Epilepsy Med) can lower sodium levels so you should drink less water to hold sodium in the body longer.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":8719592,"ranking":9,"query_text":"can seizure meds cause low sodium?","passage_text":"home \/ medterms medical dictionary a-z list \/ hyponatremia definition Medical Definition of Hyponatremia Our Hyponatremia (Low Blood Sodium) Main Article provides a comprehensive look at the who, what, when and how of Hyponatremia (Low Blood Sodium) Hyponatremia: Low sodium in the blood. Hyponatremia can be caused by many conditions and when severe can lead to confusion and seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":2104333,"ranking":10,"query_text":"can seizure meds cause low sodium?","passage_text":"TRILEPTAL can cause serious side effects, including: 1. TRILEPTAL may cause the level of sodium in your blood to be low. Symptoms of low blood sodium include: ï\u0082· nausea ï\u0082· tiredness, lack of energy ï\u0082· headache ï\u0082· confusion ï\u0082· more frequent or more severe seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":3761538,"ranking":11,"query_text":"can seizure meds cause low sodium?","passage_text":"Oxcarbazepine can cause serious side effects, including: 1. Oxcarbazepine may cause the level of sodium in your blood to be low. Symptoms of low blood sodium include: 1  nausea. 2  tiredness, lack of energy. 3  headache. 4  confusion. 5  more frequent or more severe seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":2104332,"ranking":12,"query_text":"can seizure meds cause low sodium?","passage_text":"Stopping TRILEPTAL suddenly can cause serious problems. TRILEPTAL can cause serious side effects, including: 1. TRILEPTAL may cause the level of sodium in your blood to be low. Symptoms of low blood sodium include: ï\u0082· nausea ï\u0082· tiredness, lack of energy ï\u0082· headache ï\u0082· confusion ï\u0082· more frequent or more severe seizures.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":1366558,"ranking":13,"query_text":"can seizure meds cause low sodium?","passage_text":"Low sodium is caused by excess fluid in the body, according to MedicineNet. It may also be due to loss of sodium and body fluid, and it may be caused by kidney failure. Symptoms of low sodium include headache, seizures, confusion or unstable mental state. Continue Reading.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":3589312,"ranking":14,"query_text":"can seizure meds cause low sodium?","passage_text":"Low salt (sodium) levels in the blood: Symptoms may include headache; difficulty concentrating, memory changes or confusion; weakness and unsteadiness on your feet; and in severe or sudden cases hallucinations, fainting, seizures or coma. If not treated, severe low sodium levels can cause death.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":2371309,"ranking":15,"query_text":"can seizure meds cause low sodium?","passage_text":"Because the brain is very sensitive to sodium levels, low sodium causes symptoms including confusion and lethargy. The patient may feel nauseated, and experience muscle twitching, which can progress to seizures. Eventually, severe hyponatremia can lead to coma and death.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":2342222,"ranking":16,"query_text":"can seizure meds cause low sodium?","passage_text":"Taking too much desmopressin and\/or drinking lots of fluids may cause low sodium levels in the blood, which can lead to headache, nausea, confusion, seizures or, in rare cases, death. Other complications are dehydration, low blood pressure, and high sodium levels in the blood. There are four types of DI.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":7075401,"ranking":17,"query_text":"can seizure meds cause low sodium?","passage_text":"Losing sodium quickly is a medical emergency. It can cause loss of consciousness, seizures, and coma. Common symptoms of low blood sodium include: 1  weakness. 2  fatigue or low energy. 3  headache. 4  nausea and vomiting. 5  muscle cramps or spasms. 6  confusion. 7  irritability.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":1299797,"ranking":18,"query_text":"can seizure meds cause low sodium?","passage_text":"Hyponatremia is a condition where the level of sodium in the blood is low. Causes of hyponatremia can occur from excess fluid in the body, or a loss of sodium in body fluid. Some of the symptoms of hyponatremia include headache, muscle cramps or spasm, seizures, weakness and confusion.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":5304717,"ranking":19,"query_text":"can seizure meds cause low sodium?","passage_text":"Low blood sodium (hyponatremia) occurs when you have an abnormally low amount of sodium in your blood or when you have too much water in your blood. Low blood sodium is common in older adults, especially those who are hospitalized or living in long-term care facilities. Signs and symptoms of hyponatremia can include altered personality, lethargy and confusion. Severe hyponatremia can cause seizures, coma and even death.","bm25_label":"high","relevance_label":0.0},{"query_id":73257,"passage_id":4979669,"ranking":20,"query_text":"can seizure meds cause low sodium?","passage_text":"Do not take Oxtellar XR if you are allergic to oxcarbazepine or any of the other ingredients in Oxtellar XR. Oxtellar XR can cause serious side effects, including a low level of sodium in your blood. Symptoms of low blood sodium include nausea, tiredness, lack of energy, headache, confusion, and more frequent or more severe seizures. Similar symptoms that are not related to low sodium may occur from taking Oxtellar XR.","bm25_label":"high","relevance_label":0.0}]