[{"query_id":733422,"passage_id":7453985,"ranking":1,"query_text":"what is considered a missed pill","passage_text":"Although you should take the pill at roughly the same time of day, it is not considered missing the pill unless you forget to take the pill for the whole day. If you miss any hormone pills, you need a backup method of birth control (such as condom) for the rest of the month.","bm25_label":"high","relevance_label":1.0},{"query_id":733422,"passage_id":8562034,"ranking":2,"query_text":"what is considered a missed pill","passage_text":"So if missing one pill by a few hours does not effect birth control than how come so many women claim to have gotten pregnant after missing just one pill? I think by what we've discussed my chances shouldnt be too high considering I took it only nine hours late and have been taking all the others correctly and we use the pull out method I believe I should be fine.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":7453989,"ranking":3,"query_text":"what is considered a missed pill","passage_text":"What to do if you miss any of the 21 hormonal pills. 1  Use back up contraception: taking a pill even 12 hours late may decrease your protection against pregnancy. 2  If you are less than 24 hours late: Take the missed pill right away.  If you are 24 hours late: Take the missed pill and today's pill at the same time.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":5520615,"ranking":4,"query_text":"what is considered a missed pill","passage_text":"She can miss seven active pills without the risk of ovulation (which is what occurs in the pill free interval). Therefore, the least dangerous time for a woman to miss pills is in the middle of the packet and the most dangerous time is at the beginning or end of a packet. See the pill and 'periods' section.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":4794085,"ranking":5,"query_text":"what is considered a missed pill","passage_text":"Missing periods with normal use of birth control pills is called an 'absence of withdrawal bleeding' and is not usually considered abnormal or a concern, as long as there is no other cause for a missing period such as pregnancy.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":6151703,"ranking":6,"query_text":"what is considered a missed pill","passage_text":"If you are on birth control pills, the packet contains 3 weeks of active pills and one week of inactive pills. Menstruation usually happens while you are taking the inactive placebo pills, but itâ\u0080\u0099s important to note that some women can start their period while taking the active pills.any women often become surprised and even scared due to a missed period while on birth control. Often women will have a late period on birth control and not a missed period. If six weeks passes and a woman does not have a period or menstrual cycle, itâ\u0080\u0099s considered a missed period, or amenorrhea.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":5071999,"ranking":7,"query_text":"what is considered a missed pill","passage_text":"Yes; or abstain from sex until one pill has been taken every day in a row for 7 days. Consider using emergency contraception if you have had unprotected sex in the previous 7 days and have missed 2 or more pills in the first week of your pack. Consider consulting with health care provider for more advice.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":4180606,"ranking":8,"query_text":"what is considered a missed pill","passage_text":"When women first visit a doctor to obtain the pill they are generally provided with information on how the medication is taken, risks\/side effects and what to do if a pill is missed or its absorption is affected by diarrhoea or antibiotics.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":2192032,"ranking":9,"query_text":"what is considered a missed pill","passage_text":"how likely pregnancy is depends on a few things such as when you missed the pill how many pills you missed what kind of pills you take and whether you had sex here are some basic guidelines if you miss one hormone pill take it as soon as you remember you may need to use a backup birth control methodif you miss two or more hormone pills take 1 pill as soon as you remember you forgot them then read the pill label or call your doctor about instructions on how to take your missed pillspregnancy is more likely so use a backup method of birth control for 7 daysif you miss pills and have had sex without a backup method of birth control you can use emergency contraception such as plan b you can use emergency contraception for up to 5 days after having had sex but it works best if you take it right awayo use a backup method of birth control for 7 days if you miss pills and have had sex without a backup method of birth control you can use emergency contraception such as plan b you can use emergency contraception for up to 5 days after having had sex but it works best if you take it right away","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":7453986,"ranking":10,"query_text":"what is considered a missed pill","passage_text":"What to do if you miss any of the 21 hormonal pills. 1  Use back up contraception: taking a pill even 12 hours late may decrease your protection against pregnancy. Abstain or use condoms for 7 days.  If you are less than 24 hours late: Take the missed pill right away. Take your next pill at the regular time. If this is during the first week of your pill pack, you will need emergency contraception and condoms for 7 days. *Click here for emergency contraception information.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":2192040,"ranking":11,"query_text":"what is considered a missed pill","passage_text":"because it only takes one missed pill or in the case of the mini pill three missed hours it is possible to get pregnant after forgetting to take a pill even if you have what appears to be a period during that monthf you forget to take a pill but get back on track and go on to have a period the chance that you are pregnant is small but it could happen the bleeding you experience may not be a real period instead it may be the breakthrough implantation bleeding that is common during the first few weeks after conception","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":5221418,"ranking":12,"query_text":"what is considered a missed pill","passage_text":"It is also important that you don't miss a day. If you do miss a day, take two pills the following day. If you miss two pills, take two pills a day for two days. But if you miss more than that, you should use an alternative form of birth control until you start another pill pack.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":270195,"ranking":13,"query_text":"what is considered a missed pill","passage_text":"What should you do if you forget a pill? Take it as soon as you remember; to be safe, use another method of birth control until you finish that package of pills. If you miss more than one pill, take two pills per day for the next two days. Use a backup method of birth control for the rest of the cycle.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":1100437,"ranking":14,"query_text":"what is considered a missed pill","passage_text":"Taking Your Pills Properly. 1  1. Expect spotting for the first few months. 2  2. Take your pills at the same time. 3  3. Keep your pills in their original container.  4. Be prepared in case you miss a 1  pill. 5. Review the general guidelines for missing one pill.  6. Follow the recommendations if you miss more than one pill.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":8458885,"ranking":15,"query_text":"what is considered a missed pill","passage_text":"Call your doctor for advice about the test results. If you have not missed any pills, it is unlikely that you are pregnant. Do not stop taking your pills and risk a pregnancy unless instructed to do so by your doctor. If you forget 1 or more pills and you miss a period, take a home pregnancy test as soon as possible.If the test is positive, stop taking your pills. Call your doctor for advice about the test results. If the test is negative, talk to your doctor about what to do about missed or skipped birth control pills.f you have not missed any pills, skip 1 period, yet have no other signs of early pregnancy, it is very unlikely that you are pregnant. Signs of early pregnancy include fatigue, breast tenderness or enlargement, nausea or vomiting, and increased urination. Call your doctor if you are worried.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":3540300,"ranking":16,"query_text":"what is considered a missed pill","passage_text":"1 If you miss one hormone pill, take it as soon as you remember. 2  You may need to use a backup birth control method. 3  If you miss two or more hormone pills, take 1 pill as soon as you remember you forgot them. 4  Then read the pill label or call your doctor about instructions on how to take your missed pills.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":7453990,"ranking":17,"query_text":"what is considered a missed pill","passage_text":"Most women discover a missed pill when they go to take the next days pill and in that event , it IS a missed pill so you would go ahead and take both at the same time and use back up ( condoms ) for the next seven days ( or abstain if you prefer ) If you miss two pills , you are at a higher risk for ovulation and so you take two pills the day you ...","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":2805092,"ranking":18,"query_text":"what is considered a missed pill","passage_text":"Swap colonoscopy for a pill with PillCam Colon 2. What if you could swap your colonoscopy for a pill? No need to knock you out, for you to miss a day of work or for you to recruit somebody for a ride home in your post-scope sedative haze. At a fraction of the cost.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":8286363,"ranking":19,"query_text":"what is considered a missed pill","passage_text":"Woman should also not that the pill is not 100% effective and a missed period while on birth control could be a normal pregnancy. Again, talk with your doctor about these options to see whatâ\u0080\u0099s best for you and your situation.ften women will have a late period on birth control and not a missed period. If six weeks passes and a woman does not have a period or menstrual cycle, itâ\u0080\u0099s considered a missed period, or amenorrhea.","bm25_label":"high","relevance_label":0.0},{"query_id":733422,"passage_id":292659,"ranking":20,"query_text":"what is considered a missed pill","passage_text":"Birth Control Pill. The most common type of birth control pill uses the hormones estrogen and progestin to prevent ovulation. When taken on schedule, the pill is highly effective. About 8% of typical users get pregnant, including those who miss doses.Like all hormonal contraceptives, the pill requires a prescription.omen who have trouble remembering a daily pill may want to consider the birth control patch. The Ortho Evra patch is worn on the skin and changed only once a week for three weeks with a fourth week that is patch-free. The patch releases the same types of hormones as the birth control pill and is just as effective.","bm25_label":"high","relevance_label":0.0}]