[{"query_id":736125,"passage_id":8442028,"ranking":1,"query_text":"what is crossfit?","passage_text":"CrossFit is more of a forum for the progressive understanding of what fitness is and who is fit and as such the umbrella definition is appropriate. CrossFit is not a cookie-cutter program such as Insanity or P90x. Thus, to try to define CrossFit by a similar method is to completely ignore what CrossFit is about.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":820571,"ranking":2,"query_text":"what is crossfit?","passage_text":"What is CrossFit? The CrossFit prescription is performing â\u0080\u009cfunctional movements that are constantly varied at high intensity.â\u0080\u009d CrossFit is a core strength and conditioning program. The CrossFit program is designed to elicit as broad an adaptational response as possible.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":7597940,"ranking":3,"query_text":"what is crossfit?","passage_text":"About CrossFit. What is CrossFit? CrossFit is a fitness and conditioning system developed by Coach Greg Glassman through many years of watching, working with, and coaching all types of people â\u0080\u0093 from those considered â\u0080\u009cnormal and averageâ\u0080\u009d, to top athletes.","bm25_label":"high","relevance_label":1.0},{"query_id":736125,"passage_id":2565465,"ranking":4,"query_text":"what is crossfit?","passage_text":"In my time coaching and programming in several different CrossFit boxes, Iâ\u0080\u0099ve noticed there is some confusion surrounding the CrossFit RX standard and what it means to each and every individual CrossFitter. This confusion, can drastically change the experience of CrossFit for each person.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":1137854,"ranking":5,"query_text":"what is crossfit?","passage_text":"We take a closer look at Reebok's line of 'CrossFit' shoes with a comparison of the CrossFit Nano 3.0 vs Nano Speed. Here is what we thought of both.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":7899769,"ranking":6,"query_text":"what is crossfit?","passage_text":"Crossfit's Fitness. For CrossFit the specter of championing a fitness program without clearly defining what it is that the program delivers combines elements of fraud and farce. The vacuum of guiding authority has therefore necessitated that CrossFitâ\u0080\u0099s directors provide their own definition of fitness.ut CrossFit is good for becoming good at CrossFit. In the article of defining fitness, Greg says that a Outdoor's triathlete is not the world's fittest man, but he is the world's fittest man in the sport of triathlons.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":5638265,"ranking":7,"query_text":"what is crossfit?","passage_text":"Letâ\u0080\u0099s figure out what CrossFit is, who itâ\u0080\u0099s for, how it works, and if you should join your local CrossFit gym. WARNING: At 6,000 words, this is the longest post that has ever appeared on NF. If you have NO interest in CrossFit, check back in on Monday with your regularly scheduled nerdiness.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":3182135,"ranking":8,"query_text":"what is crossfit?","passage_text":"What is CrossFit? CrossFit is a fitness regimen developed by Greg Glassman over several decades. Glassman, CrossFit's Founder and CEO, was the first person in history to define fitness in a meaningful, measurable way: increased work capacity across broad time and modal domains. He then created a program specifically designed to improve fitness and health.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":1677625,"ranking":9,"query_text":"what is crossfit?","passage_text":"ESPN & the CrossFit Games: How It All Started & What It Means Now (+ the 2015 TV Schedule) On July 21st, the 9th annual CrossFit Games will take place at the Stub Hub Center in Carson, CA.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":4526854,"ranking":10,"query_text":"what is crossfit?","passage_text":"Do Not Cross CrossFit. Greg Glassman's essential business outlook is this: he can do whatever the hell he wants to. What he wants to do right now is protect the brand of CrossFit, his extraordinary fitness company. CERTIFIABLE CrossFitters do thrusters as part of a training seminar at CrossFit Morristown in Morristown, New Jersey.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":1740515,"ranking":11,"query_text":"what is crossfit?","passage_text":"Katrin Tanja Davidsdottir. In 2016, four-time CrossFit Games veteran Katrin Tanja Davidsdottir did what only two other athletes have done in the history of the CrossFit Games: win the CrossFit Games twice (Annie Thorisdottir won the Games in 2011 and 2012, and Rich Froning held the menâ\u0080\u0099s title from 2011-2014).","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":8315456,"ranking":12,"query_text":"what is crossfit?","passage_text":"CrossFit RUK aims to be the CrossFit hub of Western Kansas and we feel that in order to accomplish this we must be have the proper pieces in place to create a gym that people will talk about with high regard. The CrossFit RUK internship is a 6 month program. This program will allow the intern as well as CrossFit RUK to discover if the relationship is a good fit. A performance evaluation will be done after every 30 days. After every evaluation we will meet and discuss what was observed at that time.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":7597941,"ranking":13,"query_text":"what is crossfit?","passage_text":"Is CrossFit Right For You? This depends entirely on what you are looking for in a workout environment and what physical changes you are hoping to see in your body. One less-marketed aspect of Crossfit you may not know of is the central importance of nutrition. Many CrossFitters utilize some form of a Paleo diet.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":8442035,"ranking":14,"query_text":"what is crossfit?","passage_text":"December 27, 2010. â\u0080\u009cItâ\u0080\u0099s a quantifiable approach to a finally well-defined notion of what fitness is. That is what CrossFit is,â\u0080\u009d CrossFit founder and CEO Greg Glassman says in defining the program he created and showing how it differs from every other exercise regimen out there.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":39361,"ranking":15,"query_text":"what is crossfit?","passage_text":"What is an EMOM? Donâ\u0080\u0099t worry, you are not alone in asking these questions. Both beginners, and even experienced CrossFitterâ\u0080\u0099s, struggle with some of the acronyms. Here are some of the most common acronyms used in CrossFit and at CrossFit Power Grid.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":6267032,"ranking":16,"query_text":"what is crossfit?","passage_text":"Inspired by my last post in rambling off my Crossfit workouts without realizing that half of the readers may not even know what is a WOD, I opted to put together a very basic list of what some Crossfit abbreviations and terms are so you can reference anytime you read my posts.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":1324991,"ranking":17,"query_text":"what is crossfit?","passage_text":"What Elite Athletes Eat: 13 Meals From Famous CrossFit Games Competitors. Sufficient and well balanced nutrition is beneficial not only for the CrossFit Games athletes, but everyday Crosfitters looking to improve their health and performance. So take a look at what they eat when they need to perform, and when they need to reward themselves. September 16, 2015.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":7597932,"ranking":18,"query_text":"what is crossfit?","passage_text":"what is crossfit? how to start; find a box; faq; message board; Courses. Home; Level 1 Course; Level 2 Trainer Course; Kids Course; Online Courses; Specialty Courses; Trainer Directory; FAQ; Certifications. Home; Certified Crossfit Trainer (CF-L3) Certified CrossFit Coach (CF-L4) Trainer Directory; FAQ; exercise & demos; games; journal; affiliates. about affiliation; how to affiliate; application","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":7597938,"ranking":19,"query_text":"what is crossfit?","passage_text":"CrossFit is what remains â\u0080\u0093 bar none, the most effective fitness and conditioning system in the world! One of the things that makes CrossFit unique is that it addresses the fact that the fitness needs of an â\u0080\u009cAverage Joeâ\u0080\u009d are identical to that of a top athlete â\u0080\u0093 the only difference being intensity (speed & weight) and volume.","bm25_label":"high","relevance_label":0.0},{"query_id":736125,"passage_id":8579395,"ranking":20,"query_text":"what is crossfit?","passage_text":"Ultimately, youâ\u0080\u0099ll find out why Reebok CrossFit shoes are, in fact, great shoes, and more importantly, which model is best for your needs. Reebok CrossFit Nano. Reebok CrossFit OLY. Reebok makes two models of CrossFit shoes, the CrossFit Nano and the Reebok CrossFit shoe has a minimalist design.","bm25_label":"high","relevance_label":0.0}]