[{"query_id":736347,"passage_id":7429625,"ranking":1,"query_text":"what is csfb","passage_text":"Circuit Switched FallBack. (CSFB) Circuit Switched FallBack (CSFB) is a technology whereby voice and SMS services are delivered to LTE devices through the use of GSM or another circuit-switched network. Circuit Switched FallBack is needed because LTE is a packet-based all-IP network that cannot support circuit-switched calls.","bm25_label":"high","relevance_label":1.0},{"query_id":736347,"passage_id":7429624,"ranking":2,"query_text":"what is csfb","passage_text":"Such migration path is possible with CS Fallback (CSFB) feature. CSFB is introduced in 3GPP Rel-8 to allow an UE in EPS to reuse CS domain services by defining how the UE can switch its radio from EUTRAN access to other RAT (e.g. GERAN\/UTRAN\/1xRTT access) that can support CS domain services.","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":4258103,"ranking":3,"query_text":"what is csfb","passage_text":"The terms outperform is the opposite of underperform, which indicates a stock is more likely to be weaker than the market. CSFB, Wachovia and Raymond James are brokerage firms that use these specific terms (as opposed to alternatives) in analyzing stocks.","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":7429622,"ranking":4,"query_text":"what is csfb","passage_text":"NEW YORK -- NEW YORK, June 5 \/PRNewswire\/ -- CSFB is pleased to announce the launch of the Credit Indexed-Note Default Index (CINDI), comprised of a pair of indices which track the most liquid corporate credits in the in the U.","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":7429623,"ranking":5,"query_text":"what is csfb","passage_text":"William Battey, President of CSFB DNA, said, In today's fast moving and increasingly global marketplace, trader priced data and broad based quantitative analytics are absolutely essential in assisting our clients in their interpretation of a range of risk factors in the marketplace.","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":7429620,"ranking":6,"query_text":"what is csfb","passage_text":"CSFB Realty will provide a full range of corporate real estate services, including tenant representation, landlord leasing, investment sales and advisory services for Credit Suisse First Boston, its subsidiaries and affiliates, as well as for clients of Credit Suisse First Boston and non-affiliated clients globally.","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":7429627,"ranking":7,"query_text":"what is csfb","passage_text":"Circuit Switched Fallback (CSFB) CS domain services are the services that can be offered today in GSM-UMTS networks. Examples of such services are: voice and its supplementary services (e.g. call waiting, call forwarding), USSD, LCS, SMS, E911, LI, and even CS DUI video, etc.","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":3058085,"ranking":8,"query_text":"what is csfb","passage_text":"What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your favorite. What's your, what's your, what's your, what's your, what's your.","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":2737045,"ranking":9,"query_text":"what is csfb","passage_text":"whats good; whats gooday [whats good] B; What's good boys? whats good family? what's good for the geese? whats good in the hood; What's good mo; What's good nigga; What's good wit chu; what's good with the butt? Whats good wit it; whats goody; What's goodybags? What's Goy? What's Grapes? What's Gravity; What's gravy; whats gravy in the navy; what's growin' long; whats guanin","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":6809641,"ranking":10,"query_text":"what is csfb","passage_text":"20 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it0 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":1147809,"ranking":11,"query_text":"what is csfb","passage_text":"what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":1147811,"ranking":12,"query_text":"what is csfb","passage_text":"what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ... 62. what is: humulin, used for; and what is ...","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":1606419,"ranking":13,"query_text":"what is csfb","passage_text":"What is the opposite of obtuse? What is the opposite of obtunding? What is the opposite of obtunded? What is the opposite of obtund? What is the opposite of obtrusively? What is the opposite of obtrusive? What is the opposite of obtuse-angled? What is the opposite of obtusely? What is the opposite of obtuseness? What is the opposite of obtusenesses? What is the opposite of obtuser? What is the opposite of obtusest?","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":1338568,"ranking":14,"query_text":"what is csfb","passage_text":"What is the singular of of cyclopropaphanes? What is the singular of of cyclopropenes? What is the singular of of cyclopropeniums? What is the singular of of cyclopropenone? What is the singular of of cyclopropyls? What is the singular of of cyclopropylamine? What is the singular of of cyclopsams? What is the singular of of cyclopterids? What is the singular of of cyclopyrrolones? What is the singular of of cycloramas? What is the singular of of cyclorelease?","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":8154817,"ranking":15,"query_text":"what is csfb","passage_text":"What is the opposite of modification? What is the opposite of modifiably? What is the opposite of modifiable? What is the opposite of modicum? What is the opposite of modica? What is the opposite of modesty? What is the opposite of modifies? What is the opposite of modify? What is the opposite of modifying? What is the opposite of modish? What is the opposite of modishly?","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":1605952,"ranking":16,"query_text":"what is csfb","passage_text":"What is the opposite of biasedly? What is the opposite of biased? What is the opposite of bias crime? What is the opposite of bias? What is the opposite of biandry? What is the opposite of bi? What is the opposite of biases? What is the opposite of biasing? What is the opposite of biassed? What is the opposite of biasses? What is the opposite of biassing? What is the opposite of bib and tucker?","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":7211423,"ranking":17,"query_text":"what is csfb","passage_text":"What is the opposite of aisle? What is the opposite of airy hope? What is the opposite of airy-fairy? What is the opposite of airy? What is the opposite of airworthy? What is the opposite of airworthiness? What is the opposite of ajar? What is the opposite of AJAX? What is the opposite of AKA? What is the opposite of aken? What is the opposite of akimbo? What is the opposite of akin?","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":8114700,"ranking":18,"query_text":"what is csfb","passage_text":"What is the plural of of decorum? What is the plural of of decose? What is the plural of of decoside? What is the plural of of decoupage? What is the plural of of decoupler? What is the plural of of decoupling? What is the plural of of decoy duck? What is the plural of of decoy-duck? What is the plural of of decoyer? What is the plural of of decoyinine? What is the plural of of decoyman? What is the plural of of decrease?","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":665982,"ranking":19,"query_text":"what is csfb","passage_text":"What is Hosting? What do these terms mean? What is a Web Server? What does HTTP stand for? What is a Domain Name? What is an IP Address? What is a URL? What does DNS do? What is FTP? What does...","bm25_label":"high","relevance_label":0.0},{"query_id":736347,"passage_id":1147810,"ranking":20,"query_text":"what is csfb","passage_text":"what is: acetic acid, used for; and ... 57. what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ...","bm25_label":"high","relevance_label":0.0}]