[{"query_id":741392,"passage_id":9178,"ranking":1,"query_text":"what is drop in baseball bat selection","passage_text":"Drop refers to the length of the bat minus the weight of the bat. The higher the drop, usually the lighter the bat is. Again, some leagues and\/or programs have a limit on how much the drop can be so always check your rule book. If youâ\u0080\u0099re a power hitter, you may do well with a slightly heavier bat. If you play small ball and try to get base hits, a smaller bat will give you more control. How to Buy a T-Ball Bat. What You Need to Know About Youth Baseball Bats. How to Get the Most out of Your Wood Baseball Bat.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":1560146,"ranking":2,"query_text":"what is drop in baseball bat selection","passage_text":"DeMarini Drop 3 Baseball Bats. This is the best selection of DeMarini drop 3 bats you can find today. I like the 2015 CF7 but itâ\u0080\u0099s basically out of stock. If you have oneâ\u0080¦itâ\u0080\u0099s still one of the best even though the 2016â\u0080\u0099s are selling like hotcakes.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":3966122,"ranking":3,"query_text":"what is drop in baseball bat selection","passage_text":"Simply put, you need to concentrate on the size of youth baseball bat more than anything else. Make sure that the bat you select is ideal for your height and body weight. When you talk about the technical details, most youth bats have a drop weight between -10 and -13.5.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":961848,"ranking":4,"query_text":"what is drop in baseball bat selection","passage_text":"Bat Size Chart-Guide to selecting correct bat size. Use this bat size guide (courtesy Louisville Slugger) to help you select the best bat size for little league baseball, senior league baseball, high school\/college baseball or fastpitch softball. Click the link below to see bat chart.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":6815013,"ranking":5,"query_text":"what is drop in baseball bat selection","passage_text":"The drop of the bat is the difference between the length minus the  weight. For example, if a bat is 33 long and it weighs 30 ounces,  then the drop is -3. The drop of the â\u0080¦bat varies in baseball,  depending on the level of play.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":7244529,"ranking":6,"query_text":"what is drop in baseball bat selection","passage_text":"1 It refers to the difference between the length of the bat (in inches) and the weight of the bat (in ounces). 2  It is always shown as a minus number and the higher the weight drop, the lighter the bat. 3  For example, a baseball bat with a -10 weight drop would be lighter than a bat with a -3 weight drop.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":961850,"ranking":7,"query_text":"what is drop in baseball bat selection","passage_text":"The more negative the drop, the lighter the bat is relative to the length of the bat. So, in general, young kids will swing high drop (more negative) bats and older kids will swing low drop (less negative) bats. An important note about drop for older boys playing baseball: The natural drop of wood is -3.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":679972,"ranking":8,"query_text":"what is drop in baseball bat selection","passage_text":"The drop of the bat is the difference between the length minus the weight. For example, if a bat is 33 long and it weighs 30 ounces, then the drop is -3. The drop of the bat varies in baseball, depending on the level of play. Little League doesn't have any regulations for the drop zone.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":5718088,"ranking":9,"query_text":"what is drop in baseball bat selection","passage_text":"Both sports use bats, but a softball bat and a baseball bat are two completely different pieces of equipment. Neither softball nor baseball bats generally exceed 34 inches in length (baseball bats have a maximum length of 42 inches, though this is a rarity), but their weight differences are vastly different. In both sports, the difference between the length and weight is referred to as to the drop.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":1656444,"ranking":10,"query_text":"what is drop in baseball bat selection","passage_text":"Drop 3 baseball bats are more important today than ever before and I want to explain why. The way the game is played today has forced leagues to have certain rules regarding the bats used. Click here to see the best-rated drop 3 baseball bats of 2016 and then continue reading the rest of this article.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":1770910,"ranking":11,"query_text":"what is drop in baseball bat selection","passage_text":"A baseball bat is a smooth wooden or metal club used in the sport of baseball to hit the ball after it is thrown by the pitcher.By regulation it may be no more than 2.75 inches in diameter at the thickest part and no more than 42 inches (1,100 mm) long.he bat drop of a bat is its weight, in ounces, minus its length, in inches. For example, a 30-ounce, 33-inch-long bat has a bat drop of minus 3 (30 â\u0088\u0092 33 = â\u0088\u00923). Larger bat drops help to increase swing speed.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":5324342,"ranking":12,"query_text":"what is drop in baseball bat selection","passage_text":"Confidence votes 222. The drop of the bat is the difference between the length minus the weight. For example, if a bat is 33 long and it weighs 30 ounces, then the drop is -3. The drop of the bat varies in baseball, depending on the level of play. Little League doesn't have any regulations for the drop zone.","bm25_label":"high","relevance_label":1.0},{"query_id":741392,"passage_id":679968,"ranking":13,"query_text":"what is drop in baseball bat selection","passage_text":"Drop 3 baseball bats are more important today than ever before and I want to explain why. The way the game is played today has forced leagues to have certain rules regarding the bats used. Click here to see the best-rated drop 3 baseball bats of 2014 or 2015 and then continue reading the rest of this article.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":300461,"ranking":14,"query_text":"what is drop in baseball bat selection","passage_text":"If you still have questions on about selecting the right youth baseball bat, check out our Bat Sizing Chart. s we offer free shipping both ways. USA Baseball: Youth Bat Rules. USA Baseball, the national governing body for the sport of baseball in the United States, follows the USABat Standard. This video explains the USA Baseball bat standard.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":300460,"ranking":15,"query_text":"what is drop in baseball bat selection","passage_text":"Hi, James. A lower drop number for a baseball bat means it's a heavier bat; a higher number translates into a lighter bat. So, a lower drop number doesn't necessarily mean a better bat, but--depending on the player--a higher drop number could lead to more extra base hits and homeruns. Hope that helps.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":2570155,"ranking":16,"query_text":"what is drop in baseball bat selection","passage_text":"Transcript of Hitting Power of Wood vs. Aluminum Baseball Bats. What is the effect of a baseball bat material, wood vs. aluminum, on the hitting distance of a baseball? If an aluminum baseball bat instead of a wood baseball bat is used to hit a baseball, then the baseball will travel a farther distance. How the test will be done: 1. I will hit two rounds of twelve baseballs off of a hitting tee with each of the four bats.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":8037819,"ranking":17,"query_text":"what is drop in baseball bat selection","passage_text":"How to Choose the Correct Baseball or Softball Bat Weight. Before looking at weights, itâ\u0080\u0099s important to first understand a little bit more: Bat weight is measured by the minus or drop weight; Drop weight is the difference between the length and weight of the bat, so a bat that is 30 inches long and has a drop weight of -10 will weigh 20 ounces","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":3202879,"ranking":18,"query_text":"what is drop in baseball bat selection","passage_text":"With over 7,000 bats in stock, our selection of softball equipment and baseball equipment includes everything! We have baseball bats and softball bats, whether it be fast pitch or slow pitch, adult or youth. We stock batting gloves, baseball gloves and softball gloves, equipment bags, protective equipment, catcher's sets, softballs and baseballs. We also carry cleats and trainers, apparel, and tons of accessories.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":1394736,"ranking":19,"query_text":"what is drop in baseball bat selection","passage_text":"The smaller the drop, the heavier the bat. In each of those categories there will be a number e.g. -10oz, -11oz, -12oz etc. Those numbers are the DROP which represent the weight difference between the length of the bat and the actual weight of the bat. For example, If looking for a 30inch, 20oz Youth Baseball bat, we know that the difference between the length and the weight is 10oz.","bm25_label":"high","relevance_label":0.0},{"query_id":741392,"passage_id":1979531,"ranking":20,"query_text":"what is drop in baseball bat selection","passage_text":"What is a BBCOR baseball bat? What is BBCOR? Pull out your PHD and start reading. It is a extremely complicated, exhaustively wordy new standard for testing baseball bats for High School and College Baseball players. The following protocol has been adopted by the NCAA and must be followed when baseball bats are submitted for BBCOR certification.","bm25_label":"high","relevance_label":0.0}]