[{"query_id":744261,"passage_id":7716436,"ranking":1,"query_text":"what is eod mean","passage_text":"EOD Warrior 5k | San Diego, CA. Explosive Ordnance Disposal (EOD) is a joint service military occupational skill, meaning EOD technicians serve within the Army, Marine Corps, Navy, and Air Force.","bm25_label":"high","relevance_label":1.0},{"query_id":744261,"passage_id":4500006,"ranking":2,"query_text":"what is eod mean","passage_text":"Definition of EOD. 1  acronym for End of Day.I need that report by EOD.  See more words with the same meaning: acronyms (list of).","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":2934874,"ranking":3,"query_text":"what is eod mean","passage_text":"Meaning of the EOD Badge. THE WREATH is symbolic of the achievements and laurels gained by minimizing accident potentials, through the ingenuity and devotion to duty of its members. It is in memory of the EOD personnel who have given their lives while performing EOD duties.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":4500007,"ranking":4,"query_text":"what is eod mean","passage_text":"Definition of EOD. 1  acronym for End of Day.I need that report by EOD. 2  See more words with the same meaning: acronyms (list of).  See more words with the same meaning: business (related to).","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":4500003,"ranking":5,"query_text":"what is eod mean","passage_text":"Link to this slang definition. To link to this term in a web page or blog, insert the following. <a href=http:\/\/onlineslangdictionary.com\/meaning-definition-of\/eod>EOD<\/a>. To link to this term in a wiki such as Wikipedia, insert the following.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":7657870,"ranking":6,"query_text":"what is eod mean","passage_text":"Looking for the definition of DEET? Find out what is the full meaning of DEET on Abbreviations.com! 'Directed Energy EOD Tool' is one option -- get in to view more @ The Web's largest and most authoritative acronyms and abbreviations resource.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":5708860,"ranking":7,"query_text":"what is eod mean","passage_text":"EOD, Combat Control, Pararescue? In tech school after Air Force Basic Training I want to go for EOD Explosive Ordinance Disposal or Combat Control. What are roughly the salaries of each position?? Will I still be paid based upon what rank I come in as, such as E3 or will my pay change during and after tech...Source(s): air force salary eod combat control pararescue: https:\/\/tr.im\/0nRYy.n tech school after Air Force Basic Training I want to go for EOD Explosive Ordinance Disposal or Combat Control.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":4500008,"ranking":8,"query_text":"what is eod mean","passage_text":"EOD [Internet]; Aug 1, 2016 [cited 2016 Aug 1]. Available from: http:\/\/www.allacronyms.com\/_Military\/EOD. 'EOD', All Acronyms, 1 August 2016, <http:\/\/www.allacronyms.com\/_Military\/EOD> [accessed 1 August 2016] All Acronyms, EOD (Aug. 1, 2016, 7:08 PM), available at http:\/\/www.allacronyms.com\/_Military\/EOD.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":7716442,"ranking":9,"query_text":"what is eod mean","passage_text":"EOD means help, not punishment By Doug Russell McAlester News-Capital. Emergency order of detention: not something police like to do, but something thatâ\u0080\u0099s far too often necessary. Police routinely pick up people for EODs who have attempted suicide or otherwise caused themselves injury. Sometimes the individual is violent or verbally abusive, but thatâ\u0080\u0099s just part of the job, officers say. â\u0080\u009cWe do quite a few EODs,â\u0080\u009d said McAlester Det. Capt. Darrell Miller.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":4500005,"ranking":10,"query_text":"what is eod mean","passage_text":"Preferably an EOD is initiated using an online messenger service such as MSN or Gtalk. EOD is often extended using parentheses and\/or semicolon EOD();, indicating the use of a method in programming languages. EOD is the counterpart of a BOD (Beginning Of Day)","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":4500010,"ranking":11,"query_text":"what is eod mean","passage_text":"Acronym for End of Day used by colleagues of office spaces to conclude their day. A typical EOD should be initiated half an hour before the end of the workday. Preferably an EOD is initiated using an online messenger service such as MSN or Gtalk. EOD is often extended using parentheses and\/or semicolon EOD();, indicating the use of a method in programming languages. Renji: EOD()!","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":4500002,"ranking":12,"query_text":"what is eod mean","passage_text":"1 acronym for End of Day.I need that report by EOD. 2  See more words with the same meaning: acronyms (list of).  See more words with the same meaning: business (related to).","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":5708863,"ranking":13,"query_text":"what is eod mean","passage_text":"In tech school after Air Force Basic Training I want to go for EOD Explosive Ordinance Disposal or Combat Control.What are roughly the salaries of each position?? Will I still be paid based upon what rank I come in as, such as E3 or will my pay change during and after tech...Source(s): air force salary eod combat control pararescue: https:\/\/tr.im\/0nRYy.n tech school after Air Force Basic Training I want to go for EOD Explosive Ordinance Disposal or Combat Control.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":4500009,"ranking":14,"query_text":"what is eod mean","passage_text":"EOF - Next 1  â\u0086\u0092. acronym for End of Day.I need that report by EOD. 2  See more words with the same meaning: acronyms (list of).  See more words with the same meaning: business (related to).","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":555563,"ranking":15,"query_text":"what is eod mean","passage_text":"If an EOD Team is needed for a water insertion then the only choice is Navy. Navy EOD training is pretty close SEALs training. Many times you Navy EOD teams are assigned with SEAL teams on patrols in Afghanistan. You will not be a part of a seal team but your EOD team may be assigned with a SEAL team. You are put where you are tactically needed.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":7716440,"ranking":16,"query_text":"what is eod mean","passage_text":"EOD. Acronym for End of Day used by colleagues of office spaces to conclude their day. A typical EOD should be initiated half an hour before the end of the workday. Preferably an EOD is initiated using an online messenger service such as MSN or Gtalk.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":1017430,"ranking":17,"query_text":"what is eod mean","passage_text":"A debate started in my shop today when one of my EOD Techs (1) jokingly called another EOD Tech (2) a Nonner. (2) had never heard the word before and that started the debate. What is your definition of a Nonner? I have always been told that a Nonner is an insult for anyone that isn't a Maintainer. Others say it's someone who has a desk job.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":793167,"ranking":18,"query_text":"what is eod mean","passage_text":"Here are some of the common myths and truths about military EOD technicians: 1  Myth â\u0080\u0093 EODâ\u0080\u0099s job is glamorous. 2  Myth â\u0080\u0093 All EOD technicians are men. 3  Myth - EOD technicians are heavily rewarded for their additional risks. 4  Myth - EOD techs only defuse bombs. 5  Myth - Bomb disposal is about cutting the â\u0080\u009credâ\u0080\u009d wire.","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":793165,"ranking":19,"query_text":"what is eod mean","passage_text":"These men and women are Explosive Ordnance Disposal (EOD) technicians and there is a lot that people donâ\u0080\u0099t know about the critical and lifesaving work these quiet professionals do. EOD stands for Explosive Ordnance Disposal, the disarming and disposal of bombs. EOD technicians are highly-trained military members serving in the Army, Marines, Navy, and Air Force who are responsible for disarming, rendering safe, and disposing of bombs. The EOD profession is the most dangerous occupation in ...","bm25_label":"high","relevance_label":0.0},{"query_id":744261,"passage_id":1765038,"ranking":20,"query_text":"what is eod mean","passage_text":"Also known as the â\u0080\u009cEOD Badgeâ\u0080\u009d or Crab, the decoration is issued by the United States Army, Air Force, Navy and Marine Corps. The EOD Badge is the only occupational badge awarded to all four services. First created in the 1950s, the EOD Badge is issued in three levels and is identical for all branches of service.","bm25_label":"high","relevance_label":0.0}]