[{"query_id":746055,"passage_id":7535113,"ranking":1,"query_text":"what is face primer","passage_text":"Best Face Primer for Normal Skin: When you have normal skin, you have no excuse for not using a face primer unless you want your makeup to melt away in mere hours. Face primer is essential for flawless looking makeup that lasts all day, and it can do a lot more.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":101849,"ranking":2,"query_text":"what is face primer","passage_text":"A cosmetic primer is a cream or lotion applied before another cosmetic to improve coverage and lengthen the amount of time the cosmetic lasts on the face. There are different kinds of cosmetic primers such as foundation primer, eyelid primer, lip primer, and mascara primer.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":7476345,"ranking":3,"query_text":"what is face primer","passage_text":"Primer (cosmetics) A cosmetic primer is a cream or lotion applied before another cosmetic to improve coverage and lengthen the amount of time the cosmetic lasts on the face. Variations[edit] There are different kinds of cosmetic primers such as foundation primer, eyelid primer, lip primer, and mascara primer.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":7476344,"ranking":4,"query_text":"what is face primer","passage_text":"Primer (cosmetics) From Wikipedia, the free encyclopedia. A cosmetic primer is a cream or lotion applied before another cosmetic to improve coverage and lengthen the amount of time the cosmetic lasts on the face. There are different kinds of cosmetic primers such as foundation primer, eyelid primer, lip primer, and mascara primer.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":1043958,"ranking":5,"query_text":"what is face primer","passage_text":"More importantly, my skin doesnâ\u0080\u0099t feel or look oily! The face primer Iâ\u0080\u0099ve been using is Bare Escentuals bareVitamins Prime Time. First I apply moisturizer, and then I use one full pump of the face primer (about the size of a dime) on my face before I apply my foundation. I apply and blend the primer with my fingers.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":3783029,"ranking":6,"query_text":"what is face primer","passage_text":"It makes foundation sit better only our skin, giving a more flawless look, and prevents it form sliding around or smudging much better. primer does multiple tasks: and most primer usually are healthy for your skin and I suggest you to use elf face primer which are the best for the face.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":7535109,"ranking":7,"query_text":"what is face primer","passage_text":"Best Face Primer. Face primer is a product that can help your skin look not only flawless, but polished and professional. In effect, it creates a canvas on your skin where you can apply your favorite cosmetics such as foundation and blush. Face primer also helps minimize pores and fine lines and some have specialty uses such as correcting color, reducing oil or dryness and being specifically made for problem skin or acne.","bm25_label":"high","relevance_label":1.0},{"query_id":746055,"passage_id":1043961,"ranking":8,"query_text":"what is face primer","passage_text":"16 Comments. [â\u0080¦] Primers Face and How to Use The Face Primer I with Prime Time Bare Escentuals bareVitamins. I apply moisturizer first, then I use a full pump of face book (about the size of a dime) on my face before you apply my foundation. [â\u0080¦] Prime your face, if desired (though I strongly recommend it for your wedding day!","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":101847,"ranking":9,"query_text":"what is face primer","passage_text":"Primer (cosmetics) A cosmetic primer is a cream or lotion applied before another cosmetic to improve coverage and lengthen the amount of time the cosmetic lasts on the face. Variations. There are different kinds of cosmetic primers such as foundation primer, eyelid primer, lip primer, and mascara primer. A foundation primer may work like a moisturizer only different, or it may absorb oil with salicylic acid or aid in creating a less oily, more matte appearance.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":5842686,"ranking":10,"query_text":"what is face primer","passage_text":"1 Invest in primer and foundation. 2  Use a lip primer before applying lipstick to prevent smudging and improve finish. 3  Put a face moisturizer on your face and then apply powder foundation with a blusher brush and it will last you all day.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":3783028,"ranking":11,"query_text":"what is face primer","passage_text":"primer does multiple tasks: 1. creates a layer between (harmful) makeup and your skin to protect your skin 2. smoothes out your skin, so the makeup goes on smoother 3. since the makeup goes on smoother, it lasts longer and most primer usually are healthy for your skin and I suggest you to use elf face primer which are the best for the face.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":5842691,"ranking":12,"query_text":"what is face primer","passage_text":"1 It makes your eyeshadow look a lot better! 2  Invest in primer and foundation. 3  Use a lip primer before applying lipstick to prevent smudging and improve finish. 4  Put a face moisturizer on your face and then apply powder foundation with a blusher brush and it will last you all day.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":8338515,"ranking":13,"query_text":"what is face primer","passage_text":"Primers have different ingredients, weights, and textures that will work better with different skin types. If you're not sure what kind of skin you have, wash your face with a gentle cleanser and let it air dry. How does your skin feel after 15-20 minutes? If your face feels moist or oily, you have oily skin.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":6676722,"ranking":14,"query_text":"what is face primer","passage_text":"Here's the deal. Makeup primer is a base for foundation or face makeup that allows it to go on smoother and last longer. Formulas are available in cream, gel and powder.f you haven't been using makeup primer, then you're really missing out. Whether you wear a full face of makeup everyday or you prefer to keep it simple with BB cream and tinted lip balm, makeup primer is a godsend when trying to combat shine or create a smooth base for foundation.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":3783025,"ranking":15,"query_text":"what is face primer","passage_text":"Makeup primer is a base for foundation or any face makeup which allows it to go on smoother and last longer. I highly recommend the primers by Makeup Forever. They come in a variety of different needs, i.e. smoothing the skin, hydrating, etc. A face primer is used before you start applying makeup. It has multiple benefits, as it creates a layer over your skin making it even and smooth. It also protects your skin from the makeup as it wont let your foundation clog your pores. Your should first clean your skin by washing and then moisturize before starting with the primer.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":7029353,"ranking":16,"query_text":"what is face primer","passage_text":"Rating Newest Oldest. Best Answer: -the base of makeup is called Primer primer is like the canvas to a painting, it smooths your skin, fills in lines, and keeps your foundation on longer. -Foundation is what you put everywhere on your face, to even out skin tone. I used to use MAC, but i too found it was overpriced and didnt work very well. i heard great things about Maybelline Mineral Power foundation, and a week ago i bought it.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":4408303,"ranking":17,"query_text":"what is face primer","passage_text":"Using Powder Foundation. 1  1. Pick the right powder foundation. Like other types of foundation, you want to match the skin tone of your face as closely as possible. 2  2. Apply a makeup primer. Paint a thin layer of primer across your face using your fingertips. 3  3. Load the powder onto a brush.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":449603,"ranking":18,"query_text":"what is face primer","passage_text":"Apply a quality primer to your face before applying your foundation. The primer has 2 purposes. It gives the foundation a better surface to adhere and it fills in your pores so your foundation doesn't soak into your pores. Without a primer, the foundation will enhance your pores, rather than hide them.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":449607,"ranking":19,"query_text":"what is face primer","passage_text":"2. Apply a quality primer to your face before applying your foundation. The primer has 2 purposes. It gives the foundation a better surface to adhere and it fills in your pores so your foundation doesn't soak into your pores. Without a primer, the foundation will enhance your pores, rather than hide them.","bm25_label":"high","relevance_label":0.0},{"query_id":746055,"passage_id":449606,"ranking":20,"query_text":"what is face primer","passage_text":"Apply a quality primer to your face before applying your foundation. The primer has 2 purposes. It gives the foundation a better surface to adhere and it fills in your pores so your foundation doesn't soak into your pores.","bm25_label":"high","relevance_label":0.0}]