[{"query_id":752473,"passage_id":7611580,"ranking":1,"query_text":"what is granicrete","passage_text":"Counters Floors and More! Granicrete is a high-end cement overlay system that bonds to your existing counter tops or cement flooring. Granicrete gives you the elegant look of granite, marble, concrete, stone, tile, wood and more at a fraction of the price. Granicrete is very durable and Eco-friendly.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611577,"ranking":2,"query_text":"what is granicrete","passage_text":"Granicrete is a durable polymer modified concrete mix used as a thin overlay for new or existing surfaces that can be colored to look like granite, marble stone or concrete. The Granicrete colors can be used as-is or mixed to produce virtually any color you desire.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611572,"ranking":3,"query_text":"what is granicrete","passage_text":"THE REVOLUTIONARY GRANICRETE COUNTER TOP RESURFACING SYSTEM: Virtually any look for granite, marble, or custom concrete can be easily achieved. Instead of replacing the counter top - with Granicrete Installations you simply resurface it. Granicrete has excellent adhesion to laminate, FormicaÂ®, tile, and wood countertops and quickly replicates the highest-end stone looks, chiseled edges, and easily creates tall back splashes. Our simple coloring system guarantees you will achieve that one-of-a-kind look.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611573,"ranking":4,"query_text":"what is granicrete","passage_text":"OK, can't convert a file to jpg. My post is about granicrete. Got a brochure on the company telling me to go to their school (Farminton hills MI.) and be a granicrete installer. They say, among other things that this product can be layed over laminate, formica and MDF.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611574,"ranking":5,"query_text":"what is granicrete","passage_text":"Granicrete is very durable, and, unlike granite, remains impermeable to water, food bacteria, harsh chemicals and stains. Granite, on the other hand, stains with certain fruits, oils, and retains bacteria. Granicrete is also seamless and uses a USDA approved epoxy coating, unlike granite.","bm25_label":"high","relevance_label":1.0},{"query_id":752473,"passage_id":7611575,"ranking":6,"query_text":"what is granicrete","passage_text":"Granicrete Installations can achieve virtually any look for granite, marble, stone, or custom concrete countertops..â\u0080¦or get the custom look that Ty Pennington preferred on Extreme Home Makeover! Granicrete is also used for the following applications: Raised Backsplashes, Bathroom Counters, Shower Panels, Bar Tops. Garage Floors, Patios, Driveways.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611579,"ranking":7,"query_text":"what is granicrete","passage_text":"Granicrete Countertops is one of the hottest trends in the home improvement industry. Granicrete is used to design and build your custom counter top to match your decor and personality. You can have complete control of your new look. If you choose, you can see several custom samples before your countertop is installed. Some of the many advantages of Granicrete are: 1  Easy to clean. 2  Custom and beautiful design let your imagination get the look you desire. 3  Non porous â\u0080\u0093 Food safe â\u0080\u0093 Simple to clean and resists staining (USDA certified)  No more unsightly seams â\u0080\u0093 Every top we install is completely 100% seamless.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611578,"ranking":8,"query_text":"what is granicrete","passage_text":"I had Granicrete put on my countertops about 5 years ago. The coloration is great, but the product is not what it appears. The overlay of this product around my sink is pulling away from the formica underneath it. The edges in some places is so rough you could actually scrape you skin on it.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611581,"ranking":9,"query_text":"what is granicrete","passage_text":"We had Granicrete installed in our kitchen about 2 1\/2 years ago . It is the worst thing we could have ever done!! $ 2400.00 and it is crumbling around the edges, I have had to use a magic marker to fill where the edges have fallen off.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7611576,"ranking":10,"query_text":"what is granicrete","passage_text":"4\/2014 We had 950 feet of our patio covered in this product. Granicrete! We spent $5,350 to have it done. Within a year, it started cracking and chipping off in certain places. Since then, I have been calling the business to have them come and fix it. I don't hear back and they don't show up. Each year it gets worse.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":3058085,"ranking":11,"query_text":"what is granicrete","passage_text":"What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your favorite. What's your, what's your, what's your, what's your, what's your.","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":2737045,"ranking":12,"query_text":"what is granicrete","passage_text":"whats good; whats gooday [whats good] B; What's good boys? whats good family? what's good for the geese? whats good in the hood; What's good mo; What's good nigga; What's good wit chu; what's good with the butt? Whats good wit it; whats goody; What's goodybags? What's Goy? What's Grapes? What's Gravity; What's gravy; whats gravy in the navy; what's growin' long; whats guanin","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":6809641,"ranking":13,"query_text":"what is granicrete","passage_text":"20 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it0 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":1147809,"ranking":14,"query_text":"what is granicrete","passage_text":"what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":1147811,"ranking":15,"query_text":"what is granicrete","passage_text":"what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ... 62. what is: humulin, used for; and what is ...","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":1606419,"ranking":16,"query_text":"what is granicrete","passage_text":"What is the opposite of obtuse? What is the opposite of obtunding? What is the opposite of obtunded? What is the opposite of obtund? What is the opposite of obtrusively? What is the opposite of obtrusive? What is the opposite of obtuse-angled? What is the opposite of obtusely? What is the opposite of obtuseness? What is the opposite of obtusenesses? What is the opposite of obtuser? What is the opposite of obtusest?","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":1338568,"ranking":17,"query_text":"what is granicrete","passage_text":"What is the singular of of cyclopropaphanes? What is the singular of of cyclopropenes? What is the singular of of cyclopropeniums? What is the singular of of cyclopropenone? What is the singular of of cyclopropyls? What is the singular of of cyclopropylamine? What is the singular of of cyclopsams? What is the singular of of cyclopterids? What is the singular of of cyclopyrrolones? What is the singular of of cycloramas? What is the singular of of cyclorelease?","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":8154817,"ranking":18,"query_text":"what is granicrete","passage_text":"What is the opposite of modification? What is the opposite of modifiably? What is the opposite of modifiable? What is the opposite of modicum? What is the opposite of modica? What is the opposite of modesty? What is the opposite of modifies? What is the opposite of modify? What is the opposite of modifying? What is the opposite of modish? What is the opposite of modishly?","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":1605952,"ranking":19,"query_text":"what is granicrete","passage_text":"What is the opposite of biasedly? What is the opposite of biased? What is the opposite of bias crime? What is the opposite of bias? What is the opposite of biandry? What is the opposite of bi? What is the opposite of biases? What is the opposite of biasing? What is the opposite of biassed? What is the opposite of biasses? What is the opposite of biassing? What is the opposite of bib and tucker?","bm25_label":"high","relevance_label":0.0},{"query_id":752473,"passage_id":7211423,"ranking":20,"query_text":"what is granicrete","passage_text":"What is the opposite of aisle? What is the opposite of airy hope? What is the opposite of airy-fairy? What is the opposite of airy? What is the opposite of airworthy? What is the opposite of airworthiness? What is the opposite of ajar? What is the opposite of AJAX? What is the opposite of AKA? What is the opposite of aken? What is the opposite of akimbo? What is the opposite of akin?","bm25_label":"high","relevance_label":0.0}]