[{"query_id":753479,"passage_id":7435841,"ranking":1,"query_text":"what is hand dancing","passage_text":"WHAT IS HAND DANCE\/DANCING\/DANCER? In Washington, D.C., HAND DANCE was performed in the black and white communities in the 1950s to, mostly, Motown music. The dance has always been and still is danced by all races, cultures, genders, and ages of people. Hand dance is the official dance of the District of Columbia.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":4499786,"ranking":2,"query_text":"what is hand dancing","passage_text":"Think about it when you touch me there. Close my eyes, here you are. All alone dancing in the dark. Tell me baby if it's wrong. To let my hands do what they want. Late at night I pretend we are. Dance, dance, da-dance dancing in the dark. Dancing in the dark, ooh la la, ooh la la, ooh la la dancing in the dark.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":7435833,"ranking":3,"query_text":"what is hand dancing","passage_text":"Hand dancing. Not to be confused with Hand jive. Hand dancing, also known as D.C. hand dancing or D.C. swing, is a form of swing dance that can be traced as far back as the 1920s, from Lindy Hop, to Jitterbug and to the 50s when Washington, D.C. developed its own version and named it Hand Dance.","bm25_label":"high","relevance_label":1.0},{"query_id":753479,"passage_id":8800096,"ranking":4,"query_text":"what is hand dancing","passage_text":"Everybody dance, do-do-do. Clap your hands, clap your hands. Everybody dance, do-do-do. Clap your hands, clap you hands. Everybody dance, do-do-do. Clap your hands, clap your hands. Everybody dance, do-do-do. Clap your hands, clap your hands. Music never lets you down. Puts a smile on your face. Any time, anyplace. Dancing helps relieve the pain.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":7435839,"ranking":5,"query_text":"what is hand dancing","passage_text":"I initiated and taught, with the help of some of my peers, a social hand dance class from 2003-2007 in my community in Hyattsville, Maryland. Hand dance\/dancing\/dancer is a partnership (male\/female) style dance distinguished by the motions of the male's hand and received by the female's hand to follow his lead.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":7435840,"ranking":6,"query_text":"what is hand dancing","passage_text":"The National Hand Dance Association is sponsoring a workshop So You Want To Be A Hand Dance DJ. This FREE workshop is the beginning of introducing new and younger DJs in playing hand dance music which would appeal to a younger generation of hand dancers. This is a hands-on session with professional DJ equipment.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":7435838,"ranking":7,"query_text":"what is hand dancing","passage_text":"The National Hand Dance Association (NHDA) works to continue the 50 year legacy of Hand Dance.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":6661584,"ranking":8,"query_text":"what is hand dancing","passage_text":"Hand dancing in Washington DC,s metro area. Three popular dances from the 60,s by some that were teenagers at the time. The Slop, The Birdland and Hand Dancing.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":850144,"ranking":9,"query_text":"what is hand dancing","passage_text":"Allow me to retort. 98% of the world has no idea what their daughters are doing at a homecoming dance. Iâ\u0080\u0099ve observed it first hand, and Iâ\u0080\u0099ve asked kids around the country. The report is always the same. Parents have no idea whatâ\u0080\u0099s going on in the darkened gymnasiums of school dances.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":4510928,"ranking":10,"query_text":"what is hand dancing","passage_text":"Each cycle of the dance ends with a 90 degree rotation of the body, and the dance is then repeated. In 1996, many believe a world record for group dancing was set, when a crowd of 50,000 people danced the Macarena in Yankee Stadium in New York. The dance became a staple at weddings, high-school dances, and sporting events. To perform the dance, there are eight basic steps to learn. 1  The dance is performed in time with the chorus portion of the song, and is as follows: 2  Put Right hand out straight, palm down. Repeat with left hand. 3  Turn right palm up, repeat on left side. 4  Place right hand on left shoulder or arm, repeat with left hand on right.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":7435834,"ranking":11,"query_text":"what is hand dancing","passage_text":"In the early 1990â\u0080\u0099s, the dance was coined â\u0080\u009cHand Danceâ\u0080\u009c. In 1993, 2001, and 2011 Hand Dance was included in The Smithsonian Institutionâ\u0080\u0099s Folk Life Festival on the National Mall in Washington, DC. Hand Dance is recognized as a traditional folk form and national treasure by Americaâ\u0080\u0099s historical institution.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":48923,"ranking":12,"query_text":"what is hand dancing","passage_text":"Santana and Brittany sit next to each other during Glee Club practice. Santana has her hand at Brittany's stomach during this scene, and as they leave the choir room they link pinkies. They dance together with the other Cheerios during Mercedes and Kurt's performance of 4 Minutes, pairing up for a couple dance moves.antana approaches her, asking her what this is all about. Brittany tells her that this is her sole creative outlet now and Santana says that's not what Brittany really loves to do, that she loves to dance. Then Santana tries to help her and suggests a dance performance for Glee club, but Brittany refuses.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":3466100,"ranking":13,"query_text":"what is hand dancing","passage_text":"About. Tutting is a style of hip hop dance that involves popping oneâ\u0080\u0099s hands and arms at perpendicular angles in sync to the beat. The dance can be traced back to the 1970s, but it found increased popularity in late 2013 through â\u0080\u009chand tuttingâ\u0080\u009d videos on Vine.bout. Tutting is a style of hip hop dance that involves popping oneâ\u0080\u0099s hands and arms at perpendicular angles in sync to the beat. The dance can be traced back to the 1970s, but it found increased popularity in late 2013 through â\u0080\u009chand tuttingâ\u0080\u009d videos on Vine.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":190089,"ranking":14,"query_text":"what is hand dancing","passage_text":"I have a great dance, for you to see. Well, tell us now, Henry, what we all should do. Tell us now, Henry, we want to dance like you. Clap your hands, above your head, and you sway, from side to side. Start to bob, up and down, now let's spin, around and round.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":3216992,"ranking":15,"query_text":"what is hand dancing","passage_text":"Participatory dance, on the other hand, whether it be a folk dance, a social dance, a group dance such as a line, circle, chain or square dance, or a partner dance such as is common in western Western ballroom dancing, is undertaken primarily for a common purpose, such as social interaction or exercise, of participants rather than onlookers.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":2671897,"ranking":16,"query_text":"what is hand dancing","passage_text":"Dancing On Ice 2018 contestant and Good Morning Britain weatherman Here's what we know about the hunky weather presenter who is now trying his hand at figure skating on telly By Olivia Waring, Showbiz Reporter","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":2786671,"ranking":17,"query_text":"what is hand dancing","passage_text":"Jazz hands. Jazz hands in performance dance is the extension of a performer's hands with palms toward the audience and fingers splayed (this position is also referred to as webbing). It is commonly associated with especially exuberant types of performance such as musicals, cheerleading, show choir, revue, and especially jazz dance shows.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":4975221,"ranking":18,"query_text":"what is hand dancing","passage_text":"Dance, Dance, Dance (keep on dancing; yowsah yowsah yowsah) - 1978 - Chic. Dance For Me (I order you to dance for me, dance to the music) â\u0080\u0093 1989 â\u0080\u0093 Queen Latifah. Dance For You - 2012 - Beyonce. Dance Hall Days (take your baby by the hand, and make her do a high handstand) - 1984 - Wang Chung.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":190090,"ranking":19,"query_text":"what is hand dancing","passage_text":"Henry, (the octopus) The Octopus, (the octopus). I have a great dance, for you to see. Well, tell us now, Henry, what we all should do. Tell us now, Henry, we want to dance like you. Clap your hands, above your head, and you sway, from side to side. Start to bob, up and down, now let's spin, around and round.","bm25_label":"high","relevance_label":0.0},{"query_id":753479,"passage_id":2801555,"ranking":20,"query_text":"what is hand dancing","passage_text":"Well they're are no friends of mine. I say we can dance, we can dance everything out control. We can dance, we can dance we're doing it wall to wall. We can dance, we can dance everybody look at your hands. We can dance, we can dance everybody's takin' the chance.","bm25_label":"high","relevance_label":0.0}]