[{"query_id":765583,"passage_id":7919988,"ranking":1,"query_text":"what is liberty of london fabric","passage_text":"Liberty of London fabric brooch flower brooch Liberty of London fabric brooch Daisy flower brooch purple Liberty of London flower. EmmaFlorenceParis. $13.50 USD. Liberty of London Fabric Beads. whimrose. $15.00 USD. Buttons Liberty of London fabric covered buttons 23mm (Size 36) Set of 5 clothes buttons.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919995,"ranking":2,"query_text":"what is liberty of london fabric","passage_text":"Liberty of London Tana Lawn Apple Turquoise\/Green From the world famous Liberty Of London, this exquisite cotton lawn fabric is finely woven, lightweight and ultra soft.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919992,"ranking":3,"query_text":"what is liberty of london fabric","passage_text":"Made to order: Custom fit shirt in Liberty of London fabric.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919994,"ranking":4,"query_text":"what is liberty of london fabric","passage_text":"Liberty of London fabric fridge magnets. Magnet gift tin of 6. Pick your own colours. Love Liberty on your fridge.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919989,"ranking":5,"query_text":"what is liberty of london fabric","passage_text":"Liberty of London fabric tunic, handmade, suitable for sizes 38 to 43 chest.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919991,"ranking":6,"query_text":"what is liberty of london fabric","passage_text":"Description: From the world famous Liberty Of London, this exquisite cotton lawn fabric is finely woven, light weight and ultra soft. This gorgeous fabric is oh so perfect for flirty blouses, dresses, lingerie, tunics, tops and more.","bm25_label":"high","relevance_label":1.0},{"query_id":765583,"passage_id":7919990,"ranking":7,"query_text":"what is liberty of london fabric","passage_text":"Description: From the world famous Liberty Of London, this exquisite cotton lawn fabric is finely woven, lightweight and ultra soft. This gorgeous fabric is oh so perfect for flirty blouses, dresses, lingerie, tunics, tops and more. Colors include teal blue, purple, ...","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919993,"ranking":8,"query_text":"what is liberty of london fabric","passage_text":"Description: From the world famous Liberty Of London, this exquisite cotton lawn fabric is finely woven, lightweight and ultra soft. This gorgeous fabric is oh so perfect for flirty blouses, dresses, lingerie, tunics, tops and more. Colors include turquoise, blue, teal ...","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919987,"ranking":9,"query_text":"what is liberty of london fabric","passage_text":"These tutorials are just a small sampling of whatâ\u0080\u0099s out there in the wide, wide world of the internet. Here are a few more resources if, like me, you just canâ\u0080\u0099t get enough Liberty: 1  Liberty Love: 25 Projects to Quilt and Sew Featuring Liberty of London Fabrics. 2  The Liberty Book of Home Sewing. 3  Liberty Scrap Challenge (2012) from a cuppa and a catch up. 4  Lots more tutorials here.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":3643788,"ranking":10,"query_text":"what is liberty of london fabric","passage_text":"Incorporate designer looks into any wardrobe with these high-quality fabrics from the top brands in the apparel industry. Find the perfect fabrics for any occasion or season, including premium denim, faux leather, yarn-dyed flannel, velveteen, faux fur, luxurious lace, and more in every color and print imaginable. Shop brands like Robert Kaufman, Liberty of London, Art Gallery, and Birch Organic for your next fashion project.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":7919996,"ranking":11,"query_text":"what is liberty of london fabric","passage_text":"I strolled around and around the fabric and haberdashery section: A brief history of tana lawn as posted on the wall in the Liberty fabric section. And then, of course, I was inspired to sew! So here is a top ten list of some free Liberty fabric sewing tutorials. Of course any of these could be made with other fabrics but, to me, they all stand out and are made special by the Liberty designs. Liberty offer a stunning range of cottons (both quilting weight and tana lawn â\u0080\u0093 their most famous), corduroy, jersey, various home deco weights and crepe de chine.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":3173249,"ranking":12,"query_text":"what is liberty of london fabric","passage_text":"What is Fabrican? Fabrican created and patented instant, Â© sprayable, non-woven Â© Spray-on fabric. Based in London, at the London Bioscience Innovation Centre, Fabrican technology has captured the imagination of designers, industry and the public around the world.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":4130655,"ranking":13,"query_text":"what is liberty of london fabric","passage_text":"The Liberty Bell. The Liberty Bell's inscription conveys a message of liberty which goes beyond the words themselves. An earlier bell for the Pennsylvania State House was cast in London, England, however, it cracked soon after it arrived in Philadelphia.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":6100392,"ranking":14,"query_text":"what is liberty of london fabric","passage_text":"The Liberty Bell is the first true replica of the original Liberty Bell in Philadelphia as it was first cast.Libertyâ\u0080\u0099s bell weighs 2,016 pounds and was made at the Whitechapel Foundry in London in 1960.he Liberty Bell is the first true replica of the original Liberty Bell in Philadelphia as it was first cast.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":6100390,"ranking":15,"query_text":"what is liberty of london fabric","passage_text":"Why was the Liberty Bell made or built? The Liberty Bell was ordered in 1751 to commemorate William Penn's 1701 Charter of Privileges, which had been passed 50 years earlier. It was cast in 1752 in London and commis â\u0080¦ sioned as the bell for the Pennsylvania State House (now called Independence Hall).The Liberty Bell represented the freedoms valued by the Pennsylvania colony.t was cast in 1752 in London and commis â\u0080¦ sioned as the bell for the Pennsylvania State House (now called Independence Hall). The Liberty Bell represented the freedoms valued by the Pennsylvania colony.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":2393606,"ranking":16,"query_text":"what is liberty of london fabric","passage_text":"Liberty Bell Facts. The original Liberty Bell was cast in 1752, in London, England. It was hung in the Pennsylvania State House, in Philadelphia, Pennsylvania, United States, which was later renamed Independence Hall.It cracked the first time it was rung and was then recast by local artisans, twice for the same reason.iberty Bell Facts. The original Liberty Bell was cast in 1752, in London, England. It was hung in the Pennsylvania State House, in Philadelphia, Pennsylvania, United States, which was later renamed Independence Hall.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":1189854,"ranking":17,"query_text":"what is liberty of london fabric","passage_text":"Like London Gatwick or London Stansted, the name is something of a creative liberty, since Southend is certainly not in the south end of London - it is located near the seaside town of Southend-on-Sea in Essex, which is some 42 miles (67km) to the east of the city.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":2080233,"ranking":18,"query_text":"what is liberty of london fabric","passage_text":"Like London Gatwick or London Stansted, the name is something of a creative liberty, since Southend is certainly not in the south end of London-it is located near the seaside town of Southend-on-Sea in Essex, which is some 42 miles (67km) to the east of the city.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":5770209,"ranking":19,"query_text":"what is liberty of london fabric","passage_text":"Nathan Stanton, senior, came to Liberty in March, 1796, from Preston, New London county, Connecticut, and settled on the place since owned by Colonel Edward Young, two miles north-west of the village of Liberty.","bm25_label":"high","relevance_label":0.0},{"query_id":765583,"passage_id":3173247,"ranking":20,"query_text":"what is liberty of london fabric","passage_text":"Fabrican is the creator of Â© Spray-on fabric. Fabrican created and patented instant, Â© sprayable, non-woven Â© Spray-on fabric. Based in London, at the London Bioscience Innovation Centre, Fabrican technology has captured the imagination of designers, industry and the public around the world.","bm25_label":"high","relevance_label":0.0}]