[{"query_id":77323,"passage_id":7570852,"ranking":1,"query_text":"can you faint with eyes fixed open","passage_text":"Doctor insights on: Fainting Eyes Open. 1. Last week I fainted with eyes opens , and remembered everything perfectly , and I have been having heart palpitations . Terminology: The terms faint and syncope (a condition you list) imply loss of consciousness - in which case you would not remember everything perfectly. Presumably these are not the best terms for your illness. Heart arrhythmia can cause falling spells without loss of consciousness.","bm25_label":"high","relevance_label":1.0},{"query_id":77323,"passage_id":7570853,"ranking":2,"query_text":"can you faint with eyes fixed open","passage_text":"Can a person faint with their eyes open or was this a seizure? I am a 25-year-old female PhD student. I have previously suffered two seizures, one I was told was typically epileptic but the other was not as I was concious but unable to control my flickering eyes, or to move or speak.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":7570850,"ranking":3,"query_text":"can you faint with eyes fixed open","passage_text":"Can a person faint with their eyes open or was this a seizure? elderflower. I am a 25-year-old female PhD student. I have previously suffered two seizures, one I was told was typically epileptic but the other was not as I was concious but unable to control my flickering eyes, or to move or speak.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":6505802,"ranking":4,"query_text":"can you faint with eyes fixed open","passage_text":"Symptoms include: 1  Severe orthostatic hypotension (low blood pressure upon standing) that persists for weeks to years. 2  Fainting. 3  Constipation. 4  Urinary retention. 5  Fixed and dilated pupils. 6  Dry mouth and eyes.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":196205,"ranking":5,"query_text":"can you faint with eyes fixed open","passage_text":"Dizziness, Dry eyes, Fatigue and Feeling faint. WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms dizziness, dry eyes, fatigue and feeling faint including Middle ear infection, Labyrinthitis, and Dehydration (Children). There are 98 conditions associated with dizziness, dry eyes, fatigue and feeling faint.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":7915785,"ranking":6,"query_text":"can you faint with eyes fixed open","passage_text":"2 doctors weighed in: Can steroid eye drops cause effects of nausea or feeling faint? 2 doctors weighed in. Want a second opinion? The amount of steroid that is absorbed systemically from eyedrops is not going to affect how you feel systemically except in response to how the condition in your eyes is responding to the steroid application. If you have persistent nausea or faintness, then check with your family doctor for further diagnosis.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":307197,"ranking":7,"query_text":"can you faint with eyes fixed open","passage_text":"Terrace is a collection of short stories about how I see myself through the eyes of someone I hold dearly in my heart and the faint line between being selfish and loving someone so much that you can no longer be with them.errace is a collection of short stories about how I see myself through the eyes of someone I hold dearly in my heart and the faint line between being selfish and loving someone so much that you can no longer be with them.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":2401899,"ranking":8,"query_text":"can you faint with eyes fixed open","passage_text":"If people say you often look unhappy, have a blank stare, or do not blink your eyes, talk to your doctor. Dizziness or fainting: Feeling dizzy or fainting on a regular basis can be signs of low blood pressure linked to Parkinsonâ\u0080\u0099s or to PD medications.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":3635303,"ranking":9,"query_text":"can you faint with eyes fixed open","passage_text":"the heart that may cause fainting) or unexplained fainting; and if you have or have ever had glaucoma (an eye disease that can cause vision loss); any type of blockage in the bladder or digestive system; difficulty emptying your bladder or a weak urine stream; myasthenia gravis ...","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":3635298,"ranking":10,"query_text":"can you faint with eyes fixed open","passage_text":"the heart that may cause fainting) or unexplained fainting; and if you have or have ever had glaucoma (an eye disease that can cause vision loss); any type of blockage in the bladder or digestive system; difficulty emptying your bladder or a weak urine stream; myasthenia gravis 1  ... Anterior Prolapse (cystocele).","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":1233412,"ranking":11,"query_text":"can you faint with eyes fixed open","passage_text":"Dizzines, faint spells, intense headache. You will die from cerebral hemorrhaging when your â\u0080\u009cthird eyeâ\u0080\u009d â\u0080\u009copens upâ\u0080\u009d. This is because your â\u0080\u009cthird eyeâ\u0080\u009d no longer is anatomically an eye like it was in our distant ancestors and still is in infant tuateras, but a small, important gland in your brain.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":7469138,"ranking":12,"query_text":"can you faint with eyes fixed open","passage_text":"Many symptoms are associated with eyes rolling back, eye injury, Fainting , and Corneal abrasion. Astigmatism, Glaucoma and Dry Eyes are other problems you may be experiencing. That is why it is important to visit an eye doctor regularly to monitor your eye condition.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":4848482,"ranking":13,"query_text":"can you faint with eyes fixed open","passage_text":"Printed photos. If you've developed your camera film and notice red eyes in pictures, you can still get rid of the dreaded devil eyes.. The easiest way is to use a special red-eye remover pen. You also can scan the photo to your computer and use a photo-editing program to fix red eyes.f you've developed your camera film and notice red eyes in pictures, you can still get rid of the dreaded devil eyes.. The easiest way is to use a special red-eye remover pen. You also can scan the photo to your computer and use a photo-editing program to fix red eyes.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":519948,"ranking":14,"query_text":"can you faint with eyes fixed open","passage_text":"Staring â\u0080\u0094 an open-eyed look of interest or amazement â\u0080\u0094 is most often used as a verb but can also be an adjective. The man asked what you were staring at and his staring eyes seemed to look right through you. The word staring comes from the root word stare, a fixed gaze. Its early meaning was to be rigid, or to stiffen, and later became to look fixedly at.. Staring is often rude, unless the person you are staring at is putting on a performance. Staring at the sun is not a good idea, since it can damage your eyes.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":4815500,"ranking":15,"query_text":"can you faint with eyes fixed open","passage_text":"Intro: Pressing Powdered Pigments and Loose and Mineral Eye Shadows. You can press cosmetic pigments such as MAC or loose powder eye shadows such as NYX or mineral eye shadows. You can also use this method to fix ... Step 1: What you need.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":4673384,"ranking":16,"query_text":"can you faint with eyes fixed open","passage_text":"Dizziness isnâ\u0080\u0099t a disease, but rather a symptom of various disorders. Dizziness is the feeling of being lightheaded, woozy, or unbalanced. It affects the sensory organs, specifically the eyes and ears, so it can sometimes cause fainting. Dizziness isnâ\u0080\u0099t a disease, but rather a symptom of various disorders. Read more. Dizziness is the feeling of being lightheaded, woozy, or unbalanced. It affects the sensory organs, specifically the eyes and ears, so it can sometimes cause fainting. ","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":8053573,"ranking":17,"query_text":"can you faint with eyes fixed open","passage_text":"Dizziness is the feeling of being lightheaded, woozy, or unbalanced. It affects the sensory organs, specifically the eyes and ears, so it can sometimes cause fainting. Dizziness isnâ\u0080\u0099t a disease, but rather a symptom of various disorders. Vertigo... Read More. Dizziness is the feeling of being lightheaded, woozy, or unbalanced. It affects the sensory organs, specifically the eyes and ears, so it can sometimes cause fainting. Dizziness isnâ\u0080\u0099t a disease, but rather a symptom of various disorders. Vertigo and","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":8407643,"ranking":18,"query_text":"can you faint with eyes fixed open","passage_text":"Andromeda is the furthest thing you can see with the naked eye (appearing as a faint smudge in the sky). With a total apparent size of about 4 degrees, or more than 8 times the apparent size of the full moon, it makes an outstanding object for binoculars.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":7618625,"ranking":19,"query_text":"can you faint with eyes fixed open","passage_text":"On the flip side, if you don't eat enough before your workoutâ\u0080\u0094or it's been too long since your last mealâ\u0080\u0094you can expect an energy crash. Blood-sugar levels drop during the first 15 or 20 minutes of a workout, which can lead to tiredness, dizziness, or even fainting. The fix? There are two ways to go, says Pagano.","bm25_label":"high","relevance_label":0.0},{"query_id":77323,"passage_id":7041254,"ranking":20,"query_text":"can you faint with eyes fixed open","passage_text":"Here are the indications that death has occurred: 1  No breathing for a prolonged period of time. 2  No heartbeat. 3  Eyes are fixed and slightly open, with enlarged pupils.  Jaw relaxed, with the mouth slightly open.","bm25_label":"high","relevance_label":0.0}]