[{"query_id":775138,"passage_id":3244290,"ranking":1,"query_text":"what is name of a korean karate uniform?","passage_text":"What is a Tae Kwon Do Uniform called? I think that's an easy question for all Tae Kwon Do practitioners but if you guys don't know the name then you're a shame to this martial art!!! Update: The Official Korean Name please!!! Update 2: And a Gi is for karate, don't forget it. The one for Tae Kwon Do is different in shape and name ;p.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":8629080,"ranking":2,"query_text":"what is name of a korean karate uniform?","passage_text":"A Karate uniform is called a Karategi (Gi), while a Judo uniform  is called a Judogi. Karate uniforms are sometimes worn for other  arts as well.    In Korean, it is â\u0080¦called a dobok (ë\u008f\u0084ë³µ). do is art and bok is  a uniform.    Kung Fu uniforms:   The Kung Fu uniform (Mandarin white inset collar with frog buttons)  is referred to as a Hee Fu,Han ZeeFu, Ceong Sam\/Jong Sahm in  Mandarin.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":7955765,"ranking":3,"query_text":"what is name of a korean karate uniform?","passage_text":"Husband, father of three boys, Taekwondo Grandmaster Candidate, & school owner. A Karate uniform is called a Karategi (Gi), while a Judo uniform is called a Judogi. Karate uniforms are sometimes worn for other arts as well. In Korean, it is called a dobok (ë\u008f\u0084ë³µ). do is art and bok is a uniform. Kung Fu uniforms: The Kung Fu uniform (Mandarin white inset collar with frog buttons) is referred to as a Hee Fu,Han ZeeFu, Ceong Sam\/Jong Sahm in Mandarin.","bm25_label":"high","relevance_label":1.0},{"query_id":775138,"passage_id":7955773,"ranking":4,"query_text":"what is name of a korean karate uniform?","passage_text":"Kataaro custom martial arts belts are hand-made and embroidered in the USA. Every rank belt, black belt and master belt is stitched with superior craftsmanship. Belts and uniforms are available for many martial arts disciplines, including Karate, Judo, Jujitsu (BJJ), Tang Soo Do, and Taekwondo. A Kataaro embroidered belt or uniform is the preferred choice. Kataaro offers exceptional custom embroidery, with translations available in Japanese, Chinese and Korean. Names and logos can be embroidered on martial arts belts as well as uniforms and apparel.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":8159523,"ranking":5,"query_text":"what is name of a korean karate uniform?","passage_text":"What is Olympic sparring? It is tae kwon do. Tae kwon do is a Korean art of self-defense; a style of karate.... What is field spar? Field Spar is a street name in Manor, TX 78653. You may be confusing it with the... See All Questions","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":3254617,"ranking":6,"query_text":"what is name of a korean karate uniform?","passage_text":"Quick Answer. A karate uniform is called a karategi or simply gi for short. Karate is a Japanese martial art, and karategi is a Japanese word. The word comes from the traditional name for a judo uniform, which is similar in style. Continue Reading.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":7955766,"ranking":7,"query_text":"what is name of a korean karate uniform?","passage_text":"Korean Karate is basically any Korean martial art that uses the hand in feet. Karate is just simply a category of martial arts, kind of like Kung Fu. Korean martial arts may get the title Karate due to the Japanese occupation. ^_^ Hope that helps.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":7955770,"ranking":8,"query_text":"what is name of a korean karate uniform?","passage_text":"Superior ProForceÂ® karate gis & uniforms in 100% cotton or poly\/cotton blend ranging from 5 oz. ultra lightweight karate gis to our extraordinary 14 oz. heavyweight karate uniforms are available in white, black, blue, red and demo team colors. Quality ThunderÂ®, GladiatorÂ® and ProForceÂ® karate belts for the martial artists together with kung fu uniforms, ninja uniforms, AdidasÂ® gis and TokaidoÂ® karate uniforms are available at AWMAÂ®. In addition to our ProForceÂ® Gladiator Â® jiu jitsu uniforms, AWMAÂ® also carries MizunoÂ®, Fuji, Hayabusa and AdidasÂ®.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":4633998,"ranking":9,"query_text":"what is name of a korean karate uniform?","passage_text":"Karategi (ç©ºæ\u0089\u008bç\u009d\u0080 or ç©ºæ\u0089\u008bè¡£) is the formal Japanese name for the traditional uniform used for Karate practice and competition.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":435946,"ranking":10,"query_text":"what is name of a korean karate uniform?","passage_text":"Karate gi. Karategi (ç©ºæ\u0089\u008bç\u009d\u0080 or ç©ºæ\u0089\u008bè¡£) is the formal Japanese name for the traditional uniform used for Karate practice and competition. A karategi is somewhat similar to a judogi (æ\u009f\u0094é\u0081\u0093ç\u009d\u0080 or æ\u009f\u0094é\u0081\u0093è¡£, Judo uniform) as it shares a common origin; however, the material and cut of the uniform is generally much lighter and looser fitting. The heaviest of Karategi are only 0.5 kg (16 oz) compared to some judogi at 1 kg (35 oz).","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":7955769,"ranking":11,"query_text":"what is name of a korean karate uniform?","passage_text":"Korean karate is derived by combining Japanese Karate with the Korean martial arts disciplines. Most of them now refer to themselves as TKD, though some still call it Tang Soo Do. Chuck Norris studied Tang Soo Do in Korea.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":5538496,"ranking":12,"query_text":"what is name of a korean karate uniform?","passage_text":"Comparison between Taekwondo and Karate: Taekwondo. Karate. Short descriptions. Taekwondo is a form of a Korean martial art and a combat sport. Karate is a form of unarmed Japanese martial art developed from fighting methods.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":1821031,"ranking":13,"query_text":"what is name of a korean karate uniform?","passage_text":"Meaning, Origin, Inspirations, and Associations. Have you been wondering what does the name Karat mean? The list below shows the origins of Karat as well as things modernly associated with the name Karat such as celebrities named Karat. the unit of measurement for the proportion of gold in an alloy; 18-karat gold is 75 2.122e-314old; 24-karat gold is pure gold.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":4532835,"ranking":14,"query_text":"what is name of a korean karate uniform?","passage_text":"Masutatsu Å\u008cyama, more commonly known as Mas Oyama, was a karate master who founded Kyokushin Karate, considered the first and most influential style of full contact karate. A Zainichi Korean, he spent most of his life living in Japan and acquired Japanese citizenship in 1964. He was an alumnus of Waseda University.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":5538489,"ranking":15,"query_text":"what is name of a korean karate uniform?","passage_text":"<br \/> <br \/> Some people refer to Taekwondo as Korean Karate but that is only by using Karate as a loose, generic germ for Martial Art. There are actually vast differences in the weight distribution and posture in stances, internal muscular contractions for power, and mostly fighting strategy and tactics.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":3701776,"ranking":16,"query_text":"what is name of a korean karate uniform?","passage_text":"(In most cases, the questioners are adoptees who are attempting retrace their roots.) And usually, the Korean's answer is: unless you know the what Chinese characters were used for your name, the Korean can't really say what your name means. Korean last names are 100% Sino-Korean. That is, all Korean last names have an underlying Chinese character. So the meaning of Korean last names are basically the meaning of the Chinese characters underlying those last names.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":3566913,"ranking":17,"query_text":"what is name of a korean karate uniform?","passage_text":"Best Answer: There are several differences. 1 - Judo and Karate are Japanese martial arts while Tae Kwon Do is Korean. 2 - Judo is primarily grappling, a form a oriental wrestling. Karate and Tae Kwon Do are primarily striking arts using the hands and feet as weapons.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":1535963,"ranking":18,"query_text":"what is name of a korean karate uniform?","passage_text":"(In most cases, the questioners are adoptees who are attempting retrace their roots.) And usually, the Korean's answer is: unless you know the what Chinese characters were used for your name, the Korean can't really say what your name means. Korean last names are 100% Sino-Korean. That is, all Korean last names have an underlying Chinese character. So the meaning of Korean last names are basically the meaning of the Chinese characters underlying those last names. Having said that, here are the ten most common Korean last names, the underlying Chinese characters ...","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":4812912,"ranking":19,"query_text":"what is name of a korean karate uniform?","passage_text":"1 Karate Depot.com sells uniforms for $17 to $50.  Depending on size and thickness of material, Tae Kwon do uniforms cost $17 to $40. Kung Fu uniforms cost $27 to $43, with jackets and pants often sold separately. Judo uniforms cost $30 to $50.","bm25_label":"high","relevance_label":0.0},{"query_id":775138,"passage_id":1535965,"ranking":20,"query_text":"what is name of a korean karate uniform?","passage_text":"What do Korean names mean? Korean last names are passed from a father to his children, but first names are selected by the parents. There are two types of names that a parent can select: Sino-Korean names, and Pure Korean names. Sino means Chinese, so Sino-Korean names are names that come from Chinese characters. This type of name is the most common by far.","bm25_label":"high","relevance_label":0.0}]