[{"query_id":777235,"passage_id":2044941,"ranking":1,"query_text":"what is nondisjunction?","passage_text":"An X-borne dominant mutation as a cause of nondisjunction in mothers of children with Down's syndrome.It causes other diseases too [ Source: http:\/\/www.chacha.com\/question\/what-disease-does-nondisjunction-cause ]. More Answers to  What disease does nondisjunction cause .","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":3341476,"ranking":2,"query_text":"what is nondisjunction?","passage_text":"1. How is nondisjunction defined; what are characteristic features and consequences of nondisjunction. 2. How is nondisjunction classified according to cell cycle phase (meiosis I, meiosis II, mitosis) and location (germ line versus somatic). This distinction could be clarified by a table. Signs and Symptoms. 1.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":2044940,"ranking":3,"query_text":"what is nondisjunction?","passage_text":"http:\/\/www.chacha.com\/question\/what-disease-does-nondisjunction-cause. An X-borne dominant mutation as a cause of nondisjunction in mothers of children with Down's syndrome.It causes other diseases too.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":7158872,"ranking":4,"query_text":"what is nondisjunction?","passage_text":"What is Nondisjunction? Normally when cells divide, the pair of chromosomes are split evenly between the two resulting cells. Nondisjunction is ...more Â» Nondisjunction: Failure of chromosomes to separate during the cell cycle, causing one daughter cell to receive 2 chromosomes and the other daughter cell to receive no chromosomes.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":2262149,"ranking":5,"query_text":"what is nondisjunction?","passage_text":"Klinefelter syndrome is typically caused by what is called nondisjunction, more specifically nondisjunction of the sex chromosomes. The X and Y chromosome are known as sex chromosomes, and their presence or absence determines the gender of the embryo.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":3341474,"ranking":6,"query_text":"what is nondisjunction?","passage_text":"As explained by DevBio, nondisjunction is what happens when a pair of chromosomes do not separate properly during meiosis. According to Indiana University-Purdue University Indianapolis (IUPUI),... As explained by DevBio, nondisjunction is what happens when a pair of chromosomes do not separate properly during meiosis.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":6801508,"ranking":7,"query_text":"what is nondisjunction?","passage_text":"Nondisjunction is the failure of chromosomes to seperate during meiosis. This failure can occur at Anaphase I or Anaphase II and results in trisomy or monosomy gametes. Common diseases taught in conjunction with nondisjunction are Down's Syndrome and Turner's Syndrome. Vocabulary words: meiosis, prophase, metaphase, anaphase, telophase, spindle fibers, sister chromatids, homologous pairs, centromere, centrioles, nondisjunction, trisomy, monosomy. What you need:","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":3341478,"ranking":8,"query_text":"what is nondisjunction?","passage_text":"A: As explained by DevBio, nondisjunction is what happens when a pair of chromosomes do not separate properly during meiosis. According to Indiana University-Purdue University Indianapolis (IUPUI), nondisjunction can occur during either anaphase I or anaphase II of meiosis. Continue Reading","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":752682,"ranking":9,"query_text":"what is nondisjunction?","passage_text":"Down syndrome is typically caused by what is called nondisjunction. Nondisjunction happens when a pair of chromosomes fails to separate during egg (or sperm) formation. When that egg unites with a normal sperm to form an embryo, the embryo ends up with three copies of chromosome 21 instead of the normal two.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":8066180,"ranking":10,"query_text":"what is nondisjunction?","passage_text":"Research More About Nondisjunction. Do I have Nondisjunction? Nondisjunction: Introduction; Treatments for Nondisjunction; More about Nondisjunction. Other Possible Causes of these Symptoms . Click on any of the symptoms below to see a full list of other causes including diseases, medical conditions, toxins, drug interactions, or drug side effect causes of that symptom.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":8066178,"ranking":11,"query_text":"what is nondisjunction?","passage_text":"Research symptoms & diagnosis of Nondisjunction: 1  Overview -- Nondisjunction. 2  Doctors & Specialists. 3  Hidden Causes of Nondisjunction. 4  Other Causes -- causes of these or similar symptoms.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":7905058,"ranking":12,"query_text":"what is nondisjunction?","passage_text":"â\u0080¢ NONDISJUNCTION (noun). The noun NONDISJUNCTION has 1 sense: 1. meiosis in which there is a failure of paired homologous chromosomes to separate; results in an abnormal number of chromosomes in the daughter cells. Familiarity information: NONDISJUNCTION used as a noun is very rare. Dictionary entry details. â\u0080¢ NONDISJUNCTION (noun).","bm25_label":"high","relevance_label":1.0},{"query_id":777235,"passage_id":6987263,"ranking":13,"query_text":"what is nondisjunction?","passage_text":"Topics that you will need to know and comprehend in order to pass the quiz include chromosomal characteristics and occurrences of nondisjunction. Quiz & Worksheet Goals. Use these assessment tools to assess your knowledge of: The proper explanations of nondisjunction Syndromes that lack one chromosome Phases of nondisjunction in meiosis Different types of gametes produced by nondisjunction Skills Practiced. This worksheet and quiz let you practice the following skills: Critical thinking - apply relevant concepts to examine information about nondisjunction in meiosis in a different light Problem solving - use acquired knowledge to solve nondisjunction in meiosis practice problems","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":6361712,"ranking":14,"query_text":"what is nondisjunction?","passage_text":"Video: Nondisjunction in Meiosis: Definition & Examples. Nondisjunction during meiosis produces eggs or sperm cells that don't have the normal number of chromosomes. In this lesson, learn about the process of nondisjunction and problems it can cause in humans.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":3092651,"ranking":15,"query_text":"what is nondisjunction?","passage_text":"Nondisjunction (Genetics) Nondisjunction is the improper segregation of chromosomes during either meiotic or mitotic cell divisions. The result of nondisjunction is dosage imbalance â\u0080\u0093 either one extra or one missing chromosome for some proportion of the resulting cells.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":7270310,"ranking":16,"query_text":"what is nondisjunction?","passage_text":"Definition of Nondisjunction. Failure of proper separation of two homologous chromosomes or the sister chromatids during cell division is termed as nondisjunction. History. Time attests to the discovery of nondisjunction in the spring of 1910 at the hands of Calvin Bridges and Thomas Hunt Morgan.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":7813828,"ranking":17,"query_text":"what is nondisjunction?","passage_text":"Mitotic nondisjunction results in somatic mosaicism, since only daughter cells originating from the cell where the nondisjunction event has occurred will have an abnormal number of chromosomes. Nondisjunction during mitosis can contribute to the development of some forms of cancer, e.g. retinoblastoma (see below). Chromosome nondisjunction in mitosis can be atrributed to the inactivation of topoisomerase II, condensin, or separase.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":3341475,"ranking":18,"query_text":"what is nondisjunction?","passage_text":"Nondisjunction Mutants of the Nematode CAENORHABDITIS ELEGANS. â\u0086\u0092â\u0086\u0092Discusses mutations that increase nondisjunction on the X-chromosome. Fifteen mutations in total were studied and characterized. Mitotic stability of yeast chromosomes: a colony color assay that measures nondisjunction and chromosome loss.","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":1956535,"ranking":19,"query_text":"what is nondisjunction?","passage_text":"What type of chromosomal abnormalities can be detected by using a karyotype? Sex cells with abnormal number of chromosomes due to nondisjunction (usually causes embryos that are not viable) Down Syndrome","bm25_label":"high","relevance_label":0.0},{"query_id":777235,"passage_id":5432451,"ranking":20,"query_text":"what is nondisjunction?","passage_text":"Aneuploidy-Extra or missing chromosomes resulting from nondisjunction. Nondisjunction is the failure of a homologous chromosme pair to separate (become disjunct) during meiosis results in aneuploidy. Nondisjunction can occur in either meiosis I. or meiosis II. (Hoefnagels, pg. 185, fig.","bm25_label":"high","relevance_label":0.0}]