[{"query_id":781877,"passage_id":7946356,"ranking":1,"query_text":"what is pataday drops used for","passage_text":"Conditions that Pataday Eye Drops Can Treat. Pataday eye drops are usually used for the treatment of allergic conjunctivitis. In some cases, it is used to treat people who have allergic rhinitis that affects the eye.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":7946354,"ranking":2,"query_text":"what is pataday drops used for","passage_text":"In which strengths and forms are Patanol and Pataday available? Patanol and Pataday are both ophthalmic solutions (eye drops), but Patanol is available as a 0.1% solution, where Pataday is a 0.2% solution.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":7946357,"ranking":3,"query_text":"what is pataday drops used for","passage_text":"This medication comes in the form of an eyedrop. It is used in each eye just once a day. It does not matter what time of day you use Pataday, but it is best to take it at the same time each day. If you wear contact lenses, you must remove them to use the drops.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":7946353,"ranking":4,"query_text":"what is pataday drops used for","passage_text":"Pataday Dosage. The standard recommended Pataday dosage for the treatment of eye allergy symptoms is one drop in each affected eye once a day. This dose is the same for everyone, regardless of your age or the severity of your symptoms.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8508878,"ranking":5,"query_text":"what is pataday drops used for","passage_text":"Pataday As far as this list is concerned, Pataday is likely the most similar to Patanol, as they are both prescription eye drops that are quite strong when it comes to getting the red out of your eyes, improving itchiness symptoms, leaving the eye moist and healthy, and attacking allergic conjunctivitis.ataday As far as this list is concerned, Pataday is likely the most similar to Patanol, as they are both prescription eye drops that are quite strong when it comes to getting the red out of your eyes, improving itchiness symptoms, leaving the eye moist and healthy, and attacking allergic conjunctivitis.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8508876,"ranking":6,"query_text":"what is pataday drops used for","passage_text":"Went to have it checked out, and since there were really no changes in my vision upon examination, they prescribed me Pataday and a steroid drop to reduce inflammation.That eased the irritation, but the off-white color in the iris remained.ent to have it checked out, and since there were really no changes in my vision upon examination, they prescribed me Pataday and a steroid drop to reduce inflammation.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8508872,"ranking":7,"query_text":"what is pataday drops used for","passage_text":"Preservative free artificial tears, and perhaps a mild allergy drops like pataday and oral flax and fish oil supplements and maybe a short trial of a weak steroid as directed by your ophthalmolgist. Long term, restasis might be a good option also.ent to have it checked out, and since there were really no changes in my vision upon examination, they prescribed me Pataday and a steroid drop to reduce inflammation.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":7946352,"ranking":8,"query_text":"what is pataday drops used for","passage_text":"+ Side Effects. Pataday eye drops are a type of antihistamine that is used to treat redness and itching in the eyes caused by allergies. It is available on prescription and it is not recommended for those who have irritations as a result of wearing contact lenses.","bm25_label":"high","relevance_label":1.0},{"query_id":781877,"passage_id":3976264,"ranking":9,"query_text":"what is pataday drops used for","passage_text":"Alaway: Ophthalmic drops, solution | Bepreve: Ophthalmic drops, solution | Children's Alaway: Ophthalmic drops, solution | Claritin Eye: Ophthalmic drops, solution | Elestat: Ophthalmic drops, solution | Emadine: Ophthalmic drops, solution | Optivar: Ophthalmic drops, solution | Pataday: Ophthalmic drops, solution | Zaditor: Ophthalmic drops, ...","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8508877,"ranking":10,"query_text":"what is pataday drops used for","passage_text":"Patanol\/pataday has been borderline effective for me. Low strength steriod eye drops, e.g. Alrex, (in conjuction with nasal steriod spray) has been much more effective than any antihistamine eye drop\/oral medication combination I've tried.'ve been taking Pataday for 4 days, and my eyes are worse than before-even more red, swollen and itcy! I'm going to look for something different. Thankfully, I was given a sample by my doctor, so didn't have to sell my first born to pay for it.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":3769389,"ranking":11,"query_text":"what is pataday drops used for","passage_text":"Olopatadine hydrochloride is an antihistamine (as well as anticholinergic and mast cell stabilizer), sold as a prescription eye drop manufactured by Alcon in one of three strengths: 0.7% solution or Pazeo in the US, 0.2% solution or Pataday (also called Patanol S in some countries), and 0.1% or Patanol (also called Opatanol in some countries).","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8508869,"ranking":12,"query_text":"what is pataday drops used for","passage_text":"Olopatadine hydrochloride is an antihistamine (as well as anticholinergic and mast cell stabilizer), sold as a prescription eye drop (0.2% solution, Pataday (or Patanol S in some countries), manufactured by Alcon).It is used to treat itching associated with allergic conjunctivitis (eye allergies).lopatadine hydrochloride 0.1% is sold as Patanol (or Opatanol in some countries).","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":3769392,"ranking":13,"query_text":"what is pataday drops used for","passage_text":"The usual dose for Patanol is 1 drop in each affected eye 2 times per day, with 6 to 8 hours between doses. Both Pazeo and Pataday are dosed 1 drop in each eye daily. There is potential for Olopatadine as a treatment modality for steroid rebound (red skin syndrome).","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":5046841,"ranking":14,"query_text":"what is pataday drops used for","passage_text":"Answer: Watery, itchy eyes are usually related to allergic conjunctivitis, although other eye conditions can cause these same symptoms. There are a number of eye drops (e.g. Pataday, Zaditor, Alocril) eye drops can relieve the symptoms of itchy, watery eyes that you describe. Check with your doctor about trying this.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8508873,"ranking":15,"query_text":"what is pataday drops used for","passage_text":"You may need to stop wearing your contacts and have your Eye MD try a short course of a safer steroid such as lotemax to clear it up. If you are female make up allergy or cosmetic allergy is also common. Read More. I'm not a big fan of optivar, like patenol or pataday the best.You could take a 2 week course of steroid drops as well to get started. You shouldn't be getting much protein buildup with the disposable lens-just soak them every night in a solution that disinfects and cleans.ent to have it checked out, and since there were really no changes in my vision upon examination, they prescribed me Pataday and a steroid drop to reduce inflammation.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":3976261,"ranking":16,"query_text":"what is pataday drops used for","passage_text":"While there are many different causes of bilateral conjuncitivits such as atopic and vernal, allergic is the most common type encompassing 80-90% of all types. Many prescription strength anti-allergy ophthalmic drops are available and include Bepreve (ISTA), Lastacaft (Allergan), and Patanol\/Pataday (Alcon).","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8508874,"ranking":17,"query_text":"what is pataday drops used for","passage_text":"Click here for full prescribing information. PATADAY Â® Solution is for topical ocular use only and should not be injected or swallowed. To prevent contamination of the dropper tip and solution, avoid touching the dropper tip to your eyelids or the surrounding areas with the dropper tip of the bottle.Keep the bottle tightly closed when it is not in use.Talk to your eye care professional about using PATADAY Â® Solution with contact lenses.he two most common side effects reported with the use of PATADAY Â® Solution are cold-like symptoms and pharyngitis (sore throat). About 10% of patients experience one of these conditions. You are encouraged to report negative side effects of prescription drugs to FDA.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":8747436,"ranking":18,"query_text":"what is pataday drops used for","passage_text":"What are the possible side effects of olopatadine ophthalmic (Pataday)? Get emergency medical help if you have any of these signs of an allergic reaction: hives; difficulty breathing; swelling of your face, lips, tongue, or throat.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":3769397,"ranking":19,"query_text":"what is pataday drops used for","passage_text":"olopatadine - ophthalmic solution, Pataday, Patanol. The display and use of drug information on this site is subject to express terms of use. By continuing to view the drug information, you agree to abide by such terms of use.","bm25_label":"high","relevance_label":0.0},{"query_id":781877,"passage_id":3769393,"ranking":20,"query_text":"what is pataday drops used for","passage_text":"What are the possible side effects of olopatadine ophthalmic (Pataday, Patanol)? Get emergency medical help if you have any of these signs of an allergic reaction: hives; difficulty breathing; swelling of your face, lips, tongue, or throat.","bm25_label":"high","relevance_label":0.0}]