[{"query_id":785176,"passage_id":5557295,"ranking":1,"query_text":"what is polydextrose made from","passage_text":"It can appear in product ingredient lists as soluble corn fiber, corn syrup, or corn syrup solids.3. Polydextrose. Polydextrose is a polysaccharide thatâ\u0080\u0099s synthesized from glucose and sorbitol, a sugar alcohol made from corn syrup but also found in apples, pears, peaches, and prunes.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":3936350,"ranking":2,"query_text":"what is polydextrose made from","passage_text":"Synthesized from dextrose, sorbitol and citric acid, polydextrose is used in a wide range of commercial food products for a variety of purposes. Used as a humectant, polydextrose helps keep foods moist.As a stabilizer, thickener or bulking agent, it helps keep flavor and texture uniform in packaged foods.ynthesized from dextrose, sorbitol and citric acid, polydextrose is used in a wide range of commercial food products for a variety of purposes. Used as a humectant, polydextrose helps keep foods moist.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":3936351,"ranking":3,"query_text":"what is polydextrose made from","passage_text":"Side Effects. Polydextrose is generally well tolerated in those who use it in moderation. However, in large quantities or in particularly sensitive people, polydextrose can cause a variety of side effects, including abdominal cramping, bloating and excessive gas.ynthesized from dextrose, sorbitol and citric acid, polydextrose is used in a wide range of commercial food products for a variety of purposes. Used as a humectant, polydextrose helps keep foods moist.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":3936348,"ranking":4,"query_text":"what is polydextrose made from","passage_text":"The fiber in Cocoa Pebbles comes from a little-known ingredient called polydextrose, which is synthesized from glucose and sorbitol, a low-calorie carbohydrate.unctional refers to both the synthetic variety like polydextrose as well as naturally occurring inulin, which is extracted and purified from chicory roots. Polydextrose shares with dietary fiber one fundamental property: It seems to rev up your GI tract.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":3936345,"ranking":5,"query_text":"what is polydextrose made from","passage_text":"As a sugar substitute that is derived from dextrose, polydextrose is a food ingredient that can be used as a low calorie substitute in many recipes.s a sugar substitute that is derived from dextrose, polydextrose is a food ingredient that can be used as a low calorie substitute in many recipes.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886009,"ranking":6,"query_text":"what is polydextrose made from","passage_text":"Functional refers to both the synthetic variety like polydextrose as well as naturally occurring inulin, which is extracted and purified from chicory roots. Polydextrose shares with dietary fiber one fundamental property: It seems to rev up your GI tract.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886007,"ranking":7,"query_text":"what is polydextrose made from","passage_text":"The FDA allows polydextrose to be labeled as a dietary fiber, just the same as whole oats. The same polydextrose products in Canada, which has tighter classification regulations, wouldn't show the fiber content because Health Canada doesn't consider polydextrose to be a dietary fiber.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":3936349,"ranking":8,"query_text":"what is polydextrose made from","passage_text":"A review of the studies of the safety of polydextrose in food. Burdock GA(1), Flamm WG. Author information: (1)Burdock & Associates, Vero Beach, FL 32963, USA. Polydextrose (CAS no. 68424-04-4) is a water-soluble polymer of glucose that provides to foods the bulk and texture of sucrose.There are two main forms of polydextrose, an acidic form (PD-A) and a neutralized potassium salt (PD-N). review of the studies of the safety of polydextrose in food. Burdock GA(1), Flamm WG. Author information: (1)Burdock & Associates, Vero Beach, FL 32963, USA. Polydextrose (CAS no. 68424-04-4) is a water-soluble polymer of glucose that provides to foods the bulk and texture of sucrose.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886008,"ranking":9,"query_text":"what is polydextrose made from","passage_text":"Polydextrose is a soluble non-viscous manmade polymer that is only partially fermented by the gut microbiota. An important factor drawing the attention of food manufactures to the use of polydextrose in various applications is its simplicity.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":8290764,"ranking":10,"query_text":"what is polydextrose made from","passage_text":"Several manufacturers of low-carb products, including Atkins Nutritionals, Keto, and Biochem, say that carb counters should count only what they call net carbs or net impact carbs. Their definition of these terms is total carbohydrates less fiber, glycerin(e), the sugar alcohols, and polydextrose. They say that glycerin(e), the sugar alcohols, and polydextrose have â\u0080\u009ca negligible effect on blood glucoseâ\u0080\u009d or â\u0080\u009ca minimal impact on blood sugar.â\u0080\u009d. This is a fairly new development.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886003,"ranking":11,"query_text":"what is polydextrose made from","passage_text":"The fiber trend is different and more worrisome. The benefits of fiber nutrients like polydextrose are questionable. The makers of Cocoa Pebbles admitted as much when asked about the use and promotion of polydextrose as a dietary fiber.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886011,"ranking":12,"query_text":"what is polydextrose made from","passage_text":"The fiber in Cocoa Pebbles comes from a little-known ingredient called polydextrose, which is synthesized from glucose and sorbitol, a low-calorie carbohydrate.","bm25_label":"high","relevance_label":1.0},{"query_id":785176,"passage_id":3936346,"ranking":13,"query_text":"what is polydextrose made from","passage_text":"However, polydextrose is commonly used in food as a replacement for sugar, starch, and fat, resulting in a low calorie alternative. Foods that may contain polydextrose include cakes, dessert mixes, sweetes, breakfast cereals, puddings, and more.olydextrose is a tasteless synthetic form of soluble dietary fibre that is synthesised by combining glucose (AKA dextrose) molecules together with a little bit of sorbitol and citric acid.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886010,"ranking":14,"query_text":"what is polydextrose made from","passage_text":"High solubility, clarity and rheological properties similar to sucrose make polydextrose versatile enough to add a desirable texture to a variety of liquids, including dairy drinks and yogurts, sauces and dressings, while reducing calories from fat or sugar.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":3936347,"ranking":15,"query_text":"what is polydextrose made from","passage_text":"It is also used as a humectant, stabiliser, and thickening agent. Polydextrose is a form of soluble fiber and has shown healthful prebiotic benefits when tested in animals. It contains only 1 kcal per gram and, therefore, is able to help reduce calories. However, polydextrose is not universally well tolerated.t is frequently used to increase the non-dietary fiber content of food, to replace sugar, and to reduce calories and fat content. It is a multi-purpose food ingredient synthesized from dextrose (glucose), plus about 10 percent sorbitol and 1 percent citric acid. Its E number is E1200. The FDA approved it in 1981.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886006,"ranking":16,"query_text":"what is polydextrose made from","passage_text":"Polydextrose is one of several newfangled fiber additives (including inulin and maltodextrin) showing up in dairy and baked-goods products that previously had little to no fiber.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":1239032,"ranking":17,"query_text":"what is polydextrose made from","passage_text":"Inulin is a type of soluble fiber. Soluble fiber absorbs water and slows the rate that food moves through the digestive system. Other types of fiber added to commercial yogurt may include synthetic compounds like polydextrose or maltodextrin and fiber extracted from sorghum, soy hulls or oats.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":8290765,"ranking":18,"query_text":"what is polydextrose made from","passage_text":"Dr. Atkins and the vendors of low-carb products are correct that not only fiber but also glycerin and polydextrose have little or no effect on blood glucose. The story with sugar alcohols, however, is different.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":7886002,"ranking":19,"query_text":"what is polydextrose made from","passage_text":"It's also been a boon to low-carb and sugar-free creations. Commercial polydextrose is available under brand names such as Sta-Lite by Tate & Lyle, Decatur, Ill.; Litesse by Danisco, New Century, Kan., now a division of DuPont Nutrition and Health; and Trimcal from C&H Ingredients, Farington, UK, as well as others.","bm25_label":"high","relevance_label":0.0},{"query_id":785176,"passage_id":1332760,"ranking":20,"query_text":"what is polydextrose made from","passage_text":"Active Ingredients: Magnesium Salicylate Tetrahydrate 580 mg* (NSAID)^ (Pain Reliever). Inactive Ingredients: Hypromellose, Magnesium Stearate, Microcrystalline Cellulose, Polydextrose, Polyethylene Glycol, Stearic Acid, Titanium Dioxide, Triacetin.","bm25_label":"high","relevance_label":0.0}]