[{"query_id":788851,"passage_id":7774973,"ranking":1,"query_text":"what is qualfon","passage_text":"Glassdoor has 117 Qualfon reviews submitted anonymously by Qualfon employees. Read employee reviews and ratings on Glassdoor to decide if Qualfon is right for you.","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774977,"ranking":2,"query_text":"what is qualfon","passage_text":"About Qualfon. What We Do. Qualfon is a global provider of contact center, back-office, and business process outsourcing (BPO) services. We offer a full suite of customer lifecycle services including sales, customer care, technical support, and retention programs, and we are experienced at operating large client programs across multiple geographies.","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774976,"ranking":3,"query_text":"what is qualfon","passage_text":"Qualfon Overview. Qualfon is a mission-driven business process outsourcing (BPO) company and a global provider of contact center services and back-office processing. With experienced BPO leadership and a strong track record of business growth dating back to our founding in 1995, Qualfon helps ...","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774974,"ranking":4,"query_text":"what is qualfon","passage_text":"Qualfon, Inc. is a global provider of call center, back office, and business process outsourcing (BPO) services. Founded in 1995, Qualfon provides outsourcing services including call centers, customer service, customer acquisition and retention, customer on-boarding, as well as back-office processing. The company is privately held. Qualfon operates in the Philippines, Guyana, Mexico, the United States, and China.","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774979,"ranking":5,"query_text":"what is qualfon","passage_text":"JOIN OUR TALENT NETWORK. Your Qualfon career starts right here. Qualfon is growing and we are seeking individuals that are looking to grow with us. Our foundation is our people and they are the primary reason we existâ\u0080¦ to create opportunity.","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774981,"ranking":6,"query_text":"what is qualfon","passage_text":"Qualfon was founded in 1996 initially providing IVR, billing, SMS, BPO and call centers. It has recently expanded to the Philippines, US and Europe. Qualfon is a business process and contact center outsourcing provider with call centers across the globe. Their clients include:","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774980,"ranking":7,"query_text":"what is qualfon","passage_text":"BPO provider Qualfon has opened its largest campus in the Guyanese capital of Georgetown. Spread across a 10-acre plot in East Bank Demerara, the campus is expected to grow to accomodate over 6,000 workers over the next five years. Qualfon first arrived in Guyana ten years ago. This is Qualfonâ\u0080\u0099s third contact center in the Georgetown area.","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774975,"ranking":8,"query_text":"what is qualfon","passage_text":"Why Qualfon? Qualfonâ\u0080\u0099s agent retention is often twice the industry average, which provides you more value with better quality at a lower price. The secret to our highly tenured and engaged workforce is simple: we focus on what matters to our people. We invest in our people and, in return, they take better care of your customers.","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7774972,"ranking":9,"query_text":"what is qualfon","passage_text":"Qualfon is a global provider of contact center, back-office, and business process outsourcing (BPO) services. We offer a full suite of solutions and intelligent outsourcing locations in the U.S. and across the globe.","bm25_label":"high","relevance_label":1.0},{"query_id":788851,"passage_id":3058085,"ranking":10,"query_text":"what is qualfon","passage_text":"What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your, what's your favourite. What's your, what's your, what's your favorite. What's your, what's your, what's your, what's your, what's your.","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":2737045,"ranking":11,"query_text":"what is qualfon","passage_text":"whats good; whats gooday [whats good] B; What's good boys? whats good family? what's good for the geese? whats good in the hood; What's good mo; What's good nigga; What's good wit chu; what's good with the butt? Whats good wit it; whats goody; What's goodybags? What's Goy? What's Grapes? What's Gravity; What's gravy; whats gravy in the navy; what's growin' long; whats guanin","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":6809641,"ranking":12,"query_text":"what is qualfon","passage_text":"20 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it0 words related to what it do whats up what s up what it is what up whats good hello wassup sup hi what s good hey whats crackin bay area how are you whats going on whats poppin c town holla hyphy what is it","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":1147809,"ranking":13,"query_text":"what is qualfon","passage_text":"what is: tagamet, used for; and what is ... 58. what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ...","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":1147811,"ranking":14,"query_text":"what is qualfon","passage_text":"what is: zantac, used for; and what is ... 59. what is: pepcid, used for; and what is ... 60. what is: bi-citra, used for; and what ... 61. what is: glucagon, used for; and what ... 62. what is: humulin, used for; and what is ...","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":1606419,"ranking":15,"query_text":"what is qualfon","passage_text":"What is the opposite of obtuse? What is the opposite of obtunding? What is the opposite of obtunded? What is the opposite of obtund? What is the opposite of obtrusively? What is the opposite of obtrusive? What is the opposite of obtuse-angled? What is the opposite of obtusely? What is the opposite of obtuseness? What is the opposite of obtusenesses? What is the opposite of obtuser? What is the opposite of obtusest?","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":1338568,"ranking":16,"query_text":"what is qualfon","passage_text":"What is the singular of of cyclopropaphanes? What is the singular of of cyclopropenes? What is the singular of of cyclopropeniums? What is the singular of of cyclopropenone? What is the singular of of cyclopropyls? What is the singular of of cyclopropylamine? What is the singular of of cyclopsams? What is the singular of of cyclopterids? What is the singular of of cyclopyrrolones? What is the singular of of cycloramas? What is the singular of of cyclorelease?","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":8154817,"ranking":17,"query_text":"what is qualfon","passage_text":"What is the opposite of modification? What is the opposite of modifiably? What is the opposite of modifiable? What is the opposite of modicum? What is the opposite of modica? What is the opposite of modesty? What is the opposite of modifies? What is the opposite of modify? What is the opposite of modifying? What is the opposite of modish? What is the opposite of modishly?","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":1605952,"ranking":18,"query_text":"what is qualfon","passage_text":"What is the opposite of biasedly? What is the opposite of biased? What is the opposite of bias crime? What is the opposite of bias? What is the opposite of biandry? What is the opposite of bi? What is the opposite of biases? What is the opposite of biasing? What is the opposite of biassed? What is the opposite of biasses? What is the opposite of biassing? What is the opposite of bib and tucker?","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":7211423,"ranking":19,"query_text":"what is qualfon","passage_text":"What is the opposite of aisle? What is the opposite of airy hope? What is the opposite of airy-fairy? What is the opposite of airy? What is the opposite of airworthy? What is the opposite of airworthiness? What is the opposite of ajar? What is the opposite of AJAX? What is the opposite of AKA? What is the opposite of aken? What is the opposite of akimbo? What is the opposite of akin?","bm25_label":"high","relevance_label":0.0},{"query_id":788851,"passage_id":8114700,"ranking":20,"query_text":"what is qualfon","passage_text":"What is the plural of of decorum? What is the plural of of decose? What is the plural of of decoside? What is the plural of of decoupage? What is the plural of of decoupler? What is the plural of of decoupling? What is the plural of of decoy duck? What is the plural of of decoy-duck? What is the plural of of decoyer? What is the plural of of decoyinine? What is the plural of of decoyman? What is the plural of of decrease?","bm25_label":"high","relevance_label":0.0}]