[{"query_id":789439,"passage_id":4806075,"ranking":1,"query_text":"what is rally in agile","passage_text":"How Rally's suite addresses Agile issues and more. On August 7, 2008, I spoke with Richard Leavitt, the VP of Product Marketing for Rally Software. Rally makes software that manages the development of projects in Agile environments.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":7729118,"ranking":2,"query_text":"what is rally in agile","passage_text":"A collection of articles that takes you from defining technology needs to purchasing options. Rally Software the go-to ALM tool for Agile developers. Rally Software gives Agile developers an ALM tool that, along with customizable dashboards, offers SAFe training and certification.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4561010,"ranking":3,"query_text":"what is rally in agile","passage_text":"Companies use Rally to accelerate the pace of innovation, improve productivity and more effectively adapt to rapidly changing customer needs and competitive dynamics. Rally Software is a leading global provider of cloud-based solutions for managing Agile software development. The RallyÂ® Agile application lifecycle management (ALM) platform transforms the way organizations manage the software development lifecyc... (more) Rally Software is a leading global provider of cloud-based solutions for managing Agile software development.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4806074,"ranking":4,"query_text":"what is rally in agile","passage_text":"Rally understands that working with Agile is not easy. This has always been one of my biggest problems with Agile &#8212 it requires a lot of hard work and thought to be successful.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4806067,"ranking":5,"query_text":"what is rally in agile","passage_text":"Rally Software: Agile development for the masses. One of Justin James' biggest problems with Agile development is that it requires a lot of hard work and thought to be successful. Find out how Rally Software's suite addresses these issues and more. By Justin James | in Software Engineer, August 18, 2008, 10:00 PM PST.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4561011,"ranking":6,"query_text":"what is rally in agile","passage_text":"Rally Software, founded in 2001, provides cloud-based solutions for managing Agile software development. Rallyâ\u0080\u0099s offerings include Application Lifecycle Management (ALM) and Project Portfolio Management (PPM) platform and products, Agile consulting services, courses through Agile University, and training courses focused on Agile and Lean practices.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4806076,"ranking":7,"query_text":"what is rally in agile","passage_text":"CA announced plans to acquire Rally Software Development Corp. for $480 million to beef up its Agile and DevOps platforms. The acquisition of Rally is a strategic move that bears out CAâ\u0080\u0099s continuing focus on Agile development and DevOps. The transaction has been unanimously approved by both companiesâ\u0080\u0099 boards of directors, and is expected to close in the second quarter of CAâ\u0080\u0099s fiscal 2016.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4561012,"ranking":8,"query_text":"what is rally in agile","passage_text":"Rally delivers software and services that drive agility. Organizations worldwide use Rally's solutions to navigate evolving market demands, improve performance, and accelerate the pace of innovation to deliver value faster. Rallyâ\u0080\u0099s enterprise-class ... Read more.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":7752805,"ranking":9,"query_text":"what is rally in agile","passage_text":"AKC Rally is the new dog sport that is taking the nation by storm, a successful stepping stone from the AKC Canine Good CitizenÂ® program to the world of obedience or agility. Rally offers both the dogs and handlers an experience that is fun and energizing.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4561019,"ranking":10,"query_text":"what is rally in agile","passage_text":"The RallyÂ® Agile application lifecycle management (ALM) platform transforms the way organizations manage the software development lifecyc... Rally Software is a leading global provider of cloud-based solutions for managing Agile software development. The RallyÂ® Agile application lifecycle management (ALM) platform transforms the way organizations manage the software development lifecyc...","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4806068,"ranking":11,"query_text":"what is rally in agile","passage_text":"Rally Software also provides training and certification for Scaled Agile Framework (SAFe) and Scrum through its Agile University, with workshops at several different locations over the globe. At each stage of the development cycle, users can communicate via email, RSS feeds and chat features.","bm25_label":"high","relevance_label":1.0},{"query_id":789439,"passage_id":1153697,"ranking":12,"query_text":"what is rally in agile","passage_text":"The Whippet dog breed was a poacher's best friend, speedily going after rabbits and other small game. Today the Whippet competes in agility, flyball, lure coursing, rally, and obedience and is a loving therapy dog.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4806072,"ranking":13,"query_text":"what is rally in agile","passage_text":"CA Technologies today announced it has signed a definitive agreement to acquire Rally Software, a provider of Agile development software and services, for approximately $480 million in a move that helps round out CAâ\u0080\u0099s portfolio.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":1153698,"ranking":14,"query_text":"what is rally in agile","passage_text":"Today the Whippet competes in agility, flyball, lure coursing, rally, and obedience and is a loving therapy dog. His unique nature, friendly personality, and stylish look make him a favorite as a family companion as well as in the show ring.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":12278,"ranking":15,"query_text":"what is rally in agile","passage_text":"National Specialty. Superdog A special honor that rewards the capabilities and efforts of the Portuguese Water Dog who competes and accumulates the most overall points in at least three out of six areas of competition: conformation, obedience, agility, rally, tracking, and water.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4255865,"ranking":16,"query_text":"what is rally in agile","passage_text":"This is a sprightly, vigorous dog who excels not only as a companion but also as a therapy dog and competitor in such dog sports as agility, obedience, rally, and tracking. But most of all, he loves to be with his people. Everything Maltese Puppies! See below for complete list of Maltese characteristics!","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":1075105,"ranking":17,"query_text":"what is rally in agile","passage_text":"The AKC Canine Partners program is for anyone who has a dog they want to enter AKC events with. This program allows mixed-breed dogs or dogs ineligible for AKC registration to compete in AKC events such as Obedience, Rally, and Agility. The dogs must be spayed or neutered in order to compete.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":7579536,"ranking":18,"query_text":"what is rally in agile","passage_text":"What is another word for agin? What is another word for agility? What is another word for agilities? What is another word for agilest? What is another word for agiler? What is another word for agileness? What is another word for agings? What is another word for AGIs? What is another word for agita? What is another word for agitable?","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":274550,"ranking":19,"query_text":"what is rally in agile","passage_text":"The Whippet dog breed was a poacher's best friend, speedily going after rabbits and other small game. Today the Whippet competes in agility, flyball, lure coursing, rally, and obedience and is a loving therapy dog.tranger-friendly dogs will greet guests with a wagging tail and a nuzzle; others are shy, indifferent, or even aggressive. However, no matter what the breed, a dog who was exposed to lots of different types, ages, sizes, and shapes of people as a puppy will respond better to strangers as an adult.","bm25_label":"high","relevance_label":0.0},{"query_id":789439,"passage_id":4561013,"ranking":20,"query_text":"what is rally in agile","passage_text":"Run, Don't Walk, to Scale Agile. Rally customers have always been front and center at RallyON conferences - filling the audience and the speaking agenda with their experiences, knowledge, and ideas. But at this year's RallyON 2015 conference, our customers were so engaged they nearly blew up the conference app.","bm25_label":"high","relevance_label":0.0}]