[{"query_id":794160,"passage_id":4889124,"ranking":1,"query_text":"what is school food authorities","passage_text":"Dear Cecil: As a lad I went to the same repressive boarding school that made George Bush what he is today. As a student I believed, as did we all, that the school authorities were mixing potassium nitrate, or saltpeter, into our food to control our sexual appetites.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":4889115,"ranking":2,"query_text":"what is school food authorities","passage_text":"Does saltpeter suppress male ardor? As a lad I went to the same repressive boarding school that made George Bush what he is today. As a student I believed, as did we all, that the school authorities were mixing potassium nitrate, or saltpeter, into our food to control our sexual appetites. (The food itself controlled our regular appetites.) Is this true?","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":2578378,"ranking":3,"query_text":"what is school food authorities","passage_text":"Does saltpeter suppress male ardor? As a lad I went to the same repressive boarding school that made George Bush what he is today. As a student I believed, as did we all, that the school authorities were mixing potassium nitrate, or saltpeter, into our food to control our sexual appetites.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":7836285,"ranking":4,"query_text":"what is school food authorities","passage_text":"Reimbursement payments to finance nonprofit school food service operations shall be made only to school food authorities operating under a written agreement with the State agency.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":7836291,"ranking":5,"query_text":"what is school food authorities","passage_text":"(B) If when evaluating the service of frozen fruit, the school food authority serves products that contain added sugar. (iv) Certification procedures must ensure that no performance-based cash assistance is provided to school food authorities for meals served prior to October 1, 2012.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":4665461,"ranking":6,"query_text":"what is school food authorities","passage_text":"Review of Time Temperature Indicators as Quality Monitors in Food Packaging. 1  School of Printing and Packaging Engineering, Wuhan University, Wuhan, China. Search for more papers by this author. 2  Corresponding author School of Printing and Packaging Engineering, Wuhan University, Wuhan, China.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":4035483,"ranking":7,"query_text":"what is school food authorities","passage_text":"Last Published: 07\/19\/2016. The purpose of this memorandum is to address the need for school food authorities participating in the Food and Nutrition Service National School Lunch Program and School Breakfast Program to institute and clearly communicate a meal charge policy, which would include, if applicable, the availability of alternate meals. File Upload:","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":2336734,"ranking":8,"query_text":"what is school food authorities","passage_text":"HACCP principles or with the USDA guidelines no later than the end of the 2005-2006 School Year. The. Guidance for School Food Authorities: Developing a School Food Safety Program Based on the Process. Approach to HACCP Principles was released by USDA in June 2005, extending implementation to July. 1, 2006. HACCP is a systematic approach to food safety that follows the flow of food through a foodservice. operation to eliminate or reduce the risk of foodborne hazards.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":7836290,"ranking":9,"query_text":"what is school food authorities","passage_text":"(ii) In addition, on a case-by-case basis, State agencies may authorize school food authorities to use other alternatives to the point of service lunch count; provided that such alternatives result in an accurate and reliable lunch count system.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":7562566,"ranking":10,"query_text":"what is school food authorities","passage_text":"This is a comparison between the various Child Nutrition summer feeding programs. The purpose of this comparison chart is to inform and encourage more School Food Authorities (SFAs) to provide meals in the summer and other times when school is not in session.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":7054813,"ranking":11,"query_text":"what is school food authorities","passage_text":"What are the different types of charter schools in Georgia? In Georgia, there are two types of charter schools: start-up charter schools and conversion charter schools. Start-up charter schools are often grouped by their authorizer: locally-approved charter schools and state-chartered special schools.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":7836288,"ranking":12,"query_text":"what is school food authorities","passage_text":"(e) The State agency shall reimburse the school food authority for meal supplements served in eligible schools (as defined in Â§ 210.10(n)(1)) operating afterschool care programs under the NSLP in accordance with the rates established in Â§ 210.4(b).","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":7836283,"ranking":13,"query_text":"what is school food authorities","passage_text":"(ii) Require school food authorities to submit documentation to demonstrate compliance with meal pattern requirements set forth in Â§ 210.10 and Â§ 220.8 or Â§ 220.23, as applicable.","bm25_label":"high","relevance_label":1.0},{"query_id":794160,"passage_id":501130,"ranking":14,"query_text":"what is school food authorities","passage_text":"Rick Weissbourd is a lecturer on education at the Harvard University Graduate School of Education and the Kennedy School of Government; weissbri@gse.harvard.edu. He is the author of The Vulnerable Child: What Really Hurts America's Children and What We Can Do About It (Addison-Wesley, 1996).","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":2165832,"ranking":15,"query_text":"what is school food authorities","passage_text":"The eight qualities of successful school leaders. 1  Author Jeremy Sutcliffe interviewed the UK's best headteachers to find out what makes a good leader. 2  Author Jeremy Sutcliffe interviewed the UK's best headteachers to find out what makes a good leader.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":8413927,"ranking":16,"query_text":"what is school food authorities","passage_text":"Multiple people have been shot in what authorities are calling an active shooter situation at a Parkland, Florida high school.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":242366,"ranking":17,"query_text":"what is school food authorities","passage_text":"South Somerset What is an authors purpose in writing a biography Newcastle upon Tyne Seattle descriptive words for resume writing Sarnia. writing a thesis statement in mla format What is an authors purpose in writing a biography Shrewsbury Otterburn Park write good thesis statement essay Croydon grad school papers format St. Albert my resume agent coupon What is an authors purpose in writing a biography Edinburgh Stafford. chemistry research paper topics Spokane What is an authors purpose in ...","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":1306343,"ranking":18,"query_text":"what is school food authorities","passage_text":"This page provides an EBT food list that is eligible to be purchased with your Iowa EBT card, as well as what you cannot purchase. You can buy these food items at authorized EBT locations that accept food stamps.If you need to check the current balance of your SNAP benefits, Iowa EBT card balance.his page provides an EBT food list that is eligible to be purchased with your Iowa EBT card, as well as what you cannot purchase. You can buy these food items at authorized EBT locations that accept food stamps.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":5004597,"ranking":19,"query_text":"what is school food authorities","passage_text":"Salt is also very common in junk food and is vital to one's health. The opposition states that you shouldn't eat TOO much junk food. BUT, the topic is that school canteens should not sell junk food AT ALL.Also, students can choose what they want.ut, the topic is stating that junk food should not be sold at school no matter what. All students have common sense as their parents have told them that junk food is may be unhealthy. They will not buy too much as they will know when to stop. So it is clear, schools SHOULD sell junk food.","bm25_label":"high","relevance_label":0.0},{"query_id":794160,"passage_id":2263759,"ranking":20,"query_text":"what is school food authorities","passage_text":"Health risks of genetically modified foods. Dona A(1), Arvanitoyannis IS. Author information: (1)Department of Forensic Medicine and Toxicology, University of Athens, Medical School, Athens, Greece.Comment in Crit Rev Food Sci Nutr. 2010 Jan;50(1):85-91; author reply 92-5.As genetically modified (GM) foods are starting to intrude in our diet concerns have been expressed regarding GM food safety. These concerns as well as the limitations of the procedures followed in the evaluation of their safety are presented.omment in Crit Rev Food Sci Nutr. 2010 Jan;50(1):85-91; author reply 92-5. As genetically modified (GM) foods are starting to intrude in our diet concerns have been expressed regarding GM food safety.","bm25_label":"high","relevance_label":0.0}]