[{"query_id":798253,"passage_id":7950528,"ranking":1,"query_text":"what is southwest airlines baggage policy","passage_text":"Southwest Baggage Fees 2017. Related Airlines. About Southwest. Southwest Airlines is known as one of the few airlines with a generous free baggage policy for all passengers. When planning to travel with checked baggage, Southwest is a good option compared to other low-cost airlines, as they allow 2 free checked bags on their flights.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":7950527,"ranking":2,"query_text":"what is southwest airlines baggage policy","passage_text":"New Baggage Policy. This week, Southwest Airlines implemented a new baggage policy. I just wanted to make sure all the Passengers of Southwest Airlines knew about this one. The free baggage allowance for each ticketed Customer will change from three to two bags. The first and second bag you check (up to 50lbs) are FREE.","bm25_label":"high","relevance_label":1.0},{"query_id":798253,"passage_id":1943406,"ranking":3,"query_text":"what is southwest airlines baggage policy","passage_text":"Southwest Airlines is known as one of the few airlines with a generous free baggage policy for all passengers. When planning to travel with checked baggage, Southwest is a good option compared to other low-cost airlines, as they allow 2 free checked bags on their flights.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":3861380,"ranking":4,"query_text":"what is southwest airlines baggage policy","passage_text":"What is Southwest Airlines' (WN) fee for overweight baggage? Southwest Airlines (WN) will charge the following for bags that are greater than the standard 50 pounds or 23 kilograms: 51 to 100 pounds or 24 to 46 kilograms: $75.00 USD extra per bag; Bags exceeding 100 pounds or 46 kilograms will not be accepted as checked baggage \/ hold luggage. What is Southwest Airlines' (WN) fee for oversize baggage? Southwest Airlines (WN) will charge $75.00 USD extra for bags that are from 63 to 115 ...","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":7567378,"ranking":5,"query_text":"what is southwest airlines baggage policy","passage_text":"Southwest Airlines has some of the most liberal baggage policies among U.S. carriers. Besides the airline's refusal to charge fees for the first two checked bags, Southwest also has a policy friendly to parents of small children -- allowing them to bring most of their child-gear without extra charges.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":1723866,"ranking":6,"query_text":"what is southwest airlines baggage policy","passage_text":"Carryon weight limit for southwest airlines? whats the weight limit on for the carry on baggage for southwest airlines..and can u take food&a straightner in a carryon? Source(s): carryon weight limit southwest airlines: https:\/\/knowledge.im\/?s=carryon+weight+limit+southwest+airlines.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":3571875,"ranking":7,"query_text":"what is southwest airlines baggage policy","passage_text":"The only airline with no baggage charge? Southwestâ\u0080\u0094not coincidentally, MONEYâ\u0080\u0099s Best in Travel Awards Platinum winner for Best Airline. As other airlines have begun nickel-and-diming travelers for everything, Southwest has maintained its free checked bags policy.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":8494058,"ranking":8,"query_text":"what is southwest airlines baggage policy","passage_text":"Go to the Southwest Airlines Baggage Service office located in the airport baggage claim area or at the ticket counter to report your delayed bag. The Southwest Airlines Baggage Service Agent will create a report and provide you with a receipt of this report.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":8494060,"ranking":9,"query_text":"what is southwest airlines baggage policy","passage_text":"If your baggage has been lost, damaged, or delayed, you must report this, in person, at the Southwest Airlines Baggage Service Office within four hours of your arrival at your destination. The Southwest Airlines Baggage Service Office is located in the baggage claim area or the ticket counter at the airport.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":7992372,"ranking":10,"query_text":"what is southwest airlines baggage policy","passage_text":"What is Spirit Airlines' (NK) baggage policy? The Spirit Airlines (NK) baggage policy for regular basic fares include the following: Carry-on baggage - Subject to applicable fees. 1 personal item - Fee free; 1 carry-on item - Subject to applicable fees; Checked baggage \/ Hold luggage - Applicable fees per bag increase with number checked beyond 2 bags","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":1895738,"ranking":11,"query_text":"what is southwest airlines baggage policy","passage_text":"Checked baggage. For domestic flights, bag fees vary and range from free to $200. Southwest Airlines is famous for its â\u0080\u009cBags Fly Freeâ\u0080\u009d policy â\u0080\u0093 they allow two bags for no charge. But most airlines charge around $25 for the first bag and $35 for the second bag.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":1943410,"ranking":12,"query_text":"what is southwest airlines baggage policy","passage_text":"Southwest Baggage Fees includes information about 2017 Southwest Carry-on luggage, Checked Baggage, and Excess\/Oversize\/Overweight baggage fees. Find this Pin and more on Places visited\/Travel Info by darkangel927. Carryon Dimensions and baggage requirements Carry-on Dimensions, if you are traveling by Southwest Airlines.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":1778326,"ranking":13,"query_text":"what is southwest airlines baggage policy","passage_text":"What is American Airlines' (AA) baggage policy? The American Airlines (AA) baggage policy for regular basic fares include the following: Carry-on baggage. 1 personal item - Fee free; 1 carry-on item - Fee free; Checked baggage \/ Hold luggage - Applicable fees per bag increase with number checked. Overweight and Oversize bags - Applicable fees per bag depending on weight and size categories.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":1383659,"ranking":14,"query_text":"what is southwest airlines baggage policy","passage_text":"Refer to your travel confirmation to determine which airline's baggage policy applies. When Alaska Airlines baggage policy applies, the rules and fees below are in effect. For complete information about our baggage guidelines, fees, and exceptions, please visit our baggage policy.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":1565526,"ranking":15,"query_text":"what is southwest airlines baggage policy","passage_text":"Contact of Southwest Airlines customer service (phone, address) Contact Southwest Airlines: Find below customer care details of Southwest Airlines, including phone and address. You can reach the below contact for new booking, cancellation, refund, baggage claim, cheap airfares, deals or other queries on Southwest Airlines.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":2711441,"ranking":16,"query_text":"what is southwest airlines baggage policy","passage_text":"What is Delta Airlines' (DL) checked baggage \/ hold luggage policy? Delta Airlines' (DL) standard checked baggage \/ hold luggage policy details follow: 1  2 bags standard, up to 10 bags maximum (up to 4 bags on Delta Connection)  Maximum dimensions: 62 inches or 157 centimeters (length + width + height).","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":4161934,"ranking":17,"query_text":"what is southwest airlines baggage policy","passage_text":"Baggage allowance on connecting flights with other airline companies. We respect the baggage allowance policy that is most suitable for you when you check-in with us. For more information please read the Baggage allowance policy on flights with other airline companies.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":4161938,"ranking":18,"query_text":"what is southwest airlines baggage policy","passage_text":"Baggage allowance on connecting flights with other airline companies We respect the baggage allowance policy that is most suitable for you when you check-in with us. For more information please read the Baggage allowance policy on flights with other airline companies.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":7236369,"ranking":19,"query_text":"what is southwest airlines baggage policy","passage_text":"Related Airlines. 1  Southwest. Luggage Rules 2017. 2  Volaris Airlines. Luggage Fees 2014. 3  VivaAerobus. Luggage Rules 2016. 4  Aerogaviota. Baggage Info 2011. 5  Southwest. Luggage Rules 2017. 6  Volaris Airlines. Luggage Fees 2014. 7  VivaAerobus. Luggage Rules 2016. 8  Aerogaviota. Baggage Info 2011.","bm25_label":"high","relevance_label":0.0},{"query_id":798253,"passage_id":1134756,"ranking":20,"query_text":"what is southwest airlines baggage policy","passage_text":"Contact Southwest Airlines: Find below customer care details of Southwest Airlines, including phone and address. You can reach the below contact for new booking, cancellation, refund, baggage claim, cheap airfares, deals or other queries on Southwest Airlines. Besides contact details the page also offers information and links on Southwest Airlines services.","bm25_label":"high","relevance_label":0.0}]