[{"query_id":801059,"passage_id":7848180,"ranking":1,"query_text":"what is superior and inferior in the body","passage_text":"Superior and inferior. In anatomical terminology superior (from Latin, meaning 'above') is used to refer to what is above something, and inferior (from Latin, meaning 'below') to what is below it. For example, in the anatomical position the most superior part of the human body is the head, and the most inferior is the feet. As a second example, in humans the neck is superior to the chest but inferior to the head.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":7848176,"ranking":2,"query_text":"what is superior and inferior in the body","passage_text":"Superior and inferior In anatomical terminology superior (from Latin, meaning 'above') is used to refer to what is above something, and inferior (from Latin, meaning 'below') to what is below it. For example, in the anatomical position the most superior part of the human body is the head, and the most inferior is the feet. As a second example, in humans the neck is superior to the chest but inferior to the head. Anterior and posterior","bm25_label":"high","relevance_label":1.0},{"query_id":801059,"passage_id":7848179,"ranking":3,"query_text":"what is superior and inferior in the body","passage_text":"Anatomical terms of location - Main terminologies. 1  In anatomical terminology superior (from Latin, meaning 'above') is used to refer to what is above something, and inferior (from Latin, meaning 'below') to what is below it. For example, in the anatomical position the most superior part of the human body is the head, and the most inferior is the feet. As a second example, in humans the neck is superior to the chest but inferior to the head.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":4986615,"ranking":4,"query_text":"what is superior and inferior in the body","passage_text":"In anatomical terminology superior (from Latin, meaning 'above') is used to refer to what is above something, and inferior (from Latin, meaning 'below') to what is below it. For example, in the anatomical position the most superior part of the human body is the head, and the most inferior is the feet.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":3942780,"ranking":5,"query_text":"what is superior and inferior in the body","passage_text":"What is the function of the superior and inferior vena cava? The superior vena cava returns de-oxygenated blood from the head, neck, arm and chest regions of the body to the right atrium. The inferior vena cava returns de-oxygenated blood from the lower body regions (legs, back, abdomen and pelvis) to the right atrium.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":1708628,"ranking":6,"query_text":"what is superior and inferior in the body","passage_text":"The head end of the body is referred to as the superior end (Latin superior : above), while the feet end is the inferior end (Latin inferior : below). An axis formed joining the two is the superior-inferior axis. As with other vertebrate terminology, there are synonymous terms for superior and inferior (Table 3).","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":1690077,"ranking":7,"query_text":"what is superior and inferior in the body","passage_text":"superior Above, higher than, with reference to the upright body. Compare INFERIOR. superior situated above\/directly over\/nearer the head (contrast with inferior) superior,","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":7539001,"ranking":8,"query_text":"what is superior and inferior in the body","passage_text":"Question: What features are located inferior to the cranium, and superior to the mandibular? What features are located inferior to the cranium, and superior to the mandibular? Best answer","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":521956,"ranking":9,"query_text":"what is superior and inferior in the body","passage_text":"compare superior adjective lower or of lower rank an inferior officer compare superior adjective specialized anatomy of the lower surface of a body part specialized medical used to refer to a body part that is below another body part the inferior alveolar artery compare superior adjective","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":7694924,"ranking":10,"query_text":"what is superior and inferior in the body","passage_text":"The terms superior and inferior are used when referring to parts of the body which are toward an end of the body. Superior meaning toward the head and inferior meaning toward the feet. Toward an end does not necessarily mean close to the end. For example, the bowels are inferior to the lungs.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":4290623,"ranking":11,"query_text":"what is superior and inferior in the body","passage_text":"The ischium is made up of three partsâ\u0080\u0093the body, the superior ramus and the inferior ramus. The body contains a prominent spine, which serves as the origin for the superior gemellus muscle. The indentation inferior to the spine is the lesser sciatic notch.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":521952,"ranking":12,"query_text":"what is superior and inferior in the body","passage_text":"compare superior adjective lower or of lower rank an inferior officer compare superior adjective specialized anatomy of the lower surface of a body part specialized medical used to refer to a body part that is below another body part the inferior alveolar artery","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":521953,"ranking":13,"query_text":"what is superior and inferior in the body","passage_text":"compare superior adjective lower or of lower rank an inferior officer compare superior adjective specialized anatomy of the lower surface of a body part specialized medical used to refer to a body part that is below another body part the inferior alveolar artery compare","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":4907180,"ranking":14,"query_text":"what is superior and inferior in the body","passage_text":"Superior and Inferior. The terms superior and inferior are used when referring to parts of the body which are toward an end of the body. Superior meaning toward the head and inferior meaning toward the feet. Toward an end does not necessarily mean close to the end. For example, the bowels are inferior to the lungs. This does not mean that the bowels are close to the feet nor does it mean the converse (that the lungs are close to the head). It simply means that the lungs are closer to the head than the bowels. Cranial and caudal have the same meaning as superior and inferior, respectively, but are used in reference to animal, rather than human, anatomy. Anterior and Posterior. Anterior refers to the side of the body facing up in the standard anatomical position. Posterior refers to the bottom side.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":4066666,"ranking":15,"query_text":"what is superior and inferior in the body","passage_text":"Answers. Best Answer: The superior vena cava and the inferior vena cava both enter the heart at the right atrium. The difference is that-as the name suggests-the superior vena vava carried deoxygenated blood back to the heart from the upper areas of the body (in Latin, superior == above).imilalry, the inferior vena cava carried deoxygenated blood from the lower regions of the body back to the heart (in Latin, 'inferior' == lower).","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":4080230,"ranking":16,"query_text":"what is superior and inferior in the body","passage_text":"The corpora quadrigemina (quadruplet bodies) are four solid lobes on the dorsal side of the cerebral aqueduct, where the superior posterior pair are called the superior colliculi and the inferior posterior pair are called the inferior colliculi.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":1467686,"ranking":17,"query_text":"what is superior and inferior in the body","passage_text":"Figure 1A-F. ). The cerebellum is connected to the brainstem by three cerebellar peduncles: 1) the inferior cerebellar peduncle (restiform body and juxtrarestiform body) 2) the middle cerebellar peduncle (brachium pontis), and 3) the superior peduncle (brachium conjunctivum) (1).he inferior cerebellar peduncle is mainly supplied by the posterior inferior cerebellar artery (PICA). The middle cerebellar peduncle is supplied by the anterior inferior cerebellar artery (AICA) and partly by the superior cerebellar artery (SCA). The superior cerebellar peduncle is mainly supplied by the SCA.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":8148519,"ranking":18,"query_text":"what is superior and inferior in the body","passage_text":"Plane created by an imaginary line that divides the body at any level into superior and inferior portions. Inferior Area that faces away from the head and toward the feet of the body","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":2526353,"ranking":19,"query_text":"what is superior and inferior in the body","passage_text":"The superior vena cava returns blood from the upper body to the heart, and the inferior vena cava returns the blood from the lower part of the body. The superior vena cava is thin-walled, and the blood is under low pressure.It lies near lymph nodes in the chest.he superior vena cava returns blood from the upper body to the heart, and the inferior vena cava returns the blood from the lower part of the body. The superior vena cava is thin-walled, and the blood is under low pressure.","bm25_label":"high","relevance_label":0.0},{"query_id":801059,"passage_id":522160,"ranking":20,"query_text":"what is superior and inferior in the body","passage_text":"The transverse plane (also called the horizontal plane, axial plane, or transaxial plane) is an imaginary plane that divides the body into superior and inferior parts.he transverse plane (also called the horizontal plane, axial plane, or transaxial plane) is an imaginary plane that divides the body into superior and inferior parts.","bm25_label":"high","relevance_label":0.0}]