[{"query_id":81075,"passage_id":5750178,"ranking":1,"query_text":"can you whitewash brick with a color","passage_text":"If you desire an authentic old look, you actually wash off some of the whitewash several hours after application or the next day to expose brick or parts of brick in random areas. The lime in the whitewash is the actual glue that bonds to the brick and the wood on your addition.If you want extra holding power you can actually mix white Portland cement to the whitewash. Do this and the whitewash will last for several generations. If you want to colorize the whitewash, it is possible.hitewash is applied with a brush or a roller but brushes seem to work best. One of the interesting qualities of this material is that you can make your home look like a gracious English cottage. This is achieved by varying the thickness of the whitewash.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":7321334,"ranking":2,"query_text":"can you whitewash brick with a color","passage_text":"Whitewashed brick has variegated color, unlike the uniform color of painted brick. A color wash on brick uses the same general theory as a color wash on walls; the idea is to thin the paint so the base color shows through. On brick, the technique is commonly referred to as â\u0080\u009cwhitewash,â\u0080\u009d typically involving paint and water. Brick can also be stained or painted with a non-diluted base coat and then accented with a sponging technique. Always be sure to clean the brick before adding color.","bm25_label":"high","relevance_label":1.0},{"query_id":81075,"passage_id":3205632,"ranking":3,"query_text":"can you whitewash brick with a color","passage_text":"If you have a truly massive brick fireplace and you are not fond of the color, consider giving it a gentle whitewash to lighten the hue. This can be a good compromise for those who do not want to paint their brick, as it allows some of the texture and color to show through.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":7321331,"ranking":4,"query_text":"can you whitewash brick with a color","passage_text":"After whitewashing all of the bricks that can be painted with a rag, use a dry brush to fill in hard-to reach places. If a spot has too much color, mist it thoroughly and blot up the moisture along with some of the paint. Let the whitewash dry overnight before using the fireplace.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":7321333,"ranking":5,"query_text":"can you whitewash brick with a color","passage_text":"My mom has a dark brick fireplace in her living room that I've always thought was a bit of an eyesore. I've suggested she try whitewashing it, but I'm not sure it would look right. She has tan carpet, tan walls, and cream colored plantation shutters.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":7428195,"ranking":6,"query_text":"can you whitewash brick with a color","passage_text":"Today on Before & After Basics weâ\u0080\u0099ll learn about whitewashing furniture. Whitewashing is a technique that allows you to brighten your wood without hiding the grain pattern. Please know that this can be done with gray, blue or any color of your choosing, but I would recommend a lighter color to ensure the desired finish.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":7647983,"ranking":7,"query_text":"can you whitewash brick with a color","passage_text":"AKA Shi$%ing bricks. How to do a german smear or mortar wash DIY brick whitewash on your brick fireplace or other brick surfaces. This DIY project is inexpensive & easy to do! How To Do a German Smear Mortar Wash on Brick (Dave and Brittanyâ\u0080\u0099s Fixer Upper!)â\u0080¦.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":5975247,"ranking":8,"query_text":"can you whitewash brick with a color","passage_text":"How to Make Whitewash. Two Methods: Outside whitewash Inside whitewash. Whitewash is a low cost paint that you can make at home from lime and chalk (whiting).There are a number of ways to make it, depending on what you have available to you.ow to Make Whitewash. Two Methods: Outside whitewash Inside whitewash. Whitewash is a low cost paint that you can make at home from lime and chalk (whiting).","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":8264283,"ranking":9,"query_text":"can you whitewash brick with a color","passage_text":"If you do not have an extra brick, ask Sherwin Williams for a fan deck and match the brick to a paint color in the fan deck. If you have multi-color bricks and you want your trim color to blend and fade, I recommend choosing the brick color that is the medium shade (not the lightest and not the darkest).If you want to contrast your brick color, choose the darkest or lightest brick color to match.For homes that are not brick and you want your trim to blend in, either go up or down one or two shades of the paint color of the home.rbane Bronze Sherwin Williams. 2) Once you decide if you want your color to blend in or contrast, determine â\u0080\u009croughlyâ\u0080\u009d what shade of color you want. If you have a brick home, you can take one of your bricks to Sherwin Williams and have them color match either your darkest or lightest shade brick.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":5858450,"ranking":10,"query_text":"can you whitewash brick with a color","passage_text":"Rating Newest Oldest. Best Answer: Professionals quote brick by the thousand. An average cost for brick in the midwest is $350 per thousand and can range up to $400 per thousand for standard color pattern brick. They get much higher if you want hand made, special color match.Some brick are harder than others, some more porous.ating Newest Oldest. Best Answer: Professionals quote brick by the thousand. An average cost for brick in the midwest is $350 per thousand and can range up to $400 per thousand for standard color pattern brick. They get much higher if you want hand made, special color match.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":1884130,"ranking":11,"query_text":"can you whitewash brick with a color","passage_text":"3) If you are still having difficulty pinpointing the color that you want, you can use the search feature by typing in your house color on Houzz (red brick, yellow house, tan brick, etc..) and you can see tons of examples of homes painted in your color for all kinds of various trim color inspiration:","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":5858451,"ranking":12,"query_text":"can you whitewash brick with a color","passage_text":"Best Answer: Professionals quote brick by the thousand. An average cost for brick in the midwest is $350 per thousand and can range up to $400 per thousand for standard color pattern brick.They get much higher if you want hand made, special color match.Some brick are harder than others, some more porous.ating Newest Oldest. Best Answer: Professionals quote brick by the thousand. An average cost for brick in the midwest is $350 per thousand and can range up to $400 per thousand for standard color pattern brick. They get much higher if you want hand made, special color match.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":7544051,"ranking":13,"query_text":"can you whitewash brick with a color","passage_text":"I offer a 100% Money Back Guarantee. If you discover your brick is not made anymore, then the first thing you must do is strive for a color match. Do not let a brick salesperson talk you out of this strategy.Try to find brick that are very close, if not identical, in color. When trying to match brick, many people strive to match texture first, then color.You can see texture difference when you stand close to a brick surface, but rarely can you see differences when you stand back 50 or 100 feet. offer a 100% Money Back Guarantee. If you discover your brick is not made anymore, then the first thing you must do is strive for a color match. Do not let a brick salesperson talk you out of this strategy.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":5975249,"ranking":14,"query_text":"can you whitewash brick with a color","passage_text":"Work the whitewash into the wood (optional). Before the whitewash dries, use a clean rag to rub the whitewash into the grain and knots of the wood and even the brush strokes into one level coating. 1  This is especially important for oak and other wood with large pores.. Wipe the whitewashed area. Before the whitewash can completely dry, use a clean cloth to wipe any excess from the furniture surface. This helps to make the wood grain more visible through the product. 1  You can use a dry sponge instead.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":1884129,"ranking":15,"query_text":"can you whitewash brick with a color","passage_text":"If you do not have an extra brick, ask Sherwin Williams for a fan deck and match the brick to a paint color in the fan deck. If you have multi-color bricks and you want your trim color to blend and fade, I recommend choosing the brick color that is the medium shade (not the lightest and not the darkest). If you want to contrast your brick color, choose the darkest or lightest brick color to match. For homes that are not brick and you want your trim to blend in, either go up or down one or two shades of the paint color of the home. To contrast, consider going either white (or off white), or dark (black, dark brown or dark gray):","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":6939885,"ranking":16,"query_text":"can you whitewash brick with a color","passage_text":"There is a sealing component incorporated into the brick paver staining formula. With the largest paver sealer in the country, you can now accomplish both staining and sealing pavers all in one application. Our crews are can mobilize to anywhere in the U.S. for applications to stain concrete or color brick pavers.This is an applied process.Colorant is not sold.f the question of how to stain concrete or cement coloring has come up, we can now actually re-color brick pavers. The results of this unique formula rejuvenates and restores tired, faded brick pavers.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":7321336,"ranking":17,"query_text":"can you whitewash brick with a color","passage_text":"Latex stain, oil-based stain and concrete stain can all be used to color brick; the porous surface of brick allows the color to soak in. You can dilute latex stain with water, but oil-based stain must be diluted with paint thinner or turpentine. Paint latex or oil-based stain onto the brick and then wipe it off.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":5975253,"ranking":18,"query_text":"can you whitewash brick with a color","passage_text":"9. Wipe the whitewashed area. Before the whitewash can completely dry, use a clean cloth to wipe any excess from the furniture surface. This helps to make the wood grain more visible through the product. 1  You can use a dry sponge instead.2  If the excess blobs have already dried, use sandpaper to remove them.. Wipe the whitewashed area. Before the whitewash can completely dry, use a clean cloth to wipe any excess from the furniture surface. This helps to make the wood grain more visible through the product. 1  You can use a dry sponge instead.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":3205636,"ranking":19,"query_text":"can you whitewash brick with a color","passage_text":"You can use one color for the mantel shelf and sides of the surround and a second color for inner portion of the surround. Itâ\u0080\u0099s an especially ideal option if youâ\u0080\u0099re combining a brick fireplace with a wooden mantel and surround since you can paint the brick one shade and the wood in the second shade.","bm25_label":"high","relevance_label":0.0},{"query_id":81075,"passage_id":716337,"ranking":20,"query_text":"can you whitewash brick with a color","passage_text":"Pine Hall Brick stocks a variety of colored mortars for you to choose from. Your salesperson can discuss the mortar colors that look best with your brick color. Also, sand color will affect the finished look of your mortar color. Lighter color sands are generally recommended for lighter colored mortars. Inquire about the common sand colors in your area.","bm25_label":"high","relevance_label":0.0}]