[{"query_id":815421,"passage_id":7881906,"ranking":1,"query_text":"what is the definition of restatement","passage_text":"Define restatement. restatement synonyms, restatement pronunciation, restatement translation, English dictionary definition of restatement. tr.v. reÂ·statÂ·ed , reÂ·statÂ·ing , reÂ·states To state again or in a new form. See Synonyms at repeat. reÂ·stateâ\u0080²ment n. Noun 1. restatement - a revised...","bm25_label":"high","relevance_label":1.0},{"query_id":815421,"passage_id":3663829,"ranking":2,"query_text":"what is the definition of restatement","passage_text":"What is the PPA restatement cycle? The current restatement period is the Pension Protection Act of 2006 (PPA). Pre-approved plans have until April 30, 2016 for restatement. Individual plans have a 5-year cycle determined by the last digit of the Employer's Identification Number (EIN). What is the restatement period for individually designed plans?","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":8070775,"ranking":3,"query_text":"what is the definition of restatement","passage_text":"What is the meaning of the word restate the thesis? ... So your restatement should say this is what my paper has shown you. ... To restate my example: ... Restatement of thesis - cdspub.com A thesis statement serves as your paper's (or speech's) restatement of thesis guiding idea, alerting readers to the main points of thesis statement placement your ... 5-paragraph essay writing help, ideas, topics, examples 5-paragraph Essay.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":6452945,"ranking":4,"query_text":"what is the definition of restatement","passage_text":"Codifying Statute Law & Legal Definition. A codifying statute is one which restates legal subject matter previously contained in earlier statutes, the common law, and custom.It is a statute that purports to be exhaustive in restating the whole of the law on a particular topic, including prior caselaw as well as legislative provisions.odifying Statute Law & Legal Definition. A codifying statute is one which restates legal subject matter previously contained in earlier statutes, the common law, and custom.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":4179274,"ranking":5,"query_text":"what is the definition of restatement","passage_text":"Secondary Source: A Definition. Materials that discuss, explain, interpret, and analyze what the law is or what it. should be, including treatises, law reviews, encyclopedias, ALR annotations, Restatements, and legal newspapers. Secondary sources also provide extensive. citations to primary legal materials and other relevant secondary sources.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":1784918,"ranking":6,"query_text":"what is the definition of restatement","passage_text":"Definition of inertia. Isaac Newton is the one who formulated a great definition of inertia. Also known as Newton's first law or law of inertia, Newton restated Galileo's idea. Below is what Newton said in simple terms: If an object is already moving, it will keep moving in a straight line at constant speed unless a force stops it.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":8809972,"ranking":7,"query_text":"what is the definition of restatement","passage_text":"Define paraphrase. paraphrase synonyms, paraphrase pronunciation, paraphrase translation, English dictionary definition of paraphrase. n. 1. A restatement of a text or passage in another form or other words, often to clarify meaning. 2. The restatement of texts in other words as a studying...","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":7062272,"ranking":8,"query_text":"what is the definition of restatement","passage_text":"Trust Restatement Law & Legal Definition. A restatement of a revocable living trust revises or amends a trust's provisions. A restatement of trust completely replaces and supercedes all provisions of the original revocable living trust it replaces.The original trust's name is not affected or changed by the restatement.In effect the original trust and trust estate is continued but the newly restated rules or provisions apply. Example of a statute in Texas dealing with restated declaration of trust: Tex.1) the entire text of the declaration of trust as amended or supplemented by all articles of amendment previously filed with the county clerk of the county of the principal place of business of the real estate investment trust; or.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":7207587,"ranking":9,"query_text":"what is the definition of restatement","passage_text":"Paraphrasing definition, a restatement of a text or passage giving the meaning in another form, as for clearness; rewording. See more.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":7881898,"ranking":10,"query_text":"what is the definition of restatement","passage_text":"â\u0080\u0098The result is a stunning, bare-bones artistic restatement of some of the best traditional music in America.â\u0080\u0099 â\u0080\u0098Functional abstraction involves the restatement of any problem in terms of performance specifications.â\u0080\u0099 â\u0080\u0098Our research team received a slew of restatements.â\u0080\u0099 â\u0080\u0098It seems this painting may be a restatement of an art-historical precedent.â\u0080\u0099 â\u0080\u0098Generally, what we get is a restatement of the facts surrounding the events without much analysis.â\u0080\u0099 â\u0080\u0098Several chapters are rich in fresh insights and in incisive restatements of accepted views.â\u0080\u0099 â\u0080\u0098He coupled his attack with a restatement of his objections to the wage-fund theory.â\u0080\u0099","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":1402310,"ranking":11,"query_text":"what is the definition of restatement","passage_text":"3. Concluding paragraph restating your thesis and explaining the significance of your essay. In other words, in the first part of your paper you state what you are going to say, in the second you state it, and in the third you restate what you just stated.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":349572,"ranking":12,"query_text":"what is the definition of restatement","passage_text":"Restate means to repeat what was said. It would also be good to use different words to explain that second time. the prefix re means again. restate means to state or put into words again. State again in your own words.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":4236234,"ranking":13,"query_text":"what is the definition of restatement","passage_text":"CPT Surgical Package Definition The definition of the CPT Surgical Package can be found in the Surgery guidelines in the CPT codebook and is restated here, as follows: The services provided by the physician to any patient by their very nature are variable. ...","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":1743137,"ranking":14,"query_text":"what is the definition of restatement","passage_text":"Definition of reword. 1  transitive verb. 2  1 : to repeat in the same words. 3  2 : to alter the wording of; also : to restate in other words.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":349574,"ranking":15,"query_text":"what is the definition of restatement","passage_text":"Restate means to repeat what was said. It would also be good to use different words to explain that second time. Re State. the prefix re means again. restate means  to state or put into words again. State again in your own words.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":564154,"ranking":16,"query_text":"what is the definition of restatement","passage_text":"Argumentative Essay Outline Section 4: Conclusion. In your conclusion, you are going to accomplish two important tasks. 1. Restate the importance of your issue. Similar to what you did in your introduction, you want to restate why this topic is critical.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":163002,"ranking":17,"query_text":"what is the definition of restatement","passage_text":"The Restatement proceeds to explain its original definition of condition precedent. in a comment which narrows the broad scope of the definition so as to bring it In line. with ordinary theoretical formulations.  'Condition' in ordinary legal use is a word of. broad signification.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":8633897,"ranking":18,"query_text":"what is the definition of restatement","passage_text":"The phrase for avoidance of doubt indicates a part of an agreement that is intended to restate what another portion of the contract (often in conjunction with applicable law) already implies. The phrase is added to ensure that the restatement won't be pointed to as a way to argue that other parts of the contract should be interpreted differently than intended.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":5402392,"ranking":19,"query_text":"what is the definition of restatement","passage_text":"short form document. Definition. A brief document that refers to a contract and restates the fact that a contract has been made between two or more parties. Print Cite \/ Link.","bm25_label":"high","relevance_label":0.0},{"query_id":815421,"passage_id":7207586,"ranking":20,"query_text":"what is the definition of restatement","passage_text":"paraphrase definition A restatement of speech or writing that retains the basic meaning while changing the words. A paraphrase often clarifies the original statement by putting it into words that are more easily understood.","bm25_label":"high","relevance_label":0.0}]