[{"query_id":824920,"passage_id":5033988,"ranking":1,"query_text":"what is the highest social security payment","passage_text":"But what about Social Security? According to the Social Security website, the average monthly payment is $1,237, or an annual payment of $14,844. Put both investment and Social Security income together, and you get $16,619 today, $17,416 in 10 years, plus Social Security cost-of-living adjustments.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":1303676,"ranking":2,"query_text":"what is the highest social security payment","passage_text":"Or you can call or visit your local Social Security office to ask for help. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663.r you can call or visit your local Social Security office to ask for help. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":8541303,"ranking":3,"query_text":"what is the highest social security payment","passage_text":"When are Social Security Benefits Paid? After you apply for social security benefits a notice is sent with a date that you should receive the payment. The birth date of record is what determines the date of payment; if you are the worker applying for social security benefits it will be your birthdate.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":5091428,"ranking":4,"query_text":"what is the highest social security payment","passage_text":"When are Social Security Benefits Paid? After you apply for social security benefits a notice is sent with a date that you should receive the payment. The birth date of record is what determines the date of payment; if you are the worker applying for social security benefits it will be your birthdate. If you are the spouse of the worker, their birthdate is used to determine the date of payments.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":3232958,"ranking":5,"query_text":"what is the highest social security payment","passage_text":"What's the Maximum Social Security Benefit in 2017? The biggest Social Security benefit that will be paid in 2017 is $2,687 per month. Inflation is ticking higher, and as a result, the Social Security Administration increased Social Security payments by 0.3% in 2017.","bm25_label":"high","relevance_label":1.0},{"query_id":824920,"passage_id":8256999,"ranking":6,"query_text":"what is the highest social security payment","passage_text":"Taxation of Social Security and SSDI Payments. Taxation of Social Security and SSDI Payments. If you receive Social Security or Social Security Disability Insurance (SSDI) income, you will also receive a Form SSA-1099 from the government. This form tells you the total amount of your benefits but does not tell you if any of your benefits are taxable, or at what percentage. Continue Reading Below.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":771777,"ranking":7,"query_text":"what is the highest social security payment","passage_text":"Social Security. If you pay Social Security taxes (FICA) for at least 40 quarters (10 years), you are eligible to start receiving retirement benefits at age 62. The payment amount is based on the highest 35 years of your earnings, with those earnings adjusted for inflation.The Social Security Administration website (http:\/\/www.ssa.gov) provides resources to estimate the level of benefits you will receive.You may also choose to defer drawing benefits until you are older.he payment amount is based on the highest 35 years of your earnings, with those earnings adjusted for inflation. The Social Security Administration website (http:\/\/www.ssa.gov) provides resources to estimate the level of benefits you will receive. You may also choose to defer drawing benefits until you are older.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":5974776,"ranking":8,"query_text":"what is the highest social security payment","passage_text":"Figuring out at what age you should start claiming Social Security benefits is a tricky decision, and it's one that cannot be undone. Should you, for instance, start claiming Social Security benefits at the early age of 62 and tradeoff higher payments for a certain payment?","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":1503953,"ranking":9,"query_text":"what is the highest social security payment","passage_text":"Or you can call or visit your local Social Security office to ask for help. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":8143921,"ranking":10,"query_text":"what is the highest social security payment","passage_text":"Or you can call or visit your local Social Security office to ask for help. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663. SSI","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":793684,"ranking":11,"query_text":"what is the highest social security payment","passage_text":"Social Security's Representative Payment Program provides financial management for the Social Security and SSI payments of our beneficiaries who are incapable of managing their Social Security or SSI payments.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":918189,"ranking":12,"query_text":"what is the highest social security payment","passage_text":"Social Security. When People Need Help Managing Their Money. Social Security's Representative Payment Program provides financial management for the Social Security and SSI payments of our beneficiaries who are incapable of managing their Social Security or SSI payments.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":272863,"ranking":13,"query_text":"what is the highest social security payment","passage_text":"Remember that the earliest you can start Social Security retirement benefits is age 62. You can also start it at any time up to age 70. At 62, your payments will be reduced. If you start at full retirement age, now 66 for many people, you'll get your full payment, based on your highest 35 years of earnings. At 70, you'll get your full payment plus a 32 percent bonus for waiting. See also: AARP Social Security Calculator.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":1303670,"ranking":14,"query_text":"what is the highest social security payment","passage_text":"How much your monthly disability check will be depends on whether you'll receive Social Security Disability (SSD) or Supplemental Security Income (SSI). SSD is for workers who are insured under the Social Security retirement system.r you can call or visit your local Social Security office to ask for help. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":1821531,"ranking":15,"query_text":"what is the highest social security payment","passage_text":"What are Social Security Wages? Employers must withhold both Social Security and Medicare taxes (called FICA taxes) from all wages paid to both hourly and salaried employees. But some types of payments are exempt from FICA tax. Thi article discusses what wages are included in the calculation of Social Security wages and which wages are not included. What Wages are Subject to Withholding?","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":918187,"ranking":16,"query_text":"what is the highest social security payment","passage_text":"Representative Payee Social Security's Representative Payment Program provides financial management for the Social Security and SSI payments of our beneficiaries who are incapable of managing their Social Security or SSI payments.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":7064021,"ranking":17,"query_text":"what is the highest social security payment","passage_text":"Social security paying a month behind. Is the social security check issued for the month just past, or the month upcoming? How does social security calculate my payment if i apply to start receiving benefits for the same month as my birthday? Ssa benefits paid a month behind. What month can i apply for social security benefits?","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":1822063,"ranking":18,"query_text":"what is the highest social security payment","passage_text":"Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663.ocial Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":8352825,"ranking":19,"query_text":"what is the highest social security payment","passage_text":"What You Need to Know to Request a Hearing Before an Administrative Law Judge. You have the right to appeal any decision Social Security makes on whether you are entitled to Social Security benefits or are eligible for Supplemental Security Income (SSI) payments.","bm25_label":"high","relevance_label":0.0},{"query_id":824920,"passage_id":6318352,"ranking":20,"query_text":"what is the highest social security payment","passage_text":"The Social Security Administration has limitations on garnishment, but its responsibility ends upon the payment of benefits. Here's what the Social Security Administration says on the topic of garnishment on its direct deposit  frequently asked questions  page.","bm25_label":"high","relevance_label":0.0}]