[{"query_id":825147,"passage_id":7875504,"ranking":1,"query_text":"what is the hormone that makes you fat","passage_text":"Several hormones in the body can make you eat more and get fat. Fortunately, fixing the function of those hormones is relatively simple. Several hormones in the body can make you eat more and get fat.","bm25_label":"high","relevance_label":1.0},{"query_id":825147,"passage_id":4188639,"ranking":2,"query_text":"what is the hormone that makes you fat","passage_text":"What happens, not only for progesterone cream, but for ANY hormone preparation you use by applying as a cream to your skin is that within a few weeks to a few months you will saturate the fat tissue with the hormones and they will actually stop working or can even make your symptoms worse.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":2978890,"ranking":3,"query_text":"what is the hormone that makes you fat","passage_text":"What is estrogen? Estrogens are a group of hormones that play an important role in the normal sexual and reproductive development in women. They are also sex hormones. The woman's ovaries make most estrogen hormones, although the adrenal glands and fat cells also make small amounts of the hormones.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":6310481,"ranking":4,"query_text":"what is the hormone that makes you fat","passage_text":"Whey Protein And Fat Loss: 3 Benefits. 1) Whey increases the secretion of CCK, which is a hormone that helps to regulate appetite. It also suppresses the output of grehlin which is a hormone that stimulates your appetite. The combination of these two effects may make it easier for you to stick to your fat burning diet.) Whey increases the secretion of CCK, which is a hormone that helps to regulate appetite. It also suppresses the output of grehlin which is a hormone that stimulates your appetite. The combination of these two effects may make it easier for you to stick to your fat burning diet.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":702337,"ranking":5,"query_text":"what is the hormone that makes you fat","passage_text":"The leptin hormone is released by fat cells (adipocytes) after which it travels through the bloodstream into the brain. This hormone signals the hypothalamus, the small area in the base of the brain that controls hunger, that you have eaten enough and makes you feel full. Leptin is the hormone that regulates hunger. Even more interesting, Leptin stimulates metabolism and causes you to burn stored fat instead of muscles.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":2072179,"ranking":6,"query_text":"what is the hormone that makes you fat","passage_text":"Naturally low in fat, our antelope, venison, and other meats are much healthier than pork or beef. Even if fat is not a concern, our meats are clean. As our meat is raised without hormones or antibiotics, you know exactly what you are getting when you purchase healthy meat from us.aturally low in fat, our antelope, venison, and other meats are much healthier than pork or beef. Even if fat is not a concern, our meats are clean. As our meat is raised without hormones or antibiotics, you know exactly what you are getting when you purchase healthy meat from us.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":1193224,"ranking":7,"query_text":"what is the hormone that makes you fat","passage_text":"What is vitamin D? Vitamin D is the name given to a group of fat-soluble prohormones (substances that usually have little hormonal activity by themselves but that the body can turn into hormones). Vitamin D helps the body use calcium and phosphorus to make strong bones and teeth.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":1178895,"ranking":8,"query_text":"what is the hormone that makes you fat","passage_text":"What do lipids do for you? You have many different types of lipids in your body including fats, oils, waxes and steroids. Your body uses fats as a supply and store of energy: a gram of fat contains more than double the amount of energy present in a gram of carbohydrate. The steroids in your body include some hormones. Other lipids make up the outer layer of all your cells, and the fatty sheaths that insulate nerve fibres.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":8602943,"ranking":9,"query_text":"what is the hormone that makes you fat","passage_text":"Belly fat is actually metabolically different than other fat found under our skin. Belly fat is caused by a rise in insulin levels, also known as the fat storage hormone. What Elevates Insulin Levels? Low fat diets. For example, low fat yogurt and low fat milk or cereals. â\u0080\u009cLow fatâ\u0080\u009d typically = added sugar or salt to make up for the missing fat.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":425816,"ranking":10,"query_text":"what is the hormone that makes you fat","passage_text":"Leptin is a hormone you may have heard of before, since itâ\u0080\u0099s intricately related to insulin. In fact, leptin works opposite to insulin - insulin stores fat and leptin burns fat. Insulin is secreted when you eat food, especially foods high in sugar, and it stores energy from food as fat in your body. Leptin is the hormone that allows your body to use the energy from fat. Interestingly, what influences leptin is the amount of fat you have on your body. The more fat you have the more leptin will be available, so you can burn off the fat.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":275026,"ranking":11,"query_text":"what is the hormone that makes you fat","passage_text":"For men, a low fat diet means low testosteroneâ\u0080¦ and you know what that means, guys! Low fat diets also undermine balanced hormones by preventing the detox of excess hormones, particularly estrogen. When there is excess estrogen in the body, it is packaged into the bile so it can be excreted with food waste.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":3573658,"ranking":12,"query_text":"what is the hormone that makes you fat","passage_text":"It will increase testosterone. Healthy fats helps make the hormone cholesterol which is a precursor to androgen hormones.Cholesterol is also a precursor to vital corticosteroids, the hormones that help us to deal with stress and protect the body against heart disease and cancer.t will increase testosterone. Healthy fats helps make the hormone cholesterol which is a precursor to androgen hormones.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":851739,"ranking":13,"query_text":"what is the hormone that makes you fat","passage_text":"What Leptin Is. Leptin is a hormone secreted by adipose tissue (fat cells) that tells you youâ\u0080\u0099re full. (Its opposite hormone is called ghrelin, which tells you youâ\u0080\u0099re hungry. You can remember this because the word ghrelin sounds like a stomach growling.) Because leptin is secreted by fat cells, you produce more leptin as your weight increases.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":573858,"ranking":14,"query_text":"what is the hormone that makes you fat","passage_text":"Female belly fat and hormones. There are a few hormones we need to talk about in regards to belly fat in women. And before the calorie zealots get in an uproar, I am not saying calories donâ\u0080\u0099t matter. What I am saying is that it is the hormonal situation that determines where fat is stored, and belly fat is no different.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":5742137,"ranking":15,"query_text":"what is the hormone that makes you fat","passage_text":"Are female hormones making you fat... Female hormones are responsible for hormonal weight gain during puberty, pregnancy and menopause. They affect ALL women regardless of race, culture, creed, body shape or size.ndrogen. This is the hormone that we can point fingers at for that weight gain that makes you look for apple-shaped, you know that middle-aged spread-it's androgen that is responsible for sending new weight gained to wrap around your mid-section.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":4474806,"ranking":16,"query_text":"what is the hormone that makes you fat","passage_text":"Steroids are another major group of lipids. Steroids include cholesterol, chlorophyll, and hormones. Our bodies use cholesterol to make the hormones testosterone (male hormones) and estrogen (female hormones).Chlorophyll is used by plants to absorb light for photosynthesis. There are two main types of fats: saturated fats and unsaturated fats. 2  Saturated Fats-Saturated fats are solids at room temperature. 3  These fats tend to come from foods like red meat, cheese, and butter.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":270878,"ranking":17,"query_text":"what is the hormone that makes you fat","passage_text":"To lose fat you need both a caloric deficit and hormonal balance. To lose stubborn fat, particularly stubborn belly fat, you need to understand the hormones involved. In women those hormones are: insulin, cortisol, estrogen, progesterone, and testosterone. And of course the major fat burning hormones, the catecholamines.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":186544,"ranking":18,"query_text":"what is the hormone that makes you fat","passage_text":"Leptin is a very powerful and influential hormone produced by your fat cells. Your fat, by way of leptin, tells your brain whether you should be hungry, eat and make more fat, whether you should reproduce, or (partly by controlling insulin) whether to engage in maintenance and repair.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":3572516,"ranking":19,"query_text":"what is the hormone that makes you fat","passage_text":"Top 10 Vitamin D Rich Foods. Vitamin D is a fat-soluble vitamin that is different from other vitamins because our bodies can make most of what we need with exposure to sunlight. Vitamin D is more than a vitamin in that is acts as a pro-hormone and effects hormone balance and immune regulation of the body.","bm25_label":"high","relevance_label":0.0},{"query_id":825147,"passage_id":7653985,"ranking":20,"query_text":"what is the hormone that makes you fat","passage_text":"I will discuss many of those issues below.2- Adrenal Fatigue and Difficult Weight LossStress makes you fat and here's why. Stress will make you release high amounts of hormones called cortisol and adrenaline. High cortisol or adrenaline levels will lead to fat gain around the belly and eventually to adrenal fatigue.","bm25_label":"high","relevance_label":0.0}]