[{"query_id":82842,"passage_id":8005175,"ranking":1,"query_text":"carnelian color meaning","passage_text":"Carnelian Gemstone Meaning. Carnelian... The deep Orange Color of Carnelian is warm and intense... Read more here about the New Age and Metaphysical use and properties of the Healing Stone Carnelian and Orange Color Healing. New Age Carnelian Meaning. Metaphysically, Orange evokes the fire of the Sun and has long been considered the color of capturing the Solar Powers; intense, focused, unrelenting and absolutely necessary to life.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":8005171,"ranking":2,"query_text":"carnelian color meaning","passage_text":"Carnelian Stone Color. Carnelian is a stone that has a brownish-red semi-orange surface. This stone comes from the class of chalcedony quartz . The name itself taken from the word Caro carnis from the Latin that means widening.The Widen meaning here was related to the color of the stone is going to change by itself if it has multiple colors in one .","bm25_label":"high","relevance_label":1.0},{"query_id":82842,"passage_id":8005172,"ranking":3,"query_text":"carnelian color meaning","passage_text":"About the Stone. A reddish-orange, or reddish-brown colored gemstone from the chalcedony family of quartz. It has a warm, uniform, and easily distinguishable color. Carnelian sits at a 6.5 â\u0080\u0093 7 on the Mohs scale. It is a member of the quartz family. Carnelian is derived from the Latin word meaning horn. Carnelian is also spelled â\u0080\u0098cornelianâ\u0080\u0099 and has also been referred to as Mecca Stone, Pigeonâ\u0080\u0099s blood Agate, and Sadoine.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":4021802,"ranking":4,"query_text":"carnelian color meaning","passage_text":"Carnelian Jewelry: Unique Birthstone Jewelry. Carnelian is one of the birthstones listed in the ancient Arabic, Hebrew, Italian and Roman tables and is a Zodiac birthstone for the signs of Leo and Virgo. Carnelian is a form of chalcedony, a member of the quartz family and most Carnelian is heat treated today to enhance the reddish brown color.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7689905,"ranking":5,"query_text":"carnelian color meaning","passage_text":"Carnelian Introduction to the Meaning and Uses of Carnelian Like the unexpected fire of a sunset, or the first flash of autumn brilliance, Carnelian captivates.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7689903,"ranking":6,"query_text":"carnelian color meaning","passage_text":"Carnelian belongs to the cryptocrystalline branch of quartz. Cryptocrystalline, also referred to as chalcedony quartz, includes a variety of other gemstones including agate, onyx and jasper. Carnelian is classified by its distinct color and is defined as a red-orange to brownish-red variety of chalcedony quartz. Carnelian obtains its color through iron impurities that form within colorless quartz crystal.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7689898,"ranking":7,"query_text":"carnelian color meaning","passage_text":"Carnelian (also spelled cornelian[2]) is a brownish-red mineral commonly used as a semi-precious gemstone. Similar to carnelian is sard, which is generally harder and darker (the difference is not rigidly defined, and the two names are often used interchangeably). Both carnelian and sard are varieties of the silica mineral chalcedony colored by impurities of iron oxide. The color can vary greatly, ranging from pale orange to an intense almost-black coloration. It is most common in Brazil, India, Siberia and Germany.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":1471820,"ranking":8,"query_text":"carnelian color meaning","passage_text":"In Bible times stones were identified by color, such as the Hebrew term odem which simply means â\u0080\u009cred stone.â\u0080\u009d This could have been any number of red stones known at the time (i.e. red jasper, carnelian, garnet).","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":6343863,"ranking":9,"query_text":"carnelian color meaning","passage_text":"A glassy, translucent stone, Carnelian is an orange-colored variety of Chalcedony, a mineral of the Quartz family. Its color varies from pale pinkish-orange to a deep rusty brown, though it is most known for its brilliant orange and red-orange crystals. Its name comes from a Latin word meaning flesh..","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":8005176,"ranking":10,"query_text":"carnelian color meaning","passage_text":"Carnelian meaning is focused on giving energy, boosting creativity and protecting from negative emotions. Carnelian is a brown-red variant of chalcedony. It has been in use as a gemstone and stone of power for thousands of years. List of Gemstone Meanings: For our full list of gemstone meanings.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":8005173,"ranking":11,"query_text":"carnelian color meaning","passage_text":"Carnelian Stone Meaning. Carnelian stone meaning in ancient culture often used as a symbol of courage and bravery in conquering the enemy. Most people believed it is capable to captivate, stimulate, allow your self-esteem, passion, and in most particular, love.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7003304,"ranking":12,"query_text":"carnelian color meaning","passage_text":"* The Sardius with its tawny and translucent coloring suggests fire and represents Philip. Sardius or Carnelian: Hebrew name of Odem. Carnelian is a translucent, hard, fine-grained variety of orangish red quartz (chalcedony) that has often been used for ring stones and wax seals.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7003307,"ranking":13,"query_text":"carnelian color meaning","passage_text":"Red Carnelian. Carnelian is a precious stone of blood-red color that during Bible History was sometimes called Sardine stone, or sardius because in ancient times it was obtained from Sardis in Asia Minor (Sardis was also the location of one of the prophetic Seven Churches of Revelation).","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7740340,"ranking":14,"query_text":"carnelian color meaning","passage_text":"Carnelian Agate is a translucent orange to red or brown agate. It has been a popular gemstone since Biblical times. The stones shown here have a bright orange color and a very bright polish. They were produced from agate found in Botswana (Africa). Shop for Carnelian.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":8005169,"ranking":15,"query_text":"carnelian color meaning","passage_text":"Carnelian Gemstone meaning. Carnelian (also sometimes referred to as cornelian) is found primarily in India, as well as various sites in South America. It is a variety of chalcedony. The most favorable pieces are a deep red to red-orange hue. Carnelian has a long and storied past, and was once considered strictly the property of the noble class.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7003308,"ranking":16,"query_text":"carnelian color meaning","passage_text":"by Wayne Blank. Red Carnelian. Carnelian is a precious stone of blood-red color that during Bible History was sometimes called Sardine stone, or sardius because in ancient times it was obtained from Sardis in Asia Minor (Sardis was also the location of one of the prophetic Seven Churches of Revelation).","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7689899,"ranking":17,"query_text":"carnelian color meaning","passage_text":"carnelian agate. natural rich deep red colors - solid, little to no waste - top grade gem quality- best for all types of cutting, polishing, cabbing and carving - - from india aaa (photographed w... 2.7 CARNELIAN Agate Heart Palm Stone Healing Reiki - Madagascar","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":8005174,"ranking":18,"query_text":"carnelian color meaning","passage_text":"Carnelian Meaning & Properties. Picture yourself in the forest on a cool, crisp morning kicking playfully in a pile of crimson leaves. That giddy, youthful sensation represents Carnelian perfectly â\u0080\u0093 no worries and for just one moment you are Velveteen Rabbit real.","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7689904,"ranking":19,"query_text":"carnelian color meaning","passage_text":"Carnelian tumbled stone protects you from any negative\/bad habits and keeps you away from any kind of abusive tendency. It improves your eloquence, gives courage and improves analytical ability. It also inspires passion and love. Agate Export brings you carnelian tumbled stone in various colors â\u0080\u0093 red, orange and brown. Read More","bm25_label":"high","relevance_label":0.0},{"query_id":82842,"passage_id":7003312,"ranking":20,"query_text":"carnelian color meaning","passage_text":"The Sardius is the red band found in the Sardonyx-a red Carnelian or Sard. It is a brownish-red mineral variety of Chalcedony (Silicon Quartz-SiO 2) colored by impurities of Iron Oxide.","bm25_label":"high","relevance_label":0.0}]