[{"query_id":830551,"passage_id":7888156,"ranking":1,"query_text":"what is the mayor of torrington ct salary","passage_text":"1-800-872-0222. The Inner Workings of Being a Mayor of Torrington Connecticut. Being a Mayor of Torrington CT is a very prestigious and challenging position. Being a Mayor of Torrington Connecticut a town, city or suburb tends to earn a lot of respect for you that you might not have otherwise earned. As an elected Mayor of Torrington CT, you have the following privileges:","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":7888158,"ranking":2,"query_text":"what is the mayor of torrington ct salary","passage_text":"Of 26 municipalities with populations between 20,000 and 39,999, seven have mayors, four of whom are full-time, and 11 have city or town managers. Salaries of the full-time mayors range from $54,814 in Naugatuck to $60,089 in Torrington. The part-time mayors' salaries range from zero in Cheshire to $40,000 in Shelton. City managers' salaries range from a low of $60,608 in Watertown to a high of $91,916 in Wethersfield.","bm25_label":"high","relevance_label":1.0},{"query_id":830551,"passage_id":8430583,"ranking":3,"query_text":"what is the mayor of torrington ct salary","passage_text":"Community Health & Wellness Center of Greater Torrington, Inc. Everyone Deserves Quality Healthcareâ\u0080\u009d-Torrington, CT-Est. salary: $41,000 - $56,000 a year. Bachelor's degree in related field or equivalent work experience. The Office Manager is pivotal in ensuring that the overall business operations of the front...","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":8430585,"ranking":4,"query_text":"what is the mayor of torrington ct salary","passage_text":"Community Health & Wellness Center of Greater Torrington, Inc. Everyone Deserves Quality Healthcareâ\u0080\u009d-Torrington, CT-Est. salary: $52,000 - $70,000 a year. In Counseling and current State of Connecticut licensure as an LCSW required. Community Health &amp; Wellness Center has an oprning for a Licensed Clinical Social...","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":7888155,"ranking":5,"query_text":"what is the mayor of torrington ct salary","passage_text":"City of Torrington CT 140 Main Street Torrington CT 06790 Tel: 860 489-2228. Website Disclaimer & Privacy Policy | Virtual Towns & Schools Website.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2490115,"ranking":6,"query_text":"what is the mayor of torrington ct salary","passage_text":"Study proposes fewer Torrington public works employees. August 21, 2017 - Local, Top Stories - Tagged: Torrington Towns: Torrington, Torrington CT - 2 comments. TORRINGTON â\u0080\u0093 A months-long review of the public works department envisions a leaner work force and more cohesion between its divisions.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2154031,"ranking":7,"query_text":"what is the mayor of torrington ct salary","passage_text":"If you are not contacted by the agent within 24 hours, please call 877-888-8722. Torrington, Litchfield County, CT Foreclosures & Foreclosed Homes for Sale. Discover foreclosed homes for sale and foreclosure listings for real estate in Torrington, Litchfield County, CT.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2208986,"ranking":8,"query_text":"what is the mayor of torrington ct salary","passage_text":"Torrington, CT 5 Day weather forecast includes high and low temperatures, humidity, precipitation, sky conditions, sunrise, sunset, and wind speed and direction - for both day and night with a text summary. Torrington, CT five day forecast presented in Fahrenheit and Celsius.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2208980,"ranking":9,"query_text":"what is the mayor of torrington ct salary","passage_text":"Torrington, CT live road conditions and updates are included - as well as any NWS alerts, warnings, and advisories for the Torrington area and overall Litchfield county. Torrington Connecticut weather forecast for five days. Â© 2008-2018 LocalConditions.com.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2490113,"ranking":10,"query_text":"what is the mayor of torrington ct salary","passage_text":"Torrington, CT Real Estate Insights Torrington is the largest city in Litchfield County, Connecticut and the Litchfield Hills region. It is also the core city of the largest micropolitan area in the United States.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":3438380,"ranking":11,"query_text":"what is the mayor of torrington ct salary","passage_text":"This large hearth store in Connecticut has them too! Hartford County, CT propane service and propane delivery are handled by two different Hocon Gas locations. Those in the northern Hartford County should call and visit the Hocon Hearth House showroom in Torrington, CT. Our Torrington location will handle your service and delivery needs.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":8430587,"ranking":12,"query_text":"what is the mayor of torrington ct salary","passage_text":"Get jobs by email for this search. Torrington, CT Employment Information. If youâ\u0080\u0099re ready for a new and challenging job, take a look at our wide range of Torrington, Connecticut jobs. Whatever type of job in Torrington youâ\u0080\u0099re seeking, you can find it on Monster. View our listings of Torrington job opportunities and find your perfect fit today. View More.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":4800685,"ranking":13,"query_text":"what is the mayor of torrington ct salary","passage_text":"A post office called Torrington was established in 1889 on W. G. Curtis' farm three miles west of where the town of Torrington would be in 1900, with W. G. Curtis serving as Postmaster and later as mayor. By 1908 the town was incorporated as a town in Laramie County.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2223996,"ranking":14,"query_text":"what is the mayor of torrington ct salary","passage_text":"Torrington, CT. Online Offers. Torrington is the largest city in Litchfield County, Connecticut and the northwestern Connecticut region. It is also the core city of the largest micropolitan area in the United States. The city population was 36,383 according to the 2010 census. Torrington is a former mill town, as are most other towns along the Naugatuck River Valley.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":8430584,"ranking":15,"query_text":"what is the mayor of torrington ct salary","passage_text":"$52,000 is the median household overall wage value of Torrington, CT, per BLS statistics as of approximately 2013 Torrington's cost of living, as recent as 2013, was near 132 out of 100, and that's significantly higher when it comes to the national average.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2208983,"ranking":16,"query_text":"what is the mayor of torrington ct salary","passage_text":"Get Torrington, CT 06790 typical February Weather including average and record temperatures from AccuWeather.com","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2154028,"ranking":17,"query_text":"what is the mayor of torrington ct salary","passage_text":"Torrington, CT. Online Offers. Torrington is the largest city in Litchfield County, Connecticut and the northwestern Connecticut region. It is also the core city of the largest micropolitan area in the United States. The city population was 36,383 according to the 2010 census. Torrington is a former mill town, as are most other towns along the Naugatuck River Valley. It is currently competing with the neighboring city of Winsted to recreate a pleasant Main Street environment.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":8430581,"ranking":18,"query_text":"what is the mayor of torrington ct salary","passage_text":"Description: Tradesmen International is looking for CT Licensed Commercial Plumber in Torrington, CT PAYS: $28-$30\/hr DOE PER DIEM: N\/A HOURS: 40+ weekly DURATIONS: ASAP - 3 months project *Must have a valid driver's license and reliable...","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":2223991,"ranking":19,"query_text":"what is the mayor of torrington ct salary","passage_text":"Litchfield County has the lowest population density of any county in Connecticut and is geographically the state's largest county. Litchfield County comprises the Torrington, CT Micropolitan Statistical Area, which is included in the New York-Newark, NY-NJ-CT-PA Combined Statistical Area.","bm25_label":"high","relevance_label":0.0},{"query_id":830551,"passage_id":4281740,"ranking":20,"query_text":"what is the mayor of torrington ct salary","passage_text":"Average Mayor Yearly Salary in Texas. Mayors earn a median salary of $18,250 per year. Salaries typically start from $16,020 and go up to $56,210. Learn more about the Mayor job market for salaries of real jobs in your area. Alternatively, see what Mayors earn in other states.","bm25_label":"high","relevance_label":0.0}]