[{"query_id":838453,"passage_id":8568305,"ranking":1,"query_text":"what is the parent company for adidas","passage_text":"Adidas Weakness Essays and Research Papers. 1  Adidas Weakness BACKGROUND Adidas AG FWB: ADS, ADR:Pink Sheets: ADDYY) is a German sports apparel manufacturer and parent company of the Adidas... Group, which consists of the Reebok sportswear company, golf company (including Ashworth), and Rockport.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":7864452,"ranking":2,"query_text":"what is the parent company for adidas","passage_text":"50 Things You Didn't Know About adidas. adidas is the parent company to Reebok, Rockport, and Taylor Made. Further showing that adidas has diverse interests, its brand umbrella is just as broad.","bm25_label":"high","relevance_label":1.0},{"query_id":838453,"passage_id":8568304,"ranking":3,"query_text":"what is the parent company for adidas","passage_text":"Adidas Weakness Essays and Research Papers. 1  Adidas Weakness BACKGROUND Adidas AG FWB: ADS, ADR:Pink Sheets: ADDYY) is a German sports apparel manufacturer and parent company of the Adidas... 2  Adidas adidas AG (German pronunciation: [Ë\u0088adiË\u008cdas]) is a German multinational corporation that designs and manufactures sports clothing and...","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":3452697,"ranking":4,"query_text":"what is the parent company for adidas","passage_text":"Adidas Shoe Models List. Adidas Footwear is a German sports apparel manufacturer. It is the parent company of the Adidas Group which consists of Reebok, TaylorMade-Adidas and Rockport. Adidas is the largest sportswear manufacturer in Europe and the second-biggest sportswear manufacturer in the world, with American rival Nike being the biggest. It was founded in 1948 by Adolf â\u0080\u009cAdiâ\u0080\u009d Dassler.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":3017333,"ranking":5,"query_text":"what is the parent company for adidas","passage_text":"Reebok's parent company, Adidas, is headquartered in Germany, while the Reebok world headquarters remains located in Canton, Massachusetts. The Reebok-CCM Hockey offices are located in Quebec, Canada and Stockholm, Sweden.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":7864454,"ranking":6,"query_text":"what is the parent company for adidas","passage_text":"TaylorMade-Adidas Golf, based in Carlsbad, is on the auction block. German sports gear giant Adidas, parent company of TaylorMade, said Wednesday that it plans to sell off its TaylorMade, Ashworth and Adams golf brands and operations as U.S. participation in golf remains stagnant. TaylorMade is a very viable business, Adidas Chief Executive Herbert Hainer said in a statement. However, we decided now is the time to focus even more on our core strength in the athletic footwear and apparel market.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":1673684,"ranking":7,"query_text":"what is the parent company for adidas","passage_text":"Adidas Golf is part of Adidas, a German-based sports clothing manufacturer and part of the Adidas Group, which consists of Reebok sportswear company, and TaylorMade-Adidas golf company.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":5326098,"ranking":8,"query_text":"what is the parent company for adidas","passage_text":"Its rival the University of Michigan has landed a 15-year, $169 million deal with Nike Inc. , leaving Adidas for what's likely the largest-ever contract between an apparel company and a university.ts rival the University of Michigan has landed a 15-year, $169 million deal with Nike Inc. , leaving Adidas for what's likely the largest-ever contract between an apparel company and a university.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":902183,"ranking":9,"query_text":"what is the parent company for adidas","passage_text":"It is the holding company for the Adidas Group, which consists of the Reebok sportswear company, TaylorMade-Adidas golf company (including Ashworth), 8.33% of Bayern Munich and Runtastic, an Austrian fitness technology company. Adidas revenue for 2016 was listed at â\u0082¬19.29 billion.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":6095136,"ranking":10,"query_text":"what is the parent company for adidas","passage_text":"Reebok Announces New Headquarters at Boston Seaport. Fitness footwear brand Reebok is ready to call Boston home. The move follows news last month that the company plans to relocate from its current location in Canton, Mass., part of a larger reorganization of the brand initiated by parent company Adidas.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":1350124,"ranking":11,"query_text":"what is the parent company for adidas","passage_text":"It is the holding company for the Adidas Group, which consists of the Reebok sportswear company, TaylorMade-Adidas golf company (including Ashworth), 9.1% of FC Bayern Munich and Runtastic, an Austrian fitness technology company. Adidas revenue for 2016 was listed at â\u0082¬19.29 billion.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":5115716,"ranking":12,"query_text":"what is the parent company for adidas","passage_text":"It is the holding company for the Adidas Group, which consists of the Reebok sportswear company, TaylorMade-Adidas golf company (including Ashworth), 9.1% of FC Bayern Munich and Runtastic, an Austrian fitness technology company. Adidas revenue for 2012 was listed at â\u0082¬14.88 billion.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":6095143,"ranking":13,"query_text":"what is the parent company for adidas","passage_text":"Adidas, Reebokâ\u0080\u0099s parent company, will put the nearly 60-acre Canton campus on the market once Reebok leaves. Another high-profile company is moving to Boston: Reebok, the athletic shoe and apparel company, plans to shift nearly 700 employees from Canton to a new headquarters in the city. The move would be one of Bostonâ\u0080\u0099s biggest corporate relocations in years.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":1673688,"ranking":14,"query_text":"what is the parent company for adidas","passage_text":"It is the holding company for the Adidas Group, which consists of the Reebok sportswear company, TaylorMade-Adidas golf company (including Ashworth), 9.1% of FC Bayern Munich and Runtastic a former-Austrian fitness company.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":5961887,"ranking":15,"query_text":"what is the parent company for adidas","passage_text":"Adidas may sell Reebok. Shares in adidas surge on speculation that German company may sell US sports brand Reebok. Shares in adidas have surged on speculation that the German company may sell Reebok, its US sportswear brand. Adidas shares rose 4.7pc to â\u0082¬57.18 in afternoon trading as investors digested the prospect of the under-pressure company raising billions of pounds by selling off Reebok.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":5961892,"ranking":16,"query_text":"what is the parent company for adidas","passage_text":"Reebok's parent company, Adidas, is headquartered in Germany, while the Reebok world headquarters remains located in Canton, Massachusetts. The Reebok-CCM Hockey offices are located in Quebec, Canada and Stockholm, Sweden. Reebok EMEA (Europe, Middle East, Africa) has its regional office in Amsterdam, Netherlands.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":902190,"ranking":17,"query_text":"what is the parent company for adidas","passage_text":"Adidas AG is a multinational corporation, founded and headquartered in Herzogenaurach, Germany, that designs and manufactures shoes, clothing and accessories. It is the largest sportswear manufacturer in Europe, and the second largest in the world, after Nike. It is the holding company for the Adidas Group, which consists of the Reebok sportswear company, TaylorMade golf company, Runtastic, an Austrian fitness technology company, and 8.33% of Bayern Munich, the football club. Adidas' revenue for","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":6067670,"ranking":18,"query_text":"what is the parent company for adidas","passage_text":"Contact Adidas Customer Service. Contact Adidas Customer Service. Contacting Adidas Customer Service Center. Adidas is a major player in fitness apparel and equipment. While the name Adidas appears on shoes, clothing and other items, the company is also responsible for other popular names like Reebok and Taylor Made.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":5708226,"ranking":19,"query_text":"what is the parent company for adidas","passage_text":"Nike and adidas are sportswear companies whose products are very popular around the world, while Nike has the upper hand in sales and sponsorships, Adidas is growing. Adidas owns Reebok, Taylor Made golf company and Rockport. Nike owns the Jordan Brand, Umbro, Hurley, Converse and Cole Haan.","bm25_label":"high","relevance_label":0.0},{"query_id":838453,"passage_id":2329534,"ranking":20,"query_text":"what is the parent company for adidas","passage_text":"Adidas History. Adidas was founded in 1924 in Germany by two bothers Adi and Rudolf Dassler. The company was first named Dassler shoes and later became Adidas. By the Dassler shoes being seen in the Olympics this really helped the company get itâ\u0080\u0099s name known. However, in 1948 Rudolf Dassler leaves to start his own company which is now known as Puma.","bm25_label":"high","relevance_label":0.0}]