[{"query_id":845790,"passage_id":7866640,"ranking":1,"query_text":"what is the sarkeys foundation","passage_text":"What does Sarkeys Foundation fund? We fund many types of programs in social or humanitarian services, arts and cultural endeavors, education, scientific research and animal welfare. Sarkeys provides funding only to 501(c)(3) type organizations.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":7866647,"ranking":2,"query_text":"what is the sarkeys foundation","passage_text":"Sarkeys Foundation (Oklahoma) Authority Summary Sarkeys is a nonprofit charitable foundation that supports the activities of public charities through direct grants and educational opportunities. Cultural and humanitarian programs of regional significance.","bm25_label":"high","relevance_label":1.0},{"query_id":845790,"passage_id":7866644,"ranking":3,"query_text":"what is the sarkeys foundation","passage_text":"Authority Summary Sarkeys is a nonprofit charitable foundation that supports the activities of public charities through direct grants and educational opportunities. Major areas of support by the Sarkeys Foundation include: Education; Social service and human service needs; and. Cultural and humanitarian programs of regional significance. History of Funding None is available.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":7866642,"ranking":4,"query_text":"what is the sarkeys foundation","passage_text":"Sarkeys is a nonprofit charitable foundation that supports the activities of public charities through. direct grants and educational opportunities. Office hours are 9 a.m. to 5 p.m. Monday through Friday.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":7866645,"ranking":5,"query_text":"what is the sarkeys foundation","passage_text":"The Oklahoman. Advertisement. NORMAN â\u0080\u0094 The trustees of the Sarkeys Foundation recently approved awarding 36 grants to nonprofits in Oklahoma totaling nearly $3.5 million. The largest grants, for $1 million each, will go to the Peggy and Charles Stephenson Cancer Center at the University of Oklahoma and the Oklahoma Medical Research Foundation.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":7866639,"ranking":6,"query_text":"what is the sarkeys foundation","passage_text":"Sarkeys Foundation shared a link. BOARD LEADERSHIP GUIDE THANK YOU Thank you for your interest in BoardEffectâ\u0080\u0099s Board Leadership: Challenges and Trends in the Year Ahead whitepaper! Please click the link below to download the PDF.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":7866641,"ranking":7,"query_text":"what is the sarkeys foundation","passage_text":"If you don't have a Facebook account, you can create one to see more of this Page. Sign UpLog In. See more of Sarkeys Foundation by logging into Facebook. Message this Page, learn about upcoming events and more. If you don't have a Facebook account, you can create one to see more of this Page.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":7866646,"ranking":8,"query_text":"what is the sarkeys foundation","passage_text":"Sarkeys Energy Center. Sarkeys Energy Center is the largest and tallest building on the campus of the University of Oklahoma (OU), Norman, Oklahoma, United States. It houses several academic units mainly centered on the Earth sciences.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":7876359,"ranking":9,"query_text":"what is the sarkeys foundation","passage_text":"From Wikipedia, the free encyclopedia. Oklahoma City University School of Law, also known as OCU Law, is one of the professional graduate schools of Oklahoma City University. OCU Law is located in Oklahoma City, Oklahoma and was founded in 1907. OCU Law was located in the Sarkeys Law Center on the southwest side of the Oklahoma City University campus until Spring 2015, when it moved to a new campus near downtown Oklahoma City.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":85476,"ranking":10,"query_text":"what is the sarkeys foundation","passage_text":"You can build a new house on top of an existing foundation, the real question is should you build on an old foundation. â\u0080¢ What shape is the foundation in? You will have to get a professional to give you a report on what state your existing foundation is in currently.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":567745,"ranking":11,"query_text":"what is the sarkeys foundation","passage_text":"What does The Foundation mean? Definitions for The Foundation Here are all the possible meanings and translations of the word The Foundation.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":6256597,"ranking":12,"query_text":"what is the sarkeys foundation","passage_text":"Topic: Building, What Is. When building a new home, it is vital that you get the foundations right or you might find your home moving, cracking, or even sinking over time. One option for your foundation is raft foundation construction.Hereâ\u0080\u0099s what you need to know. A raft foundation is a type of foundation that spreads the load from a building or structure over a large area.ast Updated: Topic: Building, What Is. When building a new home, it is vital that you get the foundations right or you might find your home moving, cracking, or even sinking over time. One option for your foundation is raft foundation construction. Hereâ\u0080\u0099s what you need to know.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":6256598,"ranking":13,"query_text":"what is the sarkeys foundation","passage_text":"Last Updated: Topic: Building, What Is. When building a new home, it is vital that you get the foundations right or you might find your home moving, cracking, or even sinking over time. One option for your foundation is raft foundation construction. Hereâ\u0080\u0099s what you need to know.A raft foundation is a type of foundation that spreads the load from a building or structure over a large area.ast Updated: Topic: Building, What Is. When building a new home, it is vital that you get the foundations right or you might find your home moving, cracking, or even sinking over time. One option for your foundation is raft foundation construction. Hereâ\u0080\u0099s what you need to know.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":8077583,"ranking":14,"query_text":"what is the sarkeys foundation","passage_text":"1. What is a private foundation? .....2 2. What are the beneï¬\u0081ts of a private foundation? .....2 3. How does a private foundation compare to a donor-advised fund? .....3 II.COMPLIANCE .....4 4.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":567753,"ranking":15,"query_text":"what is the sarkeys foundation","passage_text":"Definition of The Foundation in the Definitions.net dictionary. Meaning of The Foundation. What does The Foundation mean? Information and translations of The Foundation in the most comprehensive dictionary definitions resource on the web.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":6657711,"ranking":16,"query_text":"what is the sarkeys foundation","passage_text":"Looking for online definition of Canine Eye Registry Foundation (CERF) in the Medical Dictionary? Canine Eye Registry Foundation (CERF) explanation free. What is Canine Eye Registry Foundation (CERF)? Meaning of Canine Eye Registry Foundation (CERF) medical term. What does Canine Eye Registry Foundation (CERF) mean? Canine Eye Registry Foundation (CERF) | definition of Canine Eye Registry Foundation (CERF) by Medical dictionary","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":5263137,"ranking":17,"query_text":"what is the sarkeys foundation","passage_text":"http:\/\/www.cof.org\/newsroom\/factsheets\/communityfacts.htm This site is provided by the Council on Foundations and includes the following topics: what is a foundation, starting a foundation, resources for foundations, legal and government affairs, links and networking, and the future of foundations.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":5788791,"ranking":18,"query_text":"what is the sarkeys foundation","passage_text":"Synonyms for The Foundation in Free Thesaurus. Antonyms for The Foundation. 95 synonyms for foundation: basis, heart, root, mainstay, beginning, support, ground, rest, key, principle, fundamental, premise, starting point.... What are synonyms for The Foundation?","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":4883745,"ranking":19,"query_text":"what is the sarkeys foundation","passage_text":"Dior Foundation & Face Makeup. Related Products. What it is: A foundation that offers full, ... What it is: A foundation that offers full, natural-looking coverage with 16 hours of weightless wear.What it does: Highly pigmented and perfectly balanced, this breakthrough formula builds and blends effortlessly with just one drop.","bm25_label":"high","relevance_label":0.0},{"query_id":845790,"passage_id":6786003,"ranking":20,"query_text":"what is the sarkeys foundation","passage_text":"For FOUNDATION we have found 5 definitions. What does FOUNDATION mean? We know 5 definitions for FOUNDATION abbreviation. Possible FOUNDATION meaning as an acronym, abbreviation, shorthand or slang term vary from category to category. Please look for them carefully. FOUNDATION Stands For:","bm25_label":"high","relevance_label":0.0}]