[{"query_id":846082,"passage_id":1639574,"ranking":1,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Golden State Warriors win first NBA title in 40 years â\u0080\u0093 as it happened. Watch as Golden State Warriors fans take to the streets of Oakland to celebrate. 12.00am EDT 00:00 FINAL SCORE: Warriors 105, Cavaliers 97. 11.45pm EDT 23:45 Warriors 98, Cavaliers 85.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":7811174,"ranking":2,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"NBA Playoffs: Warriors vs. Cavaliers Game 4 LIVE SCORE UPDATES, NBA Finals (6\/10\/16) Golden State Warriors at Cleveland Cavaliers. Golden State Warriors guard Stephen Curry (R) defends against Cleveland Cavaliers guard Kyrie Irving (L) during Game 3 of the NBA Finals at Quicken Loans Arena in Cleveland.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":5329548,"ranking":3,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Cavaliers or Warriors? After a seven game series between the Cleveland Cavaliers and the Golden State Warriors, the winner of the 2016 NBA Finals has finally been crowned. It was a super close game the entire time with the score nearly even throughout the all four quarters of the seventh game.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":5948211,"ranking":4,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Breaking News THE CAVS ARE NBA CHAMPS. Final Score: Cleveland Cavaliers defeat the Golden State Warriors 110-99. The Cavaliers get a signature win over the league leading Warriors. Two of the league's hottest teams got together Thursday night for a possible Finals preview, and they did not disappoint. The Warriors have shown that they belong in the championship discussion since the beginning of the year and tonight the Cavaliers showed that they too deserve to be taken seriously.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":2534907,"ranking":5,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Champion Cavs drink it all in after lifting Cleveland's title drought. NBA Finals 2016: Cavaliers vs. Warriors Game 7 TV Schedule, Odds and Predi... What happened the last time Cleveland won a major sports championship. Cleveland Cavaliers vs. Atlanta Hawks: Game 4 score, updates, TV channel,...","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":3184257,"ranking":6,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Cleveland Cavaliers defeat the Golden State Warriors: NBA finals, Game 6 â\u0080\u0093 as it happened! LeBron James scores 41 points in his second straight NBA finals game as the Cleveland Cavaliers defeat the Golden State Warriors 115-101 to force a Game 7. Updated.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":3184251,"ranking":7,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Who Won the NBA Finals 2016? Cavaliers or Warriors? After a seven game series between the Cleveland Cavaliers and the Golden State Warriors, the winner of the 2016 NBA Finals has finally been crowned. It was a super close game the entire time with the score nearly even throughout the all four quarters of the seventh game.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":7811172,"ranking":8,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"NBA Playoffs: Warriors vs. Cavaliers Game 4 LIVE SCORE UPDATES, NBA Finals (6\/10\/16) Golden State Warriors guard Stephen Curry (R) defends against Cleveland Cavaliers guard Kyrie Irving (L) during Game 3 of the NBA Finals at Quicken Loans Arena in Cleveland.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":3405577,"ranking":9,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"What Warriors must do to beat Cavaliers. USA TODAY Sports' Sam Amick and Jeff Zillgitt break down what Golden State will need to do to win the NBA finals. What Warriors must do to beat Cavaliers USA TODAY Sports' Sam Amick and Jeff Zillgitt break down what Golden State will need to do to win the NBA finals. Post to Facebook. What Warriors must do to beat Cavaliers ","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":1596131,"ranking":10,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"NBA Playoffs: Cavaliers vs. Warriors Game 7 LIVE SCORE UPDATES (6\/19\/16) The Cleveland Cavaliers, led by LeBron James and Kyrie Irving, face the Golden State Warriors, led by Stephen Curry and Klay Thompson, in Game 7 of the NBA Finals on Sunday, June 19, 2016, at Oracle Arena in Oakland, California. The winner is the NBA champion. We'll have up-to-the-minute scoring and game statistics throughout the game.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":8453623,"ranking":11,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"james scored 40 points in the cavaliers game 3 nba finals 96 91 victor y over the golden state warriors on tuesday night bringing his three game total to 123 points the most ever scored by a player through the first three games of the finalsames scored 40 points in the cavaliers game 3 nba finals 96 91 victor y over the golden state warriors on tuesday night bringing his three game total to 123 points the most ever scored by a player through the first three games of the finals","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":7811173,"ranking":12,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Warriors vs. Cavaliers 2016 final score: LeBron James forces a Game 7 in a 115-101 win. LeBron James had one of the craziest, most dominant fourth quarters in a Finals game that we perhaps have ever seen. LeBron James forced a Game 7. The Cleveland Cavaliers will play the Golden State Warriors in a winner-take-all final game, but make no mistake, James is the reason why the Cavaliers won 115-101 in Game 6 on Thursday.","bm25_label":"high","relevance_label":1.0},{"query_id":846082,"passage_id":7919561,"ranking":13,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Cavaliers vs. Warriors 2016 final score: LeBron James brings a title back to Cleveland in thrilling Game 7 win. Kyrie Irving hit the shot of the playoffs to lead the Cavaliers to a 93-89 win in Game 7. In the end, it was LeBron James. One of the most dominant individuals in NBA history overcame one of the leagueâ\u0080\u0099s most dominant teams, when the Cleveland Cavaliers shocked the Golden State Warriors on the road in a thrilling 93-89 win in Game 7 to win the NBA Championship, the first in Cavaliers history.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":2609286,"ranking":14,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Shaun Livingston scored 20 points to lead the Golden State Warriors to a 104-89 victory over the Cleveland Cavaliers in Game 1 of the 2016 NBA Finals.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":3556609,"ranking":15,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Warriors: 103. Cavaliers: 82. LIVE BOX SCORE. The Golden State Warriors evened out the series 2-2 much to the disappointment of the Cleveland fans. Cleveland fell to the Warriors in Game 4 by a 21 point deficit, by far the largest difference in score so far in this yearâ\u0080\u0099s NBA Finals. LeBron James and MVP Steph Curry laid low and let their teammates do a lot of the work.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":2600348,"ranking":16,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"For LeBron James and the Cleveland Cavaliers on Tuesday night, it was as easy as 1â\u0080\u00932â\u0080\u00933. James scored 40 points in the Cavaliers' Game 3 NBA Finals 96â\u0080\u009391 victory over the Golden State Warriors on Tuesday night, bringing his three-game total to 123 points, the most ever scored by a player through the first three games of the Finals.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":3556613,"ranking":17,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Cavaliers vs. Warriors final score, 2015 NBA Finals: 3 things we learned as LeBron James carried Cleveland to victory. The Finals are all tied up after a stunning Cleveland win in Game 2. The Cleveland Cavaliers have tied up the 2015 NBA Finals with a stunning 95-93 overtime win over the Golden State Warriors in Game 2 on Sunday night at Oracle Arena.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":3556605,"ranking":18,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Warriors vs. Cavaliers: Live Score and Highlights for 2015 NBA Finals Game 6. By Matthew Schmidt , Featured Columnist Jun 16, 2015. For the first time in 40 years, the Golden State Warriors are NBA champions. Behind 25 points apiece from Stephen Curry and Andre Iguodala, the Warriors topped the Cleveland Cavaliers, 105-97, at Quicken Loans Arena on Tuesday night to win the 2015 NBA Finals, 4-2. Iguodala was named Finals MVP for his masterful performance on both ends of the floor.","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":2609290,"ranking":19,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Team effort fuels Warriors past Cavs in Game 1 (3:18)Steph Curry and Klay Thompson combine for just 20 points, but the rest of the team scores 84 points as the Warriors roll to a 104-89 Game 1 victory over the Cavaliers. (3:18)","bm25_label":"high","relevance_label":0.0},{"query_id":846082,"passage_id":7919556,"ranking":20,"query_text":"what is the score of the cavaliers and the warriors?","passage_text":"Cavaliers vs. Warriors 2016 final score: LeBron James brings a title back to Cleveland in thrilling Game 7 win. By Liam Boylan-Pett ï\u0098\u0091 @liam_bp on Jun 19, 2016, 10:40p 115. Kyrie Irving hit the shot of the playoffs to lead the Cavaliers to a 93-89 win in Game 7.","bm25_label":"high","relevance_label":0.0}]