[{"query_id":861433,"passage_id":8625354,"ranking":1,"query_text":"what is vitamin b3 good for","passage_text":"S unflower seeds and almonds. Fish and prawns. Yeast. Tuna, chicken breast, beef, halibut, and salmon. Other food sources of vitamin B3 include soy sauce, mushrooms, and cantaloupe. Fruits like mangoes and peaches are also good food sources of vitamin B3.sparagus, romaine lettuce, tomatoes, mustard greens, and squash are valuable vitamin B3-rich foods. Green beans, broccoli, and potatoes are also excellent sources of vitamin B3. Good sources of tryptophan such as eggs, cheese, and yogurt are also good sources of vitamin B3.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":2510893,"ranking":2,"query_text":"what is vitamin b3 good for","passage_text":"Highlights. 1  Vitamin B3 is also popularly known as Niacin. 2  Vitamin B3 or Niacin is a water-soluble vitamin. 3  Foods such as fish, nuts and chicken are good sources of this vitamin.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":8625355,"ranking":3,"query_text":"what is vitamin b3 good for","passage_text":"Foods That Contain Vitamin B3. The vitamin B3 we get from food includes preformed niacin and the amino acid tryptophan, which can be converted to niacin in the body. Food composition tables, however, list only preformed niacin.ther good sources of vitamin B3 equivalents, such as milk, actually provide more tryptophan than niacin. Mushrooms and greens are good vegetable sources. Vitamin B3 is also added to enriched breads and cereals to replace that lost during processing.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":8625352,"ranking":4,"query_text":"what is vitamin b3 good for","passage_text":"The best sources of niacin are foods with a high protein content, such as meat, eggs, and peanuts. Other good sources of vitamin B3 equivalents, such as milk, actually provide more tryptophan than niacin.Mushrooms and greens are good vegetable sources.Vitamin B3 is also added to enriched breads and cereals to replace that lost during processing.ther good sources of vitamin B3 equivalents, such as milk, actually provide more tryptophan than niacin. Mushrooms and greens are good vegetable sources. Vitamin B3 is also added to enriched breads and cereals to replace that lost during processing.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":693361,"ranking":5,"query_text":"what is vitamin b3 good for","passage_text":"The best sources of niacin are foods with a high protein content, such as meat, eggs, and peanuts. Other good sources of vitamin B3 equivalents, such as milk, actually provide more tryptophan than niacin.Mushrooms and greens are good vegetable sources.oods That Contain Vitamin B3. The vitamin B3 we get from food includes preformed niacin and the amino acid tryptophan, which can be converted to niacin in the body.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":830013,"ranking":6,"query_text":"what is vitamin b3 good for","passage_text":"What vitamins are good for hair growth and thickness? Vitamin B7 (Biotin), Vitamin C and Vitamin B3 (Niacin) are 3 of the most important vitamins for thicker fuller hair. Learn why these are 3 key vitamins that make hair thicker, and what foods or hair growth supplements provide these essential hair vitamins for growth and thickness. Top Vitamins for Thicker Fuller Hair.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":7910308,"ranking":7,"query_text":"what is vitamin b3 good for","passage_text":"What is B Complex Good For. 1  Benefits of Vitamin B1: Thiamine. 2  Benefits of Vitamin B2: Riboflavin. 3  Benefits of Vitamin B3: Niacin.  Benefits of Vitamin B5: Pantothenic 1  Acid. Benefits of Vitamin B6: Pyridoxine.  Benefits of Vitamin B7: 1  Biotin. Benefits of Vitamin B9: Folate.  Benefits of Vitamin B12: Cobalamin.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":2447134,"ranking":8,"query_text":"what is vitamin b3 good for","passage_text":"niacin is also known as vitamin b3 one of the b complex vitamins vitamins help to support the body s ability to make and break down natural compounds metabolism needed for good health niacinamide nicotinamide is a different form of vitamin b3 and does not work the same as niacin","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":7910307,"ranking":9,"query_text":"what is vitamin b3 good for","passage_text":"Benefits of Vitamin B3: Niacin. One of the best benefits of vitamin B3 is that it can help boost your HDL cholesterol â\u0080\u0093 your good cholesterol. The higher your HDL is, the lower your bad cholesterol count will be. Though B3 deficiency is relatively rare in development countries, it is common among alcoholics.","bm25_label":"high","relevance_label":1.0},{"query_id":861433,"passage_id":7646539,"ranking":10,"query_text":"what is vitamin b3 good for","passage_text":"Deficiency of this natural supplement can cause depression, anxiety and fatigue. 4. Vitamin B3. Vitamin B3, otherwise known as niacin, is another good natural supplement for depression. Deficiency in niacin produces anxiety along with fatigue and overall slowness.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":5929962,"ranking":11,"query_text":"what is vitamin b3 good for","passage_text":"Cantaloupe scores an excellent for both vitamin C and vitamin A (in the form of carotenoids). It scores very good for potassium, and good for a host of B vitamins (B1, B3, B6, and folate) as well as vitamin K, magnesium, and fiber.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":4529449,"ranking":12,"query_text":"what is vitamin b3 good for","passage_text":"Fuel your body with this form of Vitamin B3 by Lisa Freedman Where it comes from: Niacin is a form of Vitamin B3 and is found in many good-for-you foods such as yeast, meat, fish, milk, eggs, green vegetables, beans and cereal grains.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":8407628,"ranking":13,"query_text":"what is vitamin b3 good for","passage_text":"The most important benefit of niacin or vitamin B3 is its ability to lower cholesterol levels and control them. Vitamin B3, also known as niacin, releases energy into the bodyâ\u0080\u0099s cells, but niacin is primarily used to lower high cholesterol levels. You may get Vitamin B3 in supplement stores, but it is always sensible to buy niacin when specifically instructed by a doctor. Foods such as fish, nuts, dried grains, liver, chicken, lean red meat, whole grains, enriched refined grains and dried beans are good sources of vitamin B3.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":1233707,"ranking":14,"query_text":"what is vitamin b3 good for","passage_text":"Niacin\/vitamin B3. Niacin or vitamin B3 helps produce energy from foods and is essential to our nervous systems and digestion. You should be able to get all the niacin\/B3 you need from your diet. Good sources of niacin include: meat, fish, wheat flour, maize flour, eggs and milk.ou should be able to get all the vitamin A you need from your diet. Good food sources include cheese, eggs, yoghurt and fortified low-fat spreads. Daily requirements: 0.7mg a day for men.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":1669573,"ranking":15,"query_text":"what is vitamin b3 good for","passage_text":"Niacin \/ Vitamin B3. Vitamin B3 is also known as niacin or nicotinic acid. Niacin has important benefits, as it helps to rid the body of toxic chemicals and it is crucial for the healthy function of numerous enzymes in the body. It promotes good digestion and healthy skin and helps protect the pancreas.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":8828734,"ranking":16,"query_text":"what is vitamin b3 good for","passage_text":"One of these is vitamin B3, which comes in the form of either niacin or niacinamide. While vitamin B3 does share some characteristics with the other B vitamins, it also has several unique properties. This article explores the uses, side effects and sources of niacin and niacinamide, as well as how much of this vitamin is recommended for individuals. What Does Vitamin B3 Do? Just like the other B vitamins, niacin and niacinamide are needed by the body in order to convert food into energy.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":3396598,"ranking":17,"query_text":"what is vitamin b3 good for","passage_text":"Niacin\/vitamin B3. Niacin or vitamin B3 helps produce energy from foods and is essential to our nervous systems and digestion. You should be able to get all the niacin\/B3 you need from your diet. Good sources of niacin include: meat, fish, wheat flour, maize flour, eggs and milk.itamin A helps maintain a healthy immunity immune system, vision and skin. You should be able to get all the vitamin A you need from your diet. Good food sources include cheese, eggs, yoghurt and fortified low-fat spreads.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":7598614,"ranking":18,"query_text":"what is vitamin b3 good for","passage_text":"Anchovies are rich in heart healthy nutrients. They contain very good amount of Omega 3 fatty acids, potassium and Vitamin A. Also, they are strong source of protein. In addition, anchovies are a wonderful source of calcium, selenium and Vitamin D. Anchovies do provide small amount of Vitamin B3 or niacin as well.hey contain very good amount of Omega 3 fatty acids, potassium and Vitamin A. Also, they are strong source of protein. In addition, anchovies are a wonderful source of calcium, selenium and Vitamin D. Anchovies do provide small amount of Vitamin B3 or niacin as well.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":1327122,"ranking":19,"query_text":"what is vitamin b3 good for","passage_text":"1 What Is Vitamin B3? 2  Vitamin B3, or niacin, works with other b-complex vitamins to metabolize food and provide energy for the body. 3  Niacin was first discovered by researchers looking for a link between diet and the disease pellagra. Foods That Contain Vitamin B3 Niacin is found in foods with a high protein content, such as meat, eggs, and peanuts. 2  It can also be found in milk, mushrooms, and greens. 3  Niacin is added to enriched breads and cereals.","bm25_label":"high","relevance_label":0.0},{"query_id":861433,"passage_id":7910304,"ranking":20,"query_text":"what is vitamin b3 good for","passage_text":"Fuel your body with this form of Vitamin B3. Where it comes from: Niacin is a form of Vitamin B3 and is found in many good-for-you foods such as yeast, meat, fish, milk, eggs, green vegetables, beans and cereal grains. Niacin (nicotinic acid) also comes in prescription form and as dietary supplements.","bm25_label":"high","relevance_label":0.0}]