[{"query_id":866251,"passage_id":7810605,"ranking":1,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"The Franklin Park Zoo officially opened to the public on October 4, 1912 (although most sources say 1913). According to plans by Arthur A. Shurtleff, the new zoo represented a major departure from Olmsted's original plans, and included more exotic animals.","bm25_label":"high","relevance_label":1.0},{"query_id":866251,"passage_id":7810606,"ranking":2,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Established in 1912. Franklin Park Zoo is a 72-acre site, nestled in Boston's historic Franklin Park. Long considered the crown jewel of Frederick Law Olmsted's Emerald Necklace Park System, the Zoo opened in 1912.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":7810608,"ranking":3,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"From Wikipedia, the free encyclopedia. The Franklin Park Zoo is a 72 acres (290,000 m2) zoo located in Boston, Massachusetts. It is currently operated by Zoo New England, which also operates the Stone Zoo in Stoneham, Massachusetts. The zoo is located in the northeast portion of Franklin Park, Boston's largest park and the last component of the city's famed Emerald Necklace. The zoo was opened to the public in 1912, and managed by the City of Boston until 1958, when the Metropolitan District Commission (MDC) took control.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":7810601,"ranking":4,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Franklin Park Zoo is a fun place to go because there is a ton of activities to do if you're bringing children. The activities may vary but if you look closely you can find different animal footprints to follow along the sidewalks.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":2959419,"ranking":5,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"What Is a Zoo Veterinarian? Zoo veterinarians work with exotic animals, such as tigers, polar bears, elephants, snakes, flamingos and giraffes, in a zoo or wild animal park setting. Just like other veterinarians, zoo veterinarians examine these different animals to diagnose and treat any issues they may be having.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":7810607,"ranking":6,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Franklin Park Zoo. Walk on the wild side, craft beer in hand, at Franklin Park Zoo's seventh annual Brew at the Zoo. Visit pygmy hippos, ring-tailed lemurs, western lowland gorillas along with kangaroos, giraffes, zebras and more. Nearly the entire zoo will be open for this event, so be sure not to miss the Aussie Aviary, a free-flight walk through experience with a variety of colorful budgies.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":7810602,"ranking":7,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Please note: â\u0080¢ On Free Fun Friday, August 26, Franklin Park Zoo will close at 4:00 p.m., with the last admission at 3:30 p.m. â\u0080¢ On Saturday, August 20, Franklin Park Zoo will close at 1:00 p.m., with the last admission at 12:30 p.m., in preparation for Brew at the Zoo. x. About Us.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":412211,"ranking":8,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Many of the Zoos have them, but often they are only with a few of the animals. The Zoo has done alot of updating their site and park trying to compete with some of the larger Zoos. From what I could find out this Zoo also claims to be the oldest formal Zoo in the US.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":2463605,"ranking":9,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Ozarks Zoos and Animal Parks. Springfield, MO has the only zoo in the area, but there are several tiger refuges and a number of drive through wild animal parks in the region. Butterfly palace and aquarium, too! More detailed information can be found on the regional search pages. Springfield Zoos and Animal Parks.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":3132829,"ranking":10,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"The Best Zoos in the United States. A list of zoos in United States, with photos! Whether they be petting zoos or wild animal parks, American zoos are a great family destination when traveling. A zoological park is a location where animals are kept in captivity for study and viewing.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":3646146,"ranking":11,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Zoo Details. Plumpton Park Zoo is a zoo located in Zip Code 48162, MI. It first opened in 1734. The Plumpton Park Zoo has an area of 673 acres in order to house all of its animals. Inside Plumpton Park Zoo, there are 130 animals and 44 different species. About 125,000 visitors are attracted to the zoo each year, which is a relatively low number of annual visitors compared to other zoos.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":3188821,"ranking":12,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"The Henry Doorly Zoo and Aquarium is a zoo in Omaha, Nebraska. The zoo has been developed from what was once the Riverview Park Zoo, which was built in 1864, and now sprawls over 130 acres. Home to 962 different species of animals, this zoo is notable for housing the largest cat complex in North America.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":6340257,"ranking":13,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"There are seven chapters in the book. One for each of the zoos located in New York City, one for the Aquarium and a chapter that will show the children's zoos. The Central Park Zoo, The Bronx Zoo, The Prospect Park Zoo and the Staten Island Zoo all began as a collection of animals in the local park.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":3296426,"ranking":14,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Columbian Park Zoo The Columbian Park Zoo is a zoo located in Lafayette, Indiana at Columbian Park. The zoo is home to more than 190 animals from over 90 species. The zoo is in Columbian Park, which also includes playgrounds, picnic areas, a walking trail, and a baseball stadium. Admission to the zoo is free.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":6531217,"ranking":15,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Wild Animal Adventures: Denmark's Best Zoos and Wildlife Parks. Walk on the wild side in zoos, wildlife and safari parks across Denmark. You can get up close to some of your favourite exotic animals at a number of big, wild animal destinations, such as Knuthenborg Safari Park and Aalborg Zoo. See Siku, Denmark's adorable polar bear cub or wonder at the new elephant house at Copenhagen Zoo.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":2887950,"ranking":16,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Turtle Back Zoo. Housing nearly 700 animals, Turtle Back Zoo is located in West Orange, New Jersey. The zoo is actually a part of the Essex County Park System, which is considered as the oldest county park in the US. The zoo originally features animals that are indigenous to New Jersey.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":4948503,"ranking":17,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"The animals behave as if it were night, and zoo visitors can see them. Zoos are also showing more kinds of animals. Many zoos now include insects, spiders, crustaceans (lobsters, for example), and other invertebrates (animals without backbones) in their exhibits.nimal Diets. More kinds of food are probably served in a zoo than in most restaurants. To feed their livestock, zoos are always buying large quantities of grain, fruit, vegetables, meat, fish, and other foods. Many zoo visitors enjoy seeing animals fed.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":6630695,"ranking":18,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"When you see animals at Woodland Park Zoo, you help save wildlife. That's because a portion of every dollar you spend at Woodland Park Zoo supports animal conservation projects in the Northwest and around the world. Woodland Park Zoo is located just 10 minutes north of downtown Seattle, Washington, in the Phinney Ridge neighborhood. The zoo's 92-acres and award-winning exhibits are home to more than 1,000 animals representing 300 species from around the world.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":3124006,"ranking":19,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"Save this Post. Weather in San Diego Late October early November. May 13, 2008, 11:47 AM. Hi! We are thinking of going to San Diego late October or early November. Family of 4. We are thinking of going to Sea World and maybe either the Zoo or Wild Animal Park. What is the weather like during that time and also which park might be better the Zoo or the Wild Animal Park? Thank you for your help.","bm25_label":"high","relevance_label":0.0},{"query_id":866251,"passage_id":2887944,"ranking":20,"query_text":"what kind of animals are at the franklin park zoo","passage_text":"The zoo is actually a part of the Essex County Park System, which is considered as the oldest county park in the US. The zoo originally features animals that are indigenous to New Jersey. Today, however, it features animals from different continents except Antarctica. Turtle Back Zoo has many exhibits.","bm25_label":"high","relevance_label":0.0}]