[{"query_id":866428,"passage_id":3482020,"ranking":1,"query_text":"what kind of battery does a boat take","passage_text":"This is the information on the boat I own (yes I own it). The battery broke and I need to know what kind of battery I need to purchase. It's made in 1999.It's a Rinker 182 B\/R.It's 18 feet 5 inches long. The power is inboard (whatever that means)..0 L MerCruiser. I don't know if that's all the information you need but I need to know what kind of battery I need for this boat model. Thank you and suggestions and guesses on the type of battery I might need would be greatly appreciated. Thank you.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":3706060,"ranking":2,"query_text":"what kind of battery does a boat take","passage_text":"What kind of batteries does Blink use? Are they easy to replace? Blink cameras are powered by two non-rechargeable AA Lithium batteries. All cameras will ship with batteries, and theyâ\u0080\u0099re easy to replace when the time comes; simply slide open the battery compartment, take out the old batteries, and insert the new set. Blink camera batteries should be replaced by Energizer Ultimate Lithium AA batteries or the equivalent.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":3389454,"ranking":3,"query_text":"what kind of battery does a boat take","passage_text":"What kind of battery would my Golf Cart take if...? it&#39;s a 1998 Club Car... It has a gas engine. I just got it, and I&#39;ve got a lot of fixing up to do. It doesn&#39;t have a battery in it and I don&#39;t have a clue what kind of battery it would take. Source(s): kind battery golf cart if: https:\/\/tr.im\/xyPih.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":3198405,"ranking":4,"query_text":"what kind of battery does a boat take","passage_text":"What kind of battery would my Golf Cart take if...? it&#39;s a 1998 Club Car... It has a gas engine. I just got it, and I&#39;ve got a lot of fixing up to do. It doesn&#39;t have a battery in it and I don&#39;t have a clue what kind of battery it would take. Look online for the manual for the golf cart and see what they have to say for what battery to use.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":5443828,"ranking":5,"query_text":"what kind of battery does a boat take","passage_text":"Re: Is a small inflatable boat practical for ocean beach landings? Missing paint or a metal part in contact with salt water DOES make a battery & a electrometal plater. Freshwater has same problemsbut it takes much longer. We are talking about boats put in for a season or year round.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":7915991,"ranking":6,"query_text":"what kind of battery does a boat take","passage_text":"Boat Battery Buying Guide. Selecting a new 12-volt marine battery for your boat can be a daunting task for first-time buyers. You may be asking questions like What type of battery is used for a trolling motor? or, What is a deep cycle battery?.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":3361886,"ranking":7,"query_text":"what kind of battery does a boat take","passage_text":"What kind of batteries does my Arlo Wire-Free camera use? Your Arlo Wire-Free camera uses four CR123 lithium 3-volt photo batteries. These batteries are available at retail stores and at online stores that specialize in battery sales.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":2810880,"ranking":8,"query_text":"what kind of battery does a boat take","passage_text":"Posted July 05 2008 - 10:06 AM. Talking about Jaws at work the other day and the disscussion turned to what a nice boat Hooper had with all that fancy gear Does anybody know what kind of boat it was? what make ? I say it was a 28' Pacemaker others disagree What say you guys?","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":5973450,"ranking":9,"query_text":"what kind of battery does a boat take","passage_text":"It is a new kind of battery from the house of VMAX. It is a 12 volt battery with 100 Ah as rate of ampere. It also comes with deep cycle, SLA and AGM technology. It is best for the boats having a trolling motor of 40-100lb of thrust. It is considered to be a group 27 type of battery.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":3389450,"ranking":10,"query_text":"what kind of battery does a boat take","passage_text":"it's a 1998 Club Car... It has a gas engine. I just got it, and I've got a lot of fixing up to do. It doesn't have a battery in it and I don't have a clue what kind of battery it would take.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":8335712,"ranking":11,"query_text":"what kind of battery does a boat take","passage_text":"Many boat owners replace their lead-acid batteries every couple of seasons because they unknowingly kill them. Improper charging must rank as the number one cause of early battery death. With the right kind of battery, properly charged, you could get ten years of use.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":1175057,"ranking":12,"query_text":"what kind of battery does a boat take","passage_text":"what is included in phase i of casualty assistance ssd1 - draw with jazza easy anatomy pdf - what kind of tide does the observer experience when he is between tidal bulges - what kind of energy is stored in a flashlight battery and enables it to function - that violence can never lead to peace is a deontological reason supporting pacifism - in a ...","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":3032002,"ranking":13,"query_text":"what kind of battery does a boat take","passage_text":"The trolling motor is probably worth 100 dollars, the battery is worth 50, the trailer is worth 300, and the boat I would say 400.The package is worth around 850. As a package deal I would say 800 dollars. I would put on cl for 800 and take what makes you happy.he trolling motor is probably worth 100 dollars, the battery is worth 50, the trailer is worth 300, and the boat I would say 400. The package is worth around 850.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":8320099,"ranking":14,"query_text":"what kind of battery does a boat take","passage_text":"Deep cycle batteries, also called lead-acid batteries, are what many people use in their recreational vehicles, such as a camper or boat.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":8160495,"ranking":15,"query_text":"what kind of battery does a boat take","passage_text":"So, taking your question of What does 53Whr mean in terms of battery life for a new laptop?, we can answer that in terms of how long the battery charge will last because all batteries fundamentally suppy x amount of current for x amount of time regardless of what the battery voltage is.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":4622787,"ranking":16,"query_text":"what kind of battery does a boat take","passage_text":"What kind of oil does a honda 50 dirtbike take. kgb answers Â» Home & Garden Â» Automotive Â» What kind of oil does a honda 50 dirtbike take. A Honda 50cc dirt bike takes single cylinder 2-stroke engine oil.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":6843938,"ranking":17,"query_text":"what kind of battery does a boat take","passage_text":"What Kind of Battery Does a Tesla Roadster Use? The Tesla Roadster is one of the world's highest performing electric cars, with an ability to go from 0 to 60 miles per hour in under 4 seconds. To power the vehicle, Tesla uses a next-generation lithium-ion battery system.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":6831786,"ranking":18,"query_text":"what kind of battery does a boat take","passage_text":"It is a fact that you do not have to buy a new battery for your boat, once you battery does not give you satisfactory service or the original battery has started to fall. The reconditioning of the deep cycle batteries is quite easy and even you can embark on the DIY project.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":1916174,"ranking":19,"query_text":"what kind of battery does a boat take","passage_text":"What does this mean? If you think of your boat and motor as your car, then think of the BluVis display as your dashboard behind the wheel. The BluVis Multi-Function display shows your direction (forward or reverse), precise speed settings at one of ten levels, and battery voltage levels.","bm25_label":"medium","relevance_label":0.0},{"query_id":866428,"passage_id":5857873,"ranking":20,"query_text":"what kind of battery does a boat take","passage_text":"What Bluetooth devices do you support with the Nomad? What version of Linux does the Nomad support? What devices do you support with the Nomad's USB host port? How long does the Nomad battery take to charge from a completely discharged state? How long can I expect my battery to last on the Nomad?","bm25_label":"medium","relevance_label":0.0}]