[{"query_id":878959,"passage_id":4191734,"ranking":1,"query_text":"what moon phases makes neap tides","passage_text":"Watch this animation and then draw a diagram of a spring tide and a neap tide in the space below. during spring tides. during neap tides. tides. Label the moon phases. to show the relationship of the Sun, Earth and moon. tides. Label the moon phases.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":5413435,"ranking":2,"query_text":"what moon phases makes neap tides","passage_text":"Tides are cause by the gravitational pull of the Moon and the Sun.   Spring tides are when the Moon and the Sun are perfectly aligned,  in line, which gives a higher tide â\u0080¦ . Neap tide is when the Sun and  the Moon are as poorly aligned as possible, making a weaker tide.pring tides occur during the full moon and the new moon. Neap Tides During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":5413439,"ranking":3,"query_text":"what moon phases makes neap tides","passage_text":"Spring tides occur during the full moon and the new moon. Neap Tides During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide.Neap tides are especially weak tides.pring tides occur during the full moon and the new moon. Neap Tides During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":8251456,"ranking":4,"query_text":"what moon phases makes neap tides","passage_text":"Spring tides occur during the full moon and the new moon. Neap Tides. During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide. Neap tides are especially weak tides.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":4941631,"ranking":5,"query_text":"what moon phases makes neap tides","passage_text":"Spring Tides occur during two phases, full and new moon. This is because the moon earth and sun are aligned during both of these phases. It is opposite during neap tide, in wh â\u0080¦ ich the moon and sun meet at a right angle on earth, which means the moon during neap tide is at the first or third (last) quarter phase.igh tides are the biggest when the moon is Full or when the moon is a New Moon. The gravitational pull of the Moon is greatest at these phases which makes a bigger bulge in t â\u0080¦ he ocean causing high tide. But it also depends on the time of year when the tides are low or high.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":7236359,"ranking":6,"query_text":"what moon phases makes neap tides","passage_text":"Spring tides are the most drastic, while neap tides are comparatively small. Spring tides occur at new and full moons. During new and full moon, the Earth, moon, and sun form a straight line. The resultant gravitational force exerted on Earth's water is strongest at these moments. Neap tides occur during the quarter phases of the moon. During these phases, the sun and moon are at a right angle, with the Earth at the angle's vertex. During a neap tide, the sun's gravity lessens the overall effect of the moon on the water.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":1898142,"ranking":7,"query_text":"what moon phases makes neap tides","passage_text":"Neap Tides During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide. Neap tides are especially weak tides. They occur when the gravitational forces of the Moon and the Sun are perpendicular to one another (with respect to the Earth). Neap tides occur during quarter moons.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":2166974,"ranking":8,"query_text":"what moon phases makes neap tides","passage_text":"Spring Tides occur during two phases, full and new moon. This is because the moon earth and sun are aligned during both of these phases. It is opposite during neap tide, in whâ\u0080¦ich the moon and sun meet at a right angle on earth, which means the moon during neap tide is at the first or third (last) quarter phase.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":4115202,"ranking":9,"query_text":"what moon phases makes neap tides","passage_text":"Neap Tides. During the moon's quarter phases, the sun pulls against the moon's gravitational pull instead of with it. During these tides, the result is the lowest high tide and the highest low tide -- in other words, the least extreme difference between high and low tides. This is called a neap tide.he phases of the moon also affect tides. When the moon is at its full or new moon phase, high tides are at their highest, while low tides are lower than usual. Called spring tides, these tides occur when the sun, moon and the Earth all line up.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":8741895,"ranking":10,"query_text":"what moon phases makes neap tides","passage_text":"During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide. Neap tides are especially weak tides.They occur when the gravitational forces of the Moon and the Sun are perpendicular to one another (with respect to the Earth). Neap tides occur during quarter moons.he result is a smaller difference between high and low tides and is known as a neap tide. Neap tides are especially weak tides. They occur when the gravitational forces of the Moon and the Sun are perpendicular to one another (with respect to the Earth). Neap tides occur during quarter moons.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":4266786,"ranking":11,"query_text":"what moon phases makes neap tides","passage_text":"Neap tides occur when the sun and moon are at right angles to each other (First Quarter & Last Quarter moon phases). Neap tides are less dramatic than regular tides. Neap ti â\u0080¦ des occur twice per lunar period.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":5516076,"ranking":12,"query_text":"what moon phases makes neap tides","passage_text":"Neap tides are tides that occur when the moon and sun are at right angles to the earth's orbit, and the tidal range between high and low tide is at its minimum. The neap tides occur when the moon is in its first and last quarter phases.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":4833242,"ranking":13,"query_text":"what moon phases makes neap tides","passage_text":"Spring tides are especially strong tides (they do not have anything to do with the season Spring). They occur when the Earth, the Sun, and the Moon are in a line. The gravitational forces of the Moon and the Sun both contribute to the tides. Spring tides occur during the full moon and the new moon. Neap Tides. During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide. Neap tides are especially weak tides.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":7753843,"ranking":14,"query_text":"what moon phases makes neap tides","passage_text":"This very high tide occurs when the moon is both unusually close to the Earth (at its closest perigee, called the proxigee) and in the New Moon phase (when the Moon is between the Sun and the Earth). The proxigean spring tide occurs at most once every 1.5 years. Neap Tides. Neap tides are especially weak tides.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":3414924,"ranking":15,"query_text":"what moon phases makes neap tides","passage_text":"One thing I shall do is relate the tides to the position and phases of the moon. The phases of the moon are shown on many calendars. Spring tides are associtated with new and full moons, while neap tides are associated with the quarters. These principal phases are about a week apart.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":7091692,"ranking":16,"query_text":"what moon phases makes neap tides","passage_text":"During spring tides you will notice higher and\/or lower tides than normal. When the earth, sun and moon form right angles (occurs when the moon is at the first quarter or last quarter phase) to each other they form tides called NEAP TIDES. Neap tides are generally weak tides.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":3150483,"ranking":17,"query_text":"what moon phases makes neap tides","passage_text":"What are neap tides? Thereâ\u0080\u0099s about a seven-day interval between spring tides and neap tides, when the tideâ\u0080\u0099s range is at its minimum. Neap tides occur halfway between each new and full moon â\u0080\u0093 at the first quarter and last quarter moon phase â\u0080\u0093 when the sun and moon are at right angles as seen from Earth. Then the sunâ\u0080\u0099s gravity is working against the gravity of the moon, as the moon pulls on the sea. Neap tides happen approximately twice a month, once around first quarter moon and once around last quarter moon. Earth has two tidal bulges, one on the side of Earth nearest the moon (where the moonâ\u0080\u0099s gravity pulls hardest), and the other on the side of Earth farthest from the moon (where the moonâ\u0080\u0099s gravity pulls least).","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":4941630,"ranking":18,"query_text":"what moon phases makes neap tides","passage_text":"Spring Tides occur during two phases, full and new moon. This is because the moon earth and sun are aligned during both of these phases. It is opposite during neap tide, in wh â\u0080¦ ich the moon and sun meet at a right angle on earth, which means the moon during neap tide is at the first or third (last) quarter phase.hen the moon is half, the high tides happen at noon and midnight.    The sun causes tides, too, but the effect is smaller. The highest of the high tides happen during full moons and new moons, when the tidal effects from the sun and moon are parallel.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":3480131,"ranking":19,"query_text":"what moon phases makes neap tides","passage_text":"Spring Tides. When the moon is full or new, the gravitational pull of the moon and sun are combined. At these times, the high tides are very high and the low tides are very low. This is known as a spring high tide. Spring tides are especially strong tides (they do not have anything to do with the season Spring). They occur when the Earth, the Sun, and the Moon are in a line. The gravitational forces of the Moon and the Sun both contribute to the tides. Spring tides occur during the full moon and the new moon. Neap Tides. During the moon's quarter phases the sun and moon work at right angles, causing the bulges to cancel each other. The result is a smaller difference between high and low tides and is known as a neap tide. Neap tides are especially weak tides.","bm25_label":"medium","relevance_label":0.0},{"query_id":878959,"passage_id":3480132,"ranking":20,"query_text":"what moon phases makes neap tides","passage_text":"Spring tides (the bigger ones) occur every full moon and new moon. Neap tides (weaker ones) occur every 1st and 3rd quarter moons. There is approximately 28 days in one lunar â\u0080¦cycle, which consists of one of all mentioned moon phases - therefore, spring tides occur every 2 weeks, and neap tides occur every 2 weeks.","bm25_label":"medium","relevance_label":0.0}]