[{"query_id":880527,"passage_id":3408243,"ranking":1,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez life and biography. Aaron Hernandez biography. Aaron Hernandez is an American football tight end for the New England Patriots of the National Football League. Aaron Hernandez was drafted by the New England Patriots in the fourth round (113th overall) of the 2010 NFL Draft.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":3408241,"ranking":2,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez. Aaron Josef Hernandez (born November 6, 1989) is a former American football tight end and convicted murderer. Hernandez played college football for the University of Florida, where he was a member of a BCS National Championship team and was recognized as an All-American.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":3408246,"ranking":3,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez Net Worth is $8 Million. Aaron Hernandez Salary is $1.3 Million. Aaron Hernandez is American football player. Aaron Hernandez Date of Birth is 1989-11-06. Aaron Hernandez Nickname is Chico. Aaron Hernandez Height is 1.85 m. Aaron Hernandez Weight is 111.13. Aaron Hernandez Country is Bristol.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":6987268,"ranking":4,"query_text":"what nationality is aaron hernandez","passage_text":"Related searches: Odin Lloyd, Hernandez, Aaron Hernandez Daughter, Shayanna Jenkins, John 3:16, John 3 16, Aaron Hernandez News, Aaron Hernandez found dead, Aaron Hernandez Dead, Aaron Hernandez Suicide, Aaron Hernandez Murdered Who, Jose Baez, Hernandez Death, New England Patriots.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":1818499,"ranking":5,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez. Aaron Josef Hernandez (born November 6, 1989) is a former American football tight end and convicted murderer. Hernandez played college football for the University of Florida, where he was a member of a BCS National Championship team and was recognized as an All-American. He was drafted by the New England Patriots as the 15th pick in the fourth round of the 2010 NFL Draft.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":2964984,"ranking":6,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez. Aaron Josef Hernandez (November 6, 1989 â\u0080\u0093 April 19, 2017) was an American football tight end in the National Football League (NFL). A productive player during his three seasons with the New England Patriots, his career came to an abrupt end after his arrest for the murder of Odin Lloyd.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":2964991,"ranking":7,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez. Aaron Josef Hernandez[A] (November 6, 1989 â\u0080\u0093 April 19, 2017)[4] was an American football tight end in the National Football League (NFL). A productive player during his three seasons with the New England Patriots, his career came to an abrupt end after his arrest for the murder of Odin Lloyd.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":5514975,"ranking":8,"query_text":"what nationality is aaron hernandez","passage_text":"Photos: What jail life will be like for Aaron Hernandez in Souza prison. After officials process former NFL player Aaron Hernandez, he will serve his life sentence without parole at the Souza-Baranowski Correctional Center in Shirley, about 40 miles outside downtown Boston.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":2964982,"ranking":9,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez was born on November 6, 1989 in Bristol, Connecticut, USA as Aaron Josef Hernandez. He died on April 19, 2017 in Leominster, ...","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":3408240,"ranking":10,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez was born in Bristol, Connecticut, to Dennis Hernandez, who was of Puerto Rican descent, and Terri Valentine-Hernandez, who is of Italian descent. Dennis died from complications from hernia surgery in January 2006, when Aaron was 16.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":2964987,"ranking":11,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Josef Hernandez was born in Bristol, Connecticut, the son of Dennis Hernandez, of Puerto Rican descent; and Terri Valentine-Hernandez, of Italian descent. He had a brother Dennis, Jr., known as D.J. Their father Dennis died in January 2006 from complications from hernia surgery, when Aaron Hernandez was 16.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":3555728,"ranking":12,"query_text":"what nationality is aaron hernandez","passage_text":"A look at key moments for former NFL star Aaron Hernandez. Key dates in the case of Aaron Hernandez: â\u0080\u0094 June 8, 2010: Hernandez, a standout tight end drafted from the University of Florida, signs a four-year contract with the New England ...","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":1524171,"ranking":13,"query_text":"what nationality is aaron hernandez","passage_text":"4 photos: What jail life will be like for Aaron Hernandez in Souza prison. This is how Hernandez will get chow. A corrections officer hands an inmate his meal through a small opening between the mess hall and the kitchen at Souza-Baranowski.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":5514972,"ranking":14,"query_text":"what nationality is aaron hernandez","passage_text":"Photos: What jail life will be like for Aaron Hernandez in Souza prison. This is how Hernandez, convicted of first-degree murder, is likely to be handled by guards inside prison. Corrections officers move an inmate in leg shackles and handcuffs at Souza-Baranowski.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":2964985,"ranking":15,"query_text":"what nationality is aaron hernandez","passage_text":"Mini Bio (1) Aaron Hernandez was born on November 6, 1989 in Bristol, Connecticut, USA as Aaron Josef Hernandez. He died on April 19, 2017 in Leominster, Massachusetts, USA. Trade Mark (1)","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":7812373,"ranking":16,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Josef Hernandez (born November 6, 1989) is a former American football tight end and convicted murderer. Hernandez played college football for the University of Florida, where he was a member of a BCS National Championship team and was recognized as an All-American. He was drafted by the New England Patriots in the fourth round of the 2010 NFL Draft.","bm25_label":"high","relevance_label":1.0},{"query_id":880527,"passage_id":5136034,"ranking":17,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez Indicted On First-Degree Murder, Faces Life In Prison. Former New England Patriots NFL football tight end Aaron Hernandez, left, appears at Attleboro District Court on Wednesday, July 24, 2013, in Attleboro, Mass. Hernandez has pleaded not guilty to murder in the death of Odin Lloyd.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":2964988,"ranking":18,"query_text":"what nationality is aaron hernandez","passage_text":"Aaron Hernandez Claims He Got His â\u0080\u0098Characterâ\u0080\u0099 From His Mother Upon signing his massive 5-year contract extension with the Patriots in April 2012, worth over $40 million, Aaron Hernandez told The Boston Globe:","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":1524169,"ranking":19,"query_text":"what nationality is aaron hernandez","passage_text":"View gallery. Aaron Hernandez listens as prosecution witness Alexander Bradley testifies against him. (REUTERS) FALL RIVER, Mass. â\u0080\u0093 Late Wednesday afternoon a Bristol County jury decided to break off deliberations in the Aaron Hernandez murder trial for the day.","bm25_label":"high","relevance_label":0.0},{"query_id":880527,"passage_id":1818506,"ranking":20,"query_text":"what nationality is aaron hernandez","passage_text":"You have successfully emailed the post. Tim Tebow Was Aaron Hernandez's 'Life Instructor' In College. One of the more surprising parts of Rolling Stone's big feature on Aaron Hernandez is how much support the coaches at the University of Florida tried to give him in college.","bm25_label":"high","relevance_label":0.0}]