[{"query_id":881695,"passage_id":7755683,"ranking":1,"query_text":"what network is pickles on cartoon","passage_text":"Cartoon Network's Pickle Farmer Badge Game advertisement. Pickle Farmer is a game mentioned and played by both Dante and the most of the Football team. It's a game where you farm pickles. It's also a badge game on Cartoon Network.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":7755686,"ranking":2,"query_text":"what network is pickles on cartoon","passage_text":"He is also the Pickle Farmer in the Cartoon Network game. He became a guide for the football team at the end of Heckfire Tiger. The Football team played Pickle Farmer as an alternative to Maldark:Conquerer of all Worlds;the game that is the source of leaks.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":7755688,"ranking":3,"query_text":"what network is pickles on cartoon","passage_text":"New Illuminati Messages on Cartoon Network - Hail Baphomet & a Satanic Pentagram are Flashed on the Screen in an Advertisement for their new show Mr. Pickles on Adult Swim.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":7755685,"ranking":4,"query_text":"what network is pickles on cartoon","passage_text":"Mr. Pickles (series) Mr. Pickles is an animated television series created by Will Carsola and Dave Stewart. The series airs on Cartoon Network's late-night block Adult Swim. Ten episodes have been ordered for the show's first season.","bm25_label":"high","relevance_label":1.0},{"query_id":881695,"passage_id":2907481,"ranking":5,"query_text":"what network is pickles on cartoon","passage_text":"In 1994, Hanna-Barbera's new subsidiary Cartoon Network Studios was founded and started production on The What-A-Cartoon! Show (also known as World-Premiere Toons and What-A-Cartoon), a series of creator-driven short cartoons that premiered on Cartoon Network in 1995.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":4160270,"ranking":6,"query_text":"what network is pickles on cartoon","passage_text":"What A Cartoon! (later known as The What A Cartoon! Show and The Cartoon Cartoon Show), is an American animation showcase series created for and aired on Cartoon Network by Fred Seibert, who which is produced by Hanna-Barbera; the already founded Cartoon Network Studios began to produce some of the shorts as its division.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":7755682,"ranking":7,"query_text":"what network is pickles on cartoon","passage_text":"The Cartoon Network game starts out with Dante as the Pickle Farmer. Suddenly, leaks from Maldark:Conquerer of all Worlds threaten his farm. It's up to Dante to send them back to the game. There are a total of thirty stages\/waves in this game.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":1403467,"ranking":8,"query_text":"what network is pickles on cartoon","passage_text":"What A Cartoon! (later known as The What A Cartoon! Show and The Cartoon Cartoon Show) is an American animation showcase series created by Fred Seibert for Hanna-Barbera Cartoons which aired on Cartoon Network.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":1403472,"ranking":9,"query_text":"what network is pickles on cartoon","passage_text":"What a Cartoon! Hard Luck Duck is a What a Cartoon! animated cartoon directed by William Hanna, produced by Hanna-Barbera Cartoons, and broadcast as a part of World Premiere Toons on Cartoon Network on April 16, 1995.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":4034158,"ranking":10,"query_text":"what network is pickles on cartoon","passage_text":"Johnny Bravo is an American animated television series created by Van Partible for Cartoon Network. The series was originally part of a series of shorts on Cartoon Network's animation showcase series What a Cartoon! .","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":6939746,"ranking":11,"query_text":"what network is pickles on cartoon","passage_text":"Cartoon Network is one of the all-time best TV channels for action-packed cartoons that both kids and adults can enjoy. This list of the top Cartoon Network TV series, both current and canceled series, includes the date when each first aired as well as lists of the casts of actors. The best Cartoon Network TV programs of all time include the most viewed shows on Cartoon Network, as this list covers the entire history of the network. Zixx and Ed, Edd 'n' Eddy are included on this list along with many more. What are your favorite Cartoon Network TV shows? Adventure Time might top your list.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":3175108,"ranking":12,"query_text":"what network is pickles on cartoon","passage_text":"The studio began on October 21, 1994, at 7:00am as a name-only division of Hanna-Barbera Cartoons, Inc., which was then focused on producing Cartoon Cartoons for Cartoon Network: What a Cartoon!, Dexter's Laboratory, Johnny Bravo, and The Powerpuff Girls.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":2907482,"ranking":13,"query_text":"what network is pickles on cartoon","passage_text":"The network's first original show was The Moxy Show and was first aired in 1993. The chief purpose of The What A Cartoon Show was to help Cartoon Network expand its library of exclusive programming and it introduced a number of new cartoon ideas. Six of them were spun off into their own series runs. These six series, Dexter's Laboratory (1996), Johnny Bravo, Cow and Chicken (1997), The Powerpuff Girls (1998), Mike, Lu & Og, and Courage the Cowardly Dog (1999) became the origins of the network's original cartoons, collectively known as Cartoon Cartoons.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":7941521,"ranking":14,"query_text":"what network is pickles on cartoon","passage_text":"Nicktoons is the branding for Nickelodeon's original animated television series (although it has seldom been used by the network itself since the 2002 launch of the spin-off digital cable and satellite channel of the same name).One of its popular cartoons was Rugrats which focuses on the adventures of Tommy Pickles, a 1 year old baby as the shows ...","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":5117538,"ranking":15,"query_text":"what network is pickles on cartoon","passage_text":"Timeline created by doverisstudent. In History. Oct 1, 1992. Cartoon Network Launch. Cartoon Network was lauch with the original Cartoon CARTOONS. Apr 10, 1994. Cartoon Network Studios Founded. Sometime in 1994 Cartoon Network Was Founded By Hanna-Barbera.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":7697946,"ranking":16,"query_text":"what network is pickles on cartoon","passage_text":"This show is the reason why I started to watch Cartoon Network. A lot of my friends say Adventure Time is stupid, but I don't care what they say about Adventure Time. Adventure Time will always be my favorite show on Cartoon Network. - macyquinn5678.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":7697949,"ranking":17,"query_text":"what network is pickles on cartoon","passage_text":"Top 10 Cartoon Network \/ Adult Swim Shows Best Cartoon Network Shows of 2013 Top Ten Least Funny Shows From Nick, Cartoon Network, and Disney Channel Top Ten Cartoon Network Shows of 2014 Top 10 Shows On Nick and Disney and Cartoon Network.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":2554747,"ranking":18,"query_text":"what network is pickles on cartoon","passage_text":"Cartoon Network is home to your favourite cartoons and free games. Play games online with Cartoon Network characters from Ben 10, Adventure Time, Regular Show, Gumball and more. Cartoon Network Shows.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":2554744,"ranking":19,"query_text":"what network is pickles on cartoon","passage_text":"Flicks (formerly Mr. Spim's Cartoon Theater, Cartoon Network's Cartoon Theater, Movie Madness and later The Flicks) is a Film block on Cartoon Network, featuring animated theatrical feature films, animated made-for-TV feature films, and films made for Cartoon Network.","bm25_label":"high","relevance_label":0.0},{"query_id":881695,"passage_id":4823588,"ranking":20,"query_text":"what network is pickles on cartoon","passage_text":"Flicks (formerly Mr. Spim's Cartoon Theater, Cartoon Network's Cartoon Theatre, Movie Madness and later The Flicks) is a Film block on Cartoon Network, featuring animated theatrical feature films, animated made-for-TV feature films, and films made for Cartoon Network.","bm25_label":"high","relevance_label":0.0}]