[{"query_id":882002,"passage_id":242626,"ranking":1,"query_text":"what normal blood pressure by age","passage_text":"Q. what is normal blood pressure mine was 140\/62 today at the doctor's is this within the normal range for a 69 year old? A. I agree with your doctor....your blood pressure is within normal range for your age.. what is the normal blood pressure for an eleven year old. A. At 11 years of age, the normal blood pressure range is close to the same as it is for an adult.Generally speaking, the normal blood...","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":8126759,"ranking":2,"query_text":"what normal blood pressure by age","passage_text":"What Is Normal Blood Pressure For A Child, Age 6? Can you tell me what the normal blood pressure ranges are for a child of six? Answer. While the average blood pressure for adults, which should be 120\/80 or below, the average blood pressure for children varies with age.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":5179596,"ranking":3,"query_text":"what normal blood pressure by age","passage_text":"Q. what is the normal blood pressure for an eleven year old. A. At 11 years of age, the normal blood pressure range is close to the same as it is for an adult.Generally speaking, the normal blood...","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":8698444,"ranking":4,"query_text":"what normal blood pressure by age","passage_text":"Modern physicians say normal blood pressure takes no account of age. A reading of 120mm\/80mm is normal regardless, according to Mayo Clinic staff. But early 20th century blood pressure cuff users followed a 100-plus-age rule of thumb to determine what was normal for age.Early 21st century doctors accepted increased normal rates as patients age, but within a much more limited range, according to the Mayo Clinic.ut early 20th century blood pressure cuff users followed a 100-plus-age rule of thumb to determine what was normal for age. Early 21st century doctors accepted increased normal rates as patients age, but within a much more limited range, according to the Mayo Clinic.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":5179591,"ranking":5,"query_text":"what normal blood pressure by age","passage_text":"Q. what is normal blood pressure mine was 140\/62 today at the doctor's is this within the normal range for a 69 year old? A. I agree with your doctor....your blood pressure is within normal range for your age.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":8126757,"ranking":6,"query_text":"what normal blood pressure by age","passage_text":"Blood Pressure Chart by Age Blood Pressure is the most common disease in today's world. Usually we think that normal values of blood pressure are 120\/80 for all age age groups. But reality is that our body changes with age. And normal value of BP readings also changes with age. Here we are providing different normal values of blood pressure for different age groups. Blood Pressure Chart for Women Over 20 : Read More. Normal Blood Pressure for Men over 30: Read More. High Blood Pressure Diet Plan, Tips : Read More. This table is only applicable for men.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":995252,"ranking":7,"query_text":"what normal blood pressure by age","passage_text":"This is an average blood pressure level chart according to the different age group. It is suitable for any age.The chart will help you to know what your normal blood pressure should be at your age.Be sure to have a regular blood pressure check-up and seek treatment plan whenever your blood pressure is below the minimum or exceeds the maximum level for your age range.Custom Search.his is an average blood pressure level chart according to the different age group. It is suitable for any age.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":2678001,"ranking":8,"query_text":"what normal blood pressure by age","passage_text":"This is an average blood pressure level chart according to the different age group. It is suitable for any age. The chart will help you to know what your normal blood pressure should be at your age.Be sure to have a regular blood pressure check-up and seek treatment plan whenever your blood pressure is below the minimum or exceeds the maximum level for your age range. Custom Search.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":3162679,"ranking":9,"query_text":"what normal blood pressure by age","passage_text":"Normal Blood Pressure. The normal blood pressure in an infant varies by age and depends on whether the baby is sleeping, awake or crying. At birth, the approximate normal blood pressure of a healthy baby is 61 to 79 systolic over 30 to 54 diastolic. At 1 month of age, normal blood pressure is 75 to 95 over 37 to 55.t birth, the approximate normal blood pressure of a healthy baby is 61 to 79 systolic over 30 to 54 diastolic. At 1 month of age, normal blood pressure is 75 to 95 over 37 to 55.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":6281219,"ranking":10,"query_text":"what normal blood pressure by age","passage_text":"Medications for Hypotension. What is Hypotension: Low blood pressure can be broadly defined as any blood pressure that is below the normal expected for an individual in a given environment. Low blood pressure, therefore, is a relative term. Blood pressure varies greatly with activity, age, medications, and underlying medical conditions.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":8698439,"ranking":11,"query_text":"what normal blood pressure by age","passage_text":"Blood pressures tend to rise naturally with age in both men and women so that a 130 systolic blood pressure of a 30-year old (roughly 100 plus the age) becomes 150 in a fifty year old and 160 in a 60 year old with male blood pressure readings exceeding female by around 10 mm Hg.ut early 20th century blood pressure cuff users followed a 100-plus-age rule of thumb to determine what was normal for age. Early 21st century doctors accepted increased normal rates as patients age, but within a much more limited range, according to the Mayo Clinic.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":8002616,"ranking":12,"query_text":"what normal blood pressure by age","passage_text":"Blood Pressure is the most common disease in today's world. Usually we think that normal values of blood pressure are 120\/80 for all age age groups. But reality is that our body changes with age.And normal value of BP readings also changes with age. Here we are providing different normal values of blood pressure for different age groups.ut reality is that our body changes with age. And normal value of BP readings also changes with age. Here we are providing different normal values of blood pressure for different age groups.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":7139226,"ranking":13,"query_text":"what normal blood pressure by age","passage_text":"Medications for Hypotension. What is Hypotension: Low blood pressure can be broadly defined as any blood pressure that is below the normal expected for an individual in a given environment. Low blood pressure, therefore, is a relative term. Blood pressure varies greatly with activity, age, medications, and underlying medical conditions. Low blood pressure is also referred to as hypotension.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":7833126,"ranking":14,"query_text":"what normal blood pressure by age","passage_text":"The chart will help you to know what your normal blood pressure should be at your age.Be sure to have a regular blood pressure check-up and seek treatment plan whenever your blood pressure is below the minimum or exceeds the maximum level for your age range. Blood Pressure Calculator.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":8126756,"ranking":15,"query_text":"what normal blood pressure by age","passage_text":"When is blood pressure too high in a child? Normal blood pressure is lower in children than in adults. Blood pressure increases with age and body size. Normal blood pressure for your child will depend on the childâ\u0080\u0099s age, gender and height. The doctor will compare your childâ\u0080\u0099s blood pressure to charts listing normal blood pressure ranges for boys and girls based on their age and height. A diagnosis of high blood pressure should be based on at least two readings taken at three separate visits to the doctor.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":3162678,"ranking":16,"query_text":"what normal blood pressure by age","passage_text":"The normal blood pressure in an infant varies by age and depends on whether the baby is sleeping, awake or crying. At birth, the approximate normal blood pressure of a healthy baby is 61 to 79 systolic over 30 to 54 diastolic.At 1 month of age, normal blood pressure is 75 to 95 over 37 to 55.t birth, the approximate normal blood pressure of a healthy baby is 61 to 79 systolic over 30 to 54 diastolic. At 1 month of age, normal blood pressure is 75 to 95 over 37 to 55.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":2856618,"ranking":17,"query_text":"what normal blood pressure by age","passage_text":"Blood Pressure is the most common disease in today's world. Usually we think that normal values of blood pressure are 120\/80 for all age age groups. But reality is that our body changes with age. And normal value of BP readings also changes with age. Here we are providing different normal values of blood pressure for different age groups.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":22662,"ranking":18,"query_text":"what normal blood pressure by age","passage_text":"Blood Pressure Chart by Age. Blood Pressure is the most common disease in today's world. Usually we think that normal values of blood pressure are 120\/80 for all age age groups. But reality is that our body changes with age. And normal value of BP readings also changes with age.","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":126492,"ranking":19,"query_text":"what normal blood pressure by age","passage_text":"Normal values for each of these vital signs vary by age and, in some cases, by sex. Table 1. Normal Heart Rate by Age (Open Table in a new window) Table 2. Normal Respiratory Rate by Age (Open Table in a new window) The normal blood pressure in adults is 120 (systolic)\/80 (diastolic). Normal blood pressure in children and adolescents varies by age. Table 3. Normal Blood Pressure by Age in Children and Adolescents (Open Table in a new window)","bm25_label":"high","relevance_label":0.0},{"query_id":882002,"passage_id":22656,"ranking":20,"query_text":"what normal blood pressure by age","passage_text":"To read a blood pressure chart by age, locate your age range, then view the corresponding normal systolic and diastolic numbers, notes Disabled World. The chart offered by Disabled World features average blood pressure readings for 14 different age ranges. For adults between the ages of 25 and 29, a normal blood pressure reading is 120\/80 millimeters of mercury. Average blood pressure increases with age.","bm25_label":"high","relevance_label":1.0}]