[{"query_id":884533,"passage_id":4440571,"ranking":1,"query_text":"what part is the sigmoid colon","passage_text":"Medical Definition of SIGMOID COLON. : the contracted and crooked part of the colon immediately above the rectumâ\u0080\u0094called also pelvic colon, sigmoid flexure.efinition of SIGMOID COLON. : the contracted and crooked part of the colon immediately above the rectum â\u0080\u0094called also sigmoid flexure. ADVERTISEMENT.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":7277625,"ranking":2,"query_text":"what part is the sigmoid colon","passage_text":"What if my report mentions the cecum, ascending colon, transverse colon, descending colon, sigmoid colon, or rectum? These are all parts of the large intestine. The cecum is the beginning of the colon where the small intestine empties into the large intestine. The ascending colon, transverse colon, descending colon, sigmoid colon and rectum are other parts of the colon after the cecum. The colon ends at the rectum and waste exits through the anus.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":6183609,"ranking":3,"query_text":"what part is the sigmoid colon","passage_text":"Sigmoid Colon Cancer. The last part of the colon, which connects the descending colon to the rectum, is known as the sigmoid colon. All fecal matter is stored in this S-shaped part of the colon before it is expelled. When cancer cells are present in the lining of the sigmoid colon, it is termed as sigmoid colon cancer. Sigmoid colon cancer can be divided into three separate stages, depending on how far the cancer has spread.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":2170726,"ranking":4,"query_text":"what part is the sigmoid colon","passage_text":"ascending colon-the part of the large intestine that ascends from the cecum to the transverse colon. descending colon-the part of the large intestine that descends from the transverse colon to the sigmoid colon. sigmoid colon, sigmoid flexure-the s-shaped curve between the descending colon and the rectum.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":4235202,"ranking":5,"query_text":"what part is the sigmoid colon","passage_text":"Sigmoid colon The sigmoid colon is the part of the large intestine after the descending colon and before the rectum. The name sigmoid means S-shaped (see sigmoid). The walls oâ\u0080¦f the sigmoid colon are muscular, and contract to increase the pressure inside the colon, causing the stool to move into the rectum.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":31718,"ranking":6,"query_text":"what part is the sigmoid colon","passage_text":"The sigmoid colon is the part of the large intestine after the descending colon and before the rectum. The name sigmoid means S-shaped (see sigmoid; cf. sigmoid sinus). The walls of the sigmoid colon are muscular, and contract to increase the pressure inside the colon, causing the stool to move into the rectum.","bm25_label":"high","relevance_label":1.0},{"query_id":884533,"passage_id":732876,"ranking":7,"query_text":"what part is the sigmoid colon","passage_text":"This slows or completely stops the flow of stool, leading to a colonic obstruction, and is often a surgical emergency. Redundant sigmoid colon could lead to sigmoid volvulus. Sigmoid colon is the part of the colon closest to the rectum.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":4440568,"ranking":8,"query_text":"what part is the sigmoid colon","passage_text":"sigmoid colon. Definitions: 1. the part of the colon describing an S-shaped curve between the pelvic brim and the third sacral segment; it is continuous with the rectum. Synonyms: colon sigmoideum, colon pelvinum, flexura sigmoidea, sigmoid flexure. The definition information for sigmoid colon is provided by Stedman's.You can search our medical dictionary here.igmoid colon. Definitions: 1. the part of the colon describing an S-shaped curve between the pelvic brim and the third sacral segment; it is continuous with the rectum. Synonyms: colon sigmoideum, colon pelvinum, flexura sigmoidea, sigmoid flexure. The definition information for sigmoid colon is provided by Stedman's.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":3701964,"ranking":9,"query_text":"what part is the sigmoid colon","passage_text":"THE COLON: 1  The colon is only a part (the biggest part) of what makes up the large intestine. The colon has 4 parts - ascending colon, transverse colon, descending colon, and sigmoid colon. 2  So when you use the word colon youâ\u0080\u0099re referring to the large bowel by default since it is part of the large bowel.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":3666944,"ranking":10,"query_text":"what part is the sigmoid colon","passage_text":"Sigmoid Colectomy Sigmoid Colectomy. This is an operation to remove part of the left side of the colon known as the sigmoid colon. It may be performed for patients with a colon cancer, or for certain non-cancerous conditions such as Crohnâ\u0080\u0099s disease, diverticular disease or sometimes as part of surgery performed for rectal prolapse.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":6462908,"ranking":11,"query_text":"what part is the sigmoid colon","passage_text":"1 The large intestine contains all of the colon, but the colon does not contain the cecum, appendix, rectum, or anal canal.  The colon is only a part (the biggest part) of what makes up the large intestine. The colon has 4 parts - ascending colon, transverse colon, descending colon, and sigmoid colon. The anal canal, rectum, cecum, and appendix are not part of the colon.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":4241891,"ranking":12,"query_text":"what part is the sigmoid colon","passage_text":"People with a redundant colon are at increased risk for colonic volvulus, a condition that causes the colon to twist around itself. This slows or completely stops the flow of stool, leading to a colonic obstruction, and is often a surgical emergency. Redundant sigmoid colon could lead to sigmoid volvulus. Sigmoid colon is the part of the colon closest to the rectum. Symptoms of sigmoid volvulus include: failing to pass a bowel movement in some time.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":6028398,"ranking":13,"query_text":"what part is the sigmoid colon","passage_text":"The sigmoid colon is the organ most commonly affected by diverticulitis. While diverticula can form anywhere along your digestive or gastrointestinal (GI) tract, most diverticula form in the narrowest part of the large intestine, the sigmoid colon. The sigmoid colon is the part of your large intestine that connects your descending colon to your rectum. The name sigmoid refers to the S-like shape of this part of the intestine, which is about 18 inches (45 centimeters) long.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":8639509,"ranking":14,"query_text":"what part is the sigmoid colon","passage_text":"People with a redundant colon are at increased risk for colonic volvulus, a condition that causes the colon to twist around itself. This slows or completely stops the flow of stool, leading to a colonic obstruction, and is often a surgical emergency. Redundant sigmoid colon could lead to sigmoid volvulus. Sigmoid colon is the part of the colon closest to the rectum. Symptoms of sigmoid volvulus include: 1  failing to pass a bowel movement in some time.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":7269088,"ranking":15,"query_text":"what part is the sigmoid colon","passage_text":"What is the Sigmoid Colon? Sigmoid colon or pelvic colon is a portion of the large intestine which is closest to the rectum and anus. It helps to flow the fecal matter from the colon to rectum and then to the anus. Feces stays in this sigmoid colon until they are in a state of elimination from the body.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":3586307,"ranking":16,"query_text":"what part is the sigmoid colon","passage_text":"Distal colon= the last part Proximal colon= the first part -- about 40 cm long Direction of stool. â\u0080\u009cProximal to the sigmoid colonâ\u0080\u009d = The parts of the colon above or before the sigmoid colon (above the green line where the stool would travel BEFORE the stool reaches the sigmoid colon [brown arrows]). New CDB CRC Page 3 form: If results are given in the number of centimeters (cm) from the anus where the.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":2070344,"ranking":17,"query_text":"what part is the sigmoid colon","passage_text":"Unlike a colonoscopy, however, the 'range' of a sigmoidoscopy is not as good; whilst a colonoscopy can visualise the entire large bowel, a sigmoidoscopy can only visualise as far as the sigmoid colon (it is therefore primarily used to visualise the rectum and parts of the sigmoid colon).nlike a colonoscopy, however, the 'range' of a sigmoidoscopy is not as good; whilst a colonoscopy can visualise the entire large bowel, a sigmoidoscopy can only visualise as far as the sigmoid colon (it is therefore primarily used to visualise the rectum and parts of the sigmoid colon).","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":273667,"ranking":18,"query_text":"what part is the sigmoid colon","passage_text":"The cecum is the beginning of the colon where the small intestine empties into the large intestine. The ascending colon, transverse colon, descending colon, sigmoid colon and rectum are other parts of the colon after the cecum.he cecum is the beginning of the colon where the small intestine empties into the large intestine. The ascending colon, transverse colon, descending colon, sigmoid colon and rectum are other parts of the colon after the cecum.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":3856431,"ranking":19,"query_text":"what part is the sigmoid colon","passage_text":"The colon is part of the large intestine, the final part of the digestive system. Its function is to reabsorb fluids and process waste products from the body and prepare for its elimination. The colon consists of four parts: descending colon, ascending colon, transverse colon, and sigmoid colon.he descending colon is located on the left side of the large intestine, extending from the bend below the spleen to the sigmoid colon.","bm25_label":"high","relevance_label":0.0},{"query_id":884533,"passage_id":3666947,"ranking":20,"query_text":"what part is the sigmoid colon","passage_text":"Sigmoid Colectomy This is an operation to remove part of the left side of the colon known as the sigmoid colon. It may be performed for patients with a colon cancer, or for certain non-cancerous conditions such as Crohnâ\u0080\u0099s disease, diverticular disease or sometimes as part of surgery performed for rectal prolapse.","bm25_label":"high","relevance_label":0.0}]