[{"query_id":888934,"passage_id":721789,"ranking":1,"query_text":"what production is pizza","passage_text":"Specialties. For more than 55 years, millions of fans like you have inspired Pizza Hut to make delicious products for life's favorite moments.We like coming up with great-tasting products and exciting promotions because, at Pizza Hut, we've always known that you are what's most important.stablished in 1958. Pizza Hut began with two brothers borrowing $600 from their mom to start a pizzeria. What started out small has now become the biggest pizza company in the world.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":6277467,"ranking":2,"query_text":"what production is pizza","passage_text":"Established in 1958. Pizza Hut began with two brothers borrowing $600 from their mom to start a pizzeria. What started out small has now become the biggest pizza company in the world. And every step of the way, we've remained committed to making the best food and providing the highest level of service.or more than 55 years, millions of fans like you have inspired Pizza Hut to make delicious products for life's favorite moments. We like coming up with great-tasting products and exciting promotions because, at Pizza Hut, we've always known that you are what's most important.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":7714681,"ranking":3,"query_text":"what production is pizza","passage_text":"Is there a cost effective alternative to shipping frozen food products and using a lot of dry ice or ice packs? What is the best low-cost way to ship frozen pizza? What is the best insulation product for keeping things frozen during shipping?","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":4889948,"ranking":4,"query_text":"what production is pizza","passage_text":"Pizza craft Aluminum Pizza Peel with Folding Handle, for use with Oven, Grill or BBQ, PC0216 Product - Pizzacraft Pizza Cutter, Pizza Peel and BONUS 2 Pizza Herb Blends Value Bundle Product Image","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":7973535,"ranking":5,"query_text":"what production is pizza","passage_text":"Pizza Hut Production Salaries. The typical Pizza Hut Production salary is $8. Production salaries at Pizza Hut can range from $7-$9. This estimate is based upon 7 Pizza Hut Production salary reports provided by employees. See all Production salaries to learn how this stacks up in the market.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":7973533,"ranking":6,"query_text":"what production is pizza","passage_text":"Our products at Prima Pizza will be produced in the kitchen area of the premises whilst our services will be offered at the front. Prima Pizza will adopt two main types of production. The first will be line production, as our pizzas will be made fresh, there will be a line of production. This is will be the employees that shape the dough into pizza bases. They will then pass the bases onto the employees that will add the required toppings onto the pizza and place them in the oven.","bm25_label":"high","relevance_label":1.0},{"query_id":888934,"passage_id":7973537,"ranking":7,"query_text":"what production is pizza","passage_text":"All Pizza Hut Salaries. The typical Pizza Hut Production salary is $8. Production salaries at Pizza Hut can range from $7-$9. This estimate is based upon 7 Pizza Hut Production salary reports provided by employees. See all Production salaries to learn how this stacks up in the market.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":7666213,"ranking":8,"query_text":"what production is pizza","passage_text":"This is the only official website of Pizza Hut Philippines. All other websites offering Pizza Hut products in the Philippines are not authorized to do so.Since we cannot control the service and quality of our products resold by third parties, we encourage our customers not to use other website when ordering Pizza Hut products.ll other websites offering Pizza Hut products in the Philippines are not authorized to do so. Since we cannot control the service and quality of our products resold by third parties, we encourage our customers not to use other website when ordering Pizza Hut products.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":7084134,"ranking":9,"query_text":"what production is pizza","passage_text":"Deep Dish Personal Pepperoni Pizza : find more tombstone pepperoni pizza products","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":509968,"ranking":10,"query_text":"what production is pizza","passage_text":"Pizza delivery is a service in which a pizzeria or pizza chain delivers a pizza to a customer. An order is typically made either by telephone or over the internet to the pizza chain, in which the customer can request pizza type, size and other products alongside the pizza, commonly including soft drinks.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":998857,"ranking":11,"query_text":"what production is pizza","passage_text":"Pizza delivery is a service in which a pizzeria or pizza chain delivers a pizza to a customer.An order is typically made either by telephone or over the internet to the pizza chain, in which the customer can request pizza type, size and other products alongside the pizza, commonly including soft drinks.izza delivery is a service in which a pizzeria or pizza chain delivers a pizza to a customer.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":8045290,"ranking":12,"query_text":"what production is pizza","passage_text":"Calzone is like a folded-over round pizza, Stromboli a folded-over square pizza, Pazarotti a folded-over mini pizza All these products are made with pizza dough Calzone Calzone is an Italian word for 'trouser leg sleeve'. The sleeve is made of Pizza dough and stuffed with Pizza ingredients.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":8223111,"ranking":13,"query_text":"what production is pizza","passage_text":"The quality products available in the John Daly Pizza Program taste great and are created for ease of operations and production. Programs are available with either Large or Personal Pizzas. The dough, sauce, cheese and meat ingredients that make up the fresh baked pizza recipes are some of the best available.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":1146234,"ranking":14,"query_text":"what production is pizza","passage_text":"Hartley's Pizza Cumberland\/Frostburg; Hartley's Pizza, Cumberland; Get Menu, Reviews, Contact, Location, Phone Number, Maps and more for Hartley's Pizza Restaurant on Zomato Serves Pizza. Products for Businesses We're hiring","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":4889952,"ranking":15,"query_text":"what production is pizza","passage_text":"Product - Update International APP-1226 26 inch Aluminum Pizza Peels with 12 inch x 14 inch Blade Product - Honey Can Do 16 Basswood Pizza Peel with Curved End Product Image","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":7973531,"ranking":16,"query_text":"what production is pizza","passage_text":"O DISCUSS pizza crust production, we have to approach the subject. from two aspects. First, we can di-. vide the pizza industry by the type of pizza. desired, whether it be a thin crust pizza or. a thick crust, â\u0080\u009cdeep dish,â\u0080\u009d pizza.","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":4562004,"ranking":17,"query_text":"what production is pizza","passage_text":"There are 350 calories in a 1\/4 pizza serving of Hunt Brothers Pizza Thin Crust Pepperoni Pizza. Get full nutrition facts for other Hunt Brothers Pizza products and all your other favorite brands. Register | Sign In","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":8418869,"ranking":18,"query_text":"what production is pizza","passage_text":"How many people will a large pizza hut pizza feed? Whats the difference of a black man and a large pizza from pizza hut? How many people does the Pizza Hut PANORMOUS Pizza feed?","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":1141075,"ranking":19,"query_text":"what production is pizza","passage_text":"Pizza Pie Cafe Salt Lake City; Pizza Pie Cafe, Provo; Get Menu, Reviews, Contact, Location, Phone Number, Maps and more for Pizza Pie Cafe Restaurant on Zomato Serves Pizza. Products for Businesses We're hiring","bm25_label":"high","relevance_label":0.0},{"query_id":888934,"passage_id":3243959,"ranking":20,"query_text":"what production is pizza","passage_text":"All Products pizzeria! thin pizzeria! ORIGINAL Rising Crust Italian Style Favorites Garlic Bread Pizza Bacon & Cheese Stuffed Crust Cheese Stuffed Crust Classic Thin Crust Pizza & Sides Thin & Crispy Pizzas Small Sized Pizzas Artisan Style Melts Pizza Buns.","bm25_label":"high","relevance_label":0.0}]