[{"query_id":891565,"passage_id":7815874,"ranking":1,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Scott's Seafood on the River is located near the cities of Broderick, West Sacramento, Bryte, Arden Arcade, and Mc Clellan.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":7815866,"ranking":2,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Read reviews from Scott's Seafood on the River at Riverside Blvd in Little Pocket Sacramento 95822 from trusted Sacramento restaurant reviewers. Includes the menu, 1 review, 6 photos, and 178 dishes from Scott's Seafood on the River. Read reviews from Scott's Seafood on the River at Riverside Blvd in Little Pocket Sacramento 95822 from trusted Sacramento restaurant reviewers.","bm25_label":"high","relevance_label":1.0},{"query_id":891565,"passage_id":7815869,"ranking":3,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Whether you are looking for information about Scotts Seafood On The River, searching for a top Restaurants business near me or within zip code 95822, or just trying to locate a company that offers Restaurants Seafood near Sacramento CA, you will find that b2bYellowpages.com will satisfy your search.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":7815867,"ranking":4,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Scott's Seafood on The River: 10 year anniversary - See 287 traveler reviews, 69 candid photos, and great deals for Sacramento, CA, at TripAdvisor. Sacramento Sacramento Tourism","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":7815870,"ranking":5,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Scott's Seafood Restaurant on the Sacramento River and in Folsom. The freshest Seafood and Steaks served by a warm and gracious staff in a comfortable, intimate atmosphere. Winner of Best Seafood Restaurant in Sacramento 18 years running!","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":7815865,"ranking":6,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Scotts Seafood On The River is one of 42 Restaurants Seafood in Sacramento, CA 95822. Find phone, map, directions, website, coupons, reviews, hours.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":4245234,"ranking":7,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"The Sacramento River Deep Water Ship Channel connects the Delta to the Port of Sacramento, with its terminus located near Rio Vista, on the northwestern side of the Delta. The Stockton Ship Channel is a dredged and partially straightened section of the San Joaquin River cutting directly through the Delta from the Port of Stockton to the San Joaquin's confluence with the Sacramento near Antioch.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":6146535,"ranking":8,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"The longest river in California, the Sacramento River stretches 377 miles, beginning in the northern part of the state and flowing down to the Suisan Bay near San Francisco. Several significant rivers act as tributaries along the Sacramento River's course, including the McCloud River, the Pit and the Yuba.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":2652902,"ranking":9,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Oroville is situated at the head of navigation on the Feather River. The Yuba River flows into the Feather River near Marysville, California and these flow together to the Sacramento River.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":2948797,"ranking":10,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"The Effie Yeaw Nature Center is located in Ancil Hoffman Park and is part of the American River Parkway. The American River Parkway starts at Discovery Park at the confluence of the American and Sacramento Rivers and follows the river east from the city of Sacramento to the Nimbus Hatchery near Folsom.he American River Parkway is found on the north and most of the south sides of the river considered the 'jewel' of Sacramento. The parkway stretches 23 miles and offers open space, oak woodlands, rich green riparian flora, paved trails and access to the Beautiful 'Wild and Scenic' American River.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":7039096,"ranking":11,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Incorporated in 1919 near the confluence of three rivers â\u0080\u0093 the Umpqua, the Smith, and the Scholfield, the City of Reedsport is located on the beautiful Oregon Coast on Highways 101 and 38 on the banks of the Umpqua River â\u0080\u0093 the largest river between the Sacramento and the Columbia.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":8209952,"ranking":12,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Sacramento County Sheriff Scott Jones on the rise in concealed carry permits Sacramento County Sheriff Scott Jones, in a Jan. 28, 2016, interview with The Sacramento Bee's Capitol Bureau, explains his policy on concealed weapons permits.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":7888800,"ranking":13,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"300 HP and aS 260. Seadoo has 300HP while Yamahaâ\u0084¢ does not. The closet thing in HP Yamahaâ\u0084¢ has to what Seadoo has is any of the models with 260HP. The 300HP models Seadoo have are just crazy in power, Iâ\u0080\u0099ve wrote more about it here.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":6489521,"ranking":14,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"What is altitude of Sacramento ca? Can you get from Sacramento CA to the ocean by boat? Yes, you can travel by boat to the ocean from Sacramento. There is a man-made canal leading from the port of Sacramento to the Sacramento river which empties into San Franciscâ\u0080¦o Bay.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":1188396,"ranking":15,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Incorporated. We are a family owned and operated walnut processing business located near the banks of the Sacramento River in the tight knit farming community of Dairyville. Situated just 155 miles south of the Oregon border, we are the northernmost walnut processing facility in the state.ncorporated. We are a family owned and operated walnut processing business located near the banks of the Sacramento River in the tight knit farming community of Dairyville. Situated just 155 miles south of the Oregon border, we are the northernmost walnut processing facility in the state.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":529954,"ranking":16,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"William Richard Baynham Wyatt married Martha Francis Scott (dau. of Robert and Ann [Coleman] Scott) on September 5, 1832. They lived at Edgewood on the North Anna river in Hanover County, Virginia. Note that Edgewood was across the river from, but near to, Plain Dealing in Caroline County.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":7288362,"ranking":17,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Welcome: Paradise Beach is located near California State University, Sacramento, on a oxbow bend in the river which creates a cove where cautious swimmers and skimmers can play.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":6650186,"ranking":18,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"This article is about the section of U.S. Route 50 in California. For the entire route, see U.S. Route 50. In the U.S. state of California, U.S. Route 50 (US 50) runs east from I-80 in West Sacramento to the Nevada state line in South Lake Tahoe.Portions within Sacramento are known as the Capital City Freeway and El Dorado Freeway.ust east of Exit 60, US 50 continues as an undivided conventional highway with one eastbound lane and two westbound lanes, entering the river canyon of the South Fork American River near Riverton and crossing to the north side of the river near Ice House Road.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":6133381,"ranking":19,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"Two Competing Companies. By the terms of the bill, the Central Pacific Railroad Company would start building in Sacramento and continue east across the Sierra Nevada, while a second company, the Union Pacific Railroad, would build westward from the Missouri River, near the Iowa-Nebraska border.wo Competing Companies. By the terms of the bill, the Central Pacific Railroad Company would start building in Sacramento and continue east across the Sierra Nevada, while a second company, the Union Pacific Railroad, would build westward from the Missouri River, near the Iowa-Nebraska border.","bm25_label":"high","relevance_label":0.0},{"query_id":891565,"passage_id":2435822,"ranking":20,"query_text":"what river is near scotts seadoos in sacramento","passage_text":"A spot across the Sacramento River from Isleton. From the main part of town, you go north, cross over the Isleton Bridge, turn left and drive down river until you see a rusty-red colored smoke stack sitting on the levee near the launching ramp across the river.","bm25_label":"high","relevance_label":0.0}]