[{"query_id":89777,"passage_id":5951288,"ranking":1,"query_text":"centra credit union routing number","passage_text":"Centra Credit Union ABA Routing Number. Routing Number for Centra Credit Union in IN, NC and NY (for all transaction types) is 274972883.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305066,"ranking":2,"query_text":"centra credit union routing number","passage_text":"Browse Centra Credit Union Branch Locations. The last reported ABA Number for Centra Credit Union is 274972883. According to our bank database, this bank location is a main office and servicing FRB number is 274972883. There are several Centra Credit Union routing numbers reported in our bank database. Please call (812) 376-9771 to verify routing number for your bank wire transfer, reorder Centra Credit Union checks or setting up direct deposit. You can also get your Centra Credit Union routing number on your check, view sample check to locate your ABA number.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305067,"ranking":3,"query_text":"centra credit union routing number","passage_text":"274972883 Routing Number (CENTRA CREDIT UNION) 274972883 is assigned to CENTRA CREDIT UNION, COLUMBUS, Main Office by American Bankers Association (ABA). CENTRA CREDIT UNION Main Office is located at 1430 NATIONAL RD, COLUMBUS, IN. In case of any confusion regarding the routing number, one call the bank directly at (812) 376-9771. FedACH Routing Number","bm25_label":"high","relevance_label":1.0},{"query_id":89777,"passage_id":5951284,"ranking":4,"query_text":"centra credit union routing number","passage_text":"Check CENTRA CREDIT UNION routing numbers for bank transfers. 274972883 is a routing number of CENTRA CREDIT UNION. Check detailed information about 274972883. This bank routing number is required for electronic funds transfer. Bank routing number of CENTRA CREDIT UNION is the first nine digits of the number along the bottom left section of your check. The routing number for checking, savings and money market accounts identifies the financial institution where the account was opened and is located.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":5951291,"ranking":5,"query_text":"centra credit union routing number","passage_text":"Routing Number for Centra Credit Union. 1  Routing number for Centra Credit Union is a 9 digit code required for initiating various financial transactions such as direct deposits, electronic payments, wire transfers, check ordering and many more.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305063,"ranking":6,"query_text":"centra credit union routing number","passage_text":"contact centra credit union The main phone number for Centra Credit Union is 812-376-9771. The assigned Federal Reserve Office for Centra Credit Union is Fed 071000301. what is a bank routing number? A bank's Routing Transit Number (RTN) is a 9-digit code used to identify your bank on checks, direct deposit, bill pay, and in other transactions. You need to know your routing number to connect online accounts to your bank account, set up direct deposit with your employer, and in many other financial situations.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305062,"ranking":7,"query_text":"centra credit union routing number","passage_text":"Centra Credit Union Routing Number 274972883. Call (812) 376-9771 for wire instructions for domestic wire transfer to and from Centra Credit Union, international wire transfer, wire transfer fees and cut off time for wires.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305060,"ranking":8,"query_text":"centra credit union routing number","passage_text":"274972883 routing number is assigned to CENTRA CREDIT UNION, IN by ABA. Routing number 274972883 is used for ACH, check deposit and bank wire transfers.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305064,"ranking":9,"query_text":"centra credit union routing number","passage_text":"Not looking for the Centra Credit Union routing number? Try searching for your bank's ABA routing number by bank name, location, or phone number. â\u0080¢ martin county cooperative c.u. mainsource bank indiana members credit union","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305059,"ranking":10,"query_text":"centra credit union routing number","passage_text":"Centra credit union routing number is a nine digit number used to identify bank transfers. Routing numbers will be different based on the account branch. It is based on the bank account origin by state and region. The routing number on check is available for each branch in the table below.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":5951287,"ranking":11,"query_text":"centra credit union routing number","passage_text":"Centra Credit Union in Indiana Routing Number, Address, Swift Codes. 22 branches found. A routing number is a 9 digit code for identifying a financial institution for the purpose of routing of checks (cheques), fund transfers, direct deposits, e-payments, online payments, and other payments to the correct bank branch.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305061,"ranking":12,"query_text":"centra credit union routing number","passage_text":"Centra Credit Union in Indiana Routing Number, Address, Swift Codes. By City: 22 branches found. A routing number is a 9 digit code for identifying a financial institution for the purpose of routing of checks (cheques), fund transfers, direct deposits, e-payments, online payments, and other payments to the correct bank branch.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":7305065,"ranking":13,"query_text":"centra credit union routing number","passage_text":"At Centra Credit Union, we provide a full range of personal and business financial services to meet your financial goals and needs. Centra Credit Union - Centered Around You. At Centra Credit Union, we provide a full range of personal and business financial services to meet your financial goals and needs. Centra Credit Union - Centered Around You. At Centra Credit Union, we provide a full range of personal and business financial services to meet your financial goals and needs. Menu","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":5612756,"ranking":14,"query_text":"centra credit union routing number","passage_text":"Find Numerica Credit Union Routing Number on a Check. The best and easiest way to find the routing number for Numerica Credit Union checking, savings or business account is to look at the bottom left corner of the check issued to you by your credit union. Numerica Credit Union ABA Routing Number. Other Routing Numbers for Numerica Credit Union. Routing Number.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":1125600,"ranking":15,"query_text":"centra credit union routing number","passage_text":"Pentagon Federal Credit Union Routing Number. The Pentagon Federal Credit Union routing number is 2560-7844-6. The Pen Fed Credit Union routing number or ABA routing number is used for the electronic transfer of funds into a Pentagon Federal Credit Union account.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":6410803,"ranking":16,"query_text":"centra credit union routing number","passage_text":"Allegius Credit Union Branch. More Credit Unions in Burns Harbor, IN. Allegius Credit Union. ABA Routing Number: Routing numbers are also referred to as Check Routing Numbers, ABA Numbers, or Routing Transit Numbers (RTN).","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":5951290,"ranking":17,"query_text":"centra credit union routing number","passage_text":"Centra Bank, Inc Routing Number. 043316942 routing number is a 9-digit number designed and assigned to Centra Bank, Inc by The American Bankers Association (ABA) to identify the financial institution upon which a payment was drawn.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":1363478,"ranking":18,"query_text":"centra credit union routing number","passage_text":"Routing Number 256078446, Pentagon Federal Credit Union. Pentagon Federal Credit Union Routing number \/ ABA number 256078446, used by the Automated Clearing House (ACH) to process direct deposits. Routing Number 256078446, Pentagon Federal Credit Union. Other Pentagon Federal Credit Union Routing Numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":1587591,"ranking":19,"query_text":"centra credit union routing number","passage_text":"Pentagon Federal Credit Union Routing number \/ ABA number 256078446, used by the Automated Clearing House (ACH) to process direct deposits. Routing Number 256078446, Pentagon Federal Credit Union. Other Pentagon Federal Credit Union Routing Numbers. All Pentagon Federal Credit Union Routing Numbers.","bm25_label":"high","relevance_label":0.0},{"query_id":89777,"passage_id":8601781,"ranking":20,"query_text":"centra credit union routing number","passage_text":"Routing Number 321172756, Valley First Credit Union. Valley First Credit Union Routing number \/ ABA number 321172756, used by the Automated Clearing House (ACH) to process direct deposits. Routing Number 321172756, Valley First Credit Union. Other Valley First Credit Union Routing Numbers.","bm25_label":"high","relevance_label":0.0}]