[{"query_id":898714,"passage_id":7740845,"ranking":1,"query_text":"what std code is 01764","passage_text":"Crieff area code. UK area code 01764 is for Crieff in Perth and Kinross, and the surrounding area. Locations using 01764 numbers include: 1  Auchterarder. 2  Blackford.3  Comrie. 4  Crieff.5  Dunning. 6  Madderty.K area code 01764 is for Crieff in Perth and Kinross, and the surrounding area. Locations using 01764 numbers include: 1  Auchterarder. 2  Blackford. 3  Comrie. 4  Crieff. 5  Dunning.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":7740844,"ranking":2,"query_text":"what std code is 01764","passage_text":"UK area code 01764 is for Crieff in Perth and Kinross, and the surrounding area.Locations using 01764 numbers include: 1  Auchterarder. 2  Blackford. 3  Comrie. 4  Crieff.5  Dunning. 6  Madderty.K area code 01764 is for Crieff in Perth and Kinross, and the surrounding area. Locations using 01764 numbers include: 1  Auchterarder. 2  Blackford. 3  Comrie. 4  Crieff. 5  Dunning.","bm25_label":"high","relevance_label":1.0},{"query_id":898714,"passage_id":7740850,"ranking":3,"query_text":"what std code is 01764","passage_text":"The cost of calling an 01764 number. When calling from a landline, calls to 01764 numbers can cost up to 10p per minute, dependent on the time of day, and there is usually also a call set-up fee.When calling from mobile phones, calls to these numbers cost between 10p and 40p per minute.ost landline operators offer inclusive call packages which allow calls free at certain times of the day, or at all times, and most mobile companies include free any-time minutes in the monthly contract payment, or a bundle of minutes for a reduced cost in the form of a top-up credit. Codes near to 01764 area code:","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":7740846,"ranking":4,"query_text":"what std code is 01764","passage_text":"The 01764 dialling code covers Crieff and the surrounding area. Areas covered include: 1  Auchterarder. 2  Blackford. 3  Comrie. 4  Crieff. 5  Dunning.6  Madderty. 7  Muthill.ost landline operators offer inclusive call packages which allow calls free at certain times of the day, or at all times, and most mobile companies include free any-time minutes in the monthly contract payment, or a bundle of minutes for a reduced cost in the form of a top-up credit. Codes near to 01764 area code:","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":7740851,"ranking":5,"query_text":"what std code is 01764","passage_text":"Most landline operators offer inclusive call packages which allow calls free at certain times of the day, or at all times, and most mobile companies include free any-time minutes in the monthly contract payment, or a bundle of minutes for a reduced cost in the form of a top-up credit. Codes near to 01764 area code:ost landline operators offer inclusive call packages which allow calls free at certain times of the day, or at all times, and most mobile companies include free any-time minutes in the monthly contract payment, or a bundle of minutes for a reduced cost in the form of a top-up credit. Codes near to 01764 area code:","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":6050675,"ranking":6,"query_text":"what std code is 01764","passage_text":"ADVERTISEMENT. 1  For example, Pune STD code is 020, Mumbai STD code is 022, Delhi STD code is 011, Bangalore (also known as Bangaluru) STD code is 080 and Chennai STD code is 044. Here, 022, 044, 011, 033, 0124, 0120 are the STD code which are followed by phone numbers when a use makes a call.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":3988636,"ranking":7,"query_text":"what std code is 01764","passage_text":"STD codes (area codes) of India Searchable database of area codes \/ telephone codes (STD codes) of cities and towns in India.You can search for STD (Subscribers Trunk Dialing) codes by typing city\/town name and search for city\/town name by typing the STD code.TD codes (area codes) of India Searchable database of area codes \/ telephone codes (STD codes) of cities and towns in India.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":7792994,"ranking":8,"query_text":"what std code is 01764","passage_text":"Gmail Email Extractor. Mobile Number Locator. STD codes (area codes) of India Searchable database of area codes \/ telephone codes (STD codes) of cities and towns in India. You can search for STD (Subscribers Trunk Dialing) codes by typing city\/town name and search for city\/town name by typing the STD code.earchable database of area codes \/ telephone codes (STD codes) of cities and towns in India. You can search for STD (Subscribers Trunk Dialing) codes by typing city\/town name and search for city\/town name by typing the STD code.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":3988635,"ranking":9,"query_text":"what std code is 01764","passage_text":"Gmail Email Extractor. Mobile Number Locator. STD codes (area codes) of India Searchable database of area codes \/ telephone codes (STD codes) of cities and towns in India. You can search for STD (Subscribers Trunk Dialing) codes by typing city\/town name and search for city\/town name by typing the STD code.TD codes (area codes) of India Searchable database of area codes \/ telephone codes (STD codes) of cities and towns in India.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":6050677,"ranking":10,"query_text":"what std code is 01764","passage_text":"Pune STD Code | Landline, STD Code Of Pune City, Maharashtra India. Pune STD Code â\u0080\u0093 Landline : â\u0080\u009c020â\u0080\u009d. Pune City is assigned with (020) STD codes which is a prefixed number used when dialing to landline numbers in different STD areas. Pune is one of the popular and developing Metropolitan City which consists of city, town and villages.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":6050674,"ranking":11,"query_text":"what std code is 01764","passage_text":"Also, the number of digits in the STD code indicate the capacity of the exchange -- larger the STD code smaller is the exchange. You can also approximately guess the path hops that you will take to reach the desired number by looking at the STD code.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":5919373,"ranking":12,"query_text":"what std code is 01764","passage_text":"Subscriber Trunk Dialling (STD) codes are assigned to each city\/town\/village, with the larger Metro cities having shorter area codes (STD codes), the shortest being 2 digits. For example,1  11 - New Delhi, Delhi.ubscriber Trunk Dialling (STD) codes are assigned to each city\/town\/village, with the larger Metro cities having shorter area codes (STD codes), the shortest being 2 digits. For example, 1  11 - New Delhi, Delhi.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":1393567,"ranking":13,"query_text":"what std code is 01764","passage_text":"Whether its STD codes for Mumbai or any other region each and every place has a unique code and makes it different from another. If you are looking for Mumbai STD code then itâ\u0080\u0099s all available with us online. STD codes of Mumbai or such place is easily available online.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":6784664,"ranking":14,"query_text":"what std code is 01764","passage_text":"STD Code for New delhi. Get complete information of New delhi STD code or any other small city with us here at STDcodesindia.com. Whether its STD codes for New delhi or any other region each and every place has a unique code and makes it different from another.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":8732623,"ranking":15,"query_text":"what std code is 01764","passage_text":"This is my first visa interview. I will really appreciate if you can answer my questions below. 1) VFS appointment-Home Phone number. Country Code-STD Code-Phone number. I am not able to enter a 3 digit STD code. will really appreciate if you can answer my questions below. 1) VFS appointment-Home Phone number Country Code-STD Code-Phone number I am not able to enter a 3 digit STD code.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":1393569,"ranking":16,"query_text":"what std code is 01764","passage_text":"STD Code for Mumbai. Get complete information of Mumbai STD code or any other small city with us here at STDcodesindia.com.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":6784661,"ranking":17,"query_text":"what std code is 01764","passage_text":"STD Code of New Delhi, Delhi. 11 is the STD code of New Delhi, Delhi. Above are the details of the New Delhi STD code. Location of New Delhi is also mention in the Google map which helps you know the exact location of the New Delhi in Delhi state.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":6050671,"ranking":18,"query_text":"what std code is 01764","passage_text":"Trace Phone Number. Home â\u0080º STD Codes in India â\u0080º Pune, Pune, MH â\u0080\u0093 STD Code: 020. STD or 'Subscriber Trunk Dialing' codes are designed to dial long distance calls with out any operator assistance. In India, there are 2646 STD Codes under 22 Circles. Each circle is divided into telecom districts under which local telephone exchanges assign numbers to the individuals.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":8732620,"ranking":19,"query_text":"what std code is 01764","passage_text":"VFS appointment questions. Experts, This is my first visa interview. I will really appreciate if you can answer my questions below. 1) VFS appointment-Home Phone number Country Code-STD Code-Phone number I am not able to enter a 3 digit STD code. will really appreciate if you can answer my questions below. 1) VFS appointment-Home Phone number Country Code-STD Code-Phone number I am not able to enter a 3 digit STD code.","bm25_label":"high","relevance_label":0.0},{"query_id":898714,"passage_id":8732621,"ranking":20,"query_text":"what std code is 01764","passage_text":"Originally Posted by sunny354 Experts, This is my first visa interview. I will really appreciate if you can answer my questions below. 1) VFS appointment-Home Phone number Country Code-STD Code-Phone number I am not able to enter a 3 digit STD code. will really appreciate if you can answer my questions below. 1) VFS appointment-Home Phone number Country Code-STD Code-Phone number I am not able to enter a 3 digit STD code.","bm25_label":"high","relevance_label":0.0}]