[{"query_id":899423,"passage_id":7795902,"ranking":1,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"The Nervous System: Ion Channels 1. What structures in the cell membrane function as ion channels? integral proteins 2. Ion channels are selective for specific ions.","bm25_label":"high","relevance_label":1.0},{"query_id":899423,"passage_id":8643493,"ranking":2,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Action potential generation and propagation occurs through, and is regulated by, the function of voltageâ\u0080\u0090gated ion channels â\u0080\u0093 proteins with ionâ\u0080\u0090selective pores that span the cell membrane. Ion channels undergo changes in their structural conformation in response to changes in the electrical field across the membrane.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":805481,"ranking":3,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Ion Channels: Structure and Function. Ion channels are membrane protein complexes and their function is to facilitate the diffusion of ions across biological membranes. Membranes, or phospholipid bilayers, build a hydrophobic, low dielectric barrier to hydrophilic and charged molecules. They are electrical insulators.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":8070179,"ranking":4,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Ion channel. Ion channels are pore-forming membrane proteins whose functions include establishing a resting membrane potential, shaping action potentials and other electrical signals by gating the flow of ions across the cell membrane, controlling the flow of ions across secretory and epithelial cells, and regulating cell volume.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":5708037,"ranking":5,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Ion channels are pore-forming membrane proteins that allow ions to pass through the channel pore. Their functions include establishing a resting membrane potential, shaping action potentials and other electrical signals by gating the flow of ions across the cell membrane, controlling the flow of ions across secretory and epithelial cells, and regulating cell volume. Ion channels are present in the membranes of all cells. Ion channels are one of the two classes of ionophoric proteins, along with ion transporters (including the sodium-potassium pump, sodium-calcium exchanger, and sodium-glucose transport proteins).","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":5854802,"ranking":6,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Structures of Axons. Axons are extended regions of the neuron cell membrane. It starts from a portion of the cell body, known as the axon hillock. From there, the axon extends towards the target cell to what is known as the terminal. Along the cell membrane of the axon will be ion channels and ATP-driven pumps that will regulate ion concentrations within the axon.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":6936401,"ranking":7,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Cells in higher organisms may express more than 100 different types of ion channel, each with different selectivity and different gating properties. Function and structure. The flow of charged ions through open channels represents an electrical current that changes the voltage across the membrane by altering the distribution of charge.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":6571276,"ranking":8,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Periodic paralysis is caused by mutations in the genes that control the development and function of certain ion channels in the muscle membrane. Ion channels are openings that pierce the muscle membrane and act as gateways for the movement of ions in and out of the cell.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":7795899,"ranking":9,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Neuron function principal cell types of the nervous system are: Neurons excitable cells that transmit electrical signals. There are 150 different types. Vary in function and size. Supporting cells (neural glia) cells. Chapter12 types of ion channels and the stimuli that operate gated ion channels. 22. Describe the ions, channels, and integral-protein pumps that contribute to generation of a resting membrane potential.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":2657255,"ranking":10,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"The heart cell rhythm partly depends on the opening and closing of series of gateways within the cell membrane, called ion channels. Some channels let certain ions flow out, others let different ions flow in. The same membrane system is at work in other cells, helping to regulate what stays and what leaves the cell.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":8471372,"ranking":11,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"ï\u0082\u0097 Proteins have many functions in membranes, including: ï\u0082\u0097 Channels that help the passage of ions or molecules ï\u0082\u0097 Enzymes, which control chemical reactions ï\u0082\u0097 Anchors for other cell structures, such as the cytoskeleton ï\u0082\u0097 Receptors, which bind molecular signals that are important for cell-to-cell communication.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":1166932,"ranking":12,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"The human heart, composed of specialized muscle cells, beats to a specific rhythm. The heart cell rhythm partly depends on the opening and closing of series of gateways within the cell membrane, called ion channels. Some channels let certain ions flow out, others let different ions flow in.The same membrane system is at work in other cells, helping to regulate what stays and what leaves the cell. This cell membrane gateway system is specifically called the A) sodium-chlorine pump.B) hydrogen-oxygen pump.ome channels let certain ions flow out, others let different ions flow in. The same membrane system is at work in other cells, helping to regulate what stays and what leaves the cell. This cell membrane gateway system is specifically called the A) sodium-chlorine pump. B) hydrogen-oxygen pump.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":3143499,"ranking":13,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"This could modify the structural conformation of the pore\/channel proteins, creating differences in membrane permeability to specific ions.] Cell membranes, which are vital to the maintenance of intra and extracellular ion concentrations, appear to be important ion permeability barriers in fish.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":8217521,"ranking":14,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Usually, there are 4 factors required for maintaining the selective ion permeability of the cell: 1  Considerable amounts of ATP. 2  Structural Integrity of the Phospholipid Bilayer\/Cell Membrane. 3  Intact Ion Channel Proteins. 4  Normal association of the Membrane with cytoskeletal elements.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":4691873,"ranking":15,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Membrane receptors are mainly divided by structure and function into 3 classes: The ion channel linked receptor; The enzyme-linked receptor; and The G protein-coupled receptor. 1  Ion channel linked receptors have ion channels for anions and cations, and constitute a large family of multipass transmembrane proteins.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":7204537,"ranking":16,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Many ion channels are gated, regulated to be in either the open or closed conformation. Gated ion channels will be described in greater detail in the tutorial entitled Membrane Potential, Ion Transport and Nerve Impulse, which focuses on the transport of ions and the function of nerve cells.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":6171918,"ranking":17,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"1 It determines what enters and leaves the cell. 2  The cell membrane is composed of a double layer of lipid molecules in which proteins float. 3  The proteins function as membrane channels, carrier molecules, receptor molecules, enzymes, and structural components of the membrane.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":908131,"ranking":18,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"The ionic gradients across cell membranes generate a transmembrane voltage that regulates the function of numerous membrane proteins such as ion channels, transporters, pumps and enzymes.","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":26087,"ranking":19,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Lists of functions of a cell membrane (= plasma membrane) can include various numbers of functions because particles can move across the membrane in several different ways, including diffusion via ion channels, active transport via membrane pumps, endocytosis (into the cell) and exocytosis (out of the cell).","bm25_label":"high","relevance_label":0.0},{"query_id":899423,"passage_id":2718027,"ranking":20,"query_text":"what structures in the cell membrane function as ion channels?","passage_text":"Lists of functions of a cell membrane ( = plasma membrane) can include various numbers of functions because particles can move across the membrane in several different ways, including diffusion via ion channels, active transport via membrane pumps, endocytosis (into the cell) and exocytosis (out of the cell).","bm25_label":"high","relevance_label":0.0}]