[{"query_id":900450,"passage_id":8469827,"ranking":1,"query_text":"what tcm means","passage_text":"The code P1698 is: No CCD messages from TCM. That means the communication between the Transmission Control Module and the Power Control Module is lost. Sometimes this happens when a PCM, or TCM is replaced without being flashed, a bad connection at the PCM, TCM, or a bad TCM. Hope this helps.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":6953274,"ranking":2,"query_text":"what tcm means","passage_text":"So if you saw my other video of the new Rock Island Armory tactical 22 TCM...many of you are probably wondering, what exactly is a 22 TCM?This ones for you who wonder. Special thanks to my friend Mike for additional video footage. https:\/\/www.youtube.com\/user\/mikelaputt. 1  Sports.o if you saw my other video of the new Rock Island Armory tactical 22 TCM...many of you are probably wondering, what exactly is a 22 TCM?","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":2051361,"ranking":3,"query_text":"what tcm means","passage_text":"For a TCM practitioner, the name of the disease is of secondary importance. The primary key to the proper diagnosis of syndromes is the identification of the condition in terms of yin or yang. In order to understand what this means let us examine these concepts in the context of human life.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":1939222,"ranking":4,"query_text":"what tcm means","passage_text":"Traditional Chinese Acupuncture (TCM). Traditional Chinese Medicine (TCM) is the most common form of acupuncture studied and practiced in the United States. At the Acupuncture Center, we embrace all aspects of TCM. The main focus in this style is to promote balance to the body, no matter what the condition is.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":7838638,"ranking":5,"query_text":"what tcm means","passage_text":"Chaldean Numerology. The numerical value of tcm in Chaldean Numerology is: 2. Pythagorean Numerology. The numerical value of tcm in Pythagorean Numerology is: 9. Jennifer Dorian: Robert's contributions were fundamental in shaping TCM into what it is today and we owe him a debt of gratitude that can never be repaid.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":1039418,"ranking":6,"query_text":"what tcm means","passage_text":"The emotions are an extremely important aspect of Traditional Chinese Medicine (TCM). Emotional well being is an integral part of health in the TCM model. Each emotion is associated with an organ, which, if out of balance will cause specific symptoms. These are what the experienced acupuncturist or practitioner of TCM is looking for when you walk into their office with a complaint.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":1952940,"ranking":7,"query_text":"what tcm means","passage_text":"As a child growing up in China, I was always aware of Traditional Chinese Medicine (TCM). TCM is what we refer to as Eastern medicine, in contrast to the Western medicine we know from U.S. hospitals. I never understood much about TCM, only that it somehow involves herbs and that many Chinese people used it.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":8601326,"ranking":8,"query_text":"what tcm means","passage_text":"If your tongue is pale or white, then it means that you might have a Qi or blood deficiency. That might mean youâ\u0080\u0099re feeling tired, or have low energy. You can read more about TCM tongue interpretation here.At the time I was visiting my TCM doc, I had a pale white tongue and that was definitely true for me.f your tongue is pale or white, then it means that you might have a Qi or blood deficiency. That might mean youâ\u0080\u0099re feeling tired, or have low energy. You can read more about TCM tongue interpretation here.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":7078335,"ranking":9,"query_text":"what tcm means","passage_text":"Trade Cash Management: TCM: Turtle Creek Manor: TCM: Total Credit Management: TCM: Tuner Classic Movies: TCM: Tube Condenser Microphones: TCM: Total Cost Management: TCM: The Technology Council of Maryland: TCM: Terra Cielo Mare: TCM: Total Cost Model: TCM: Town Centre Management: TCM: Teaching in the Middle: TCM: Total Catchment Management: TCM: Traffic Calming Measures: TCM","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":1952939,"ranking":10,"query_text":"what tcm means","passage_text":"The TCM theory and practice are not based upon scientific knowledge, and there is disagreement between TCM practitioners on what diagnosis and treatments should be used for any given patient. The effectiveness of Chinese herbal medicine remains poorly researched and documented.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":7078334,"ranking":11,"query_text":"what tcm means","passage_text":"Total Conflict Management: TCM: Tranditional Chinese Medicine: TCM: Total Card Management: TCM: Town Center Management: TCM: Tie Clip Microphone: TCM: Treasury Capital Management: TCM: Tool for Conceptual Modeling: TCM: Traditionell Chinesischen Medizin: TCM: Transgenic Chimeric Mouse: TCM: Tech Council of Maryland: TCM: Thurlow Countryside Management: TCM: Thick Cutaneous Melanoma: TCM","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":5609789,"ranking":12,"query_text":"what tcm means","passage_text":"If your tongue is pale or white, then it means that you might have a Qi or blood deficiency. That might mean youâ\u0080\u0099re feeling tired, or have low energy. You can read more about TCM tongue interpretation here. At the time I was visiting my TCM doc, I had a pale white tongue and that was definitely true for me.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":7078339,"ranking":13,"query_text":"what tcm means","passage_text":"TCM: Total Control Management: TCM: Twin Cartridge Machine: TCM: Toxic and Chemical Materials: TCM: Transaction Cost Model: TCM: Transactional Content Management (software) TCM: Town Council Minutes (various locations) TCM: Trade Control Measures: TCM: Traditional Chinese Medicine: TCM: Traditionellen Chinesischen Medizin (German: Traditional Chinese Medicine) TCM","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":4007648,"ranking":14,"query_text":"what tcm means","passage_text":"The term tui na (pronounced twee naw), which literally means pinch and pull, refers to a wide range of Traditional Chinese Medicine (TCM) therapeutic massage and body work.he term tui na (pronounced twee naw), which literally means pinch and pull, refers to a wide range of Traditional Chinese Medicine (TCM) therapeutic massage and body work.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":744682,"ranking":15,"query_text":"what tcm means","passage_text":"Acupuncture. The term tui na (pronounced twee naw), which literally means pinch and pull, refers to a wide range of Traditional Chinese Medicine (TCM) therapeutic massage and body work.cupuncture. The term tui na (pronounced twee naw), which literally means pinch and pull, refers to a wide range of Traditional Chinese Medicine (TCM) therapeutic massage and body work.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":6260545,"ranking":16,"query_text":"what tcm means","passage_text":"What Are The Seven Emotions? TCM also believes that certain organs are related to emotional activities, i.e. the heart is related to joy, the liver to anger, the spleen to pensiveness, the lungs to anxiety and the kidneys to fear. The emotions are considered the major internal causes of disease in TCM.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":7078342,"ranking":17,"query_text":"what tcm means","passage_text":"TCM: Transitional Case Management (various organizations) TCM: Transmission Congestion Management: TCM: Transportation Carrier Management (logistics; various organizations) TCM: Trinity College of Music (UK) TCM: Treasury and Cash Management: TCM: Treasury Capital Market: TCM: Treasury Constant Maturity (US Treasury; also seen as CMT) TCM: Two Component Model: TCM","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":2728297,"ranking":18,"query_text":"what tcm means","passage_text":"TCMS and TCHS Receive Distinction The Telfair County School District is honored to announce that both Telfair County Middle School and Telfair County High School have been named as Georgia schools that â\u0080\u009cbeat the odds in 2016.â\u0080\u009d This designation means that TCMS and TCHS performed better than statistically expected given various statistical factors, ...","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":7281617,"ranking":19,"query_text":"what tcm means","passage_text":"The Thinking Style of TCM. TCM Internal Medicine is a clinical issue dealing with the right of the syndrome differentiation and treatment of internal diseases under the guidance of TCM. The Internal Diseases of TCM includes two categories: exogenous and endogenous diseases.","bm25_label":"medium","relevance_label":0.0},{"query_id":900450,"passage_id":1939224,"ranking":20,"query_text":"what tcm means","passage_text":"Traditional Chinese Acupuncture (TCM). Traditional Chinese Medicine (TCM) is the most common form of acupuncture studied and practiced in the United States. At the Acupuncture Center, we embrace all aspects of TCM.","bm25_label":"medium","relevance_label":0.0}]