[{"query_id":904542,"passage_id":7236566,"ranking":1,"query_text":"what time does sams pharmacy open","passage_text":"What time does Sam's Club pharmacy open? I actually placed this question and answered it because I was so frustrated! You can get club hrs. on the SAM'S CLUB website but not the pharmacy hrs.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":4565627,"ranking":2,"query_text":"what time does sams pharmacy open","passage_text":"The Walmart Pharmacy website allows you to refill your medicine, then track it any time of any day. No more wondering when it would be ready for pick up. If you donâ\u0080\u0099t mind doing that in person, though, find out what time does Walmart Pharmacy open and what time does Walmart Pharmacy close nearest you. STANDARD Walmart Pharmacy Hours. Most Walmart Pharmacy locations are OPEN during hours listed below.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":7791164,"ranking":3,"query_text":"what time does sams pharmacy open","passage_text":"The general Sams Club hours or the 24 hours Sams Clubs tend to be slightly longer than Sams Club pharmacy hours. Pharmacies open at 9 AM and close at 7 PM. The general Sams Club hours or the 24 hours Sams Clubs tend to be slightly longer than Sams Club pharmacy hours.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":2580480,"ranking":4,"query_text":"what time does sams pharmacy open","passage_text":"CVS Pharmacy Hours | What time does CVS Close â\u0080\u0093 Open. CVS Pharmacy Hours : Please Find here a complete list of store hours, holiday hours and open and close time in all states. CVS Pharmacy (also known as CVS\/pharmacy)is the 2nd Largest Pharmacy Chain in USA and has more than ten thousand stores in United States.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":7236560,"ranking":5,"query_text":"what time does sams pharmacy open","passage_text":"Answers.com Â® WikiAnswers Â® Categories Shopping Fashion Clothing What time does Sam's Club open?","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":2294818,"ranking":6,"query_text":"what time does sams pharmacy open","passage_text":"CVS Pharmacy Hours | What time does CVS Close â\u0080\u0093 Open. CVS Pharmacy Hours : Please Find here a complete list of store hours, holiday hours and open and close time in all states. CVS Pharmacy (also known as CVS\/pharmacy)is the 2nd Largest Pharmacy Chain in USA and has more than ten thousand stores in United States. It is also the largest pharmacy in USA in term of revenue.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":7236565,"ranking":7,"query_text":"what time does sams pharmacy open","passage_text":"What time does Sam's Club open the day after Christmas? In 2013, most Sam's Club stores were open the day after Christmas from 10am to 6pm. The hours could be different in 2014. All stores were closed on Christmas Day.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":1991071,"ranking":8,"query_text":"what time does sams pharmacy open","passage_text":"walmart pharmacy hours Walmart Pharmacy hours operate from mid-morning to late evening. These hours work well if you want to refill or pick up a prescription during your lunch or after work. However, there may be times when you donâ\u0080\u0099t want to go in person or refill by phone. The Walmart Pharmacy website allows you to refill your medicine, then track it any time of any day. No more wondering when it would be ready for pick up. If you donâ\u0080\u0099t mind doing that in person, though, find out what time does Walmart Pharmacy open and what time does Walmart Pharmacy close nearest you. STANDARD Walmart Pharmacy Hours. Most Walmart Pharmacy locations are OPEN during hours listed below.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":2580478,"ranking":9,"query_text":"what time does sams pharmacy open","passage_text":"CVS Pharmacy Hours | What time does CVS Close â\u0080\u0093 Open. May 26, 2016May 26, 2016. CVS Pharmacy Hours : Please Find here a complete list of store hours, holiday hours and open and close time in all states. CVS Pharmacy (also known as CVS\/pharmacy)is the 2nd Largest Pharmacy Chain in USA and has more than ten thousand stores in United States.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":7933874,"ranking":10,"query_text":"what time does sams pharmacy open","passage_text":"What Time Does Walgreens Pharmacy Close ? Closing times for Walgreens Pharmacy hours change several times throughout the week. Mondays to Thursdays will usually close at 9pm for the most part, although some are opened later until 10 pm. There are even a few locations that operate until 12 am.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":7791172,"ranking":11,"query_text":"what time does sams pharmacy open","passage_text":"Having a Samâ\u0080\u0099s Club membership gives you access to a lot of bulk goods and affordable bakery, optical, tire, and pharmacy departments. The general Sams Club hours or the 24 hours Sams Clubs tend to be slightly longer than Sams Club pharmacy hours. This article will provide you with Samâ\u0080\u0099s Club operating hours and a list of contact information. Samâ\u0080\u0099s Club Pharmacy Opening Hours","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":2294816,"ranking":12,"query_text":"what time does sams pharmacy open","passage_text":"What time does CVS Pharmacy open? â\u0080\u0093Is CVS Pharmacy open on Sunday? â\u0080\u0093Yes, Itâ\u0080\u0099s open. The average CVS Pharmacy hours are from 07:00 am until 11:00 pm Monday through Friday. On Saturdays you can visit the stores from 09:00 am till 18:00 pm, and on Sundays â\u0080\u0093 from 10:00 am until 06:00 pm.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":4565628,"ranking":13,"query_text":"what time does sams pharmacy open","passage_text":"You can refill and pick up prescriptions, find healthcare plans, and get flu shots. You can even pick up medications for your pet. Need to pick up your medicine, and wonder what time does Walmart Pharmacy open and what time does Walmart Pharmacy close? Youâ\u0080\u0099ve come to the right place. Read about Walmart Pharmacy hours below. Walmart Pharmacy hours operate from mid-morning to late evening. These hours work well if you want to refill or pick up a prescription during your lunch or after work.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":7791165,"ranking":14,"query_text":"what time does sams pharmacy open","passage_text":"Sams Club pharmacy hours can vary slightly depending on individual location. The above hours are just the most common opening hours for the pharmacies. Both Samâ\u0080\u0099s Club and the pharmacy are closed on New Yearâ\u0080\u0099s Day, Easter, Thanksgiving, and Christmas.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":7791170,"ranking":15,"query_text":"what time does sams pharmacy open","passage_text":"Samâ\u0080\u0099s Club Pharmacy Hours â\u0080\u0093 Additional Details. 1  Sams Club pharmacy hours can vary slightly depending on individual location. The above hours are just the most common opening hours for the pharmacies. 2  Both Samâ\u0080\u0099s Club and the pharmacy are closed on New Yearâ\u0080\u0099s Day, Easter, Thanksgiving, and Christmas. more information...","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":8150072,"ranking":16,"query_text":"what time does sams pharmacy open","passage_text":"Sams Pharmacy 10-8194 (SAMS EAST INC) is a Community\/Retail Pharmacy in Bogart, Georgia. The NPI Number for Sams Pharmacy 10-8194 is 1285651521. The current location address for Sams Pharmacy 10-8194 is 4365 Atlanta Hwy, , Bogart, Georgia and the contact number is 706-548-1913 and fax number is --. The mailing address for Sams Pharmacy 10-8194 is 702 Sw 8th St, , Bentonville, Arkansas - 72716-0445 (mailing address contact number - --).","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":5981636,"ranking":17,"query_text":"what time does sams pharmacy open","passage_text":"To qualify, you must (i) open either a Sam's ClubÂ® Consumer MasterCardÂ® or Sam's Club Personal Credit account on SamsClub.com and (ii) make a single-receipt purchase of $100 or more the same day you open your account via SamsClub.com (excluding cash advances, gift card sales, alcohol, tobacco and pharmacy purchases).","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":5095865,"ranking":18,"query_text":"what time does sams pharmacy open","passage_text":"To qualify you must (i) open either a Sam's Club Â® Consumer MasterCard Â® or Sam's Club Personal Credit account on SamsClub.com and (ii) make a single-receipt purchase of $50 or more the same day you open your account via SamsClub.com (excluding cash advances, gift card sales, alcohol, tobacco, and Pharmacy purchases).","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":8150065,"ranking":19,"query_text":"what time does sams pharmacy open","passage_text":"Sams Club Pharmacy in Bogart Georgia; Sams Club Pharmacy, a Pharmacy, in Bogart, GA 30622, address and phone number. Pharmacies provide information on prescription drugs and medicines, name brand, generic and discount drugs, over the counter (OTC) medications.","bm25_label":"medium","relevance_label":0.0},{"query_id":904542,"passage_id":8150069,"ranking":20,"query_text":"what time does sams pharmacy open","passage_text":"Sams Club Pharmacy in Bogart Georgia Sams Club Pharmacy, a Pharmacy, in Bogart, GA 30622, address and phone number. Pharmacies provide information on prescription drugs and medicines, name brand, generic and discount drugs, over the counter (OTC) medications.","bm25_label":"medium","relevance_label":0.0}]