[{"query_id":917825,"passage_id":7323957,"ranking":1,"query_text":"what was al capone's first crime","passage_text":"THE LEXINGTON HOTEL. AL CAPONE'S FORMER HEADQUARTERS. In 1986, television reporter and talk show host Geraldo Rivera took a national television audience into what was then one of the last remaining landmarks of the Chicago crime era and the reign of Al Capone -- the old Lexington Hotel at the corner of Michigan Avenue and 22nd Street.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":1637405,"ranking":2,"query_text":"what was al capone's first crime","passage_text":"The Crimes. A crackdown on racketeering in Chicago meant that Al Capone's first mobster job was to move operations to Cicero. With the assistance of his brothers Frank (Salvatore) and Ralph, Capone infiltrated the government and police departments.ven though Al Capone was conveniently in Florida, the police and the newspapers knew who had staged the massacre. The St. Valentine's Day Massacre became a national media event immortalizing Capone as the most ruthless, feared, smartest and elegant of gangland bosses.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":4566147,"ranking":3,"query_text":"what was al capone's first crime","passage_text":"Organized crime figure Frank The Enforcer Nitti was a member of Al Capone&rsquo;s Chicago gang, and the front man for Capone&rsquo;s empire when Capone was imprisoned.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":3683548,"ranking":4,"query_text":"what was al capone's first crime","passage_text":"Al Capone Goes to Prison â\u0080\u0094 But Not for the Massacre. Al Capone was in Florida at the time of the St. Valentineâ\u0080\u0099s Day Massacre and claimed he had nothing to do with it. He was never arrested or prosecuted in connection with the crime. However, Capone did end up going to prison â\u0080\u0094 twice â\u0080\u0094 soon after the Massacre, effectively ending his reign as the leader of Chicago organized crime.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":3683555,"ranking":5,"query_text":"what was al capone's first crime","passage_text":"Al Capone Goes to Prison â\u0080\u0094 But Not for the Massacre Al Capone was in Florida at the time of the St. Valentineâ\u0080\u0099s Day Massacre and claimed he had nothing to do with it. He was never arrested or prosecuted in connection with the crime. However, Capone did end up going to prison â\u0080\u0094 twice â\u0080\u0094 soon after the Massacre, effectively ending his reign as the leader of Chicago organized crime.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":8189177,"ranking":6,"query_text":"what was al capone's first crime","passage_text":"These resources are going to test you on the life of Al Capone by asking you about things like his rise to power, city of power, and public persona. Quiz & Worksheet Goals. The aim of this quiz and worksheet is to ask you about: Where Capone was a crime boss How Capone became a crime boss Aspects of Capone's public persona","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":1637411,"ranking":7,"query_text":"what was al capone's first crime","passage_text":"Al Capone, only 26-years old, was now in charge of a very large crime organization that included brothels, nightclubs, dance halls, race tracks, gambling establishments, restaurants, speakeasies, breweries, and distilleries. As a major crime boss in Chicago, Capone put himself in the public's eye.apone, who was both charming and charitable as well as powerful and vicious, became an iconic figure of the successful American gangster. Al Capone was the fourth of nine children born to Gabriele and Teresina (Teresa) Capone.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":4550401,"ranking":8,"query_text":"what was al capone's first crime","passage_text":"The Many Moods of Al Capone. There's more than meets the eye to Al Capone, the Prohibition-era leader of organized crime in Chicago. During Americaâ\u0080\u0099s Prohibition era, Al Capone headed a Chicago-based crime empire that raked in millions of dollars each year through bootlegging, gambling and other illicit activities. Check out eight surprising facts about the notorious mob boss. Capone was in a street gang as a child. 1  He hated his famous nickname. 2  Caponeâ\u0080\u0099s crime gang raked in as much as $100 million annually. 3  He was never charged in connection with the St. Valentineâ\u0080\u0099s Day Massacre. 4  Eliot Nessâ\u0080\u0099s role in Caponeâ\u0080\u0099s downfall was exaggerated. 5  Capone was convicted for tax fraud but not murder.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":5298516,"ranking":9,"query_text":"what was al capone's first crime","passage_text":"What crime was al Capone put in jail for? Al Capone was put in jail for Tax Evasion~ the government knew he was getting lots of income (alcohol and prostitution) and they had to try and pin in all back to him (thats wâ\u0080¦hy it took so long). Even though he had committed murders and was selling illegal alcohol they could only put him in jail for Tax Evasion.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":7948860,"ranking":10,"query_text":"what was al capone's first crime","passage_text":"fagit.. - Al Capone. Alphonse Gabriel Capone (January 17, 1899 â\u0080\u0093 January 25, 1947), popularly known as Al Capone, was an American gangster who led a crime syndicate dedicated to the smuggling and bootlegging of liquor and other illegal activities during the Prohibition Era of the 1920s and 1930s. Born in Brooklyn, Ne;kj].","bm25_label":"high","relevance_label":1.0},{"query_id":917825,"passage_id":1637408,"ranking":11,"query_text":"what was al capone's first crime","passage_text":"Al Capone-Random Facts (TV-14; 2:00) Al Capone is best known as the Prohibition-era leader of organized crime in Chicago, however, there's more than meets the eye to this criminal mastermind.ven though Al Capone was conveniently in Florida, the police and the newspapers knew who had staged the massacre. The St. Valentine's Day Massacre became a national media event immortalizing Capone as the most ruthless, feared, smartest and elegant of gangland bosses.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":1637407,"ranking":12,"query_text":"what was al capone's first crime","passage_text":"Share. Al Capone was a notorious gangster who ran an organized crime syndicate in Chicago during the 1920s, taking advantage of the era of Prohibition. Capone, who was both charming and charitable as well as powerful and vicious, became an iconic figure of the successful American gangster.Al Capone was the fourth of nine children born to Gabriele and Teresina (Teresa) Capone. Although Capone's parents had emigrated from Italy, Al Capone grew up in Brooklyn, New York.It was through the Five Points gang that Al Capone came to the attention of brutal New York mobster Frankie Yale.apone, who was both charming and charitable as well as powerful and vicious, became an iconic figure of the successful American gangster. Al Capone was the fourth of nine children born to Gabriele and Teresina (Teresa) Capone.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":7323958,"ranking":13,"query_text":"what was al capone's first crime","passage_text":"Hosted by TV personality Geraldo Rivera, the special centered on the opening of a secret vault in the Lexington Hotel once owned by noted crime lord Al Capone, which turned out to be empty except for debris. The Mystery Of Al Capone's Vault is available in its entirety on Geraldo's website.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":4203706,"ranking":14,"query_text":"what was al capone's first crime","passage_text":"Al Capone had started gangs in the 1800's, Al Capone and Other Major bosses had controlled most of the nation's organized crime, later youth gangs had gone into style in the 1950's and in the 1970's, the increase of guns and physical violence had come into play.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":7948970,"ranking":15,"query_text":"what was al capone's first crime","passage_text":"Alphonse CAPONE (1900 - 1944) Once known as Public Enemy Number one, Al (Scar Face) Capone is, perhaps, one of the most famous criminals in America. Coming from an impoverished Italian Neapolitan family, Capone began his career in crime as a Lieutenant in the Five Points gang in Manhattan.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":2499345,"ranking":16,"query_text":"what was al capone's first crime","passage_text":"| Al Capone Goes To Atlantic City | Al Capone and Friends: | Al Capone and Miami | Al Capone Goes to Cuba | The Real Al Capone Quotes | Capone at the Ballpark | Al Capone's Death and Funeral | The St. Valentine's Day Massacre | The Massacre Pt.2 | Massacre Victim's Stats.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":7594512,"ranking":17,"query_text":"what was al capone's first crime","passage_text":"what type of car did Al capone drive. Topics: Automotive â\u0080º Al Capone, American Mafia History, United States History, History, Technology. Answer. Al Capone had several cars, at least 2 of those were identical armored cars that were 1928 Cadillacs.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":4456195,"ranking":18,"query_text":"what was al capone's first crime","passage_text":"Al Capone's haunted Chicago Cullerton Hotel and paranormal experiences there. Inside the Chicago paranormal haunted Al Capone's Cullerton Hotel. Inside the Chicago paranormal haunted Al Capone's Cullerton Hotel. by Edward Shanahan. The Chicago paranormal field has a hidden treasure in what is now the Blue Star Auto Store.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":7323956,"ranking":19,"query_text":"what was al capone's first crime","passage_text":"| Al Capone Goes To Atlantic City | Al Capone and Friends: | Al Capone Goes to Cuba | The Real Al Capone Quotes | Capone at the Ballpark | Al Capone's Death and Funeral | The St. Valentine's Day Massacre | The Massacre Pt.2 | Massacre Victim's Stats.","bm25_label":"high","relevance_label":0.0},{"query_id":917825,"passage_id":7251938,"ranking":20,"query_text":"what was al capone's first crime","passage_text":"Al Capone, byname of Alphonse Capone, also called Scarface, (born January 17, 1899, Brooklyn, New York, U.S.â\u0080\u0094died January 25, 1947, Palm Island, Florida), the most famous American gangster, who dominated organized crime in Chicago from 1925 to 1931.","bm25_label":"high","relevance_label":0.0}]