[{"query_id":921348,"passage_id":1049075,"ranking":1,"query_text":"what was the major result of the industrial revolution","passage_text":"What was the 'Industrial Revolution'. The Industrial Revolution was a period of major industrialization that took place during the late 1700s and early 1800s.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":8840527,"ranking":2,"query_text":"what was the major result of the industrial revolution","passage_text":"This change prompted the reinstatement of the mercantilist ideas that were thought to have died out. Increased industrialization was a major component of the Market Revolution as a result of the Industrial Revolution.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":6490908,"ranking":3,"query_text":"what was the major result of the industrial revolution","passage_text":"Background. The Industrial Revolution began in Great Britain in the early 19th century before spreading to Belgium, France, Germany, the United States and Japan. It was a fundamental change in the way goods were produced, and altered the way people lived.A result of the Industrial Revolution was a movement of people and goods all around the world as global trade and migrations increased. Trade. A major result of the Industrial Revolution was an increase in global trade.Many industrial countries sought new markets for their goods, and raw materials from which to make those goods. A result of this increase in trade was imperialism of Africa, India, China, and much of the rest of Asia.rade. A major result of the Industrial Revolution was an increase in global trade. Many industrial countries sought new markets for their goods, and raw materials from which to make those goods. A result of this increase in trade was imperialism of Africa, India, China, and much of the rest of Asia.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":6490912,"ranking":4,"query_text":"what was the major result of the industrial revolution","passage_text":"The Industrial Revolution began in Great Britain in the early 19th century before spreading to Belgium, France, Germany, the United States and Japan.rade. A major result of the Industrial Revolution was an increase in global trade. Many industrial countries sought new markets for their goods, and raw materials from which to make those goods. A result of this increase in trade was imperialism of Africa, India, China, and much of the rest of Asia.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":7920535,"ranking":5,"query_text":"what was the major result of the industrial revolution","passage_text":"Background. The Industrial Revolution began in Great Britain in the early 19th century before spreading to Belgium, France, Germany, the United States and Japan. It was a fundamental change in the way goods were produced, and altered the way people lived.A result of the Industrial Revolution was a movement of people and goods all around the world as global trade and migrations increased. Trade. A major result of the Industrial Revolution was an increase in global trade.Many industrial countries sought new markets for their goods, and raw materials from which to make those goods. A result of this increase in trade was imperialism of Africa, India, China, and much of the rest of Asia.he Industrial Revolution began in Great Britain in the early 19th century before spreading to Belgium, France, Germany, the United States and Japan.","bm25_label":"high","relevance_label":1.0},{"query_id":921348,"passage_id":2865571,"ranking":6,"query_text":"what was the major result of the industrial revolution","passage_text":"Industrial Revolution. The major inventions of the Industrial Revolution-American-British and European-the Industrial Revolution defined was the widespread replacement of manual labor by new inventions or machinery.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":3827368,"ranking":7,"query_text":"what was the major result of the industrial revolution","passage_text":"Background. The Industrial Revolution began in Great Britain in the early 19th century before spreading to Belgium, France, Germany, the United States and Japan.It was a fundamental change in the way goods were produced, and altered the way people lived.rade. A major result of the Industrial Revolution was an increase in global trade. Many industrial countries sought new markets for their goods, and raw materials from which to make those goods. A result of this increase in trade was imperialism of Africa, India, China, and much of the rest of Asia.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":2438665,"ranking":8,"query_text":"what was the major result of the industrial revolution","passage_text":"Second Industrial Revolution â\u0080\u0093 information on how the Industrial Revolution of the 19th Century changed manufacturing. Industrial Revolution â\u0080\u0093 brief overview of the changes resulting from the Industrial Revolution.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":2138805,"ranking":9,"query_text":"what was the major result of the industrial revolution","passage_text":"The Market Revolution which occurred in the United States, in the 19th century, is an historical model which argues that there was a drastic change of the economy, which reoriented and coordinated all aspects of the economy in line with both the nation and the world.raditional commerce was made obsolete by improvements in transportation and communication. This change prompted the reincarnation of the mercantilist ideas that were thought to have died out. Increased industrialization was a major component of the Market Revolution as a result of the Industrial Revolution.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":4892151,"ranking":10,"query_text":"what was the major result of the industrial revolution","passage_text":"The development of the stationary steam engine was an important element of the Industrial Revolution; however, for most of the period of the Industrial Revolution, the majority of industrial power was supplied by water and wind.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":6500617,"ranking":11,"query_text":"what was the major result of the industrial revolution","passage_text":"Another major industry of the later Industrial Revolution was gas lighting. Though others made a similar innovation elsewhere, the large-scale introduction of this was the work of William Murdoch, an employee of Boulton and Watt, the Birmingham steam engine pioneers.he development of the stationary steam engine was an important element of the Industrial Revolution; however, for most of the period of the Industrial Revolution, the majority of industrial power was supplied by water and wind.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":2865569,"ranking":12,"query_text":"what was the major result of the industrial revolution","passage_text":"The major inventions of the Industrial Revolution-American-British and European-the Industrial Revolution defined was the widespread replacement of manual labor by new inventions or machinery.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":1644974,"ranking":13,"query_text":"what was the major result of the industrial revolution","passage_text":"DEFINITION of 'Industrial Revolution'. A period of major industrialization that took place during the late 1700s and early 1800s. The Industrial Revolution, beginning in Great Britain, quickly spread throughout the world.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":3754168,"ranking":14,"query_text":"what was the major result of the industrial revolution","passage_text":"Industrial Revolution Inventions Timeline â\u0080\u0093 1712-1942. Major Inventions of the Industrial Revolution: 1712 â\u0080\u0093 Thomas Newcomen patents the atmospheric steam engine.1733 â\u0080\u0093 John Kay invents the flying shuttle.ndustrial Revolution Inventions Timeline â\u0080\u0093 1712-1942. Major Inventions of the Industrial Revolution: 1712 â\u0080\u0093 Thomas Newcomen patents the atmospheric steam engine. 1733 â\u0080\u0093 John Kay invents the flying shuttle.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":1308763,"ranking":15,"query_text":"what was the major result of the industrial revolution","passage_text":"Effects of the Industrial Revolution-The Industrial Revolution that took place throughout the 18th and the 19th centuries had major effects which influenced every aspect of society and life such as, urbanization, imperialism and nationalism.ndustrial Revolution as a Time of Change-Industrial Revolution as a Time of Change The Industrial Revolution was a time of drastic change that transformed hand tools and hand made items to machine manufactured and produced goods. Inventions brought on the most drastic changes during the Industrial Revolution.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":6500618,"ranking":16,"query_text":"what was the major result of the industrial revolution","passage_text":"Some economists say that the major impact of the Industrial Revolution was that the standard of living for the general population began to increase consistently for the first time in history, although others have said that it did not begin to meaningfully improve until the late 19th and 20th centuries.he development of the stationary steam engine was an important element of the Industrial Revolution; however, for most of the period of the Industrial Revolution, the majority of industrial power was supplied by water and wind.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":7511327,"ranking":17,"query_text":"what was the major result of the industrial revolution","passage_text":"Britain led the world through the First Industrial Revolution. While the British continued to play a major role in the Second Industrial Revolution, Britain's position as world economic leader was lost to Germany and the United States of America.he First Industrial Revolution saw steam-powered machines replace human labour in industry. The Second Industrial Revolution saw electricity replace steam as the main power source in industry.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":6855964,"ranking":18,"query_text":"what was the major result of the industrial revolution","passage_text":"Eric Williams Racism was the result and not the cause of slavery; slave economies were a major source of capital for the industrial revolution; abolition came when slave economies were declining in profitability; abolition was driven more by economic interests than by philanthropy.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":4212408,"ranking":19,"query_text":"what was the major result of the industrial revolution","passage_text":"The Industrial Revolution began in Great Britain for a number of reasons Two advantages Great Britain had which were necessary for industrialization were? Coal and iron is what gave Britain an advantage in the Industrial Revolution.   coal and iorn is what gave Britain an advantage in the Industrial Revolution.","bm25_label":"high","relevance_label":0.0},{"query_id":921348,"passage_id":5914035,"ranking":20,"query_text":"what was the major result of the industrial revolution","passage_text":"The development of the stationary steam engine was an important element of the Industrial Revolution; however, for most of the period of the Industrial Revolution, the majority of industrial power was supplied by water and wind. In Britain by 1800 an estimated 10,000 horsepower was being supplied by steam.","bm25_label":"high","relevance_label":0.0}]