[{"query_id":927989,"passage_id":5209817,"ranking":1,"query_text":"what year was metallica release their first album","passage_text":"METALLICA: Limited-Edition 'Master Of Puppets' Graphic Series Guitar Released By ESP. Believe it or not, it was thirty years ago, in spring 1986, that METALLICA released what some people consider to be one of their greatest albums: Master Of Puppets.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":7885720,"ranking":2,"query_text":"what year was metallica release their first album","passage_text":"Metallica is preparing to self-destruct â\u0080\u0094 in a good way! The band announced Thursday it's releasing its first album in eight years, the longest Metallica has ever gone between studio albums. Hardwired ... To Self-Destruct will feature 80 minutes of music from the veteran heavy metal group. The album is scheduled for release Nov. 18.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":5204745,"ranking":3,"query_text":"what year was metallica release their first album","passage_text":"This article is about the Metallica album. For the title track of the album, see Master of Puppets (song) . Master of Puppets is the third studio album by American heavy metal band Metallica, released on March 3, 1986 by Elektra Records. Recorded at the Sweet Silence Studios with producer Flemming Rasmussen, it was the first Metallica album released on a major label.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":5209816,"ranking":4,"query_text":"what year was metallica release their first album","passage_text":"METALLICA: Limited-Edition 'Master Of Puppets' Graphic Series Guitar Released By ESP. June 21, 2016 0 Comments. Believe it or not, it was thirty years ago, in spring 1986, that METALLICA released what some people consider to be one of their greatest albums: Master Of Puppets.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":7885722,"ranking":5,"query_text":"what year was metallica release their first album","passage_text":"LOS ANGELES â\u0080\u0094 Metallica is preparing to self-destruct â\u0080\u0094 in a good way. The band announced Thursday, Aug. 18, that itâ\u0080\u0099s releasing its first album in eight years, the longest Metallica has ever gone between studio albums. â\u0080\u009cHardwired ... To Self-Destructâ\u0080\u009d will feature 80 minutes of music from the veteran heavy metal group. The album is scheduled for release Nov. 18.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":5209812,"ranking":6,"query_text":"what year was metallica release their first album","passage_text":"First month Free. Master of Puppets is the third studio album by American heavy metal band Metallica, released on March 3, 1986 by Elektra Records. Recorded at the Sweet Silence Studios with producer Flemming Rasmussen, it was the first Metallica album released on a major record label.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":5209811,"ranking":7,"query_text":"what year was metallica release their first album","passage_text":"This article is about the album. For the title track of the album, see Master of Puppets (song). Master of Puppets is the third studio album by American heavy metal band Metallica, released on March 3, 1986 by Elektra Records. Recorded at the Sweet Silence Studios with producer Flemming Rasmussen, it was the first Metallica album released on a major record label.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":60175,"ranking":8,"query_text":"what year was metallica release their first album","passage_text":"Metallica's first studio album since Burton's death, ...And Justice for All, was released in 1988. The album was a commercial success, reaching number six on the Billboard 200, and was the band's first album to enter the top 10. The album was certified platinum nine weeks after its release.","bm25_label":"high","relevance_label":1.0},{"query_id":927989,"passage_id":7885724,"ranking":9,"query_text":"what year was metallica release their first album","passage_text":"Metallica Fans Rejoice! The New Album Is Upon Us! The news just broke a couple of hours ago that Metallica will finally be releasing their long awaited new album. The album is called Hardwiredâ\u0080¦ To Self-Destruct. This album has been greatly anticipated and there have been many speculations as to what it would possibly sound like.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":1361758,"ranking":10,"query_text":"what year was metallica release their first album","passage_text":"Metallica's Black Album: 10 Things You Didn't Know. Find out little-known facts about Metallica's self-titled breakthrough LP, released 25 years ago. Colloquially known as the Black Album, Metallica's self-titled fifth album still towers over the modern hard-rock and metal landscape like a giant obsidian monolith.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":33237,"ranking":11,"query_text":"what year was metallica release their first album","passage_text":"Metallica's first studio album since Burton's death, ...And Justice for All, was released in 1988. The album was a commercial success, reaching number six on the Billboard 200, and was the band's first album to enter the top 10.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":6478457,"ranking":12,"query_text":"what year was metallica release their first album","passage_text":"Metallica (also known as The Black Album) is the eponymously titled fifth studio album by American heavy metal band Metallica. It was released on August 12, 1991, through Elektra Records, received widespread critical acclaim and became the band's best selling album.he recording of Metallica was troubled; the band frequently entered conflicts with Bob Rock, the band's new producer, during production. The album debuted at number one in ten countries and spent four consecutive weeks at the top spot of the Billboard 200, making it Metallica's first album to top album charts.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":8702048,"ranking":13,"query_text":"what year was metallica release their first album","passage_text":"...and Justice for All was Metallica's best-selling album upon its release. Metallica released four singles,  Eye of the Beholder ,  Harvester of Sorrow ,  ...and Justice for All  and . One . ...and Justice for All was Metallica's breakthrough album and reached number six on the Billboard 200.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":1361759,"ranking":14,"query_text":"what year was metallica release their first album","passage_text":"Enter Sandman is a song by American heavy metal band Metallica. It was released as the first single from their eponymous fifth album, Metallica in 1991. The music was written by Kirk Hammett, James Hetfield and Lars Ulrich.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":3639880,"ranking":15,"query_text":"what year was metallica release their first album","passage_text":"Metallica's third studio album, Master of Puppets, was recorded at Sweet Silence Studios and was released in March 1986. The album reached number 29 on the Billboard 200 and spent 72 weeks on the chart. It was the band's first album to be certified gold on November 4, 1986, and was certified six times platinum in 2003.n 1989, Metallica received its first Grammy Award nomination for ...And Justice for All in the new Best Hard Rock\/Metal Performance Vocal or Instrument category. Metallica was the favorite to win but the award was given to Jethro Tull for the album Crest of a Knave.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":2262844,"ranking":16,"query_text":"what year was metallica release their first album","passage_text":"Watch the video, get the download or listen to Metallica â\u0080\u0093 The Unforgiven for free. The Unforgiven appears on the album Metallica. The Unforgiven is a song by the American heavy metal band Metallica. It was released as the third single from their fifth album Metallica. Though one of the slower tracks on the album, its chord progression is distinctly one of the heavier.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":60169,"ranking":17,"query_text":"what year was metallica release their first album","passage_text":"In August 1984, Ride the Lightning was released, and did slightly better than their debut, reaching #100 on the charts. This album was seen as an improvement on their first album, furthering their rise to fame. In 1985, Metallica appeared at the Monsters of Rock festival, appearing fourth on the bill. In March of 1986 Master of Puppets was released and was their first bona fide hit album, reaching #29 on the charts - a huge success for a thrash metal band. However, on tour in Sweden that year, a horrific accident occured.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":6195805,"ranking":18,"query_text":"what year was metallica release their first album","passage_text":"Enter Sandman was released as the first single from their eponymous fifth album, Metallica. The music was written by Kirk Hammett, James Hetfield and Lars Ulrich.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":8702052,"ranking":19,"query_text":"what year was metallica release their first album","passage_text":"METALLICA recently celebrated the 25th anniversary of the release of â\u0080¦And Justice For All , the band's fourth studio album and first to reach both the Top 10 on the Billboard album chart and the one million mark in sales.","bm25_label":"high","relevance_label":0.0},{"query_id":927989,"passage_id":1361763,"ranking":20,"query_text":"what year was metallica release their first album","passage_text":"Enter Sandman was the second music video from Metallica. It was also the first of six Metallica music videos directed by Wayne Isham. Recorded on July 3, 1991 in Los Angeles, it premiered on July 30, 1991, two weeks before the release of the album.","bm25_label":"high","relevance_label":0.0}]