[{"query_id":933236,"passage_id":7804066,"ranking":1,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"what temperature is it in tucson arizona right now? kgb answers Â» Local & Lookup Â» Weather Â» what temperature is it in tucson arizona right now? According to Weatherbug.com, the current temperature in Tucson, AZ is 46.9 degrees Fahrenheit.","bm25_label":"high","relevance_label":1.0},{"query_id":933236,"passage_id":64558,"ranking":2,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"In 1862, the California Column drove the Confederate forces out of Arizona. Tucson and all of what is now Arizona were part of New Mexico Territory until 1863, when they became part of the new Arizona Territory. From 1867 to 1877, Tucson was the capital of the Arizona Territory. Tucson was incorporated in 1877, making it the oldest incorporated city in Arizona.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":4745917,"ranking":3,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Hottest Arizona temperature occurred 20 years ago - Tucson News Now. Hottest Arizona temperature occurred 20 years ago. A Newpaper from Lake Havasu City after the hottest day in Arizona. Image credit to Jon Fishman.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":1497502,"ranking":4,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Current time now in Time Zone: America Phoenix (Arizona - Mountain Standard Time) What time zone is Tucson Arizona Time in? Mountain Standard Time = Tucson Arizona Time Standard Time is 7 hours behind Greenwich Mean Time ( GMT-7 ). Tucson Arizona Time does not operate Daylight-Saving Time and so operates Mountain Standard Time all year around.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":8500686,"ranking":5,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Lets start with the Tucson area by comparing it to Phoenix. Tucson Arizona is about a one and a half hour drive south of Phoenix Arizona. Tucson is located about 60 minutes north. Tucson's Dove Mountain area. of the Mexican border town of Nogales Arizona. also believe living expenses are less in Tucson however. Now letâ\u0080\u0099s move to the Phoenix, AZ area and what it offers residents. Phoenix Arizona is a metropolis in every way one thinks of a metropolis. It offers literally everything a person could want at any time.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":2006299,"ranking":6,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Tucson weather averages and climate Tucson, Arizona. The monthly temperature, precipitation and hours of sunshine. A climate graph showing the rainfall data, temperatures and normals. Average weather Tucson, AZ.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":7697388,"ranking":7,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Publishing rights for most of Adams's photographs are now handled by the trustees of The Ansel Adams Publishing Rights Trust. An archive of Ansel Adams's work is located at the Center for Creative Photography (CCP) at the University of Arizona in Tucson.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":8125708,"ranking":8,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Climate Graphs. 1  Latest temperature\/precipitation graphs across southeast Arizona. 2  Average daily dewpoint for Tucson. 3  Daily record high temperatures for Tucson. 4  Daily record low temperatures for Tucson. 5  Daily record precipitation for Tucson. 6  Yearly occurrences of 100 degrees for Tucson.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":3555618,"ranking":9,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Average Temperatures in Tucson, Arizona, Usa. The annual average temperature in Tucson, Arizona, Usa is warm at 20.2 degrees Celsius (68.4 degrees Fahrenheit). There is a variation of average monthly temperatures of 19.6 C (35.3F) which is a slightly low range. The range\/ variation of diurnal average temperatures is 15.3 C (27.5 F).","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":1489460,"ranking":10,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Temperature. The warmest month in Tucson International, Tucson, Arizona is June with an average high temperature of 101.5Â°F. The hottest day on record was June 27 1990 when the temperature hit 117.0Â°F.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":8500683,"ranking":11,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"-Jobs pay a little less in Tucson than Phoenix. I also believe living expenses are less in Tucson however. Now letâ\u0080\u0099s move to the Phoenix, AZ area and what it offers residents. Phoenix Arizona is a metropolis in every way one thinks of a metropolis.It offers literally everything a person could want at any time. also believe living expenses are less in Tucson however. Now letâ\u0080\u0099s move to the Phoenix, AZ area and what it offers residents. Phoenix Arizona is a metropolis in every way one thinks of a metropolis. It offers literally everything a person could want at any time.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":1711744,"ranking":12,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Weather in Tucson in September 2016. Check the weather in Tucson in September before you book your next holiday in Arizona. Long-term weather averages give the best indication of the weather in September 2016 and include figures for temperature, sunshine and rainfall for Tucson, Arizona, United States.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":4440152,"ranking":13,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Weather in Tucson in June 2017. Check the weather in Tucson in June before you book your next holiday in Arizona. Long-term weather averages give the best indication of the weather in June 2017 and includes figure for temperature, sunshine and rainfall for Tucson, Arizona, United States.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":4629442,"ranking":14,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"temperature the warmest month in tucson international tucson arizona is june with an average high temperature of 101 5 f the hottest day on record was june 27 1990 when the temperature hit 117 0 f","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":340621,"ranking":15,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Home : Climate Graphs: Arizona : Tucson. Average Temperatures for Tucson. Tucson's coldest month is January when the average temperature overnight is 38.9Â°F. In June, the warmest month, the average day time temperature rises to 100.2Â°F. The driest month in Tucson is May with 0.24 inches of precipitation, and with 2.30 inches August is the wettest month.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":1489457,"ranking":16,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"The warmest month in Tucson International, Tucson, Arizona is June with an average high temperature of 101.5Â°F. The hottest day on record was June 27 1990 when the temperature hit 117.0Â°F.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":8563856,"ranking":17,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Arizona Weather > Tucson Weather. Tucson, AZ climate is hot during summer when temperatures tend to be in the 80's and cool during winter when temperatures tend to be in the 50's.","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":4745919,"ranking":18,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Now back on that date of June 29th, 1913, Tucson was hot but not the hottest we have ever been. The hottest temperature for Tucson was 117Â° on June 26th, 1990. Phoenix on that date saw 117Â° while Douglas was much cooler. Monsoon moisture probably moved in and kept the southern corner of Arizona cooler with clouds as Douglas was only 106Â° (still hot).","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":4629441,"ranking":19,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"the warmest month in tucson international tucson arizona is june with an average high temperature of 101 5 f the hottest day on record was june 27 1990 when the temperature hit 117 0 f","bm25_label":"high","relevance_label":0.0},{"query_id":933236,"passage_id":8563853,"ranking":20,"query_text":"what's the temperature in tucson arizona right now?","passage_text":"Arizona Weather > Tucson Estates Weather. Tucson Estates, AZ climate is hot during summer when temperatures tend to be in the 80's and cool during winter when temperatures tend to be in the 50's.","bm25_label":"high","relevance_label":0.0}]