[{"query_id":938359,"passage_id":2169121,"ranking":1,"query_text":"when did eritrea gain independence","passage_text":"Eritrea reached an amicable divorce with Ethiopia's new rulers and gained independence from Ethiopia in 1993. Relations between the one-time allies soured when Eritrea introduced its own currency in November in an effort to reassert its independence, triggering a trade war.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":6931852,"ranking":2,"query_text":"when did eritrea gain independence","passage_text":"From the 1950s, African countries began to gain their independence. 1  In 1950, four African countries â\u0080\u0093 Liberia, South Africa, Egypt and Ethiopia â\u0080\u0093 were independent. The majority gained their independence over the next 30 years, though Namibia and Eritrea had to wait until the 1990s.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":7977301,"ranking":3,"query_text":"when did eritrea gain independence","passage_text":"Eritrea got its independence in 1991 but techoncally in 1993 that is when they declared their independence.","bm25_label":"high","relevance_label":1.0},{"query_id":938359,"passage_id":3879918,"ranking":4,"query_text":"when did eritrea gain independence","passage_text":"How did Brazil gain its independence? A: Brazil gained its independence on September 7th, 1822, when Dom Pedro proclaimed Brazil's independence after an antagonistic relationship with Portugal proved too much for the Brazilian people. It all began when Napoleon I invaded Portugal in 1807.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":7252408,"ranking":5,"query_text":"when did eritrea gain independence","passage_text":"In May 1993 the people of Eritrea voted in a referendum for full independence from Ethiopia. Eritrea became Africa's fifty-third sovereign state and at the same time Ethiopia became Africa's fifteenth land-locked state. More importantly Eritrea's independence marked the end of the longest running, most destructive wars in post-independence Africa.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":78086,"ranking":6,"query_text":"when did eritrea gain independence","passage_text":"When did Central African Republic Chad Mali and Niger gain independence? The CAR gained independence in 1960, along with Chad, Niger, and Mali. France apparently granted independence to all of its colonies in the same time frame, although exact datâ\u0080¦es vary. I got this info from the CIA factbook.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":5042150,"ranking":7,"query_text":"when did eritrea gain independence","passage_text":"By 1913, the Europeans had drawn boundaries for their 40 new states or â\u0080\u0098coloniesâ\u0080\u0099. These boundaries form the basis of the African nations we have today. After the destruction of World War II, European countries no longer had the economic muscle or determination to rule Africa. From the 1950s, African countries began to gain their independence. 1  In 1950, four African countries â\u0080\u0093 Liberia, South Africa, Egypt and Ethiopia â\u0080\u0093 were independent. The majority gained their independence over the next 30 years, though Namibia and Eritrea had to wait until the 1990s.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":8778243,"ranking":8,"query_text":"when did eritrea gain independence","passage_text":"Why did US get its independence from the British much earlier than India? What did the US gain and lost after independence? What was the reason for English speaking regions that now form Canada did not join the thirteen colonies that declared independence from the U... The US was one of the first European colonies to gain independence.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":8382436,"ranking":9,"query_text":"when did eritrea gain independence","passage_text":"The Vietnamese language did not achieve status as an official language until the 20th century, when the country of Vietnam gained independence from French rule.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":2947425,"ranking":10,"query_text":"when did eritrea gain independence","passage_text":"The tax issue served as fuel to the fire. Soon, the heated debates led to war and to the formal declaration of US independence from Great Britain, written by Thomas Jefferson. This hatched the exact day of when did America gain independence.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":6378656,"ranking":11,"query_text":"when did eritrea gain independence","passage_text":"It never gained independence from anyone because it was never under the control of any other country. Actually it did gain independence again in 1952 from US occupation after World War II.The state does not need to be democratic to be independent, and Japan operates under a parliamentary government with a constitutional monarchy.Ending an occupation does not imply gaining independence.ctually it did gain independence again in 1952 from US occupation after World War II. The state does not need to be democratic to be independent, and Japan operates under a parliamentary government with a constitutional monarchy. Ending an occupation does not imply gaining independence.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":8597967,"ranking":12,"query_text":"when did eritrea gain independence","passage_text":"South Sudan gained independence from Sudan in July 2011 as the outcome of a 2005 peace deal that ended Africa's longest-running civil war. An overwhelming majority of South Sudanese voted in a January 2011 referendum to secede and become Africa's first new country since Eritrea split from Ethiopia in 1993.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":4875866,"ranking":13,"query_text":"when did eritrea gain independence","passage_text":"More information about Eritrea is available on the Eritrea Page and from other Department of State publications and other sources listed at the end of this fact sheet. U.S.-ERITREA RELATIONS. The United States established diplomatic relations with Eritrea in 1993, following its independence and separation from Ethiopia.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":4875868,"ranking":14,"query_text":"when did eritrea gain independence","passage_text":"U.S. Relations With Eritrea. More information about Eritrea is available on the Eritrea Page and from other Department of State publications and other sources listed at the end of this fact sheet. The United States established diplomatic relations with Eritrea in 1993, following its independence and separation from Ethiopia.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":2998268,"ranking":15,"query_text":"when did eritrea gain independence","passage_text":"How did the Philippines gain their independence? A: The Philippines gained independence on July 4,1946, due to the signing of the Treaty of Manila with the United States, who had annexed the Philippines as a territory in 1898.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":2169120,"ranking":16,"query_text":"when did eritrea gain independence","passage_text":"Relations between Ethiopia and Eritrea. Eritrea, formerly a province of Ethiopia whose 30-year war for independence was a key factor in the broader rebellion that toppled Mengistu Haile Mariam.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":2557627,"ranking":17,"query_text":"when did eritrea gain independence","passage_text":"On the 4th day of July, 1776 America, specifically the Thirteen Colonies, formally declared its independence from Great Britain. For more than a year before this, Great Britain and the Thirteen Colonies had been waging war against each other. In summary, here are events leading to when did America gain independence.n the 4th day of July, 1776 America, specifically the Thirteen Colonies, formally declared its independence from Great Britain. For more than a year before this, Great Britain and the Thirteen Colonies had been waging war against each other. In summary, here are events leading to when did America gain independence.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":77120,"ranking":18,"query_text":"when did eritrea gain independence","passage_text":"31 May 1961 is recognized as the official date of Independence as South Africa became a Republic on that date. The Republic of South Africa as it is today did not gain independence fully at a single point in history.Rather, it went through a series of transitions. It first gained partial independence from Britain on 31 May 1910.Then it formed the Union of South Africa under partial British and Dutch rule. It then gained further independence from the statue of Westminster on 11 December 1931.1 May 1961 is recognized as the official date of Independence as South Africa became a Republic on that date. The Republic of South Africa as it is today did not gain independence fully at a single point in history.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":51375,"ranking":19,"query_text":"when did eritrea gain independence","passage_text":"When did France gain its independence? Quick Answer. France's independence day, which is also known as Bastille Day, celebrates the beginning of the French Revolution on July 14, 1789. This is considered France's independence day because it symbolically marks the dissolution of the king's absolute power and the forming of a new republic in 1792.","bm25_label":"high","relevance_label":0.0},{"query_id":938359,"passage_id":4591472,"ranking":20,"query_text":"when did eritrea gain independence","passage_text":"What year did the Philippines gain independence? ChaCha Answer: The Republic of the Philippines received its independence on July 4, ...","bm25_label":"high","relevance_label":0.0}]