[{"query_id":958311,"passage_id":7785288,"ranking":1,"query_text":"when was jim vance funeral","passage_text":"Jim was preceded in death by his father James B. Vance. The Vance family will receive friends Sunday August 4, 2013 from 1-4 p.m. in the Bellville Snyder Funeral Home where funeral services will be held Monday at 11 a.m. The Rev. Dr. Michael V. Stine will officiate and burial will follow in Bellville Cemetery.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7785283,"ranking":2,"query_text":"when was jim vance funeral","passage_text":"James (Jim) Vance, 66. James (Jim) Vance was born April 7, 1947 in Mexico City, Mexico, son of Helen K. Vance and the late C. Reed Vance. Jim died at Inova Alexandria Hospital on July 11, 2013. He was 66. Jim's family moved to Sierra Vista, Arizona, where he graduated from Buena High School in 1966.","bm25_label":"high","relevance_label":1.0},{"query_id":958311,"passage_id":7785286,"ranking":3,"query_text":"when was jim vance funeral","passage_text":"JAMES L. Jim VANCE. VANCE age 65, husband of Carolyn M. (Kucinic) Vance, of Spring City, PA, passed away peacefully Saturday afternoon, September 24, 2016 at Phoenixville Hospital, Phoenixville, Pennsylvania. Born on July 21, 1951 in Cleveland, OH, he was a son of James and Stella (Gbur) Vance.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7785282,"ranking":4,"query_text":"when was jim vance funeral","passage_text":"JAMES L. Jim VANCE. 1951 - 2016 Obituary Condolences Flowers. VANCE age 65, husband of Carolyn M. (Kucinic) Vance, of Spring City, PA, passed away peacefully Saturday afternoon, September 24, 2016 at Phoenixville Hospital, Phoenixville, Pennsylvania. Born on July 21, 1951 in Cleveland, OH, he was a son of James and Stella (Gbur) Vance.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7785287,"ranking":5,"query_text":"when was jim vance funeral","passage_text":"Services & Gatherings. James C. Jim Vance, age 89, passed peacefully under the care of Mt. Carmel Palliative Care on Saturday afternoon, February 18, 2017. He was born on September 1, 1927 in Columbus to the late Dale and Leona (Ross) Vance.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7785284,"ranking":6,"query_text":"when was jim vance funeral","passage_text":"You can enhance Jim Vance's memory by upgrading Jim's public record with words and pictures, signing Jim's memory book, recording an audio memory or lighting a candle. The information in this obituary is based on data from the US Government's Social Security Death Index. No further information is available.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":3939061,"ranking":7,"query_text":"when was jim vance funeral","passage_text":"Jim Vance, who is celebrating his 46th year at NBC4, will continue anchoring for another few years. Vance will continue to anchor News4 at 6 with Doreen Gentzler. He will also contribute stories and special reports for News4 at 11, but will step down as anchor of that newscast at the end of May. After all those years of staying at work until midnight, Vance said heâ\u0080\u0099s ready for an early bedtime.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7785290,"ranking":8,"query_text":"when was jim vance funeral","passage_text":"Memorial contributions may be made to the American Lung Association. James C. Jim Vance, age 89, passed peacefully under the care of Mt. Carmel Palliative Care on Saturday afternoon, February 18, 2017. He was born on September 1, 1927 in Columbus to the late Dale and Leona (Ross) Vance.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":3939062,"ranking":9,"query_text":"when was jim vance funeral","passage_text":"Doreen Gentzler (born 1957) is an American television news anchor. She is a 6 p.m. and 11 p.m. news anchor at WRC-TV, alongside co-anchor Jim Vance.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":4286494,"ranking":10,"query_text":"when was jim vance funeral","passage_text":"When he died, I went into my bedroom, phoned my mother and cracked up. She couldn't understand a word, I was crying so much.' The funeral, Jim says, was a haze. â\u0080\u0098I kept saying, â\u0080\u0098He's not really dead'.' It was also the first time Mary, with whom Freddie had once lived for six years, snubbed Jim.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7284535,"ranking":11,"query_text":"when was jim vance funeral","passage_text":"Jim Davis was born as Marlin Jim Davis to Lucian Davis and Ethyl Offutt Davis in Edgerton, Missouri. His parents were the owners of a funeral home in Dearborn, Missouri. He studied in â\u0080\u0098William Jewell Collegeâ\u0080\u0099 in Liberty, Missouri.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":1842928,"ranking":12,"query_text":"when was jim vance funeral","passage_text":"What started the Hatfield-McCoy feud? The Hatefield-McCoy feud began with the murder of Asa Harmon McCoy on January 7, 1865. Jim Vance, the uncle of Devil Anse Hatfield, despised Harmon because he had joined the Uâ\u0080¦nion Army during the American Civil War.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":1842930,"ranking":13,"query_text":"when was jim vance funeral","passage_text":"In an effort to end the commotion once and for all, a group of the Hatfields and their supporters hatched a plan to attack Randolph McCoy and his family. Led by Devil Anseâ\u0080\u0099s son Cap and ally Jim Vance, a group of Hatfield men ambushed the McCoysâ\u0080\u0099 home on New Yearâ\u0080\u0099s Day in 1888.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":1842932,"ranking":14,"query_text":"when was jim vance funeral","passage_text":"Making the world better, one answer at a time. The Hatefield-McCoy feud began with the murder of Asa Harmon McCoy on January 7, 1865. Jim Vance, the uncle of Devil Anse Hatfield, despised Harmon because he had joined the Union Army during the American Civil War.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":8161840,"ranking":15,"query_text":"when was jim vance funeral","passage_text":"Directed by Randall Einhorn. With Steve Carell, Rainn Wilson, John Krasinski, Jenna Fischer. Michael holds a lonely hearts party on Valentine's Day at the office, hoping that he will run into a woman he met earlier that day at a blood drive. Meanwhile, Jim and Pam have an awkward lunch with Phillis and Bob Vance.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":6922601,"ranking":16,"query_text":"when was jim vance funeral","passage_text":"Posted in Blog Tags: adam tuss, alex naini, andrea roane, angie goff, barbara harrison, bob ryan, doug kammerer, elizabeth thorp, jeanhee, jim vance, kate benett, keith russell, melissa mollet, mona nabili, nbc4, pamela brown, richard jordan, tony tull, veronica johnson, z burger No Comments Â»","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7943850,"ranking":17,"query_text":"when was jim vance funeral","passage_text":"In 1825 he married Mira Margaret Baird, daughter of Zebulon Baird, at their Beaverdam home. David and Mira Vance lived at the Vance homeplace on Reems Creek with his mother, Priscilla Brank Vance, until her death in 1837, when they bought a stockstand and inn on the Buncombe Turnpike near what is now Marshall.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":5151723,"ranking":18,"query_text":"when was jim vance funeral","passage_text":"Like his cousin Bo, he often drove the General Lee and was a bit more wild than Vance and chased women; he and Vance were only in the first 19 episodes of season 5 and Coy and Vance were in only one episode with their cousins Bo and Luke when they returned from the NASCAR Circuit.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":7215943,"ranking":19,"query_text":"when was jim vance funeral","passage_text":"vance al weather copyright Â© 2018 Weather for Vance, AL - Vance, AL 35490 Weather, Current Weather in Vance, AL. Local weather report for Vance, AL, Local Vance, AL 35490 weather. Forecast for Vance, Alabama, Vance, AL weather forecast. Find your local Vance weather forecast. Vance, AL weather conditions. Weather outlook for Vance, AL. Weather report for Vance, AL. Weather Maps and Driving Directions vance al weather.","bm25_label":"high","relevance_label":0.0},{"query_id":958311,"passage_id":4874335,"ranking":20,"query_text":"when was jim vance funeral","passage_text":"John Candy's funeral would be held on March 21, 1994, at St. Martin's of Tours Church in LA. The church was near his home at 1630 Mandeville Canyon. Among those attending his funeral would be Jim Belushi, Bill Murray, Chevy Chase, Martin Short, Rick Moranis, Tom Hanks, Ed Harris, and Director Harold Ramis.","bm25_label":"high","relevance_label":0.0}]