[{"query_id":968608,"passage_id":2055155,"ranking":1,"query_text":"where did edison set up his first laboratory for research","passage_text":"It was out of this tradition that Edison forged the first industrial research laboratory. When Edison set up his Menlo Park Laboratory in 1876 he was seeking to extend, not replace, this shop tradition. Nonetheless, Menlo Park prefigured a new model of research, as Edison merged the shop tradition with sophisticated laboratory research into basic scientific and technical principles.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":4911837,"ranking":2,"query_text":"where did edison set up his first laboratory for research","passage_text":"The first practical incandescent light bulb. Where Edison succeeded and surpassed his competition was in developing a practical and inexpensive light bulb, according to the DOE. Edison and his team of researchers in Edison's laboratory in Menlo Park, N.J., tested more than 3,000 designs for bulbs between 1878 and 1880.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":8807907,"ranking":3,"query_text":"where did edison set up his first laboratory for research","passage_text":"In his 84 years, Thomas Edison acquired a record number of 1,093 patents (singly or jointly) and was the driving force behind such innovations as the phonograph, the incandescent light bulb and one of the earliest motion picture cameras. He also created the worldâ\u0080\u0099s first industrial research laboratory. Known as the â\u0080\u009cWizard of Menlo Park,â\u0080\u009d for the New Jersey town where he did some of his best-known work, Edison had become one of the most famous men in the world by the time he was in his 30s.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":4703980,"ranking":4,"query_text":"where did edison set up his first laboratory for research","passage_text":"Introduction. In his 84 years, Thomas Edison acquired a record number of 1,093 patents (singly or jointly) and was the driving force behind such innovations as the phonograph, the incandescent light bulb and one of the earliest motion picture cameras. He also created the worldâ\u0080\u0099s first industrial research laboratory. Known as the â\u0080\u009cWizard of Menlo Park,â\u0080\u009d for the New Jersey town where he did some of his best-known work, Edison had become one of the most famous men in the world by the time he was in his 30s.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":2452276,"ranking":5,"query_text":"where did edison set up his first laboratory for research","passage_text":"The first practical incandescent light bulb. Edison and his team of researchers in Edison's laboratory in Menlo Park, N.J., tested more than 3,000 designs for bulbs between 1878 and 1880. In November 1879, Edison filed a patent for an electric lamp with a carbon filament.he first practical incandescent light bulb. Edison and his team of researchers in Edison's laboratory in Menlo Park, N.J., tested more than 3,000 designs for bulbs between 1878 and 1880. In November 1879, Edison filed a patent for an electric lamp with a carbon filament.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":2055152,"ranking":6,"query_text":"where did edison set up his first laboratory for research","passage_text":"Edison's great success at the Menlo Park Laboratory made it a model for others. Alexander Graham Bell was influenced by what he called Edison's â\u0080\u0098celebrated laboratory at Menlo Parkâ\u0080\u0099 when he set up his own Volta Laboratory in Washington, D.C. in 1881 22.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":19025,"ranking":7,"query_text":"where did edison set up his first laboratory for research","passage_text":"The first practical incandescent light bulb. Edison and his team of researchers in Edison's laboratory in Menlo Park, N.J., tested more than 3,000 designs for bulbs between 1878 and 1880. In November 1879, Edison filed a patent for an electric lamp with a carbon filament.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":4911835,"ranking":8,"query_text":"where did edison set up his first laboratory for research","passage_text":"Menlo Park was the embryo of the modern research laboratory -- a place where the inventor could have at his fingertips the materials and expertise to turn his ideas into physical form. None of his contemporaries had such a marvelous tool. Edison built a house for his family just down the lane from the laboratory.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":2055159,"ranking":9,"query_text":"where did edison set up his first laboratory for research","passage_text":"While Edison's genius spawned many formative inventions of the modern world, his greatest invention may well have been the first industrial research laboratory, a prototype for today's corporate research and development centers.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":5953123,"ranking":10,"query_text":"where did edison set up his first laboratory for research","passage_text":"The first practical incandescent light bulb. Edison and his team of researchers in Edison's laboratory in Menlo Park, N.J., tested more than 3,000 designs for bulbs between 1878 and 1880. In November 1879, Edison filed a patent for an electric lamp with a carbon filament.arly research & developments. The story of the light bulb begins long before Edison patented the first commercially successful bulb in 1879. In 1800, Italian inventor Alessandro Volta developed the first practical method of generating electricity, the voltaic pile.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":2055158,"ranking":11,"query_text":"where did edison set up his first laboratory for research","passage_text":"Portrait of Thomas Edison in his West Orange, New Jersey, laboratories, in 1904. Courtesy the Library of Congress, Prints and Photographs Division, Washington, D.C., LC-USZ62-41756. Edison was one of the first to grasp the importance of chemical knowledge when conducting industrial research and development.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":2376289,"ranking":12,"query_text":"where did edison set up his first laboratory for research","passage_text":"By the Spring of 1876, Edison moved his operations to Menlo Park. Edisonâ\u0080\u0099s Menlo Park laboratory was the worldâ\u0080\u0099s first such research and development facility. While Edison was working on perfecting the telephone, he started experimenting with the idea of being able to record the sound of the human voice.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":6598153,"ranking":13,"query_text":"where did edison set up his first laboratory for research","passage_text":"Nevertheless, Edison became a voracious reader and at age 10, he set up a laboratory in his basement. When his mother could no longer stand the smell of his chemistry lab, Edison took a job as a trainboy on the railway and established a new lab in an empty freight car. He was 12 at the time.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":2836389,"ranking":14,"query_text":"where did edison set up his first laboratory for research","passage_text":"The first practical incandescent light bulb. Edison and his team of researchers in Edison's laboratory in Menlo Park, N.J., tested more than 3,000 designs for bulbs between 1878 and 1880. In November 1879, Edison filed a patent for an electric lamp with a carbon filament.homas Edison is usually credited with the invention of the light bulb, but the famous American inventor wasn't the only one who contributed to the development of this revolutionary technology.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":7809505,"ranking":15,"query_text":"where did edison set up his first laboratory for research","passage_text":"Aside from being an inventor, Edison was also a successful manufacturer and businessman, marketing his inventions to the public. In 1876, the year of the American centennial, he opened his first full-scale industrial research laboratory in Menlo Park, New Jersey.","bm25_label":"high","relevance_label":1.0},{"query_id":968608,"passage_id":8807909,"ranking":16,"query_text":"where did edison set up his first laboratory for research","passage_text":"Thomas Edison was born in 1847 in Milan, Ohio. Like Ben Franklin, he was both a scientist and an inventor. In fact, Edison patented 1,093 inventions in his lifetime including the kinetoscope, the phonograph, and his most famous - the incandescent light bulb. The Menlo Laboratory in Newark, New Jersey, was to become the first research and development lab in the world. Edison called this lab his invention factory.. In 1879, after 1,200 experiments, Edison made a light bulb using carbonized filaments from cotton that burned for two days.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":7596797,"ranking":17,"query_text":"where did edison set up his first laboratory for research","passage_text":"Menlo Park, New Jersey, is where Edison built a laboratory in 1876. (Menlo Park is now part of Edison, New Jersey.) There he developed the electric light system and invented the first phonograph. However, Menlo Park served as his lab for only ten years.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":6768732,"ranking":18,"query_text":"where did edison set up his first laboratory for research","passage_text":"Over at the laboratories of Edison's rival, Bell was insisting on Ahoy! as the correct way to answer the telephone. It was trounced by hello, which became the standard as the first telephone exchanges, equipped by Edison, were set up across the United States and operating manuals adopted the word.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":2055153,"ranking":19,"query_text":"where did edison set up his first laboratory for research","passage_text":"At his laboratory at Menlo Park, New Jersey, Edison merged the machine shop with sophisticated electrical and chemical laboratories and employed teams of researchers who could experiment on all aspects of his inventions and move them rapidly from research to development and commercialization.","bm25_label":"high","relevance_label":0.0},{"query_id":968608,"passage_id":784045,"ranking":20,"query_text":"where did edison set up his first laboratory for research","passage_text":"Thomas Edison. Thomas Edison's most famous invention, the lightbulb, paved the way for modern life. Introduction. In his 84 years, Thomas Edison acquired a record number of 1,093 patents (singly or jointly) and was the driving force behind such innovations as the phonograph, the incandescent light bulb and one of the earliest motion picture cameras. He also created the worldâ\u0080\u0099s first industrial research laboratory.","bm25_label":"high","relevance_label":0.0}]