[{"query_id":971653,"passage_id":7776246,"ranking":1,"query_text":"where do the ash borer come from","passage_text":"Frequently Asked Questions about the Emerald Ash Borer Where did the Emerald Ash Borer beetle come from? The Emerald Ash Borer originated from eastern Russia, northern China, Japan and Korea. Before June of 2002, it had never been found in North America.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":8818561,"ranking":2,"query_text":"where do the ash borer come from","passage_text":"On other trees, other buprestids, such as the bronze birch borer and the two-lined chestnut borer, do produce D-shaped exit holes. These insects are not found in ash trees. The combination of a D-shaped exit hole and an ash tree is unique to EAB, and a sure indication that the insect is present.merald Ash Borer (EAB) Help Slow the Spread of the Emerald Ash Borer What You Can Do to Help | Stop the Beetle Emerald Ash Borer is now in Connecticut.Currently there is a quarantine affecting the movement of ash materials and firewood out of the State of Connecticut.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":967935,"ranking":3,"query_text":"where do the ash borer come from","passage_text":"Green Menace-Emerald Ash Borer Scientific name: Agrilus planipennis The adult emerald ash borer Homeland \/ Origin: This alien invader is from northern China and Korea. It can also be found in eastern Russia, Japan, and Mongolia.t's the second most common tree in urban areas, after the Norway maple. So, you can imagine what these insects could do to Wisconsin's forests and tree-lined streets! Emerald ash borer larva feeding under the bark of an ash tree.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5971874,"ranking":4,"query_text":"where do the ash borer come from","passage_text":"What eats an emerald ash borer? There are two types of stingless wasps that lay eggs in the larvae of emerald ash borer. Currently these wasps are being used to control the spread of eab especially in areas â\u0080¦ where chemical controls and removal of infested trees are difficult.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5971878,"ranking":5,"query_text":"where do the ash borer come from","passage_text":"What do emerald ash borers do to ash trees? Emerald ash borer is a wood boring insect that feeds on the xylem and phloem of ash trees when it is in its larval stage. By feeding on these tissues, the larvae cut off valua â\u0080¦ ble water and nutrient supplies to parts of the tree and cause die back. As the infestation progresses more of the tree dies back and, eventually the tree dies.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":1622492,"ranking":6,"query_text":"where do the ash borer come from","passage_text":"On November 8, 2016, Emerald Ash Borer was confirmed in Alabama. On October 14, 2016, Emerald Ash Borer was confirmed in Oklahoma. On August 23, 2016, Emerald Ash Borer was confirmed in Delaware. This Website is part of a multinational effort to bring you the latest information about emerald ash borer.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":3710646,"ranking":7,"query_text":"where do the ash borer come from","passage_text":"What is killing the ash trees? All of the native North American ash trees are highly susceptible to a new invasive species of beetle, the Emerald Ash Borer or EAB. Emerald ash borers destroy an ash tree's ability to store water and nutrients, killing the tree from the top down.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":7776241,"ranking":8,"query_text":"where do the ash borer come from","passage_text":"Green Menace-Emerald Ash Borer Scientific name: Agrilus planipennis The adult emerald ash borer Homeland \/ Origin: This alien invader is from northern China and Korea. It can also be found in eastern Russia, Japan, and Mongolia. It isn't a major pest of ash trees in its native range, but it sure is trouble in the United States. Arrival date: Before 2002, the emerald ash borer (EAB) was never found outside of Asia.","bm25_label":"high","relevance_label":1.0},{"query_id":971653,"passage_id":4121047,"ranking":9,"query_text":"where do the ash borer come from","passage_text":"The CFIA is now focusing all its efforts related to the emerald ash borer towards surveillance, enforcement, and public awareness to prevent further spread of the pest. When the emerald ash borer was first detected in Canada, the CFIA included tree removal as one control measure. The CFIA has since decided to eliminate tree removal as a management option for the emerald ash borer because, from a national perspective, ash tree removal is not an effective way to prevent this pest from spreading to non-infested areas.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":6582611,"ranking":10,"query_text":"where do the ash borer come from","passage_text":"Stressed trees and shrubs tend to be more susceptible to borer infestation, so plant health care is a first line of defense: 1  Do not plant ash trees; because of emerald ash borer it is no longer a suitable landscape plant. 2  Avoid planting native understory species such as dogwoods and rhododendrons in full sun.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5472253,"ranking":11,"query_text":"where do the ash borer come from","passage_text":"Green Menace-Emerald Ash Borer Scientific name: Agrilus planipennis The adult emerald ash borer Homeland \/ Origin: This alien invader is from northern China and Korea. It can also be found in eastern Russia, Japan, and Mongolia.It isn't a major pest of ash trees in its native range, but it sure is trouble in the United States. Arrival date: Before 2002, the emerald ash borer (EAB) was never found outside of Asia.But, in 2002, it was identified in southeast Michigan.here are some ash trees that are not at risk, such as the mountain ash, but that's because they are not true ash trees. In Wisconsin, there are approximately 700 million ash trees in our forests, and about as many in our towns and cities.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5472250,"ranking":12,"query_text":"where do the ash borer come from","passage_text":"Ash trees are susceptible to ash tree borers and other pests and disease. Keep ash trees as healthy as possible through regular monitoring, pruning, fertilizing and watering.By following these steps, you can help prevent ash tree problems from starting.sh trees are susceptible to ash tree borers and other pests and disease. Keep ash trees as healthy as possible through regular monitoring, pruning, fertilizing and watering.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5472244,"ranking":13,"query_text":"where do the ash borer come from","passage_text":"All of the native North American ash trees are highly susceptible to a new invasive species of beetle, the Emerald Ash Borer or EAB. Emerald ash borers destroy an ash tree's ability to store water and nutrients, killing the tree from the top down.he European Mountain Ash (Sorbus aucuparia) is not affected by the EAB infestation. A native of Europe and northern Asia, the European Mountain Ash is not related to the true ash tree although the leaves are similar in structure.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":6482938,"ranking":14,"query_text":"where do the ash borer come from","passage_text":"Due to the recent discovery of the emerald ash borer. (EAB) in Michigan, it is important to be able to recognize. and identify ash trees. To date, emerald ash borer has only. been found on ash trees (see page 4). Not sure if your tree is.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5472248,"ranking":15,"query_text":"where do the ash borer come from","passage_text":"It was first found to be attacking and killing ash trees in Michigan in 2002. Bright green in color and about a half inch in length, the Emerald Ash Borer (EAB) only attacks ash trees and is a devastating and destructive pest that greatly affects the urban forest.he Emerald Ash Borer (Agrilus planipennis) is an invasive wood boring beetle from Asia that is predicted to infest all unprotected ash trees in the United States and Canada.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5971873,"ranking":16,"query_text":"where do the ash borer come from","passage_text":"The non-native wasps also keep emerald ash borer populations low in forests that have already been invaded. â\u0080\u009cEmerald ash borer has many native and non-native natural enemies,â\u0080\u009d says Ulyshen. â\u0080\u009cMaintaining stable populations of these predators can help ash trees survive emerald ash borer infestations.â\u0080\u009d Read the full text of the article.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":8358956,"ranking":17,"query_text":"where do the ash borer come from","passage_text":"The emerald ash borer, or EAB, a native of East Asia, has already devastated entire ash populations in northern cities such as Detroit, where it first appeared in 2002. Since then, the insect has swept into 22 states across the country.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":967929,"ranking":18,"query_text":"where do the ash borer come from","passage_text":"Emerald ash borer adults are very small, metallic green beetles. They are about the size of a cooked grain of rice: only 3\/8 - 1\/2 inch long and 1\/16 inch wide.Adult emerald ash borers emerge from beneath the bark of ash trees late May through mid-July.he pupae, like the larvae, cannot be seen unless bark is pulled away from the tree. EAB Look-Alikes. There are many metallic green insects that are common in Wisconsin and often mistaken for EAB. For more information on these look-alikes please visit the University of Wisconsin-Madison's emerald ash borer webpage.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":5105663,"ranking":19,"query_text":"where do the ash borer come from","passage_text":"Others concerns within the state are the emerald ash borer, pine shoot beetles, and oak wilt. The emerald ash borer, in particular, poses a serious threat to Missouri's ash population. This imported insect has killed hundreds of thousands of ash trees as it makes it's way west.","bm25_label":"high","relevance_label":0.0},{"query_id":971653,"passage_id":7473030,"ranking":20,"query_text":"where do the ash borer come from","passage_text":"An exotic pest called the emerald ash borer has wreaked havoc on ash trees in Michigan. We don't want that kind of excitement here in Illinois, so we have asked homeowners to keep a look out. Check with your local U of I Extension office for information on emerald ash borer or www.na.fs.fed.us\/spfo\/eab.To complicate matters ash trees already suffer from other problems here in Illinois.e don't want that kind of excitement here in Illinois, so we have asked homeowners to keep a look out. Check with your local U of I Extension office for information on emerald ash borer or www.na.fs.fed.us\/spfo\/eab. To complicate matters ash trees already suffer from other problems here in Illinois.","bm25_label":"high","relevance_label":0.0}]