[{"query_id":977770,"passage_id":1946444,"ranking":1,"query_text":"where is battle creek michigan","passage_text":"Location of Battle Creek within Michigan. Battle Creek, Michigan. Battle Creek is a city in the U.S. state of Michigan, in northwest Calhoun County, at the confluence of the Kalamazoo and Battle Creek rivers. It is the principal city of the Battle Creek, Michigan Metropolitan Statistical Area (MSA), which encompasses all of Calhoun County.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":2330005,"ranking":2,"query_text":"where is battle creek michigan","passage_text":"Battle Creek, Michigan. Photos by Kim Russell. Statue created by Tina Allen in 1999 and is located in the Memorial Park in Battle Creek. She is a 12 foot tall bronze piece in the town where she spent the last 26 years of her life â\u0080\u0094 from 1857 to Nov. 26, 1883. Sojourner Truth is buried in the Oak Hill Cemetery, Battle Creek, Michigan. More on this Battle Creek Project.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":2689407,"ranking":3,"query_text":"where is battle creek michigan","passage_text":"Battle Creek Health System - Battle Creek, Calhoun County, Michigan. Battle Creek VA Medical Center - Battle Creek, Calhoun County, Michigan. Bay Regional Medical Center - Bay City, Bay County, Michigan. Bay Special Care Hospital - Bay City, Bay County, Michigan.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":2330002,"ranking":4,"query_text":"where is battle creek michigan","passage_text":"Active until 1875, when her grandson and companion fell ill and died, Sojourner Truth returned to Michigan where her health deteriorated and she died in 1883 in a Battle Creek sanitorium of infected ulcers on her legs. She was buried in Battle Creek, Michigan, after a very well-attended funeral.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":7786745,"ranking":5,"query_text":"where is battle creek michigan","passage_text":"Battle Creek Tourism: Best of Battle Creek. Battle Creek, Michigan. Known as Cereal City, Battle Creek, Michigan is home to both the Kellogg and Post corporations. These two companies have left their mark on the city, building both office buildings and local attractions.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":7786749,"ranking":6,"query_text":"where is battle creek michigan","passage_text":"Battle Creek, MI. Sponsored Topics. Battle Creek is a city in the U.S. state of Michigan, in northwest Calhoun County, at the confluence of the Kalamazoo and Battle Creek Rivers. It is the principal city of the Battle Creek, Michigan Metropolitan Statistical Area (MSA), which encompasses all of Calhoun county.","bm25_label":"high","relevance_label":1.0},{"query_id":977770,"passage_id":2558393,"ranking":7,"query_text":"where is battle creek michigan","passage_text":"Battle Creek, Michigan. Battle Creek is a city in the U.S. state of Michigan, in northwest Calhoun County, at the confluence of the Kalamazoo and Battle Creek rivers. It is the principal city of the Battle Creek, Michigan Metropolitan Statistical Area (MSA), which encompasses all of Calhoun County. As of the 2010 census, the city had a total population of 52,347, while the MSA population was 136,146. 1 History and name origin.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":8256126,"ranking":8,"query_text":"where is battle creek michigan","passage_text":"Driving distance from Battle Creek, MI to Detroit, MI. The total driving distance from Battle Creek, MI to Detroit, MI is 122 miles or 196 kilometers. Your trip begins in Battle Creek, Michigan. It ends in Detroit, Michigan.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":7786744,"ranking":9,"query_text":"where is battle creek michigan","passage_text":"Battle Creek, Michigan. Battle Creek: Soujourner Truth Monument located at Division and Hamblin Avenues in Downtown Battle Creek. Battle Creek: Friendship Park - downtown Battle Creek at the corner of Capital Ave. and State Street. Battle Creek: Arial photo coming into Duncan Aviation at Kellogg Airfield in Battle Creek, MI.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":7604315,"ranking":10,"query_text":"where is battle creek michigan","passage_text":"Battle Creek, MI. Online Offers. Battle Creek is a city in the U.S. state of Michigan, in northwest Calhoun County, at the confluence of the Kalamazoo and Battle Creek Rivers. It is the principal city of the Battle Creek, Michigan Metropolitan Statistical Area (MSA), which encompasses all of Calhoun county. As of the 2010 census, the city had a total population of 52,347, while the MSA population was 136,146.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":4887327,"ranking":11,"query_text":"where is battle creek michigan","passage_text":"The Battle Creek Sanitarium, which is now the Battle Creek Federal Center building, is still one of the tallest buildings in Battle Creek. This building is a historical marker to the city and the state of Michigan.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":1946442,"ranking":12,"query_text":"where is battle creek michigan","passage_text":"Battle Creek is a city in the U.S. state of Michigan, in northwest Calhoun County, at the confluence of the Kalamazoo and Battle Creek rivers. It is the principal city of the Battle Creek, Michigan Metropolitan Statistical Area, which encompasses all of Calhoun County. As of the 2010 census, the city had a total population of 52,347, while the MSA's population was 136,146.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":4887323,"ranking":13,"query_text":"where is battle creek michigan","passage_text":"Battle Creek is a city in the U.S. state of Michigan, in northwest Calhoun County, at the confluence of the Kalamazoo and Battle Creek Rivers. It is the principal city of the Battle Creek, Michigan Metropolitan Statistical Area (MSA), which encompasses all of Calhoun county. As of the 2010 census, the city had a total population of 52,347, while the MSA population was 136,146.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":4887328,"ranking":14,"query_text":"where is battle creek michigan","passage_text":"Battle Creek is the home to The Battle Creek Symphony Orchestra, whose home is at the W.K. Kellogg Auditorium in downtown Battle Creek. The symphony is currently conducted by Anne Harrigan, and is Michigan's longest-running symphony orchestra.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":1946439,"ranking":15,"query_text":"where is battle creek michigan","passage_text":"After Battle Creek Township merged into the city of Battle Creek in 1983, the city's declining population rose by nearly 18,000 new residents, but the city continues to decline in population. Prior to the merge, the city measured 18.6 square miles (48.17 km 2). Battle Creek is variously considered to be part of Western Michigan or Southern Michigan.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":3665174,"ranking":16,"query_text":"where is battle creek michigan","passage_text":"1951 Died in Battle Creek, Michigan. CAPS: Kellogg, Kellogg's, Will Keith Kellogg, John Harvey Kellogg, Battle Creek Michigan, Sanitas Food Company, Battle Creek Toasted Corn Flakes Co., Kellogg Company, ARY, invention, cereal, corn flakes, Kellogg's' corn flakes, cornflakes, SIP, history, biography, inventor.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":8256128,"ranking":17,"query_text":"where is battle creek michigan","passage_text":"Driving distance from Battle Creek, MI to Milwaukee, WI. The total driving distance from Battle Creek, MI to Milwaukee, WI is 259 miles or 417 kilometers. Your trip begins in Battle Creek, Michigan.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":8256130,"ranking":18,"query_text":"where is battle creek michigan","passage_text":"Driving distance from Battle Creek, MI to Detroit, MI. The total driving distance from Battle Creek, MI to Detroit, MI is 122 miles or 196 kilometers. Your trip begins in Battle Creek, Michigan.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":4213555,"ranking":19,"query_text":"where is battle creek michigan","passage_text":"Driving distance from Battle Creek, MI to Indianapolis, IN. The total driving distance from Battle Creek, MI to Indianapolis, IN is 221 miles or 356 kilometers. Your trip begins in Battle Creek, Michigan. It ends in Indianapolis, Indiana.","bm25_label":"high","relevance_label":0.0},{"query_id":977770,"passage_id":8256129,"ranking":20,"query_text":"where is battle creek michigan","passage_text":"The total driving distance from Battle Creek, MI to Milwaukee, WI is 259 miles or 417 kilometers. Your trip begins in Battle Creek, Michigan.","bm25_label":"high","relevance_label":0.0}]