[{"query_id":978057,"passage_id":7731945,"ranking":1,"query_text":"where is berrimah","passage_text":"Located within Berrimah are the Summer Institute of Linguistics, Kormilda College, Berrimah Power Station, CSIRO Wildlife Research Laboratory, Berrimah Research Farm Centre, Darwin Prison, Don Dale Juvenile Detention Centre, the Showground and Exhibition Centre. Berrimah is a predominantly industrial area.","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":7731943,"ranking":2,"query_text":"where is berrimah","passage_text":"Berrimah, Northern Territory. Berrimah is an Eastern Suburb in the city of Darwin, in the Northern Territory of Australia.","bm25_label":"high","relevance_label":1.0},{"query_id":978057,"passage_id":7731946,"ranking":3,"query_text":"where is berrimah","passage_text":"Position: Street Map Â» NT Â» Letter B Â» Berrimah. Street Map of Berrimah (Northern Territory), Australia. Below map you can see Berrimah street list. If you click on street name, you can see position on the map. Click on street name to see the position on Berrimah street map. In list you can see 35 streets.","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":7731942,"ranking":4,"query_text":"where is berrimah","passage_text":"Berrimah. 1  Large format wall tiles and a heavily distressed finish are the key characteristics of the Berrimah traditional format walling range. Beautiful natural colour variation is present through the pieces and the distressed finish perfectly highlights the natural beauty of the stone.","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":7731947,"ranking":5,"query_text":"where is berrimah","passage_text":"Berrimah. 1  Large format wall tiles and a heavily distressed finish are the key characteristics of the Berrimah traditional format walling range. 2  Traditional Format walling is a natural stone range using random length and uniform height tiles to achieve a sophisticated stone wall finish.","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":1360686,"ranking":6,"query_text":"where is berrimah","passage_text":"Where is Surgut: Where is Svobodnyj: Where is Syktyvkar: Where is Syzran: Where is Taganrog: Where is Tambov: Where is Tichoreck: Where is Tichvin: Where is Timashyovsk: Where is Tobolsk: Where is Toljatti: Where is Tomsk: Where is Troick: Where is Tuapse: Where is Tujmazy: Where is Tula: Where is Tumen: Where is Tver: Where is Uchta: Where is Ufa: Where is Ulan-Ude: Where is Uljanovsk","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2292184,"ranking":7,"query_text":"where is berrimah","passage_text":"Where is Soka: Where is Suita: Where is Sukumo: Where is Suzuka: Where is Tachikawa: Where is Takahashi: Where is Takamatsu: Where is Takaoka: Where is Takarazuka: Where is Takasaki: Where is Takatsuki: Where is Takikawa: Where is Tama: Where is Tokorozawa: Where is Tokushima: Where is Tokyo: Where is Tomakomai: Where is Tottori: Where is Toyama: Where is Toyohashi: Where is Toyokawa","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":4567167,"ranking":8,"query_text":"where is berrimah","passage_text":"Where is Kanel: Where is Kaolack: Where is Kayar: Where is Kebemer: Where is Kedougou: Where is Khombole: Where is Kolda: Where is Koungheul: Where is Linguere: Where is Louga: Where is M'Bour: Where is Matam: Where is Mbacke: Where is Mboro: Where is Mekhe: Where is Ndioum: Where is Nguekhokh: Where is Nioro du Rip: Where is Ouro Sogui: Where is Pout: Where is Richard Toll","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2409126,"ranking":9,"query_text":"where is berrimah","passage_text":"Where is Bielsko-Biala: Where is Bydgoszcz: Where is Bytom: Where is Chelm: Where is Chorzow: Where is Czestochowa: Where is Dabrowa Gornicza: Where is Elblag: Where is Elk: Where is Gdansk: Where is Gdynia: Where is Gliwice: Where is Glogow: Where is Gniezno: Where is Gorzow Wielkopolski: Where is Grudziadz: Where is Inowroclaw: Where is Jastrzebie Zdroj: Where is Jaworzno","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2447657,"ranking":10,"query_text":"where is berrimah","passage_text":"Where is Italy Located; Airports in Italy; Major Cities in Italy; Where is Rome; Where is Florence; Where is Milan; Where is Afragola; Where is Alessandria; Where is Altamura; Where is Ancona; Where is Andria; Where is Arezzo; Where is Asti; Where is Bari; Where is Barletta; Where is Benevento; Where is Bergamo; Where is Bologna; Where is Bolzano; Where is Brescia; Where is Brindisi","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2441838,"ranking":11,"query_text":"where is berrimah","passage_text":"super bowl 2018 where | where is super bowl 2018 | where is the super bowl | where is the super bowl 2018 | where is the super bowl in 2018 | where are the olympics | where am i | where are the 2018 olympics | where is the olympics | where is new england | where is prince from | where was prince born | where is starman | where is justin timberlake from | where is super bowl 2019 | where is mauritania | where was prince from | where are the patriots from | where to watch superbowl online ...","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2261092,"ranking":12,"query_text":"where is berrimah","passage_text":"Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. See that other chick asked that she said where the cash at. She said where the paper plastic product and where the stash at.","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":7269020,"ranking":13,"query_text":"where is berrimah","passage_text":"Where is Ahtanum WA: Where is Airway Heights WA: Where is Alderton WA: Where is Alderwood Manor WA: Where is Algona WA: Where is Allyn WA: Where is Amboy WA: Where is Ames Lake WA: Where is Anacortes WA: Where is Anderson Island WA: Where is Artondale WA: Where is Asotin WA: Where is Bangor Base WA: Where is Barberton WA: Where is Basin WA: Where is Bethel WA","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2261098,"ranking":14,"query_text":"where is berrimah","passage_text":"Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. Submit Corrections. Visit www.azlyrics.com for these lyrics.","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":7269069,"ranking":15,"query_text":"where is berrimah","passage_text":"Where is Shellman GA: Where is Skidaway Island GA: Where is Social Circle GA: Where is Soperton GA: Where is Sparks town GA: Where is Sparta GA: Where is Springfield GA: Where is St. Marys GA: Where is St. Simons GA: Where is Statenville GA: Where is Statham GA: Where is Stone Mountain GA: Where is Summerville GA: Where is Sunnyside GA: Where is Suwanee GA","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2261094,"ranking":16,"query_text":"where is berrimah","passage_text":"Don't be surprised if she ask where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. Submit Corrections. Visit www.azlyrics.com for these lyrics.","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":4859459,"ranking":17,"query_text":"where is berrimah","passage_text":"Where is Greenville AL: Where is Grove Hill town AL: Where is Guin AL: Where is Gulf Shores AL: Where is Guntersville AL: Where is Hackleburg town AL: Where is Haleyville AL: Where is Hamilton AL: Where is Hanceville AL: Where is Harpersville town AL: Where is Hartford AL: Where is Hartselle AL: Where is Harvest AL: Where is Hayneville town AL: Where is Hazel Green AL","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":3435113,"ranking":18,"query_text":"where is berrimah","passage_text":"Where Can A Ruby Be Found | Where Are Rubies Found | Where Is Beryl Found | Where Is Ruby Found | Where Do Rubies Come From | Where Are Rubies Found In The World | Where Are Garnets Found | Where Is Kyanite Found | Where Is Topaz Found | Where Is Carletonite Found | Where Can You Find Rubies | Where Is The Garnet Found | Where Is Tourmaline Found | ...","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":2295161,"ranking":19,"query_text":"where is berrimah","passage_text":"Where is Anacortes WA: Where is Anderson Island WA: Where is Artondale WA: Where is Asotin WA: Where is Bangor Base WA: Where is Barberton WA: Where is Basin WA: Where is Bethel WA: Where is Big Lake WA: Where is Birch Bay WA: Where is Black Diamond WA: Where is Bonney Lake WA: Where is Bothell East WA: Where is Bothell West WA: Where is Boulevard Park WA","bm25_label":"high","relevance_label":0.0},{"query_id":978057,"passage_id":7266724,"ranking":20,"query_text":"where is berrimah","passage_text":"Where is Graceville FL: Where is Grant-Valkaria town FL: Where is Green Cove Springs FL: Where is Greenbriar FL: Where is Grenelefe FL: Where is Gretna FL: Where is Grove FL: Where is Groveland FL: Where is Gulf Breeze FL: Where is Gulf Gate Estates FL: Where is Gulfport FL: Where is Harbor Bluffs FL: Where is Harbour Heights FL: Where is Harlem FL: Where is Harlem Heights FL","bm25_label":"high","relevance_label":0.0}]