[{"query_id":980789,"passage_id":2822317,"ranking":1,"query_text":"where is crystal colorado","passage_text":"1.05. Amazonite Crystal - Teller County, Colorado. This is a lovely, teal blue, amazonite crystal mined in Teller County, Colorado. Amazonite is a green variety of microcline feldspar that is the state mineral of Colorado. It has recently received lot of attention for its prominence on the reality show, â\u0080\u009cProspectorsâ\u0080\u009d which follows several groups of Colorado mineral miners.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7918109,"ranking":2,"query_text":"where is crystal colorado","passage_text":"Crystal Colorado Ghost Town and Mill. Lush mountain setting surrounds the Lost Horse Mill (sometimes Dead Horse Mill) near the ghost town of Crystal, Colorado. This building actually housed a power generator for the mill, which was standing next to it. Crystal never had nor does it have now, electricity.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7918111,"ranking":3,"query_text":"where is crystal colorado","passage_text":"How to use SwarovskiÂ® Crystal Rhinestones. Colorado Crystals is your home to all Bling needs! Why choose Colorado Crystals? The reason we opened many years ago was because â\u0080\u009cUs MOMsâ\u0080\u009d were ordering the wrong color and size over and over! Then â\u0080\u009cus momsâ\u0080\u009d didnâ\u0080\u0099t know how to apply the stones!","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":3270112,"ranking":4,"query_text":"where is crystal colorado","passage_text":"Crystals of amazonite can also be found in Crystal Park, El Paso County, Colorado. Other localities in the United States which yield amazonite include the Morefield Mine in Amelia, Virginia. It is also found in pegmatite in Madagascar and in Brazil.mazonite is a mineral of limited occurrence. Formerly it was obtained almost exclusively from the area of Miass in the Ilmensky Mountains, 50 miles southwest of Chelyabinsk, Russia, where it occurs in granitic rocks.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7918105,"ranking":5,"query_text":"where is crystal colorado","passage_text":"Crystal River Valley - Northwest Colorado. Thirty miles from Aspen and 12 miles from Glenwood Springs, The Crystal River Valley, surrounded by the White River National Forest, offers unique charm and secluded, untouched beauty of Colorado's unspoiled past. Carbondale is the gateway to Highway 133 just off Highway 82.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7918106,"ranking":6,"query_text":"where is crystal colorado","passage_text":"Crystal Colorado Ghost Town and Mill. Lush mountain setting surrounds the Lost Horse Mill (sometimes Dead Horse Mill) near the ghost town of Crystal, Colorado. This building actually housed a power generator for the mill, which was standing next to it. Correction: Many thanks to John Skuches who sent us the following information:","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7918107,"ranking":7,"query_text":"where is crystal colorado","passage_text":"History of Crystal City, Colorado. Crystal City is a semi-ghost town located 6 miles east of the City of Marble. The road to Crystal City has to be experienced. The city was originally incorporateded in 1880, and had a high population of some 300-400 hardy souls, mostly support for the miners in the area.","bm25_label":"high","relevance_label":1.0},{"query_id":980789,"passage_id":7918108,"ranking":8,"query_text":"where is crystal colorado","passage_text":"<p>The <b>Crystal Mill<\/b>, or the <b>Old Mill<\/b> is an 1892 wooden <a href=\/pages\/w\/107467249275953>powerhouse<\/a> located on an outcrop above the <a href=\/pages\/w\/143739512309157>Crystal River<\/a> in <a href=\/pages\/w\/112241038788464>Crystal, Colorado<\/a>, <a href=\/pages\/w\/112463092102121>United States<\/a>.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7740381,"ranking":9,"query_text":"where is crystal colorado","passage_text":"These are some of the Amethysts that are from Brazil http:\/\/www.crystal-world.com\/html\/mining\/international\/brazil.htm. Amethyst in the U.S.: There are many places in the U.S. where you can locate the amethyst crystal. Some of the places are Maine, Pennsylvania, and North Carolina to Montana, Colorado and Arizona.icture credited to Four Peaks Arizona. This is a picture of what an Amethyst looks like before it is cut and facetted. In this picture you are able to see the reddish purple gem with hematite crystal points. Uruguay Amethyst: The amethyst that you find here are mined in large vugs, or volcanic pockets.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":567352,"ranking":10,"query_text":"where is crystal colorado","passage_text":"Rhodochrosites is found in eighteen of Colorados counties and it is one of Colorados most popular and highly sought after minerals due to its exceptional beauty. There is a 6.5-inch rhodochrosite crystal known as the Alma King displayed in the Nature and Science Museum of Denver.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":3840963,"ranking":11,"query_text":"where is crystal colorado","passage_text":"The Mineral rhodochrosite. Rhodochrosite is a very aesthetic and desirable mineral; its deep red and hot pink crystals are highly sought after. Of special note are the beautiful, intensely colored rhombohedral crystals that have come from the Sweet Home Mine in Colorado.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7574627,"ranking":12,"query_text":"where is crystal colorado","passage_text":"CRYSTAL AND GEMSTONE HEALING THERAPY. LEPIDOLITE BEST CRYSTAL FOR HEALING ANXIETY. Lepidolite is a common stone that is uncommonly known. Chances are you haven't heard of it. It is a mica formation that appears most often in a light purple-grey opaque color. It is native to California, Colorado and Brazil.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7918103,"ranking":13,"query_text":"where is crystal colorado","passage_text":"A viewer writes - Wednesday, February 29, 2012 -- Crystal Colorado the town, the mill, the mtns are one of the most beautiful places I have ever been. This place is very remote and can only be found by 4x4. Thanks to my parents and growing up in the Colorado mountains.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":7918110,"ranking":14,"query_text":"where is crystal colorado","passage_text":"This is perhaps one of the most photographed mining buildings in Colorado. It is part of an old power plant below Crystal City. The Power Plant was operated by Sheep Mountain Mill to drive air compressors for the Sheep Mountain Tunnel. The structure is located near the old town of Crystal City.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":8393532,"ranking":15,"query_text":"where is crystal colorado","passage_text":"The Mineral rhodochrosite. Rhodochrosite is one of the prettiest and desirable of all minerals. Its deep red and hot pink crystals are extremely sought after and good crystals command extremely high prices. Especially desirable are the beautiful intensely colored rhombohedron s from the Sweet Home Mine in Colorado.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":4925007,"ranking":16,"query_text":"where is crystal colorado","passage_text":"The historic Crystal Mill, built in 1893. Gunnison County is the fifth-most extensive of the 64 counties in the U.S. state of Colorado. As of the 2010 census, the population was 15,324. The county seat is Gunnison.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":3467121,"ranking":17,"query_text":"where is crystal colorado","passage_text":"1 Platoro Reservoir, south of Del Norte and west of Conejos. 2  Cucharas Pass, Colorado 12, from Trinidad to Walsenburg. 3  CO 103 from Evergreen Parkway west to Echo Lake.  McClure Pass - This is a spectacular 8,755 foot pass south of Carbondale along Colorado 133 and the Crystal River.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":6665043,"ranking":18,"query_text":"where is crystal colorado","passage_text":"Crystallizing and Crystallized redirect here. For the song, see Crystalised. For other uses, see Crystallization (disambiguation). Crystallization is the (natural or artificial) process where a solid forms where the atoms or molecules are highly organized in a structure known as a crystal. Some of the ways which crystals form are through precipitating from a solution, melting or more rarely deposition directly from a gas.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":8393538,"ranking":19,"query_text":"where is crystal colorado","passage_text":"The most famous locality in the world for superb rhodochrosite crystals is the Sweet Home Mine, located near the community of Alma, Colorado. It was opened in 1873 as a silver mine and was worked on and off for silver until the 1960s.","bm25_label":"high","relevance_label":0.0},{"query_id":980789,"passage_id":2604426,"ranking":20,"query_text":"where is crystal colorado","passage_text":"If a rock has both crystal types, it means that the mamga spent some time in a magma chamber, where the large crystals grew, then was violently erupted onto the surface, where the small crystals were formed.","bm25_label":"high","relevance_label":0.0}]