[{"query_id":985165,"passage_id":7295427,"ranking":1,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Why are jury trials important to court cases like those of Felina Early v. Suzy Snoozer Why are jury trials important to court cases like those of Felina E...","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":7295423,"ranking":2,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Why are jury trials important to court cases like those of Felina Early v. Suzy Snoozer Why are jury trials important to court cases like those of Felina Early v. Suzy Snoozer was asked by Shelly Notetaker on May 31 2017. 433 students have viewed the answer on StudySoup. View the answer on StudySoup.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":7295424,"ranking":3,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Why are jury trials important to court cases like those of Felina Early v. Suzy Snoozer? Jury trials protect the right of the government to require suspect citizens to prove their innocence in a court of law. They help to make the trial process go faster because jury members can split up the evidence to examine.","bm25_label":"high","relevance_label":1.0},{"query_id":985165,"passage_id":7295428,"ranking":4,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Why are jury trials important to court cases like those of Felina Early v. Suzy Snoozer? Jury trials protect the right of the government to require suspect citizens to prove their innocence in a court of law. They help to make the trial process go faster because jury members can split up the evidence to examine. Jury trials relieve judges of their responsibilities in the courtroom, allowing them to focus only on simpler cases. They help ensure justice by having ordinary citizens determine whether a fellow citizen is at fault in a situation.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":7295425,"ranking":5,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Question 5 (Multiple Choice Worth 3 points) In the lesson, you played the role of a juror in the case of Snoozer v. Early. What type of case was it, and what could be its outcome? It was a criminal case. Felina Early faced possible jail time for failing to control her cat. It was a civil case. Snoozer was seeking compensation for the loss of her birds. It was a civil case. Early was seeking compensation for the loss of her cat. It was a criminal case. Snoozer faced possible jail time for lying about her neighbor. Question 6 (Multiple Choice Worth 3 points) In the lesson, you played the role of a juror in the case of Snoozer v. Early.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":2921921,"ranking":6,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Hickman v. Jones, 76 U.S. (9 Wall.) 197, 201 (1869) (It. is as much within the province of the jury to decide questions of fact as of the court to. decide questions of law. The jury should take the law as laid down by the court and give. it full effect.) The early recognized power of the court to grant new trials in civil cases. was one method of preventing the rendering of judgments on verdicts against the direc-. tions of the Court ...","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":8151991,"ranking":7,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Serving the United States District Court Purpose of This Handbook. Importance of Jury Service. The Courts. The Criminal Case. The Civil Case. The Voir Dire Examination. The Jurors' Solemn Oath. The Eight Stages of Trial. The Arguments of Counsel. The Charge to the Jury. The Juryâ\u0080\u0099s Verdict. Courtroom Etiquette. Conduct of the Jury during the Trial. In the Jury Room","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":3737530,"ranking":8,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"In a long line of cases, the Court had held that no constitutional right to jury trial existed in trials of criminal contempt. 72 But in Bloom v. Illinois, 73 the Court announced that ''[o]ur deliberations have convinced us.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":6404630,"ranking":9,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"unfortunately the courts are split as to enforcement of jury trial waiver provisions some georgia cases indicate that courts in that state may not enforce the waiver of jury trial as contained in standard loan and lease documents american southern financial ltd v yang 448 s e 2d 450 ga 1994","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":1374187,"ranking":10,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Most jury trials in the United States (roughly five out of six jury trials conducted in any U.S. Court) take place in criminal cases in state courts. State courts do not have jurisdiction over criminal cases arising on Indian reservations even if those reservations are located in their state.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":4641065,"ranking":11,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"The consent of the prosecutor is necessary to waive the jury. The prosecutor has a legitimate interest in having the case tried in the most likely manner to produce a fair trial. However, some courts may allow a defendant to waive a trial by jury even without government consent.ince the right to a trial by jury is very important, there are specific requirements in order to waive the jury. These include: 1  The defendantâ\u0080\u0099s consent to forgo a jury trial must be written. 2  The defendantâ\u0080\u0099s agreement to waive the jury must be voluntary, knowing and intelligent.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":6685752,"ranking":12,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"The act of the clerk of the court in making up a list of the jurors who have been selected for the trial of a particular cause. All the steps of ascertaining who shall be the proper jurors to sit in the trial of a particular case up to the final formation. v. to select and install a jury. (See: impaneling, jury)","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":47110,"ranking":13,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Court Trial Definition. A court trial, also called a bench trial or a jury trial, is when all the facts of a case are heard, and a judge or jury makes the final decision about the court case. An offender can waive their rights to a jury trial and just have the judge make the ruling in a bench trial.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":2771585,"ranking":14,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"When the court decides the facts, an opening trial brief may be more important than it is in a trial by jury. Such a brief in a jury trial is usually confined to an analysis of the legal issues likely to arise during the trial. But in a bench trial, a trial brief can be an important part of fact-oriented advocacy.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":8143931,"ranking":15,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Over 90% of medical malpractice cases settle out of court, and for good reason. Neither side wants to go to court, because it is expensive and time-consuming. Generally, only those cases where neither side can agree on a settlement amount will go to trial, and even then it is usually a last option. Settlement Amounts vs. Jury Awards. The average out of court settlement for a medical malpractice lawsuit is just over $425,000, while the average jury award is now over $1 Million. So why not go to trial every time? The fact is that medical malpractice litigation is very expensive, time consuming and not guaranteed.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":583043,"ranking":16,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"If the trial date is set at the Case Management Conference, both sides have to tell the judge whether they want a jury trial or a court trial. A jury trial means that a jury of your peers will decide the case. A court trial, also called a bench trial, means that the judge alone makes the decision on your case.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":8151994,"ranking":17,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Importance of Jury Service. The Courts. The Criminal Case. The Civil Case. The Voir Dire Examination. The Jurors' Solemn Oath. The Eight Stages of Trial. The Arguments of Counsel. The Charge to the Jury. The Juryâ\u0080\u0099s Verdict. Courtroom Etiquette. Conduct of the Jury during the Trial. In the Jury Room. After the Trial. Conclusion. Importance of Jury Service Jurors perform a vital role in the American system of justice. The protection of our rights and liberties is largely achieved through the teamwork of judge and jury who, working together in a common effort, put into practice the principles of our great heritage of freedom.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":3983439,"ranking":18,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Let's take a look at a couple court cases where the 7th Amendment came into play: In United States v. Wonson, the Supreme Court created the historical test for determining whether a law was eligible for trial by jury.he 7th amendment is one of the lesser known amendments, but it established important rules for civil courts and asserts the supremacy of jury decisions. Once you've watched the video, text your understanding with a quiz.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":7028478,"ranking":19,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"The events that culminated in the trials began in the early spring of 1931, when nine young black men were falsely accused of raping two white women on a train. The cases were tried and appealed in Alabama and twice argued before the U.S. Supreme Court.hree months later, the court once again overturned the guilty verdicts and ordered new trials, ruling in Patterson v. Alabama and Norris v. Alabama that the defendants were denied a fair trial because African Americans had been systematically excluded from Jackson County jury rolls.","bm25_label":"high","relevance_label":0.0},{"query_id":985165,"passage_id":2741972,"ranking":20,"query_text":"why are jury trials important to court cases like those of felina early v. suzy snoozer","passage_text":"Only one. The US District Courts are the trial courts for cases of general jurisdiction in the federal court system. Cases are either tried by jury (jury trial) or by a single â\u0080¦ judge (bench trial). 2 people found this useful.","bm25_label":"high","relevance_label":0.0}]