[{"query_id":985752,"passage_id":2483395,"ranking":1,"query_text":"who was william henry preceded by","passage_text":"John Tyler. John Tyler - 04\/04\/1841: After the death of President William Henry Harrisoâ\u0080¦. After the death of President William Henry Harrison, Vice President John Tyler assumes the presidency. He is the first ever to do so, setting the precedent for presidential succession.April 04, 1841.ohn Tyler. John Tyler - 04\/04\/1841: After the death of President William Henry Harrisoâ\u0080¦. After the death of President William Henry Harrison, Vice President John Tyler assumes the presidency. He is the first ever to do so, setting the precedent for presidential succession.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":7608376,"ranking":2,"query_text":"who was william henry preceded by","passage_text":"He was the third of four Whig presidents, the last being Fillmore, his successor. Taylor was also the second president to die in office, preceded by William Henry Harrison who died while serving as President nine years earlier, as well as the only President elected from Louisiana.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":6933468,"ranking":3,"query_text":"who was william henry preceded by","passage_text":"William Henry Harrison (1773-1841) was the 9th President of the US, although he died after just a month in office. He had gained notoriety as a military leader in 1811 in the â\u0080¦Indian wars that preceded the War of 1812. William Henry Harrison was the first Whig to enter office, and the first President to die in office.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":6933471,"ranking":4,"query_text":"who was william henry preceded by","passage_text":"William Henry Harrison (1773-1841) was the 9th President of the US, although he died after just a month in office. He had gained notoriety as a military leader in 1811 in the â\u0080¦ Indian wars that preceded the War of 1812. William Henry Harrison was the first Whig to enter office, and the first President to die in office.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":7294090,"ranking":5,"query_text":"who was william henry preceded by","passage_text":"He is preceded in death by his parents, William Henry and Gussie Ewing Brown, Sr., sister Margaret Eleanor Brown Sullivan, brother James Lawrence Brown and son-in-law John Watts Avent. The Family would like to thank all of the caregivers who took special care of him.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":7294083,"ranking":6,"query_text":"who was william henry preceded by","passage_text":"William Henry Harrison. 9th President of the United States. Terms: 1. Time in office: March 4, 1842- March 4, 1845. Vice President: John Tyler. Preceded by: Martin Van Buren.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":7294084,"ranking":7,"query_text":"who was william henry preceded by","passage_text":"William Henry Harrison: 9th President of the United States: Terms: 1 Time in office: March 4, 1842- March 4, 1845 Vice President: John Tyler: Preceded by: Martin Van Buren: Succeeded by: Henry Clay: United States Senator from Ohio: In office: March 4, 1825 â\u0080\u0093 May 20, 1828 Preceded by: Ethan Allan Brown Succeeded by: Jacob Burnet 1st Governor of Indiana Territory","bm25_label":"high","relevance_label":1.0},{"query_id":985752,"passage_id":6933465,"ranking":8,"query_text":"who was william henry preceded by","passage_text":"J.D. Ryznar: Iâ\u0080\u0099m gonna tell you the story of William Henry Harrison. Shot cuts to an image of William Henry Harrison J. D. Ryznar (voiceover): He was the ninth President of the United States. He was the president who had the shortest term of any President. It was less than a month. The shot cuts to Paul Schneider dressed as William Henry Harrison.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":6027959,"ranking":9,"query_text":"who was william henry preceded by","passage_text":"By Judge J. A. Arenz, Chapter XIV, History of Cass County, Illinois, edited by William Henry Perrin, Chicago, O.L. Baskin & Co. Historical Publishers, 1882. In order to prepare a complete history of the precinct of Arenzville, it will be necessary to refer to some events which preceded its organization.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":7946617,"ranking":10,"query_text":"who was william henry preceded by","passage_text":"the battle of Tippecanoe begin in November 7,1811. it was American who was lead by William Henry Harrison against the Shawnee Indians. the Shawnee Indians were defeated by Wil â\u0080¦ liam Henry Harrison and his soldiers.1 person found this useful.he battle of Tippecanoe begin in November 7,1811. it was American who was lead by William Henry Harrison against the Shawnee Indians. the Shawnee Indians were defeated by Wil â\u0080¦ liam Henry Harrison and his soldiers. 1 person found this useful.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":8273925,"ranking":11,"query_text":"who was william henry preceded by","passage_text":"1. King John (1623). The historical play is about King Richard, the Second who ruled England between 1377-1399. It is Shakespeare's second tetralogy, which has four plays chronologically. Henry IV, (Part 1), Henry IV (Part 2), and Henry V are preceded by Richard II.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":4824379,"ranking":12,"query_text":"who was william henry preceded by","passage_text":"Prior to Henry's own daughters Mary and Elizabeth (who both ruled after him), the only precedent for a Queen Regnant in England was Empress Matilda during the Anarchy (an English Civil War in the 1100's) who attempted and failed to claim the Crown and rule on behalf of her son, King Henry II.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":3762640,"ranking":13,"query_text":"who was william henry preceded by","passage_text":"Catherine Parr's marriage to Henry was preceded by his marriages to Catherine of Aragon, Anne Boleyn, Jane Seymour, Anne of Cleves and Katherine Howard. She was also one of two of Henry's wives who were not ill-fated and did not die during their marriages to the King.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":6027960,"ranking":14,"query_text":"who was william henry preceded by","passage_text":"By Judge J. A. Arenz, Chapter XIV, History of Cass County, Illinois, edited by William Henry Perrin, Chicago, O.L. Baskin & Co. Historical Publishers, 1882. Arenzville Precinct--Its Early History. In order to prepare a complete history of the precinct of Arenzville, it will be necessary to refer to some events which preceded its organization.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":7424729,"ranking":15,"query_text":"who was william henry preceded by","passage_text":"William Harrison-Broadley. William Henry Harrison-Broadley (August 1820 â\u0080\u0093 1896) was a British Conservative politician who sat in the House of Commons from 1868 to 1885.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":8604243,"ranking":16,"query_text":"who was william henry preceded by","passage_text":"Who delivered the wakeup kiss to the Sleeping Beauty: Prince James, Prince Philip, Prince Charles, or Prince Henry? If Prince Charles should be crowned King, what title will Prince Harry have? The second son is usually Duke of York, but Prince Andrew already has that title. With the planned changes to the UK's laws of succession, if something happened to prevent Charles, William, George and Harry from becoming king will Princess Anne be next in line now, or do Prince Andrew and Prince Edward still take precedence?","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":3903107,"ranking":17,"query_text":"who was william henry preceded by","passage_text":"The Williams Brothers 91 year old mother, Mom Amanda Williams, attended the event as did their sisters, Deliana, Marie and Marilyn, who along with brother, Huey Williams, shared their memories of life with Doug, Melvin and Henry.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":6665974,"ranking":18,"query_text":"who was william henry preceded by","passage_text":"The name William is a Shakespearean baby name. In Shakespearean the meaning of the name William is: Henry VI, 2' Sir John Stanley. 'Henry VI, Part III' Sir William Stanley.he name William is a Shakespearean baby name. In Shakespearean the meaning of the name William is: Henry VI, 2' Sir John Stanley. 'Henry VI, Part III' Sir William Stanley.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":2892306,"ranking":19,"query_text":"who was william henry preceded by","passage_text":"William Henry Harrison, 9th President ,who died in office on April 4, 1841.served the shortest term of any president: March 4 - April 4, 1841. He served 30 days, 12 hours, andâ\u0080¦ 30 minutes. He died of pneumonia. William Henry Harrison only held office for 32 days.","bm25_label":"high","relevance_label":0.0},{"query_id":985752,"passage_id":7817972,"ranking":20,"query_text":"who was william henry preceded by","passage_text":"William Henry Harrison, 9th President ,who died in office on April 4, 1841.served the shortest term of any president: March 4 - April 4, 1841. He served 30 days, 12 hours, and 30 minutes. He died of pneumonia. William Henry Harrison only held office for 32 days.","bm25_label":"high","relevance_label":0.0}]