[{"query_id":986210,"passage_id":1374321,"ranking":1,"query_text":"who was the basket of apples by","passage_text":"In order to compare apples to apples, the items in the basket of goods must remain the same. Of course, American consumers change their product purchases over time (i.e. smart phones). Thus, the basket is only relevant for a limited period of time. The basket targets the average urban consumer.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":7293395,"ranking":2,"query_text":"who was the basket of apples by","passage_text":"The Basket of Apples The Basket of Apples is an oil painting produced in 1895 by French painter Paul Cezanne. This painting by Paul Cezanne was noticed widely for its disjoint perspectives. The Basket of Apples due to its unbalanced parts was regarded as a balanced composition. Many unbalanced parts include the titled bottle, cookies shortened lines, inclined basket and the right side of the painting containing the table cloth does not matches with the same plane as the left side giving a view that there are two different viewpoints.","bm25_label":"high","relevance_label":1.0},{"query_id":986210,"passage_id":6098488,"ranking":3,"query_text":"who was the basket of apples by","passage_text":"Say you have 18 apples. You want to split them into baskets of 6. You now have 3 (baskets) of 6 (apples). You have 3 * 6 = 18 apples in total. Images: http:\/\/micasamontessori.ie\/septe... http:\/\/comfortablydomestic.com\/2...","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":7201769,"ranking":4,"query_text":"who was the basket of apples by","passage_text":"It promotes a greater sense of family When we buy local foods, we are encouraged and inspired by our food. Who doesnâ\u0080\u0099t spy a brimming basket of apples and think, â\u0080\u009chomemade apple pie!â\u0080\u009d We hit the kitchen, whipping up favourite family recipes and applying our creative juices.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":6188970,"ranking":5,"query_text":"who was the basket of apples by","passage_text":"So we can conclude that the golden apples are equal to the word of the first phrase and the silver basket or the picture of silver is equal to the word fitly in the first phrase. Word = Apples, fitly equals pictures of silver.ut the word, if presented fitly, as the apples in a silver basket, then the word fitly spoken will be received more readily. In other words there is a way that words spoken will be accepted more readily if spoken properly or fitly.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":7293391,"ranking":6,"query_text":"who was the basket of apples by","passage_text":"Discussion. 1  http:\/\/www.luc.edu\/depts\/history\/dennis\/Visual_Arts\/11-cubism_Cezanne_The-Basket-of-Apples-(1896)-%5BAIC%5D.jpg. 2  Meyer Schapiro, http:\/\/www.ibiblio.org\/wm\/paint\/auth\/cezanne\/sl\/basket-apples\/. 3  http:\/\/www.ibiblio.org\/wm\/paint\/auth\/cezanne\/portraits\/cezanne.woman-seated-blue.jpg -- fabric #2.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":4222916,"ranking":7,"query_text":"who was the basket of apples by","passage_text":"The word chamomile comes from the Greek, karnai, meaning on the ground, and melon, meaning apple, for ground apple. Fill the press basket about half full of ground apples. The leftover ground apples that they have to dispose of would be great for smaller animals.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":6961233,"ranking":8,"query_text":"who was the basket of apples by","passage_text":"2. Place damaged apples out on the counter. When kept at room temperature in a basket, apples can stay fresh for about two days. This is not a long time, of course, but damaged apples should be eaten within a short amount of time no matter how you store them since a partially decayed apple is likely to spoil faster.. Place damaged apples out on the counter. When kept at room temperature in a basket, apples can stay fresh for about two days. This is not a long time, of course, but damaged apples should be eaten within a short amount of time no matter how you store them since a partially decayed apple is likely to spoil faster.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":4009515,"ranking":9,"query_text":"who was the basket of apples by","passage_text":"1 Enter your model number to make sure this fits. 2  1 Dozen 1\/2 Peck Wooden Apple or Picking Baskets. 3  1\/2 Peck Size Wooden Basket with Wooden Spool Handle. 4  Basket Size 8.5.  Natural Wood Color.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":2468538,"ranking":10,"query_text":"who was the basket of apples by","passage_text":"How to Use Vinegar to Detoxify the Liver. Apple cider vinegar on a wooden table with a basket of apples. Apple cider vinegar boasts various healing properties for the skin and blood, as well as liver detoxification properties, according to NaturalNews.com.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":6188971,"ranking":11,"query_text":"who was the basket of apples by","passage_text":"But the word, if presented fitly, as the apples in a silver basket, then the word fitly spoken will be received more readily. In other words there is a way that words spoken will be accepted more readily if spoken properly or fitly.ut the word, if presented fitly, as the apples in a silver basket, then the word fitly spoken will be received more readily. In other words there is a way that words spoken will be accepted more readily if spoken properly or fitly.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":8500729,"ranking":12,"query_text":"who was the basket of apples by","passage_text":"Place damaged apples out on the counter. When kept at room temperature in a basket, apples can stay fresh for about two days. This is not a long time, of course, but damaged apples should be eaten within a short amount of time no matter how you store them since a partially decayed apple is likely to spoil faster.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":7293387,"ranking":13,"query_text":"who was the basket of apples by","passage_text":"Basket of Apples, 1895 by Paul Cezanne, Final period. Post-Impressionism. still life. Art Institute of Chicago, Chicago, IL, US","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":2220692,"ranking":14,"query_text":"who was the basket of apples by","passage_text":"Cider was tediously made at first by pounding the apples in wooden mortars; the pomace was afterward pressed in baskets. Stage-coach and Tavern Days Alice Morse Earle After the juice has been extracted from the apples the pomace that remains is sometimes used as a fertilizer.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":8511640,"ranking":15,"query_text":"who was the basket of apples by","passage_text":"A basket of apples next to a bottle of apple cider vinegar. Apple cider vinegar provides benefits that may reduce or prevent acid reflux. Although apple cider vinegar contains acetic acid that can trigger reflux for some people, others use apple cider as a remedy for heartburn, the pain and burning in the upper chest and throat from acid reflux. The effectiveness of a treatment may depend on the person and the cause of heartburn.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":7200782,"ranking":16,"query_text":"who was the basket of apples by","passage_text":"Also includes 1 attachable baby seat with safety strap, 2 attachable meal trays with cup holders, can of apple juice, can of orange juice, 4 sandwiches, basket to serve sandwiches, and basket of food with lid. Calico Critters sold separately. top reviews Olena - August 08, 2016. Nice car for a small Calico family.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":7293393,"ranking":17,"query_text":"who was the basket of apples by","passage_text":"This decorative wire-mesh apple shape basket safely stores and displays ... 12 Mini Chalkboards 2X4- For Wedding Place Cards Party Favors, & Crafts by Unknown by Decorator & Craft Corp","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":7293396,"ranking":18,"query_text":"who was the basket of apples by","passage_text":"Liven up the walls of your home or office with Basket Of Apples art from Zazzle. Check out our great posters, wall decals, photo prints, & wood wall art.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":2661742,"ranking":19,"query_text":"who was the basket of apples by","passage_text":"Apples in a wire basket on a gardening table. Apples, a member of the rose family, are low in calories and are fat-, sodium- and cholesterol-free. About 2,500 varieties are grown throughout the United States, according to the University of Illinois Extension. Besides being a good source of fiber, apples contain vitamins, minerals and other nutrients that help improve your health. Eating apples with their skin benefits your health because much of the fiber and antioxidants are in the skin.","bm25_label":"high","relevance_label":0.0},{"query_id":986210,"passage_id":4985793,"ranking":20,"query_text":"who was the basket of apples by","passage_text":"You will learn how to make an elaborate bow, organize the items inside the basket and wrap the basket with cellophane. This basket was made for an employees retirement. This video was edited by Bill Phillips who also created the music. The instruction for making the basket was presented by Tracey Phillips.","bm25_label":"high","relevance_label":0.0}]