[{"query_id":986427,"passage_id":7293034,"ranking":1,"query_text":"who was peter drucker","passage_text":"More about Peter Drucker. 1  Peter Druckerâ\u0080\u0099s Life and Legacy: Hailed by BusinessWeek as â\u0080\u009cthe man who invented management,â\u0080\u009d Drucker directly influenced a huge number of leaders from a wide range of organizations across all sectors of society.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7293032,"ranking":2,"query_text":"who was peter drucker","passage_text":"Enjoy the best Peter Drucker Quotes at BrainyQuote. Quotations by Peter Drucker, American Businessman, Born November 19, 1909. Share with your friends. Management is doing things right; leadership is doing the right things. - Peter Drucker","bm25_label":"high","relevance_label":1.0},{"query_id":986427,"passage_id":8071709,"ranking":3,"query_text":"who was peter drucker","passage_text":"One good answer to this question comes from management guru Peter Drucker, who divided the job of the manager into these five basic tasks.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7293031,"ranking":4,"query_text":"who was peter drucker","passage_text":"Drucker delivered the prestigious Godkin Lecture at Harvard University in 1994. The Drucker Center became the Peter F. Drucker Graduate School of Management in 1997, and the Drucker Archives (a repository for Druckerâ\u0080\u0099s manuscripts, letters and other material) was inaugurated in 1998.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":8456313,"ranking":5,"query_text":"who was peter drucker","passage_text":"Peter Drucker is often called 'the guru's guru'. Drucker himself would suggest that accolade should be given to Frederick Winslow Taylor (1856-1915):","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7293033,"ranking":6,"query_text":"who was peter drucker","passage_text":"In 2004, the Drucker Graduate School of Management became the Peter F. Drucker and Masatoshi Ito Graduate School of Management. Asked near the end of his life what he considered his most important contributions, Drucker replied:","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":4788031,"ranking":7,"query_text":"who was peter drucker","passage_text":"Peter Drucker. Peter Ferdinand Drucker (\/Ë\u0088drÊ\u008ckÉ\u0099r\/; German: [Ë\u0088dÊ\u0080Ê\u008akÉ\u0090]; November 19, 1909 â\u0080\u0093 November 11, 2005) was an Austrian-born American management consultant, educator, and author, whose writings contributed to the philosophical and practical foundations of the modern business corporation.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7293038,"ranking":8,"query_text":"who was peter drucker","passage_text":"Druckerâ\u0080\u0099s Career Timeline and Bibliography. Early Years. Peter Drucker was born in Vienna, Austria on November 19, 1909. The household in which he grew up was one of great intellectual ferment. His parents, Adolph and Caroline, regularly held evening salons with economists (including Joseph Schumpeter, who would come to have a tremendous influence on Drucker), politicians, musicians, writers and scientists.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7293035,"ranking":9,"query_text":"who was peter drucker","passage_text":"But Drucker's tale is not mere history. Whether it's recognized or not, the organization and practice of management today is derived largely from the thinking of Peter Drucker. His teachings form a blueprint for every thinking leader (page 106).","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":1258263,"ranking":10,"query_text":"who was peter drucker","passage_text":"Adapted from â\u0080\u009cThe Wall Street Journal Guide to Managementâ\u0080\u009d by Alan Murray, published by Harper Business. What do managers do? One good answer to this question comes from the late Peter Drucker, whose name that stands out above all others in the century-long history of management studies. A native of Vienna, Austria, Mr. Drucker was an intellectual who worked as a journalist and studied economics.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":5098332,"ranking":11,"query_text":"who was peter drucker","passage_text":"An entrepreneur is defined by Peter F. Drucker as someone who shifts economic resources out of an area of lower and into an area of higher productivity and greater yield.. The difference between entrepreneurship and social entrepreneurship, however, stems from the purpose of a creation.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":4061365,"ranking":12,"query_text":"who was peter drucker","passage_text":"Management by objectives (Drucker) The father of modern corporate management Peter Drucker is often considered to be the worldâ\u0080\u0099s most influential corporate guru. His ideas and thoughts revolutionized corporate management in the later half of the 20th century.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7772140,"ranking":13,"query_text":"who was peter drucker","passage_text":"It is Alan Kay's quote. <br \/> P.S to everyone who reads this: What does it mean??????????????????? <br \/> -Puppylove7(guess who it is!!!!!!!!!!!!!!!!!!!!!!)<br \/><br \/>Peter Drucker is attributed for saying it in this way, but Kay said invent it not create it. However, according to brainyquotes.com, the quote is attributed to Abraham Lincoln.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7291356,"ranking":14,"query_text":"who was peter drucker","passage_text":"Ethical Advice from Peter Drucker. I think all leaders would serve their followers well if they always followed this advice from Peter Drucker, â\u0080\u009cDo not knowingly do harm.â\u0080\u009d Of course the key word here is â\u0080\u009cknowinglyâ\u0080\u009d. I think knowing how to read and use your moral compass will help you make better ethical decisions.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":857853,"ranking":15,"query_text":"who was peter drucker","passage_text":"The idea of management by objectives (MBO), first outlined by Peter Drucker and then developed by George Odiorne, his student, was popular in the 1960s and 1970s. In his book â\u0080\u009cThe Practice of Managementâ\u0080\u009d, published in 1954, Drucker outlined a number of priorities for the manager of the future.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":8183541,"ranking":16,"query_text":"who was peter drucker","passage_text":"What is an Information Worker? When Peter Drucker originally articulated the idea of a â\u0080\u009cknowledge workerâ\u0080\u009d in 1959, he was proposing a classification with the primary goal of describing the work of people who applied knowledge directly, and in a unique way, to the tasks assigned to them.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7293036,"ranking":17,"query_text":"who was peter drucker","passage_text":"For years professors at the most elite business schools said they didn't bother to read Drucker because they found him superficial. And in the years before Drucker's death even the dean of the Peter F. Drucker Graduate School of Management at Claremont said: This is a brand in decline. In the 1980s he began to have grave doubts about business and even capitalism itself.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":3775664,"ranking":18,"query_text":"who was peter drucker","passage_text":"He is one of the best-read people I have ever met. He was a Yale undergraduate, a history major. He has a great sense of history and its forces. He is the first president to be an MBA, a Harvard MBA. I had read Peter Drucker, but I had never seen Peter Drucker in action until I saw George W. Bush as governor of Texas.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":7772142,"ranking":19,"query_text":"who was peter drucker","passage_text":"P.S to everyone who reads this: What does it mean??????????????????? -Puppylove7(guess who it is!!!!!!!!!!!!!!!!!!!!!!) Peter Drucker is attributed for saying it in this way, but Kay said invent it not create it. However, according to brainyquotes.com, the quote is attributed to Abraham Lincoln. Puppylove, it means we can create, invent or otherwise shape our futures and destinies.","bm25_label":"high","relevance_label":0.0},{"query_id":986427,"passage_id":3942432,"ranking":20,"query_text":"who was peter drucker","passage_text":"Peter Drucker believed market research to be the quintessence of marketing. Market research is a way that producers and the marketplace study the consumer and gather information about the consumers needs.","bm25_label":"high","relevance_label":0.0}]