[{"query_id":987183,"passage_id":5200202,"ranking":1,"query_text":"who studied neptune","passage_text":"When the spacecraft visited the Neptunian system, Neptune was the farthest known body in the Solar system. It was not until 1999, that Pluto was further from the Sun in its trajectory. Voyager 2 studied Neptune's atmosphere, Neptune's rings, its magnetosphere, and Neptune's moons.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":7291788,"ranking":2,"query_text":"who studied neptune","passage_text":"When the spacecraft visited the Neptunian system, Neptune was the farthest known body in the Solar system. It was not until 1999, that Pluto was further from the Sun in its trajectory. Voyager 2 studied Neptune's atmosphere, Neptune's rings, its magnetosphere, and Neptune's moons. The Neptunian system had been studied scientifically for many years with telescopes and indirect methods, but the close inspection by the Voyager 2 probe settled many issues and revealed a plethora of information that could not have been obtained otherwise.","bm25_label":"high","relevance_label":1.0},{"query_id":987183,"passage_id":7293021,"ranking":3,"query_text":"who studied neptune","passage_text":"subjects of study. Percival Lowell, (born March 13, 1855, Boston, Mass., U.S.â\u0080\u0094died Nov. 12, 1916, Flagstaff, Ariz.), American astronomer who predicted the existence of a planet beyond the orbit of Neptune and initiated the search that ended in the discovery of Pluto.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":5416684,"ranking":4,"query_text":"who studied neptune","passage_text":"Who Discovered Neptune. The fourth biggest planet in the Solar System, Neptune is named after the god of the sea, Neptune, from Roman mythology.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":5416682,"ranking":5,"query_text":"who studied neptune","passage_text":"1 Neptune is the 8th planet from the Sun. 2  Uranus, the 7th planet, was first discovered by means of a telescope in 1781. 3  Two astronomers (scientists who study the stars and planets), J.C.Adams in England and Urbain Le Verrier in France, had been puzzled by the shape of Uranusâ\u0080\u0099 orbit.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":5772640,"ranking":6,"query_text":"who studied neptune","passage_text":"It is very difficult to determine how fast one of the gas giant planets is rotating. A recent study by the University of Arizona revealed that Neptune spins one entire rotatio â\u0080¦ n every 15 hours, 57 minutes, and 59 seconds. Before this study, Neptune's rotation time had been assumed to be around 16 hours, 6 minutes.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":2376719,"ranking":7,"query_text":"who studied neptune","passage_text":"Who discovered Pluto? Pluto was discovered in 1930 by Clyde Tombaugh. Astronomers noticed that the orbits of Neptune and Uranus were being affected by the gravity of an unknown object in the Solar System. Clyde Tombaugh carefully studied images of the night sky, and after a lot of hard work he finally discovered Pluto.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":7291786,"ranking":8,"query_text":"who studied neptune","passage_text":"Scientists study violent winds of Uranus, Neptune. Shrouded in a dense layer of clouds, Uranus appears as an almost featureless world when viewed in visible light. Jet streams encircling giant gas planets don't reach deep, according to a new study. (Yohai Kaspi) The Voyager 2 spacecraft photographed bands of clouds around Neptune during its flyby in 1989.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":7291787,"ranking":9,"query_text":"who studied neptune","passage_text":"NASA has initiated preliminary studies of missions to either Uranus or Neptune, Jim Green (above), the agency's planetary science director, said Aug. 24. Credit: NASA. LAUREL, MD. â\u0080\u0094 NASA began an early feasibility study for missions to the distant, mostly ignored ice-giants Uranus and Neptune, a senior agency official said here Aug. 24.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":5416681,"ranking":10,"query_text":"who studied neptune","passage_text":"Who Discovered Neptune. The fourth biggest planet in the Solar System, Neptune is named after the god of the sea, Neptune, from Roman mythology. Neptune is one of the three planets that were not visible to the human eye; the other two planets are Uranus and Pluto (now classified as a dwarf planet).","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":1221370,"ranking":11,"query_text":"who studied neptune","passage_text":"Neptune is warming In April 2007, Heidi Hammel published a study comparing Neptune's brightening to Earth's warming and solar variations. She concluded that while they don't correlate statistically, the patterns are visually compelling and planetary climate changes may be due to solar variations.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":5774965,"ranking":12,"query_text":"who studied neptune","passage_text":"A Day on Neptune Is Just 16 Hours Long, Study Reveals. by Nola Taylor Redd, Space.com Contributor | October 09, 2011 07:00am ET. Neptune's Great Dark Spot, accompanied by white high-altitude clouds, as seen by a Voyager spacecraft.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":2992323,"ranking":13,"query_text":"who studied neptune","passage_text":"Facts About. Who Discovered Neptune. The fourth biggest planet in the Solar System, Neptune is named after the god of the sea, Neptune, from Roman mythology. Neptune is one of the three planets that were not visible to the human eye; the other two planets are Uranus and Pluto (now classified as a dwarf planet).","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":1539764,"ranking":14,"query_text":"who studied neptune","passage_text":"By studying hundreds of images from the Hubble Space Telescope, astronomers were able to calculate how long a day lasts on Neptune by measuring how often prominent features on the planet appeared. By studying hundreds of images from the Hubble Space Telescope, astronomers were able to calculate how long a day lasts on Neptune by measuring how often prominent features on the planet appeared.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":4227963,"ranking":15,"query_text":"who studied neptune","passage_text":"1 Venus is the 2nd planet from the sun. 2  The closest planet to the sun is Mercury. 3  Then comes Venus and then Earth, followed by Mars, Saturn, Jupiter, Uranus, Neptune and Pluto. 4  There are other orbiting bodies beyond Pluto but astronomers (scientists who study the Solar System) do not agree about whether these are planets.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":1221366,"ranking":16,"query_text":"who studied neptune","passage_text":"Climate Myth... Neptune is warming. In April 2007, Heidi Hammel published a study comparing Neptune's brightening to Earth's warming and solar variations. She concluded that while they don't correlate statistically, the patterns are visually compelling and planetary climate changes may be due to solar variations.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":2920706,"ranking":17,"query_text":"who studied neptune","passage_text":"No. Humans could not live on Neptune. The planet is extremely cold,  its atmosphere is not breathable, and there is no solid surface to  stand on. Although in the distant fuâ\u0080¦ture we could see a space  station in orbit around Neptune which would send probes, and ships  into the atmosphere for scientific study.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":2920709,"ranking":18,"query_text":"who studied neptune","passage_text":"No. Humans could not live on Neptune. The planet is extremely cold, its atmosphere is not breathable, and there is no solid surface to stand on. Although in the distant fu â\u0080¦ ture we could see a space station in orbit around Neptune which would send probes, and ships into the atmosphere for scientific study.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":5200208,"ranking":19,"query_text":"who studied neptune","passage_text":"Neptune's magnetosphere was also studied by Voyager 2. The magnetic field was found to be highly tilted and largely offset from the planet's centre. The probe discovered auroras, but much weaker than those on Earth or other planets. The radio instruments on board found that Neptune's day lasts 16 hours and 6.7 minutes.","bm25_label":"high","relevance_label":0.0},{"query_id":987183,"passage_id":7291790,"ranking":20,"query_text":"who studied neptune","passage_text":"Common knowledge says that in synastry, the person who has the Neptune will put the spell on the person who has the inner planet. Frankly, I havenâ\u0080\u0099t seen this. I have to say that Iâ\u0080\u0099ve seen more of it the other way around, that itâ\u0080\u0099s the Neptune person who gets enchanted by the inner planet person. Certainly at first.","bm25_label":"high","relevance_label":0.0}]