[{"query_id":987978,"passage_id":7802968,"ranking":1,"query_text":"where is miralago","passage_text":"Miralago Subdivision Homes for sale in Ahwatukee Foothills. Miralago at the Foothills is a gated subdivision in the Foothills in Ahwatukee. Miralago is located in the south eastern area of Chandler Blvd and Desert Foothills Parkway. Homes in this gated subdivision were built between 1990 and 1995. A total of 104 houses are in the Miralago subdivision, with 47 of them being single story and the other 57 being 2 story houses.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":7802967,"ranking":2,"query_text":"where is miralago","passage_text":"MiraLago At A Glance: MiraLago is a newer West Parkland gated community of luxury estate homes from 2,100 to over 4,600 square feet under living areas. There are multiple builder models to choose from with elegant 1 and 2-story homes including 3-6 bedrooms, 2- or 3-car garages, and inviting covered entries and patios.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":7802965,"ranking":3,"query_text":"where is miralago","passage_text":"The Miralago is a modern hotel with gardens and outdoor pool set on the shores of Lake Piediluco. It offers comfortable rooms with lake views, LCD TV with satellite channels, parquet floors, and air conditioning. You will enjoy beautiful views of the lake from Hotel Miralago's summer terrace and from the restaurant. The hotel provides free Wi-Fi in the lobby, and it has a TV lounge. A breakfast buffet is served daily.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":7802970,"ranking":4,"query_text":"where is miralago","passage_text":"Miralago is a small village in the Poschiavo valley, at the southern end of the Lago di Poschiavo. It lies on the Bernina Express line. Coordinates: 46Â°16â\u0080²24â\u0080³N 10Â°06â\u0080²03â\u0080³E \/ 46.2732Â°N 10.1009Â°E \/ 46.2732; 10.1009.","bm25_label":"high","relevance_label":1.0},{"query_id":987978,"passage_id":7802973,"ranking":5,"query_text":"where is miralago","passage_text":"B&B Romantic and cozy. Miralago is a little family run bed and breakfast located a few steps from the lake in the suggestive hamlet of Pescallo. Here you can feel the stillness and enjoy the sun from early morning in a fresh atmosphere.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":7802966,"ranking":6,"query_text":"where is miralago","passage_text":"Miralago B&B a piece of paradise in Bellagio a family run B&B, located in the picturesque Pescallo bay, 10 minutes walking from Bellagio centre. Few steps from the lake, you can feel the fresh and peaceful atmosphere of the fishing village.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2355110,"ranking":7,"query_text":"where is miralago","passage_text":"This article is about the house and resort. For Swiss village, see Miralago. Mar-a-Lago (English pronunciation: \/mÉ\u0091É¹.É\u0099.lÉ\u0091.goÊ\u008a\/) is an estate and National Historic Landmark in Palm Beach, Florida, built from 1924 to 1927 by heiress and socialite Marjorie Merriweather Post.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":7802974,"ranking":8,"query_text":"where is miralago","passage_text":"You will love Club MiraLago, the grand, two-story 24,000 sq. ft., resort-style clubhouse that will be situated at the heart of the community featuring a resident ballroom, party room, billiard room, aerobic\/yoga and kids room, as well as a fitness center and private locker room with saunas.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":8184637,"ranking":9,"query_text":"where is miralago","passage_text":"Parkland to consider its first charter school. Re-posting a story from the Sun-Sentinel. By Lisa Huriash. Parkand, a city whose A-rated public schools lure families to move there, may be getting its first charter school. Somerset Academy, which operates more than 60 schools in Florida, Texas, Nevada and Washington, D.C., is proposing a two-story school of nearly 98,000 square feet for grades kindergarten through eighth. The school, possibly called Somerset Parkland Academy, would open at the northwest corner of University Drive and Hillsboro Boulevard. Plans call for a gymnasium with views of a lake and landscaping that is â\u0080\u009clush in nature.â\u0080\u009d It would be near the Parkland Golf & Country Club, MiraLago and Town Parc communities. Peak enrollment is expected at 1,280.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":1360686,"ranking":10,"query_text":"where is miralago","passage_text":"Where is Surgut: Where is Svobodnyj: Where is Syktyvkar: Where is Syzran: Where is Taganrog: Where is Tambov: Where is Tichoreck: Where is Tichvin: Where is Timashyovsk: Where is Tobolsk: Where is Toljatti: Where is Tomsk: Where is Troick: Where is Tuapse: Where is Tujmazy: Where is Tula: Where is Tumen: Where is Tver: Where is Uchta: Where is Ufa: Where is Ulan-Ude: Where is Uljanovsk","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2292184,"ranking":11,"query_text":"where is miralago","passage_text":"Where is Soka: Where is Suita: Where is Sukumo: Where is Suzuka: Where is Tachikawa: Where is Takahashi: Where is Takamatsu: Where is Takaoka: Where is Takarazuka: Where is Takasaki: Where is Takatsuki: Where is Takikawa: Where is Tama: Where is Tokorozawa: Where is Tokushima: Where is Tokyo: Where is Tomakomai: Where is Tottori: Where is Toyama: Where is Toyohashi: Where is Toyokawa","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":4567167,"ranking":12,"query_text":"where is miralago","passage_text":"Where is Kanel: Where is Kaolack: Where is Kayar: Where is Kebemer: Where is Kedougou: Where is Khombole: Where is Kolda: Where is Koungheul: Where is Linguere: Where is Louga: Where is M'Bour: Where is Matam: Where is Mbacke: Where is Mboro: Where is Mekhe: Where is Ndioum: Where is Nguekhokh: Where is Nioro du Rip: Where is Ouro Sogui: Where is Pout: Where is Richard Toll","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2409126,"ranking":13,"query_text":"where is miralago","passage_text":"Where is Bielsko-Biala: Where is Bydgoszcz: Where is Bytom: Where is Chelm: Where is Chorzow: Where is Czestochowa: Where is Dabrowa Gornicza: Where is Elblag: Where is Elk: Where is Gdansk: Where is Gdynia: Where is Gliwice: Where is Glogow: Where is Gniezno: Where is Gorzow Wielkopolski: Where is Grudziadz: Where is Inowroclaw: Where is Jastrzebie Zdroj: Where is Jaworzno","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2447657,"ranking":14,"query_text":"where is miralago","passage_text":"Where is Italy Located; Airports in Italy; Major Cities in Italy; Where is Rome; Where is Florence; Where is Milan; Where is Afragola; Where is Alessandria; Where is Altamura; Where is Ancona; Where is Andria; Where is Arezzo; Where is Asti; Where is Bari; Where is Barletta; Where is Benevento; Where is Bergamo; Where is Bologna; Where is Bolzano; Where is Brescia; Where is Brindisi","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2441838,"ranking":15,"query_text":"where is miralago","passage_text":"super bowl 2018 where | where is super bowl 2018 | where is the super bowl | where is the super bowl 2018 | where is the super bowl in 2018 | where are the olympics | where am i | where are the 2018 olympics | where is the olympics | where is new england | where is prince from | where was prince born | where is starman | where is justin timberlake from | where is super bowl 2019 | where is mauritania | where was prince from | where are the patriots from | where to watch superbowl online ...","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2261092,"ranking":16,"query_text":"where is miralago","passage_text":"Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. See that other chick asked that she said where the cash at. She said where the paper plastic product and where the stash at.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":7269020,"ranking":17,"query_text":"where is miralago","passage_text":"Where is Ahtanum WA: Where is Airway Heights WA: Where is Alderton WA: Where is Alderwood Manor WA: Where is Algona WA: Where is Allyn WA: Where is Amboy WA: Where is Ames Lake WA: Where is Anacortes WA: Where is Anderson Island WA: Where is Artondale WA: Where is Asotin WA: Where is Bangor Base WA: Where is Barberton WA: Where is Basin WA: Where is Bethel WA","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2261098,"ranking":18,"query_text":"where is miralago","passage_text":"Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. Submit Corrections. Visit www.azlyrics.com for these lyrics.","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":7269069,"ranking":19,"query_text":"where is miralago","passage_text":"Where is Shellman GA: Where is Skidaway Island GA: Where is Social Circle GA: Where is Soperton GA: Where is Sparks town GA: Where is Sparta GA: Where is Springfield GA: Where is St. Marys GA: Where is St. Simons GA: Where is Statenville GA: Where is Statham GA: Where is Stone Mountain GA: Where is Summerville GA: Where is Sunnyside GA: Where is Suwanee GA","bm25_label":"high","relevance_label":0.0},{"query_id":987978,"passage_id":2261094,"ranking":20,"query_text":"where is miralago","passage_text":"Don't be surprised if she ask where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. Submit Corrections. Visit www.azlyrics.com for these lyrics.","bm25_label":"high","relevance_label":0.0}]