[{"query_id":988306,"passage_id":4846150,"ranking":1,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Cute Hotel bar. 1  Cute bar in the Hilton, overlooking the lake. 2  This restaurant is in the lobby of the Hilton University Place in Charlotte. 3  The Edgewater Bar is an excellent addition to the Hilton University Place. 4  We stayed at the Hilton Hotel and had dinner at the Edgewater Bar and Grille one night.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":7289326,"ranking":2,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Our hotel rooms in Charlotte, NC are located near Charlotte Douglas Airport and UNC Charlotte. Book at Hilton Charlotte University Place. Our hotel rooms in Charlotte, NC are located near Charlotte Douglas Airport and UNC Charlotte.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":7289331,"ranking":3,"query_text":"who owns charlotte hilton university place hotel","passage_text":"[1\/52] 1  1 - Hilton Charlotte University Place, Charlotte. 2  2 - Hilton Charlotte University Place, Charlotte, Reception. 3  3 - Hilton Charlotte University Place, Charlotte, Lobby Sitting Area. 4  4 - Hilton Charlotte University Place, Charlotte, Executive Room, 2 Double Beds, Business Lounge Access, Guestroom.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":7289328,"ranking":4,"query_text":"who owns charlotte hilton university place hotel","passage_text":"6 - Hilton Charlotte University Place, Charlotte, Executive Room, 1 King Bed, Business Lounge Access, Guest Room; 7 - Hilton Charlotte University Place, Charlotte, Premium Room, 2 Double Beds, Guest Room; 8 - Hilton Charlotte University Place, Charlotte, Executive Room, 1 King Bed, Business Lounge Access, Guest Room 9 - Hilton Charlotte University Place, Charlotte, Guest Room 10 - Hilton Charlotte University Place, Charlotte, Guest Room","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":7289327,"ranking":5,"query_text":"who owns charlotte hilton university place hotel","passage_text":"ABOUT Hilton Charlotte University Place Freebies like Wi-Fi and parking, an outdoor pool and luxurious beds make the non-smoking Hilton Charlotte University Place a special spot for our guests. Set on a waterfront boardwalk, the 12-floor hotel has 392 upscale rooms with flat-panel HDTVs, free Wi-Fi, coffeemakers and clock\/radios with mp3 connections.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":7289325,"ranking":6,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Showcasing a playground and views of the lake, Hilton Charlotte University Place is located in Charlotte in the region of North Carolina, just 219 yards... Showcasing a playground and views of the lake, Hilton Charlotte University Place is located in Charlotte in the region of North Carolina, just 219 yards...","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":7289333,"ranking":7,"query_text":"who owns charlotte hilton university place hotel","passage_text":"The Hilton Charlotte University Place is owned by UPH Lakeside, LP, and managed by GF Management, LLC, one of the nationâ\u0080\u0099s leading hospitality management companies based in Center City Philadelphia, PA.","bm25_label":"high","relevance_label":1.0},{"query_id":988306,"passage_id":4846144,"ranking":8,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Edgewater Bar & Grille is located in the Hilton University Place Charlotte. Visit us in the vibrant heart of Charlotte, North Carolina to enjoy our restaurantâ\u0080\u0099s delicious cuisine as well as our hotelâ\u0080\u0099s convenient services and features. Private dining is also available in our event venues and in our guest rooms and suites. Learn more about the Hilton University Place Charlotte","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":4846152,"ranking":9,"query_text":"who owns charlotte hilton university place hotel","passage_text":"This restaurant is in the lobby of the Hilton University Place in Charlotte. Staff is friendly, happy hour prices are good and they have a good selection of menu items. They will box it to go as well. The Edgewater Bar is an excellent addition to the Hilton University Place.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":4846147,"ranking":10,"query_text":"who owns charlotte hilton university place hotel","passage_text":"See Full Restaurant List Make a Reservation at Edgewater Bar & Grille - Hilton Charlotte University Place","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":8272298,"ranking":11,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Welcome to the Hilton Garden Inn Charlotte Airport hotel offering free Wifi and complimentary shuttle service. Hilton Garden Inn Charlotte Airport is located in the attractive Lakepointe Center office park. Our Charlotte airport hotel is located only minutes from the Charlotte Douglas Airport.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":7289330,"ranking":12,"query_text":"who owns charlotte hilton university place hotel","passage_text":"1 All Welcome to the Hampton Inn Charlotte-University Place. Our hotel is conveniently located off I-85 and only a few miles from the University of North Carolina at Charlotte. 2  Exterior Welcome to the Hampton Inn Charlotte-University Place. Our hotel is conveniently located off I-85 and only a few miles from the University of North Carolina at Charlotte. \/resources\/media\/hp\/CLTUVHX\/en_US\/img\/shared\/full_page_image_gallery\/main\/HX_exterior1_425x303_FitToBoxSmallDimension_Center.jpg Hampton Inn Charlotte-University Place Hotel, NC - Exterior 0","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":8272300,"ranking":13,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Welcome to the Hilton Garden Inn Charlotte Airport hotel offering free Wifi and complimentary shuttle service. Hilton Garden Inn Charlotte Airport is located in the attractive Lakepointe Center office park. Hotel Interior Our Charlotte airport hotel is located only minutes from the Charlotte Douglas Airport. Our friendly staff is happy to help with any needs you may have during your stay at our Charlotte airport hotel.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":4846146,"ranking":14,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Book now at Edgewater Bar & Grille - Hilton Charlotte University Place in Charlotte, NC. Explore menu, see photos and read 20 reviews: The food was good. The service was friendly. The location was great.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":1940682,"ranking":15,"query_text":"who owns charlotte hilton university place hotel","passage_text":"The Charlotte Convention Center is located in downtown Charlotte. There are no hotels in the Center, but the Westin Hotel and the Hilton Center City Hotel are across the street. Cancel. 0.1 mile Westin Hotel 601 South College Street, Charlotte, NC 28202.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":3692208,"ranking":16,"query_text":"who owns charlotte hilton university place hotel","passage_text":"No. She is a descendent of the founder of the hotel chain, Conrad Hilton, who started his first hotel in 1919. The chain is now owned by Hilton Hotels Corporation, which is a subsidiary of The Blackstone Group LP. Paris's parents do not own the hotel chain, or any stock, since Blackstone bought out Hilton Hotels Corp.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":8272299,"ranking":17,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Uptown Charlotte Hotel. Enjoy central location and superior amenities of Hilton Charlotte Center City. The hotel offers easy access to the Charlotte Convention Center via a covered walkway, and complimentary access to the YMCA which is also connected to the hotel.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":5431030,"ranking":18,"query_text":"who owns charlotte hilton university place hotel","passage_text":"1 Book your next group event or meeting at the DoubleTree by Hilton Hotel Charlotte Airport. \/ 2 resources\/media\/dt\/CLTAPDT\/en_US\/img\/shared\/full_page_image_gallery\/main\/DT_meet002_26_677x380_FitToBoxSmallDimension_Center.jpg DoubleTree by Hilton Hotel Charlotte Airport, NC-Meeting Room 29. 3  Events & Meetings.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":1510014,"ranking":19,"query_text":"who owns charlotte hilton university place hotel","passage_text":"No. She is a descendent of the founder of the hotel chain, Conrad Hilton, who started his first hotel in 1919. The chain is now owned by Hilton Hotels Corporation, which is a subsidiary of The Blackstone Group LP. yes her family does own it.","bm25_label":"high","relevance_label":0.0},{"query_id":988306,"passage_id":8272304,"ranking":20,"query_text":"who owns charlotte hilton university place hotel","passage_text":"Relax at the Hilton Charlotte Center City hotel and enjoy our downtown location. Our Charlotte hotel is situated in the heart of the city across from the Charlotte Convention Center, within walking distance to restaurants, entertainment, and museums. Travel to the hotel from Charlotte\/Douglas International Airport in just 15 minutes.","bm25_label":"high","relevance_label":0.0}]