[{"query_id":988512,"passage_id":2758522,"ranking":1,"query_text":"who is your favourite drink?","passage_text":"Use this quick guide to work out how many units are in your favourite pint of beer or glass of wine. 1  Use the units calculator to quickly calculate units in your favourite drink.  Download a drinks diary (PDF, 697kb) to track your drinking over a week.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":656349,"ranking":2,"query_text":"who is your favourite drink?","passage_text":"Discover the nutrition profile for your favourite menu items with our easy-to-use Nutrition Calculator. Learn the dietary value of changing to your favourite drink or swapping fries for corn cup. Nutrition Calculator Make informed decisions, even before leaving the house. Discover the nutrition profile for your favourite menu items with our easy-to-use . Make informed decisions, even before leaving the house. Discover the nutrition profile for your favourite menu items with our easy-to-use  Learn the dietary value of changing to your favourite drink or swapping fries for corn cup. Make informed decisions, even before leaving the house.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":656351,"ranking":3,"query_text":"who is your favourite drink?","passage_text":"Discover the nutrition profile for your favourite menu items with our easy-to-use Nutrition Calculator. Learn the dietary value of changing to your favourite drink or swapping fries for corn cup. Find out What's in your food.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":3164734,"ranking":4,"query_text":"who is your favourite drink?","passage_text":"Yacon Powder has a delightful caramel and molasses taste. It can be used to sweeten your favourite desserts, added to cereal, blended in smoothies and mixed in with your favourite drink. Sweetness has never been so healthy! There is hope for everyone on a low-sugar diet.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":7288654,"ranking":5,"query_text":"who is your favourite drink?","passage_text":"Originally Answered: What is your favorite drink and why? Being in Turin, Italy, my favourite drink is Bicerin!-hot cocoa, espresso and cream. â\u0080\u0093 Photo By Jeremy Hunsinger","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":7288653,"ranking":6,"query_text":"who is your favourite drink?","passage_text":"Originally Answered: What is your favorite drink and why? Hazelnut Latte by Starbucks. The perfect coffee they make anywhere across the stores I have been made this my favourite drink.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":4226562,"ranking":7,"query_text":"who is your favourite drink?","passage_text":"Caffeine calculator. Ever wonder how much caffeine is in your favourite foods and drinks? Our handy caffeine counter enables you to choose from a wide range of popular foods and drinks such as tea, coffee, cocoa and green tea to calculate your daily caffeine intake.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":736949,"ranking":8,"query_text":"who is your favourite drink?","passage_text":"Product Description. Bovril is a thick beef and yeast extract that's been warming the nation with its beefy taste since 1886. Add to a mug of hot water and enjoy as a hearty drink, spread on toast, or use it as a rich, beefy stock for your favourite British dishes.roduct Description. Bovril is a thick beef and yeast extract that's been warming the nation with its beefy taste since 1886. Add to a mug of hot water and enjoy as a hearty drink, spread on toast, or use it as a rich, beefy stock for your favourite British dishes.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":8718971,"ranking":9,"query_text":"who is your favourite drink?","passage_text":"Compare the caffeine in our drinks to other products and discover how much is contained in your favourite so you can drink Coca-Cola as part of a healthy diet. Cookie Notification We use cookies to deliver the best possible web experience.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":1912291,"ranking":10,"query_text":"who is your favourite drink?","passage_text":"Perfect for game day, perfect for trips south, the Bubba Keg Mug will keep your favourite frosty beverage beautifully chilled for hours. When itâ\u0080\u0099s not being used to keep you cool, the insulated interior also keeps drinks hot. It holds 52 ounces of your favourite brew and itâ\u0080\u0099s available in 3 colours. Read More.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":7288649,"ranking":11,"query_text":"who is your favourite drink?","passage_text":"Being in Turin, Italy, my favourite drink is Bicerin!-hot cocoa, espresso and cream. â\u0080\u0093 Photo By Jeremy Hunsinger. What is Bicerin? Turin, Italy has great wine, delicious chocolate and a coffee drink that is guaranteed to warm your soul on a cold winter night.","bm25_label":"high","relevance_label":1.0},{"query_id":988512,"passage_id":6294027,"ranking":12,"query_text":"who is your favourite drink?","passage_text":"Geezer. A Geezer is a male englishman who likes drinking, football, and violence, preferably all at the same time. Wants to be the typical cockney jack the lad. They dress up smart to normally pull 'birds' favourites being Stone Island and Burberry.Theyre basically like a better meaner version of a Chav and not bad people to know aslong as you just prove your a 'geezer'.ants to be the typical cockney jack the lad. They dress up smart to normally pull 'birds' favourites being Stone Island and Burberry. Theyre basically like a better meaner version of a Chav and not bad people to know aslong as you just prove your a 'geezer'.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":4917330,"ranking":13,"query_text":"who is your favourite drink?","passage_text":"Limit your alcohol intake. Regularly drinking alcohol above recommended limits can raise your blood pressure over time. Find out how many units are in your favourite drink and get tips on cutting down. Alcohol is also high in calories, which will make you gain weight and can further increase your blood pressure. Find out how many calories are in popular drinks.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":7606818,"ranking":14,"query_text":"who is your favourite drink?","passage_text":"A good place to start is by finding out just how many units there are in your favourite drink. Find out exactly how many calories youâ\u0080\u0099re drinking with our unit and calorie calculator. If youâ\u0080\u0099re worried you, or someone you know is drinking too much, visit our page on alcohol dependence.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":5325182,"ranking":15,"query_text":"who is your favourite drink?","passage_text":"With a pint of lager containing the same amount of calories as a slice of pizza, the calories in alcohol soon add upâ\u0080¦. Find out how many calories are in your favourite drinks with our Unit and Calorie Calculator. Alcoholic drinks are high in calories particularly common beverages such as beer and cocktails.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":7014633,"ranking":16,"query_text":"who is your favourite drink?","passage_text":"How much sugar is in your foods and drinks? Have you ever wondered how much sugar is in the foods and drinks we consume? Not many of us will take too much notice about the amount of sugars in our favourite snacks and teatime treats but maybe we should.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":6153363,"ranking":17,"query_text":"who is your favourite drink?","passage_text":"My favourite anti-cancer remedy in juice form is made from carrots and apples, which makes a very sweet and delicious drink that even non-carrot lovers in your family will enjoy. Eight small carrots and one golden delicious apple make about two glasses (500 ml) of juice. My favourite carrot salad is:","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":6429984,"ranking":18,"query_text":"who is your favourite drink?","passage_text":"Use this quick guide to work out how many units are in your favourite pint of beer or glass of wine. The idea of counting alcohol units was first introduced in the UK in 1987 to help people keep track of their drinking. Units are a simple way of expressing the quantity of pure alcohol in a drink.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":4563670,"ranking":19,"query_text":"who is your favourite drink?","passage_text":"Here are our top tips to help you limit your alcohol intake: 1  Switch to low-alcohol or alternate an alcohol-free drink with an alcoholic one. 2  Mix your favourite wine with plain mineral water. 3  Mix beer or stout with lemonade. 4  Avoid situations where there is peer pressure to drink in rounds.","bm25_label":"high","relevance_label":0.0},{"query_id":988512,"passage_id":7744077,"ranking":20,"query_text":"who is your favourite drink?","passage_text":"What are your favourite travel planning websites? What are some best places for a solo trip in India for someone who is finding peace? What is the favourite food for foreign travellers in India?","bm25_label":"high","relevance_label":0.0}]