[{"query_id":989676,"passage_id":7285742,"ranking":1,"query_text":"who is parent company for fleetcor","passage_text":"Our parent company was happy to sign off the project at Board level knowing that we had a strong team working with us.â\u0080\u009d Todd Preston, IT Operations Manager, Fleetcor Australasia Fleetcor took the opportunity to overhaul all of their IT systems at the same time as the data migration project, including:","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":7285743,"ranking":2,"query_text":"who is parent company for fleetcor","passage_text":"Ron Clarke, Fleetcorâ\u0080\u0099s chairman and chief executive, also said in the release that his company will be â\u0080\u009crevisiting our growth plans for an independent SVS.â\u0080\u009d SVS came under Fleetcorâ\u0080\u0099s wing in 2014 when Fleetcor acquired SVSâ\u0080\u0099s parent company, the big processor Comdata Inc. Fleetcor signaled at the time that it wasnâ\u0080\u0099t particularly interested in the gift-card business and might off-load SVS someday.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":7285745,"ranking":3,"query_text":"who is parent company for fleetcor","passage_text":"This document sets out Fleetcorâ\u0080\u0099s approach and strategy for handling its tax affairs and managing tax risk of its UK Companies. It applies to all companies that form a part of the Fleetcor UK Acquistion Limited group, the companies are listed in Appendix A. The members of the group are subsidaries of a US based parent called Fleetcor Tecnologies Inc., this is a public traded company on the New York Stock Exchange. The range of UK taxes that the group pays includes Corporation Tax, VAT, PAYE and some other ad-hoc taxes.","bm25_label":"high","relevance_label":1.0},{"query_id":989676,"passage_id":7285746,"ranking":4,"query_text":"who is parent company for fleetcor","passage_text":"Our parent company was happy to sign off the project at Board level knowing that we had a strong team working with us.â\u0080\u009d Todd Preston, IT Operations Manager, Fleetcor Australasia January 31 2017","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":7285739,"ranking":5,"query_text":"who is parent company for fleetcor","passage_text":"The companyâ\u0080\u0099s world headquarters are in Ireland, with U.S. headquarters in the Boston area and additional offices in Atlanta, Chicago, Charlotte, Clearwater, and Phoenix. Fleetmatics is the parent company of SageQuest. For more information, visit www.fleetmatics.com or call 866-844-2235. About FleetCor","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":6590703,"ranking":6,"query_text":"who is parent company for fleetcor","passage_text":"The Chevron and Texaco Business Card and the Chevron and Texaco Diesel Advantage Card are issued by FleetCor Technologies Operating Company, LLC and are not an obligation of Chevron U.S.A. Inc.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":7285747,"ranking":7,"query_text":"who is parent company for fleetcor","passage_text":"FleetCor buying Comdata was the worst thing that could happen to morale, employee benefits, and customer satisfaction. I'm shocked this company is still in business, especially with legitimate competition here in Nashville that is actually growing.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":7285744,"ranking":8,"query_text":"who is parent company for fleetcor","passage_text":"Our Company. Our Company. FLEETCOR (NYSE: FLT) is a leading independent global provider of specialized payment products and services including fleet cards, food cards, corporate lodging discount cards and other specialized payment services for businesses throughout the world.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":5045574,"ranking":9,"query_text":"who is parent company for fleetcor","passage_text":"Company Overview. Pacific Pride Services, LLC operates and franchises card lock fueling stations in the United States and Canada. It also offers fueling cards. The company was founded in 1984 and is based in Salem, Oregon. As of July 29, 2014, Pacific Pride Services, LLC operates as a subsidiary of FleetCor Technologies, Inc.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":7285740,"ranking":10,"query_text":"who is parent company for fleetcor","passage_text":"FleetCor is a leading global provider of fuel cards and workforce payment products to businesses. FleetCor's payment programs enable businesses to better manage and control employee spending and. provide cardâ\u0080\u0090accepting merchants with a high volume customer base that can increase their sales and. customer loyalty.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":7285741,"ranking":11,"query_text":"who is parent company for fleetcor","passage_text":"FLEETCOR UK has added to its leadership team with two senior management hires. Thore Vestergaard joins as SVP & MD, Commercial Cards, Europe and Allister Mitchell as VP, Core Products. Both will report to Alan King, Group President, FLEETCOR UK & Australasia.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":6590711,"ranking":12,"query_text":"who is parent company for fleetcor","passage_text":"Chevron and Texaco Business Card and. Chevron and Texaco Diesel Advantage Card. The Chevron and Texaco Business Card and the Chevron and Texaco Diesel Advantage Card are issued by FleetCor Technologies Operating Company, LLC and are not an obligation of Chevron U.S.A. Chevron U.S.A. Inc. MasterCard is a registered trademark of MasterCard International Incorporated.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":3489924,"ranking":13,"query_text":"who is parent company for fleetcor","passage_text":"Do Chipotle and McDonald's have the same parent company? McDonald's was once an investor in McDonald's, but they have since completely... What is the parent company\/owner of the Chipotle restaurant chain? Chipotle Mexican Grill, (CMG) is a publicly traded company on the NYSE. In the... Who is ChaCha parent company grew out of the mind of Scott Jones, who invented the voicemail system that has... Who is the parent company of chacha Noone! It is privately-owned and headquartered in Carmel, Indiana with...","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":669103,"ranking":14,"query_text":"who is parent company for fleetcor","passage_text":"Amazon.com, Inc. is the parent company which is who has public stock. Amazon.com, LLC is a child company that runs the site. Amazon is more than just a sales site. It is a very common for businesses to have different companies under a parent company.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":1471267,"ranking":15,"query_text":"who is parent company for fleetcor","passage_text":"10 hilariously insightful foreign words. A parent company is one that owns or controls another company, known as the subsidiary. The parent company is able to direct the business practices of the subsidiary because it controls the voting, thus making determinations like who should sit on the board of the subsidiary.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":1471270,"ranking":16,"query_text":"who is parent company for fleetcor","passage_text":"These 10 animal facts will amaze you. A parent company is one that owns or controls another company, known as the subsidiary. The parent company is able to direct the business practices of the subsidiary because it controls the voting, thus making determinations like who should sit on the board of the subsidiary.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":147056,"ranking":17,"query_text":"who is parent company for fleetcor","passage_text":"Bill & Melinda Gates Foundation Offers Employees 52 Weeks Paid Parental Leave. Who says extended parental leave is just for tech companies like Netflix or Microsoft? The Bill and Melinda Gates Foundation recently announced a new ...ill & Melinda Gates Foundation Offers Employees 52 Weeks Paid Parental Leave. Who says extended parental leave is just for tech companies like Netflix or Microsoft? The Bill and Melinda Gates Foundation recently announced a new ...","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":4162086,"ranking":18,"query_text":"who is parent company for fleetcor","passage_text":"Who Owns Whom. Who Owns Whom is a set of annual directories published by GAP Books in association with Dun & Bradstreet (D&B). They provide the relationship between companies worldwide showing who is the ultimate parent company and who are their subsidiaries.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":1471272,"ranking":19,"query_text":"who is parent company for fleetcor","passage_text":"You won't believe these 10 facts about people. A parent company is one that owns or controls another company, known as the subsidiary. The parent company is able to direct the business practices of the subsidiary because it controls the voting, thus making determinations like who should sit on the board of the subsidiary.","bm25_label":"high","relevance_label":0.0},{"query_id":989676,"passage_id":1471275,"ranking":20,"query_text":"who is parent company for fleetcor","passage_text":"These 10 facts about space will blow your mind. A parent company is one that owns or controls another company, known as the subsidiary. The parent company is able to direct the business practices of the subsidiary because it controls the voting, thus making determinations like who should sit on the board of the subsidiary.","bm25_label":"high","relevance_label":0.0}]