[{"query_id":990010,"passage_id":7856462,"ranking":1,"query_text":"where is paihia","passage_text":"Hotel Paihia. Hotel Accommodation-Paihia-Bay of Islands. Location. Located close to the centre of Paihia and its major tourist attractions, Hotel Paihia is ideally positioned as a base from where to explore the Bay of Islands.The hotel is situated in an attractive and peaceful bush setting, 400 metres from the shopping centre and waterfront.Rooms.partment Accommodation-Paihia-Bay of Islands. Location. Located right in the heart of the bay, the Clarion Collection Edgewater Palms is at the historic part of Russell and Kerikeri. A 5 minutes stroll along the waterfront leads to Paihia's buzzing wharf area, shops, restaurants and cafes.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856460,"ranking":2,"query_text":"where is paihia","passage_text":"This is our interactive Map of paihia-you can zoom right in, move the map around, and even see satellite photos of the the Bay.If you're looking to have a wee look-around before you get to Paihia then this Map of Paihia should be what you're looking for. Loading Map of Paihia ...his is our interactive Map of paihia-you can zoom right in, move the map around, and even see satellite photos of the the Bay. If you're looking to have a wee look-around before you get to Paihia then this Map of Paihia should be what you're looking for. Loading Map of Paihia ...","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856455,"ranking":3,"query_text":"where is paihia","passage_text":"Paihia. Paihia is a tourist town in the heart of the Bay of Islands in the Northland region of the North Island. It lies 23km south-east of Kerikeri with Waitangi immediately to its north and Russell on the opposite shore.Paihia is normally accessed by road from nearby Opua.Adjoining Paihia 3km to the north is Waitangi, the site of the historic treaty signed in 1840 between Maori and the British. Paihia is a major tourist destination and well geared for providing accommodation, eateries and tours.ALI HAI MOTEL-Paihia. Bali Hai Motel, located in beautiful Paihia, known as the Jewel of the Bay of Islands, is a small, personable motel, offering spacious studios and one and two-bedroom units.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856457,"ranking":4,"query_text":"where is paihia","passage_text":"Paihia is the hub of the Bay of Islands, where bus tours to other areas leave and boat trips around the bay begin.Paihia has a variety of accommodation types available and is almost wall to wall motels along both the waterfront and the road entering town.rom Paihia you can take a ferry across to Russell, or it is a short drive (or thirty minute walk) to Waitangi where, on 6th February each year, the signing of the Treaty of Waitangi is commemorated and a carnival held. This is a great day to visit our most important heritage site.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856458,"ranking":5,"query_text":"where is paihia","passage_text":"The small village of Paihia is often called The Gateway to the Bay of Islands. It is the main base for all of the tours operating in this most popular spot in Northland. Paihia has an important history in the development of New Zealand as a nation. It is only a kilometer from the Treaty Grounds at Waitangi.aihia Location and Getting There. Paihia is the Bay of Islands in the center of Northland in the North Island. It is 60 kilometers (37 miles) north of Whangarei and 23 kilometers (14 miles) from Kerikeri. There are two roads leading to Paihia.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856463,"ranking":6,"query_text":"where is paihia","passage_text":"Paihia Location and Getting There. Paihia is the Bay of Islands in the center of Northland in the North Island. It is 60 kilometers (37 miles) north of Whangarei and 23 kilometers (14 miles) from Kerikeri. There are two roads leading to Paihia.From the south, take the main highway north from Whangarei and continue on at the Kawakawa turnoff.aihia Location and Getting There. Paihia is the Bay of Islands in the center of Northland in the North Island. It is 60 kilometers (37 miles) north of Whangarei and 23 kilometers (14 miles) from Kerikeri. There are two roads leading to Paihia.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856459,"ranking":7,"query_text":"where is paihia","passage_text":"Henry Williams and his wife Marianne settled in Paihia in 1823 and built the first church in New Zealand there the same year. William Williams and his wife Jane joined the Paihia mission in 1826.ishop William Grant Broughton (the first and only Bishop of Australia) visited the Paihia mission in 1838 and performed several firsts in New Zealand including the first Confirmation and Ordination ceremonies.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856454,"ranking":8,"query_text":"where is paihia","passage_text":"Paihia is the main tourist town in the Bay of Islands in the far north of the North Island of New Zealand. It is located close to the historic towns of Russell and Kerikeri, 60 kilometres north of Whangarei.Missionary Henry Williams named the mission station Marsden's Vale and eventually the Paihia became the accepted name of the settlement.ishop William Grant Broughton (the first and only Bishop of Australia) visited the Paihia mission in 1838 and performed several firsts in New Zealand including the first Confirmation and Ordination ceremonies.","bm25_label":"high","relevance_label":1.0},{"query_id":990010,"passage_id":7856461,"ranking":9,"query_text":"where is paihia","passage_text":"Paihia is just 3 hours drive North of Auckland and is known as the jewel of the magnificent Bay Of Islands.Amazing beaches and a host of islands make this an aquatic playground and ultimate retreat. Paihia Wharf. If adventure is what you seek, you can skydive, parasail, scuba dive or go exploring on a sea kayak.aihia is just 3 hours drive North of Auckland and is known as the jewel of the magnificent Bay Of Islands.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7856456,"ranking":10,"query_text":"where is paihia","passage_text":"If you want to discover the coves and beaches of the Bay of Islands, Paihia is the perfect place to start. Cruises of all types leave from the wharf daily.Paihia is an excellent base from which to explore the Bay of Islands.It has an extensive choice of accommodation, delicious dining options and a good-sized town centre. From the wharf you can arrange a trip to the outer islands, hook into a fishing expedition or catch ferry to Russell.f you want to discover the coves and beaches of the Bay of Islands, Paihia is the perfect place to start. Cruises of all types leave from the wharf daily.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":1360686,"ranking":11,"query_text":"where is paihia","passage_text":"Where is Surgut: Where is Svobodnyj: Where is Syktyvkar: Where is Syzran: Where is Taganrog: Where is Tambov: Where is Tichoreck: Where is Tichvin: Where is Timashyovsk: Where is Tobolsk: Where is Toljatti: Where is Tomsk: Where is Troick: Where is Tuapse: Where is Tujmazy: Where is Tula: Where is Tumen: Where is Tver: Where is Uchta: Where is Ufa: Where is Ulan-Ude: Where is Uljanovsk","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":2292184,"ranking":12,"query_text":"where is paihia","passage_text":"Where is Soka: Where is Suita: Where is Sukumo: Where is Suzuka: Where is Tachikawa: Where is Takahashi: Where is Takamatsu: Where is Takaoka: Where is Takarazuka: Where is Takasaki: Where is Takatsuki: Where is Takikawa: Where is Tama: Where is Tokorozawa: Where is Tokushima: Where is Tokyo: Where is Tomakomai: Where is Tottori: Where is Toyama: Where is Toyohashi: Where is Toyokawa","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":4567167,"ranking":13,"query_text":"where is paihia","passage_text":"Where is Kanel: Where is Kaolack: Where is Kayar: Where is Kebemer: Where is Kedougou: Where is Khombole: Where is Kolda: Where is Koungheul: Where is Linguere: Where is Louga: Where is M'Bour: Where is Matam: Where is Mbacke: Where is Mboro: Where is Mekhe: Where is Ndioum: Where is Nguekhokh: Where is Nioro du Rip: Where is Ouro Sogui: Where is Pout: Where is Richard Toll","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":2409126,"ranking":14,"query_text":"where is paihia","passage_text":"Where is Bielsko-Biala: Where is Bydgoszcz: Where is Bytom: Where is Chelm: Where is Chorzow: Where is Czestochowa: Where is Dabrowa Gornicza: Where is Elblag: Where is Elk: Where is Gdansk: Where is Gdynia: Where is Gliwice: Where is Glogow: Where is Gniezno: Where is Gorzow Wielkopolski: Where is Grudziadz: Where is Inowroclaw: Where is Jastrzebie Zdroj: Where is Jaworzno","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":2447657,"ranking":15,"query_text":"where is paihia","passage_text":"Where is Italy Located; Airports in Italy; Major Cities in Italy; Where is Rome; Where is Florence; Where is Milan; Where is Afragola; Where is Alessandria; Where is Altamura; Where is Ancona; Where is Andria; Where is Arezzo; Where is Asti; Where is Bari; Where is Barletta; Where is Benevento; Where is Bergamo; Where is Bologna; Where is Bolzano; Where is Brescia; Where is Brindisi","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":2441838,"ranking":16,"query_text":"where is paihia","passage_text":"super bowl 2018 where | where is super bowl 2018 | where is the super bowl | where is the super bowl 2018 | where is the super bowl in 2018 | where are the olympics | where am i | where are the 2018 olympics | where is the olympics | where is new england | where is prince from | where was prince born | where is starman | where is justin timberlake from | where is super bowl 2019 | where is mauritania | where was prince from | where are the patriots from | where to watch superbowl online ...","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":2261092,"ranking":17,"query_text":"where is paihia","passage_text":"Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. See that other chick asked that she said where the cash at. She said where the paper plastic product and where the stash at.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7269020,"ranking":18,"query_text":"where is paihia","passage_text":"Where is Ahtanum WA: Where is Airway Heights WA: Where is Alderton WA: Where is Alderwood Manor WA: Where is Algona WA: Where is Allyn WA: Where is Amboy WA: Where is Ames Lake WA: Where is Anacortes WA: Where is Anderson Island WA: Where is Artondale WA: Where is Asotin WA: Where is Bangor Base WA: Where is Barberton WA: Where is Basin WA: Where is Bethel WA","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":2261098,"ranking":19,"query_text":"where is paihia","passage_text":"Where the where the cash at where the cash at. Where the where the cash at where the cash at. Where the where the cash at where the cash at. Don't be surprised if she ask where the cash at. Submit Corrections. Visit www.azlyrics.com for these lyrics.","bm25_label":"high","relevance_label":0.0},{"query_id":990010,"passage_id":7269069,"ranking":20,"query_text":"where is paihia","passage_text":"Where is Shellman GA: Where is Skidaway Island GA: Where is Social Circle GA: Where is Soperton GA: Where is Sparks town GA: Where is Sparta GA: Where is Springfield GA: Where is St. Marys GA: Where is St. Simons GA: Where is Statenville GA: Where is Statham GA: Where is Stone Mountain GA: Where is Summerville GA: Where is Sunnyside GA: Where is Suwanee GA","bm25_label":"high","relevance_label":0.0}]