[{"query_id":991207,"passage_id":7282741,"ranking":1,"query_text":"who is ben hanisch","passage_text":"14 February 2018... Ben Hanisch news, gossip, photos of Ben Hanisch, biography, Ben Hanisch partner list 2016. Relationship history. Ben Hanisch relationship list. Ben Hanisch dating history, 2018, 2017, list of Ben Hanisch relationships.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":7282742,"ranking":2,"query_text":"who is ben hanisch","passage_text":"Connect any celebrity with Ben Hanisch to see how closely they are linked... romantically! Recent connections involving Ben Hanisch Keanu Reeves and Ben Hanisch","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":2651277,"ranking":3,"query_text":"who is ben hanisch","passage_text":"Amy Schumer and her boyfriend Ben Hanisch Who is Amy Schumerâ\u0080\u0099s Boyfriend? Ben Hanisch is the current boyfriend of the American actress and comedian Amy Schumer. Ben is a photographer and furniture designer by profession. The couple met via dating app bonded instantly. Such is their love that Amy considers their romance as her first relationship.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":7282739,"ranking":4,"query_text":"who is ben hanisch","passage_text":"According to our records, Ben Hanisch is possibly single. Relationships. Ben Hanisch has been in a relationship with Amy Schumer (2015 - 2017). Contribute. Help us build our profile of Ben Hanisch! Login to add information, pictures and relationships, join in discussions and get credit for your contributions. Relationship Statistics","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":2651275,"ranking":5,"query_text":"who is ben hanisch","passage_text":"Amy Schumer's boyfriend is a furniture designer and a photographer named Ben Hanisch. The couple met on a dating app and fell in love. Amy Schumer's boyfriend is a furniture designer and a photographer named Ben Hanisch.","bm25_label":"high","relevance_label":1.0},{"query_id":991207,"passage_id":7282743,"ranking":6,"query_text":"who is ben hanisch","passage_text":"55.2k Followers, 687 Following, 534 Posts - See Instagram photos and videos from ben hanisch (@benhanisch) 55.2k Followers, 687 Following, 534 Posts - See Instagram photos and videos from ben hanisch (@benhanisch)","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":7282747,"ranking":7,"query_text":"who is ben hanisch","passage_text":"Amy Schumer announced she's no longer single, making it official by calling boyfriend Ben Hanisch herâ\u0080¦ New year, new romance. Amy Schumer announced she's no longer single, making it official by calling boyfriend Ben Hanisch herâ\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":2662158,"ranking":8,"query_text":"who is ben hanisch","passage_text":"Fischer is the first man Amy has dated since she split from Ben Hanisch in May this year after 18 months. The comedienne previously admitted Ben - who she met on a dating app - was the perfect man for her as he wasn't phased by her celebrity status.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":7282740,"ranking":9,"query_text":"who is ben hanisch","passage_text":"Connect any celebrity with Ben Hanisch to see how closely they are linked... romantically! &","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":253040,"ranking":10,"query_text":"who is ben hanisch","passage_text":"Amy Schumer and Boyfriend Ben Hanisch Met on a Dating App and She Totally Made the First Move.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":2651159,"ranking":11,"query_text":"who is ben hanisch","passage_text":"New year, new romance. Amy Schumer announced she's no longer single, making it official by calling boyfriend Ben Hanisch herâ\u0080¦","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":2662049,"ranking":12,"query_text":"who is ben hanisch","passage_text":"Online, Fischer met Schumer through her personal assistant, who is Fischerâ\u0080\u0099s sister. Dating speculation swirled after they were pictured having dinner together in November. They might have been dating since June, when Schumer said she moved on from ex-boyfriend Ben Hanisch.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":253042,"ranking":13,"query_text":"who is ben hanisch","passage_text":"The rumors that Schumer met Hanisch have already been reported, but leave it to Amy to clear up those pesky rumors. Although she didnâ\u0080\u0099t divulge where she met boyfriend Ben Hanisch, she did say that she didnâ\u0080\u0099t meet him on Bumble. Schumer took to Instagram to drop a little truth bomb about her and her new beau.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":8692841,"ranking":14,"query_text":"who is ben hanisch","passage_text":"As per the today valudation standup comedian Amy Schumer net worth reaches to $1 million dollars. Born as Amy Beth Schumer is currently dating with Ben Hanisch. What Net Worth","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":2651156,"ranking":15,"query_text":"who is ben hanisch","passage_text":"Love is in the air for funny lady Amy Schumer! The 35-year-old comedian only began dating 29-year-old Chicago furniture designer Ben Hanisch last year, but the Skip Nav","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":5376324,"ranking":16,"query_text":"who is ben hanisch","passage_text":"Photo: Getty Images. Amy Schumer's dad meet Amy Schumer's other dad. The 34-year-old comedian's father, Gordon Schumer, came face-to-face with Colin Quinn, who played her old man in Trainwreck, and the actress caught the moment on camera. PHOTO: Amy Schumer's Boyfriend Ben Hanisch Teases 'Inside Amy Schumer' Cameo.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":7282746,"ranking":17,"query_text":"who is ben hanisch","passage_text":"View Ben Hanischâ\u0080\u0099s profile on LinkedIn, the world's largest professional community. Ben has 5 jobs listed on their profile. See the complete profile on LinkedIn and discover Benâ\u0080\u0099s connections and jobs at similar companies. View Ben Hanischâ\u0080\u0099s professional profile on LinkedIn. LinkedIn is the world's largest business network, helping professionals like Ben Hanisch discover inside connections to recommended job candidates, industry experts, and business partners.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":8221510,"ranking":18,"query_text":"who is ben hanisch","passage_text":"The comedian has a new boyfriend in chef Chris Fischer, Us Weekly reports. Schumer, 36, and Fischer â\u0080\u0094 who is reportedly the brother of the star's assistant â\u0080\u0094 were spotted on a cozy dinner date Nov. 7 in photos obtained by the magazine. The Trainwreck star split from furniture designer Ben Hanisch in May after a year-and-a-half long relationship that began on a dating app.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":2662155,"ranking":19,"query_text":"who is ben hanisch","passage_text":"Chris Fischer and Amy Schumer in New York City on November 7, 2017. MEGA Celebrity Splits of 2017 The Snatched actress previously dated furniture designer Ben Hanisch. They called it quits in May after nearly a year and a half together.","bm25_label":"high","relevance_label":0.0},{"query_id":991207,"passage_id":8692847,"ranking":20,"query_text":"who is ben hanisch","passage_text":"As per the today valudation standup comedian Amy Schumer net worth reaches to $1 million dollars. Born as Amy Beth Schumer is currently dating with Ben Hanisch. Amy is the elder daughter of Gordon Schumer and Sandra Schumer. She belongs from a Jewish Family.","bm25_label":"high","relevance_label":0.0}]