[{"query_id":991471,"passage_id":7282193,"ranking":1,"query_text":"who invented the tabata exercises","passage_text":"What Is Tabata? The workout protocol was named after Dr. Izumi Tabata, the Japanese physician, and researcher who invented the workout style. He initially conducted a research study to assess whether athletes could benefit from an exercise session based on a 20\/10 design repeated 8 times.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":7282201,"ranking":2,"query_text":"who invented the tabata exercises","passage_text":"Some say the Tabata workout is more at an advanced level since it is geared to going over your max heart rate; however, Tabata himself (the scientist who invented the workout, Dr. Izumi Tabata) doesnâ\u0080\u0099t agree that the Tabata workout is only for the advanced. He believes almost anyone can do the workout, just manage the intensity as needed.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":7282194,"ranking":3,"query_text":"who invented the tabata exercises","passage_text":"Dr. Izumi Tabata, the man who invented the workout, completed a study that found Tabata to be extremely effective for building muscles. 4 \/ The entire workout only lasts 4 minutes, but many people like to combine different sets, making the workout go on for a little longer.","bm25_label":"high","relevance_label":1.0},{"query_id":991471,"passage_id":5685240,"ranking":4,"query_text":"who invented the tabata exercises","passage_text":"How to Do Tabata Intervals; How to Do Tabata Squats; Types of Japanese Swords in Rurouni Kenshin; How to Do a Tabata... Before you jump into the Tabata do a set of slow squats to make sure your form is correct and... Stretching Exercises... 'Air squats' are the most fundamental exercise for the lower body.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":7282199,"ranking":5,"query_text":"who invented the tabata exercises","passage_text":"Nothing pushes you past your own limits quite like HIIT (high-intensity interval training)â\u0080\u0094and weâ\u0080\u0099ve found a way to make it more intense than ever. Itâ\u0080\u0099s called Tabata training. Named after the Japanese scientist who invented it, Tabata training consists of four moves in a 20-seconds-on, 10-seconds-off sequence.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":3835786,"ranking":6,"query_text":"who invented the tabata exercises","passage_text":"With Tabata training you exercise for 20 seconds then rest for 10 seconds, and repeat 8 times. This with a short preparation time before starting is a Tabata. It's that simple.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":7282198,"ranking":7,"query_text":"who invented the tabata exercises","passage_text":"The first group did one hour of moderate-intensity exercise five time a week while the second group did high-intensity Tabata training. In total, the Tabata group did 120 minutes of exercise total while the control group did a whopping 1,800 minutes of exercise.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":5685244,"ranking":8,"query_text":"who invented the tabata exercises","passage_text":"Tabata squats use a fast-paced, intense, time-measured routine that combines regular squats with the Tabata interval technique to strengthen your lower body. Tabata is an interval workout technique that has you exercise at a high intensity for 20 seconds and then rest for 10 seconds.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":7406658,"ranking":9,"query_text":"who invented the tabata exercises","passage_text":"If you don't already know what a Tabata interval is, it's a high intensity interval training protocol originally created by Japanese researcher Dr. Izumi Tabata. Each Tabata interval consists of 20 seconds of high intensity (as hard as you can go) exercise followed by 10 seconds of rest.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":3835784,"ranking":10,"query_text":"who invented the tabata exercises","passage_text":"Tabata training includes a 20-second high-intensity anaerobic work interval followed by a 10-second rest, repeated eight times in a row. In a creative twist on Tabata, this sample workout alternates moderate-intensity intervals with higher-intensity bouts of the same exercise.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":3835789,"ranking":11,"query_text":"who invented the tabata exercises","passage_text":"Tabata interval workouts are all the rage these days, and for good reason. This high-intensity training is fun, blasts calories, and moves so quickly that it's hard to get bored. For Tabata, you perform an exercise at maximal intensity for 20 seconds, followed by 10 seconds of rest.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":8337086,"ranking":12,"query_text":"who invented the tabata exercises","passage_text":"The participants repeated seven to eight sets of the exertion-rest intervals, equaling just about 4 minutes of actual workout time. The results were so striking that this type of training was named after its creator, hence Tabata training. Subjects who performed Tabata training five days a week for six weeks (a total of 120 minutes of exercise over the month and a half) improved both their aerobic and anaerobic endurance. In fact, subject's anaerobic fitness increased by a whopping 28%.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":8495483,"ranking":13,"query_text":"who invented the tabata exercises","passage_text":"Tabata: Tabata is a work-rest method associated with many CrossFit WODs. Here's an example: For 20 seconds, complete as many reps of a given exercise (sit ups, pullups, pushups, etc.) as possible. Then rest for 10 seconds and repeat this seven more times for a total of eight intervals.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":1216553,"ranking":14,"query_text":"who invented the tabata exercises","passage_text":"A version of HIIT was based on a 1996 study by Professor Izumi Tabata (ç\u0094°ç\u0095\u0091æ³\u0089) et al. initially involving Olympic speedskaters. The study used 20 seconds of ultra-intense exercise (at an intensity of about 170% of VO2max) followed by 10 seconds of rest, repeated continuously for 4 minutes (8 cycles). The exercise was performed on a mechanically braked cycle ergometer. Tabata called this the IE1 protocol.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":3835787,"ranking":15,"query_text":"who invented the tabata exercises","passage_text":"Continue alternating legs. Tabata interval workouts are all the rage these days, and for good reason. This high-intensity training is fun, blasts calories, and moves so quickly that it's hard to get bored. For Tabata, you perform an exercise at maximal intensity for 20 seconds, followed by 10 seconds of rest.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":3835783,"ranking":16,"query_text":"who invented the tabata exercises","passage_text":"This high-intensity training is fun, blasts calories, and moves so quickly that it's hard to get bored. For Tabata, you perform an exercise at maximal intensity for 20 seconds, followed by 10 seconds of rest. You repeat this on-off pattern a total of eight times, making one complete Tabata round four minutes.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":3835788,"ranking":17,"query_text":"who invented the tabata exercises","passage_text":"This high-intensity training is fun, blasts calories, and moves so quickly that it's hard to get bored. For Tabata, you perform an exercise at maximal intensity for 20 seconds, followed by 10 seconds of rest.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":4576532,"ranking":18,"query_text":"who invented the tabata exercises","passage_text":"So, I'll reiterate: the most effective way to lower blood pressure through exercise is with cardiovascular workouts - it doesn't matter what types; swimming, running, tabata-style weight lifting, etc.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":5913784,"ranking":19,"query_text":"who invented the tabata exercises","passage_text":"TABATA WORKOUT. Perform each exercise for 20 seconds, then rest 10 seconds, and repeat so that you spend one minute on each exercise. Then move on to the next exercise in that round. Rest one full minute after each round. Tip: Download the free Interval Timer app, which will chime when the intervals begin and end.","bm25_label":"high","relevance_label":0.0},{"query_id":991471,"passage_id":3974608,"ranking":20,"query_text":"who invented the tabata exercises","passage_text":"In the new ACE study, researchers put 16 healthy, fit people ages 20 to 47 to the test with a 20-minute Tabata-inspired workout that included exercises like push-ups, split squats, box jumps, burpees, jumping rope, and jumping jacks. Incredibly, participants burned between 240 and 360 calories in that short amount of time. This research is the first to show how well the commonly-practiced version of a Tabata workout works.","bm25_label":"high","relevance_label":0.0}]