[{"query_id":992407,"passage_id":7279808,"ranking":1,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"In this section you studied the following features of unemployment compensation, a pure social insurance program: State unemployment programs pay weekly cash benefits to workers who are involuntarily unemployed. Unemployment compensation is established by federal legislation, but it is administered by each state.","bm25_label":"high","relevance_label":1.0},{"query_id":992407,"passage_id":6453401,"ranking":2,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Georgia unemployment benefits provide temporary compensation to those workers meeting the eligibility requirements of Georgia law. The Georgia Department of Labor and each other state's unemployment office administers its own unemployment insurance program within Federal guidelines.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":1938001,"ranking":3,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"California unemployment benefits provide temporary compensation to those workers meeting the eligibility requirements of California law. The California Employment Development Department and each other state's unemployment office administers its own unemployment insurance program within Federal guidelines.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":4202271,"ranking":4,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Mississippi unemployment benefits provide temporary compensation to those workers meeting the eligibility requirements of Mississippi law. The Mississippi Department of Employment Security and each other state's unemployment office administers its own unemployment insurance program within Federal guidelines.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":551789,"ranking":5,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Tennessee unemployment benefits provide temporary compensation to those workers meeting the eligibility requirements of Tennessee law. The Tennessee Department of Labor and Workforce Development and each other state's unemployment office administers its own unemployment insurance program within Federal guidelines.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":8479765,"ranking":6,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"The third is to minimize the economic loss of unemployment by paying benefits to persons who are unemployed. Unemployment Compensation is a joint federal-state program. In 1995, the federal statute imposed a tax of 6.2 percent on payrolls. That tax was reduced to less than one percent if the employer was covered by a state unemployment compensation law that met standards set out in FUCA.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":2516945,"ranking":7,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Unemployment insurance payments (benefits) are intended to provide temporary financial assistance to unemployed workers who meet the requirements of State law. Each State administers a separate unemployment insurance program within guidelines established by Federal law.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":1530668,"ranking":8,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"In carrying out this mission, the Department administers a variety of Federal labor laws guaranteeing workers' rights to safe and healthful working conditions, a minimum hourly wage and overtime pay, freedom from employment discrimination, unemployment insurance, and workers' compensation.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":4991880,"ranking":9,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"1 Unemployment insurance payments (benefits) are intended to provide temporary financial assistance to unemployed workers who meet the requirements of State law.  Each State administers a separate unemployment insurance program within guidelines established by Federal law.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":6099387,"ranking":10,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Workers' Compensation laws apply to almost all employers. Workers' Compensation is a form of insurance that provides financial assistance, medical care and other benefits for employees who are injured or disabled on the job.Except for federal government employees and certain other groups of employees, Workers' Compensation laws are administered at the state level.orkers' Compensation is a form of insurance that provides financial assistance, medical care and other benefits for employees who are injured or disabled on the job. Except for federal government employees and certain other groups of employees, Workers' Compensation laws are administered at the state level.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":8155936,"ranking":11,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Purpose. 1  Unemployment insurance payments (benefits) are intended to provide temporary financial assistance to unemployed workers who meet the requirements of State law. 2  Each State administers a separate unemployment insurance program within guidelines established by Federal law.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":2933382,"ranking":12,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"In general, unemployment benefits are based on an individual's earnings in the base period. As of December, 2008, AZ benefits ranged from $60 to $240. Arizona state unemployment benefits are subject to Federal income taxes, and you may elect to have taxes withheld from your unemployment check.rizona unemployment benefits provide temporary compensation to those workers meeting the eligibility requirements of Arizona law. The Arizona Department of Economic Security and each other state's unemployment office administers its own unemployment insurance program within Federal guidelines.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":8479766,"ranking":13,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"through d., the term unemployment compensation means any compensation payable under the Unemployment Compensation Law (R.S. 43:21-1 et seq.) (including amounts payable by the division pursuant to an agreement under any federal law providing for compensation, assistance, or allowances with respect to unemployment).","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":4790996,"ranking":14,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Purpose. 1  Unemployment insurance payments (benefits) are intended to provide temporary financial assistance to unemployed workers who meet the requirements of State law. 2  Each State administers a separate unemployment insurance program within guidelines established by Federal law. 3  Eligibility for unemployment insurance, benefit amounts and the 4  ... In","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":435434,"ranking":15,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"The Federal Unemployment Tax Act (FUTA), with state unemployment systems, provides for payments of unemployment compensation to workers who have lost their jobs.Most employers pay both a Federal and a state unemployment tax.he Federal Unemployment Tax Act (FUTA), with state unemployment systems, provides for payments of unemployment compensation to workers who have lost their jobs.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":7166898,"ranking":16,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Unemployment Compensation. Unemployment compensation generally includes any amounts received under the unemployment compensation laws of the United States or of a state. It includes state unemployment insurance benefits and benefits paid to you by a state or the District of Columbia from the Federal Unemployment Trust Fund. It also includes railroad unemployment compensation benefits, but not worker's compensation.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":2933377,"ranking":17,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"The value of unemployment benefits in Arizona differs from that of other states because each state unemployment office applies its own formulas and limits when calculating the level of unemployment compensation.The duration of unemployment benefits in Arizona may also differ from that of other states.rizona unemployment benefits provide temporary compensation to those workers meeting the eligibility requirements of Arizona law. The Arizona Department of Economic Security and each other state's unemployment office administers its own unemployment insurance program within Federal guidelines.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":8511464,"ranking":18,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Virginia Unemployment Benefits Extension. A Virginia unemployment insurance benefits extension is available to states when the economy is recovering. An unemployment extension is administered by the federal government in partnership with Virginia. There are two parts to the program: Emergency Unemployment Compensation (EUC) and Extended Benefits (EB).","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":8279407,"ranking":19,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Taxable unemployment compensation generally includes any amounts received under the unemployment compensation laws of the United States or of a state, so both state unemployment benefits and federally funded extended benefits are considered income.","bm25_label":"high","relevance_label":0.0},{"query_id":992407,"passage_id":2904278,"ranking":20,"query_text":"who administers the federal unemployment compensation laws?","passage_text":"Workers' Compensation laws apply to almost all employers. Workers' Compensation is a form of insurance that provides financial assistance, medical care and other benefits for employees who are injured or disabled on the job. Except for federal government employees and certain other groups of employees, Workers' Compensation laws are administered at the state level.","bm25_label":"high","relevance_label":0.0}]