[{"query_id":992618,"passage_id":8495981,"ranking":1,"query_text":"where is seneca south carolina?","passage_text":"Seneca, South Carolina. South Carolina Oconee County Seneca Seneca is located in Oconee County, which forms the northwestern tip of South Carolina and borders both Georgia and North Carolina. Originally called Seneca City, it was founded in 1873 at the point where two railroad lines connecting Atlanta and Charlotte crossed. Here is a map of the Seneca area.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":3897619,"ranking":2,"query_text":"where is seneca south carolina?","passage_text":"Seneca, South Carolina. South Carolina Oconee County Seneca Seneca is located in Oconee County, which forms the northwestern tip of South Carolina and borders both Georgia and North Carolina. Originally called Seneca City, it was founded in 1873 at the point where two railroad lines connecting Atlanta and Charlotte crossed.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":7120280,"ranking":3,"query_text":"where is seneca south carolina?","passage_text":"Seneca, South Carolina South Carolina Oconee County Seneca Seneca is located in Oconee County, which forms the northwestern tip of South Carolina and borders both Georgia and North Carolina. Originally called Seneca City, it was founded in 1873 at the point where two railroad lines connecting Atlanta and Charlotte crossed.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":3897613,"ranking":4,"query_text":"where is seneca south carolina?","passage_text":"Seneca, South Carolina. Seneca is a city in Oconee County, South Carolina, United States. The population was 8,102 at the 2010 census.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":8495984,"ranking":5,"query_text":"where is seneca south carolina?","passage_text":"Main article: Seneca Historic District (Seneca, South Carolina) Seneca Historic District was listed in 1974. It is located south of the railroad tracks. The district consists of a number of homes and three churches that were built in the late nineteenth and early twentieth centuries.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":4692414,"ranking":6,"query_text":"where is seneca south carolina?","passage_text":"The Municipal Association of South Carolina recently released an article detailing South Carolina'a cities and towns that are implementing environmentally friendly ideas. The City of Seneca made the list with its upgrades to its water treatment plant, which has made the water the cleanest its ever been. Seneca was also mentioned because of it is the owner of the first entirely electric bus fleet.S... Seneca: The Best Place to Retire in South Carolina.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":7748212,"ranking":7,"query_text":"where is seneca south carolina?","passage_text":"Latest News and Events. The Municipal Association of South Carolina recently released an article detailing South Carolina'a cities and towns that are implementing environmentally friendly ideas. The City of Seneca made the list with its upgrades to its water treatment plant, which has made the water the cleanest its ever been. Seneca was also mentioned because of it is the owner of the first entirely electric bus fleet.S... Seneca: The Best Place to Retire in South Carolina.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":7674757,"ranking":8,"query_text":"where is seneca south carolina?","passage_text":"1 Seneca Institute â\u0080\u0093 Seneca Junior College, an African-American school in Seneca, South Carolina, from 1899 to 1939. 2  Seneca Academy, Darnestown, MD-a International Baccalaureate private school serving children preschool through fifth grade.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":7674761,"ranking":9,"query_text":"where is seneca south carolina?","passage_text":"1 Seneca High School (disambiguation) , various schools in the US. 2  Seneca Institute â\u0080\u0093 Seneca Junior College, an African-American school in Seneca, South Carolina, from 1899 to 1939. 3  Seneca Academy, Darnestown, MD-a International Baccalaureate private school serving children preschool through fifth grade.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":4692413,"ranking":10,"query_text":"where is seneca south carolina?","passage_text":"Seneca is a city in Oconee County, South Carolina, United States. The population was 7,652 at the 2000 census.","bm25_label":"high","relevance_label":1.0},{"query_id":992618,"passage_id":7748214,"ranking":11,"query_text":"where is seneca south carolina?","passage_text":"Recent posts about Seneca, South Carolina on our local forum with over 2,000,000 registered users. Seneca is mentioned 923 times on our forum: Latest news from Seneca, SC collected exclusively by city-data.com from local newspapers, TV, and radio stations.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":3897620,"ranking":12,"query_text":"where is seneca south carolina?","passage_text":"Seneca, South Carolina: U.S. Building Innovations Relocating from Pickens (0 replies) Seneca\/Oconeee County is ranked 8th top performing micropolitan in the country (4 replies) Latest news from Seneca, SC collected exclusively by city-data.com from local newspapers, TV, and radio stations.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":4979139,"ranking":13,"query_text":"where is seneca south carolina?","passage_text":"For more on the Savannah River, see the New Georgia Encyclopedia. The Savannah River orginates in Hart County at the confluence of the Tugaloo River and Seneca River (Seneca is in South Carolina). This confluence also forms Lake Hartwell. From Lake Hartwell the Savannah River flows southward for over 300 miles, forming the Georgia\/South Carolina border. It empties into the Atlantic Ocean near the city of Savannah. Along with the Tugaloo River, the Broad River is also a tributary of the Savannah.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":7120278,"ranking":14,"query_text":"where is seneca south carolina?","passage_text":"Serving the areas of Seneca, Walhalla and Westminster. The Oconee County Chamber of Commerce works to promote a positive business climate in the market areas of Seneca, Walhalla and Westminster, South Carolina. Our mission is to help our members maintain and\/or sharpen their competitive edge in todayâ\u0080\u0099s economy.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":4692416,"ranking":15,"query_text":"where is seneca south carolina?","passage_text":"The best city between Seneca, SC and Greenville, SC to meet is Shady Grove, South Carolina. The closest zip code to the midpoint is 29657. N and 82Â° 40' 48 W. The total driving distance from Seneca, SC to Greenville, SC is 38 miles or 61 kilometers.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":8495979,"ranking":16,"query_text":"where is seneca south carolina?","passage_text":"1 The South Carolina Department of Archives and History has additional pictures and information, a copy of the nomination form, and a map.  Newry, South Carolina:Newry Historic District was listed in 1982. It is a historic textile mill village near Seneca.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":3897618,"ranking":17,"query_text":"where is seneca south carolina?","passage_text":"Recent posts about Seneca, South Carolina on our local forum with over 2,000,000 registered users. Seneca is mentioned 923 times on our forum: Latest news from Seneca, SC collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: American (12.3%), Irish (6.1%), German (5.5%), English (5.2%), Scottish (3.2%), Greek (2.8%).","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":4692417,"ranking":18,"query_text":"where is seneca south carolina?","passage_text":"Halfway between Seneca, SC and Greenville, SC. The best city between Seneca, SC and Greenville, SC to meet is Shady Grove, South Carolina. The closest zip code to the midpoint is 29657. The exact latitude and longitude coordinates are 34Â° 45' 52. N and 82Â° 40' 48 W. The total driving distance from Seneca, SC to Greenville, SC is 38 miles or 61 kilometers.","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":4475311,"ranking":19,"query_text":"where is seneca south carolina?","passage_text":"Seneca Weather. Oconee County, located in the northwest corner of South Carolina on the edge of the Blue Ridge Mountains, takes its name from a Cherokee word meaning land beside the water..","bm25_label":"high","relevance_label":0.0},{"query_id":992618,"passage_id":702881,"ranking":20,"query_text":"where is seneca south carolina?","passage_text":"Clemson sits in the northwest corner of South Carolina, north of Anderson and southwest of Greenville. Clemson lies between Lake Keowee and Lake Hartwell, near Pendleton and Seneca. It is the home of Clemson University.","bm25_label":"high","relevance_label":0.0}]