[{"query_id":993153,"passage_id":2100087,"ranking":1,"query_text":"which situation does a company issue a note receivable","passage_text":"When to issue a credit note. There are several situations in which a credit note should be issued. There are two types of credit notes: those issued for outgoing payments and those issued for incoming payments. In other words, a credit note you receive or provide. For small business owners, both types are common.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":931773,"ranking":2,"query_text":"which situation does a company issue a note receivable","passage_text":"In this situation, playback fails, and you receive error code H7353. Note This issue does not occur in the Netflix Windows Store app. 1  You have a computer that is running Windows 8.1, Windows RT 8.1 or Windows Server 2012 R2.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":931772,"ranking":3,"query_text":"which situation does a company issue a note receivable","passage_text":"In this situation, playback fails, and you receive error code H7353. Note This issue does not occur in the Netflix Windows Store app. 1  You have a computer that is running Windows 8.1, Windows RT 8.1 or Windows Server 2012 R2. 2  You browse to the Netflix site in Internet Explorer. 3  You sign in to Netflix.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":931774,"ranking":4,"query_text":"which situation does a company issue a note receivable","passage_text":"Consider the following scenario: In this situation, playback fails, and you receive error code H7353. Note This issue does not occur in the Netflix Windows Store app. 1  You have a computer that is running Windows 8.1, Windows RT 8.1 or Windows Server 2012 R2. 2  You browse to the Netflix site in Internet Explorer.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":7127152,"ranking":5,"query_text":"which situation does a company issue a note receivable","passage_text":"Although smaller companies are not required to use GAAP, there are certain situations, such as obtaining credit or seeking investors, which require, by contract, those companies to also follow GAAP when preparing their financial statements. The SEC does not set GAAP; GAAP is primarily issued by the Financial Accounting Standards Board (FASB).","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":8174479,"ranking":6,"query_text":"which situation does a company issue a note receivable","passage_text":"ISSUES TO BE NOTED: 1  The residential status in India for the purposes of Income Tax Act is the most crucial factor determining the taxability of income of a foreign company. It should be ensured that control and management of the foreign company is situated wholly outside India.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":2565447,"ranking":7,"query_text":"which situation does a company issue a note receivable","passage_text":"These companies can be registered in any other state as a foreign company doing business in that state, if you need an aged company in a different state. Unless otherwise noted, the aged company does not have an EIN issued yet. These are clean shelf companies.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":7679926,"ranking":8,"query_text":"which situation does a company issue a note receivable","passage_text":"Definition of record date: Date, set by the issuing company, on which an individual must own shares in order to be eligible to receive a declared... Definition of record date: Date, set by the issuing company, on which an individual must own shares in order to be eligible to receive a declared... Home Articles","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":447864,"ranking":9,"query_text":"which situation does a company issue a note receivable","passage_text":"First try to login using the instructions at http:\/\/www.bcc.edu\/blackboard. If that does not work, make a note of the exact step in the instructions where you ran into the issue, and the exact wording of the error message you receive.irst try to login using the instructions at http:\/\/www.bcc.edu\/blackboard. If that does not work, make a note of the exact step in the instructions where you ran into the issue, and the exact wording of the error message you receive.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":3731448,"ranking":10,"query_text":"which situation does a company issue a note receivable","passage_text":"Contrary to what many people think, VISA does not issue credit cards. The company is actually a card network, which means it dictates where a given credit card will be accepted as well as what types of rental car insurance, extended product warranties and other perks cardholders receive.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":4983041,"ranking":11,"query_text":"which situation does a company issue a note receivable","passage_text":"Payment card number. A payment card number, or simply a card number, is the card identifier found on payment cards, such as credit cards and debit cards, as well as stored-value cards, gift cards and other similar cards. In some situations the card number is referred to as a bank card number. The card number is merely a card identifier and does not identify the account to which it is linked by the issuing company, nor does it identify the cardholder.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":6818707,"ranking":12,"query_text":"which situation does a company issue a note receivable","passage_text":"The supplier (or vendor) of the goods on credit is also referred to as a creditor. If the company receiving the goods does not sign a promissory note, the vendor's bill or invoice will be recorded by the company in its liability account Accounts Payable (or Trade Payables).","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":2970085,"ranking":13,"query_text":"which situation does a company issue a note receivable","passage_text":"Imputed Interest Rate (notes receivable) An approximated interest rate, used when a company cannot determine the interest rate of a note receivable because it has no ready market. To estimate PV, the company approximates an applicable interest rate, which may differ from the stated interest rate.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":156463,"ranking":14,"query_text":"which situation does a company issue a note receivable","passage_text":"Meaning that the can receive goods immediately by agreeing to pay within 90 days. The various types of receivables include customer accounts receivables, notes receivable and other receivables. The amounts that a customer owes is called Customer Account Receivables, which is better known as Accounts Receivable. Notes receivable maybe loans that a company made to another firm.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":2565445,"ranking":15,"query_text":"which situation does a company issue a note receivable","passage_text":"If you need other services see our other services here. These companies can be registered in any other state as a foreign company doing business in that state, if you need an aged company in a different state. Unless otherwise noted, the aged company does not have an EIN issued yet. These are clean shelf companies.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":6874487,"ranking":16,"query_text":"which situation does a company issue a note receivable","passage_text":"There is no 1099 or W2 issued by the taxi company because they have never paid the driver anything. Edited based on your Additional Details: It sounds like your friend does indeed act as an independent contractor as I have described, however there seems to be a twist if he is receiving a check from the company.here is no 1099 or W2 issued by the taxi company because they have never paid the driver anything. Edited based on your Additional Details: It sounds like your friend does indeed act as an independent contractor as I have described, however there seems to be a twist if he is receiving a check from the company.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":6304514,"ranking":17,"query_text":"which situation does a company issue a note receivable","passage_text":"Administrative receivership differs from simple receivership in that an administrative receiver is appointed over all of the assets and undertaking of the company. This means that an administrative receiver can normally only be appointed by the holder of a floating charge.nforcement is also a significant aspect of the situations where administrative receivership is still permitted â\u0080\u0093 for example, the ability to take control of the entirety of the assets is important in structuring insolvency-remote special purpose companies that issue securities or operate infrastructure projects.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":7278030,"ranking":18,"query_text":"which situation does a company issue a note receivable","passage_text":"Notes Receivable (N\/R) N\/R is a receivable due the company, in the form of a promissory note, arising because the company made a loan. Making loans is the business of banks, not of operating business, and particularly not the business of a small company with limited financial resources. Notes receivable is probably a note due from one of three sources: 1. Customers, 2. Employee, or 3. Officers of the company. Customer notes receivable is when the customer who borrowed from the company probably did so because he could not meet the accounts receivable terms.","bm25_label":"high","relevance_label":1.0},{"query_id":993153,"passage_id":6160228,"ranking":19,"query_text":"which situation does a company issue a note receivable","passage_text":"Notes. At the end of the annual report are notes on the financial statements by the auditor. These notes contain any comments the auditor feels are necessary to understand the company's situation. Common notes deal with how the company depreciates assets, how it books revenue, and how it calculates profit.inances. The financial section of the annual report gives an objective portrait of the company's situation. The balance sheet and statement of assets and liabilities shows what the company owns and what loans are outstanding.","bm25_label":"high","relevance_label":0.0},{"query_id":993153,"passage_id":1124938,"ranking":20,"query_text":"which situation does a company issue a note receivable","passage_text":"Apply for a CUSIP Number. Note: ISIN.net is not affiliated nor endorsed by any agency or company that allocates CUSIP numbers. ISIN.net is a consulting firm and assists with documentation writing and the CUSIP application, but does not issue CUSIP Numbers.","bm25_label":"high","relevance_label":0.0}]