[{"query_id":993178,"passage_id":6914218,"ranking":1,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis: Introduction. Syphilis is one type of sexually transmitted disease. Syphilis is the result of a bacterial infection of the genital tract by the bacterium Treponema pallidum. Syphilis is passed from one person another during direct sexual contact with a syphilis lesion that involves vaginal, oral, or anal sex.here are three stages of syphilis, and each stage of syphilis has distinct symptoms. The first stage (primary syphilis) is characterized by the development of a painless lesion called a chancre. The chancre usually develops in the genital area.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":7277958,"ranking":2,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"The sexually transmitted disease known as syphilis has three major stages of infection and one inactive or latent stage. The first stage of a syphilis infection manifests itself typically as the formation of a small ulcer or chancre on the site of the...","bm25_label":"high","relevance_label":1.0},{"query_id":993178,"passage_id":8329908,"ranking":3,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"The first (primary) stage: This involves the formation of the chancre. At this stage, syphilis is highly contagious. The primary stage can last one to five weeks. The disease can be transmitted from any contact with one of the ulcers, which are teeming with spirochetes.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":3844732,"ranking":4,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is a sexually transmitted disease that spreads from person to person through vaginal * , oral * , or anal * intercourse. A pregnant female also can pass the disease to her fetus. People are most contagious during the second stage of the infection.yphilis is a disease that is caused by the bacterium Treponema pallidum (treh-puh-NEE-muh PAL-ih-dum). The disease develops in three distinct phases. The first, or primary, stage is marked by a chancre * . In the secondary stage, a rash develops.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":6206212,"ranking":5,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Chancre: The classic painless ulcer of syphilis. The chancre forms in the first (primary) stage of syphilis. It is highly contagious and can last 1-5 weeks.The disease can be transmitted from contact with the ulcer, which is teeming with spirochetes.he chancre forms in the first (primary) stage of syphilis. It is highly contagious and can last 1-5 weeks. The disease can be transmitted from contact with the ulcer, which is teeming with spirochetes.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":5971068,"ranking":6,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"1 Syphilis is a bacterial infection that is transmitted by sexual contact. 2  Condoms do not necessarily prevent sexually transmitted diseases. 3  The scientific name for the syphilis organism is Treponema pallidum. 4  Early syphilis causes a mouth or genital ulcer (chancre).5  This is the hallmark symptom of the first stage. Syphilis is a bacterial infection that is transmitted by sexual contact. 2  Condoms do not necessarily prevent sexually transmitted diseases. 3  The scientific name for the syphilis organism is Treponema pallidum. 4  Early syphilis causes a mouth or genital ulcer (chancre). 5  This is the hallmark symptom of the first stage.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":7277960,"ranking":7,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis that is caught early in the first stage of the infection can be quickly and easily treated. If not promptly recognized and treated, syphilis will progress through three stages. Each stage of syphilis has distinct symptoms. The first stage is characterized by the development of a lesion called a chancre. The chancre usually develops in the genital area, but it can develop on the lips, tongue or rectum if these areas have been exposed to a syphilis chancre on another person during oral or anal sexual contact.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":5971063,"ranking":8,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Patient Comments Share Your Story. 1  Syphilis is a bacterial infection that is transmitted by sexual contact. 2  Condoms do not necessarily prevent sexually transmitted diseases. 3  The scientific name for the syphilis organism is Treponema pallidum. 4  Early syphilis causes a mouth or genital ulcer (chancre). 5  Later stages of syphilis can cause hair loss, ... Syphilis is a bacterial infection that is transmitted by sexual contact. 2  Condoms do not necessarily prevent sexually transmitted diseases. 3  The scientific name for the syphilis organism is Treponema pallidum. 4  Early syphilis causes a mouth or genital ulcer (chancre). 5  This is the hallmark symptom of the first stage.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":5890345,"ranking":9,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"There are three stages of syphilis, and each stage of syphilis has distinct symptoms. The first stage (primary syphilis) is characterized by the development of a painless lesion called a chancre. The chancre usually develops in the genital area.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":5848145,"ranking":10,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"An incubation period is the time between exposure to a disease and the first symptom. A skin sore called a chancre is usually the first symptom of sexually transmitted syphilis. A chancre appears between 3 weeks to 3 months after a person has been infected with syphilis.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":5884395,"ranking":11,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Chancre: The classic painless ulcer of syphilis. The chancre forms in the first (primary) stage of syphilis. It is highly contagious and can last 1-5 weeks. The disease can be transmitted from contact with the ulcer, which is teeming with spirochetes. If the ulcer is outside of the vagina or on the scrotum of the male, the use of condoms may not help in preventing transmission of the disease.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":567959,"ranking":12,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is a sexually transmitted infection caused by the bacterium Treponema pallidum subspecies pallidum. The signs and symptoms of syphilis vary depending in which of the four stages it presents. The primary stage classically presents with a single chancre but there may be multiple sores. In secondary syphilis a diffuse rash occurs, which frequently involves the palms of the hands and soles of the feet. There may also be sores in the mouth or vagina. In latent syphilis, which can last for ye","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":3465494,"ranking":13,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Incubation period. An incubation period is the time between exposure to a disease and the first symptom. A skin sore called a chancre is usually the first symptom of sexually transmitted syphilis.ransmission. Transmission of the bacteria usually occurs during vaginal, anal, or oral sex. The syphilis bacteria are passed from person to person through direct contact with: 1  The open sore (chancre) that appears during the primary stage.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":8329905,"ranking":14,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is a sexually transmitted infection caused by the bacterium Treponema pallidum subspecies pallidum. The signs and symptoms of syphilis vary depending in which of the four stages it presents (primary, secondary, latent, and tertiary). The primary stage classically presents with a single chancre (a firm, painless, non-itchy skin ulceration) but there may be multiple sores. In secondary syphilis a diffuse rash occurs, which frequently involves the palms of the hands and soles of the feet. There may also be sores in the mouth or vagina.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":6454823,"ranking":15,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is transmitted from person to person by direct contact with a syphilitic sore, known as a chancre. Chancres occur mainly on the external genitals, vagina, anus, or in the rectum. Chancres also can occur on the lips and in the mouth. Transmission of syphilis occurs during vaginal, anal, or oral sex.Pregnant women with the disease can transmit it to their unborn child.his stage typically starts with the development of a rash on one or more areas of the body. Rashes associated with secondary syphilis can appear when the primary chancre is healing or several weeks after the chancre has healed. The rash usually does not cause itching.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":6247217,"ranking":16,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is caused by a spirochete, Treponema pallidum. A spirochete is a thin spiralor coil-shaped bacterium that enters the body through the mucous membranes or breaks in the skin. In 90% of cases, the spirochete is transmitted by sexual contact.rimary syphilis is the stage of the organism's entry into the body. The first signs of infection are not always noticed. After an incubation period ranging between 10 and 90 days, the patient develops a chancre, which is a small blister-like sore about 0.5 in (13 mm) in size.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":846661,"ranking":17,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is a sexually transmitted infection caused by the bacterium Treponema pallidum subspecies pallidum. The signs and symptoms of syphilis vary depending in which of the four stages it presents (primary, secondary, latent, and tertiary). The primary stage classically presents with a single chancre (a firm, painless, non-itchy skin ulceration) but there may be multiple sores.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":8686476,"ranking":18,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is a disease that is caused by the bacterium Treponema pallidum (treh-puh-NEE-muh PAL-ih-dum). The disease develops in three distinct phases. The first, or primary, stage is marked by a chancre * . In the secondary stage, a rash develops. By the third, or tertiary, stage the disease can cause widespread damage to the body, affecting the brain, nerves, bones, joints, eyes, and heart and other organs.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":567957,"ranking":19,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"Syphilis is a sexually transmitted infection caused by the bacterium Treponema pallidum subspecies pallidum.[2] The signs and symptoms of syphilis vary depending in which of the four stages it presents (primary, secondary, latent, and tertiary). The primary stage classically presents with a single chancre (a firm, painless, non-itchy skin ulceration) but there may be multiple sores.","bm25_label":"high","relevance_label":0.0},{"query_id":993178,"passage_id":7277955,"ranking":20,"query_text":"which sexually transmitted disease has three stages, the first of which involves development of a chancre?","passage_text":"A bacterial infection caused by an organism called spirochete.Syphilis belongs to a group of infections which are transmitted sexually. The first stage of infection development involves genitalsâ\u0080\u0099 sores, which are not accompanied by any painful feelings. Treponema pallidum on the surface of human skin, bacterium which causes syphilis. Syphilis symptoms and causative agent. Treponema pallidum on the surface of human skin, bacterium which causes syphilis.","bm25_label":"high","relevance_label":0.0}]