[{"query_id":993748,"passage_id":6400013,"ranking":1,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"Definition. organ system: CV and circulatory function: branches into the coronary arteries which supply oxygen-rich blood to the myocardium of the heart. organ system: CV and circulatory. function: branches into the coronary arteries which supply oxygen-rich blood to the myocardium of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":1661284,"ranking":2,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The heart muscle, like every other organ or tissue in your body, needs oxygen-rich blood to survive. Blood is supplied to the heart by its own vascular system, called coronary circulation. The aorta (the main blood supplier to the body) branches off into two main coronary blood vessels (also called arteries).These coronary arteries branch off into smaller arteries, which supply oxygen-rich blood to the entire heart muscle. The right coronary artery supplies blood mainly to the right side of the heart.he aorta (the main blood supplier to the body) branches off into two main coronary blood vessels (also called arteries). These coronary arteries branch off into smaller arteries, which supply oxygen-rich blood to the entire heart muscle.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":7766436,"ranking":3,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The heart muscle, like every other organ or tissue in your body, needs oxygen-rich blood to survive. Blood is supplied to the heart by its own vascular system, called coronary circulation. The aorta (the main blood supplier to the body) branches off into two main coronary blood vessels (also called arteries). These coronary arteries branch off into smaller arteries, which supply oxygen-rich blood to the entire heart muscle. The right coronary artery supplies blood mainly to the right side of the heart. The right side of the heart is smaller because it pumps blood only to the lungs. The left coronary artery, which branches into the left anterior descending artery and the circumflex artery, supplies blood to the left side of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":7276806,"ranking":4,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"Coronary Circulation. The heart muscle, like every other organ or tissue in your body, needs oxygen-rich blood to survive. Blood is supplied to the heart by its own vascular system, called coronary circulation. The aorta (the main blood supplier to the body) branches off into two main coronary blood vessels (also called arteries). These coronary arteries branch off into smaller arteries, which supply oxygen-rich blood to the entire heart muscle. The right coronary artery supplies blood mainly to the right side of the heart.","bm25_label":"high","relevance_label":1.0},{"query_id":993748,"passage_id":2219578,"ranking":5,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The heart muscle, like every other organ or tissue in your body, needs oxygen-rich blood to survive. Blood is supplied to the heart by its own vascular system, called coronary circulation. The aorta (the main blood supplier to the body) branches off into two main coronary blood vessels (also called arteries). These coronary arteries branch off into smaller arteries, which supply oxygen-rich blood to the entire heart muscle. The right coronary artery supplies blood mainly to the right side of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":832994,"ranking":6,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"Coronary Circulation. The heart muscle, like every other organ or tissue in your body, needs oxygen-rich blood to survive. Blood is supplied to the heart by its own vascular system, called coronary circulation.The aorta (the main blood supplier to the body) branches off into two main coronary blood vessels (also called arteries).These coronary arteries branch off into smaller arteries, which supply oxygen-rich blood to the entire heart muscle.The right coronary artery supplies blood mainly to the right side of the heart.oronary Circulation. The heart muscle, like every other organ or tissue in your body, needs oxygen-rich blood to survive. Blood is supplied to the heart by its own vascular system, called coronary circulation.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":2535400,"ranking":7,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"This artery supplies blood to the back of the heart. Left Coronary Artery. Left Coronary Artery: The left coronary artery (LCA), which divides into the left anterior descending artery and the circumflex branch, supplies blood to the heart ventricles and left atrium. Coronary arteries supply blood to the heart muscle.he two main coronary arteries are the left and right coronary arteries. The left coronary artery (LCA), which divides into the left anterior descending artery and the circumflex branch, supplies blood to the heart ventricles and left atrium.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":778449,"ranking":8,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches:The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.Right coronary artery (RCA). The right coronary artery supplies blood to the right ventricle, the right atrium, and the SA (sinoatrial) and AV (atrioventricular) nodes, which regular the heart rhythm.his artery supplies blood to the outer side and back of the heart. Right coronary artery (RCA). The right coronary artery supplies blood to the right ventricle, the right atrium, and the SA (sinoatrial) and AV (atrioventricular) nodes, which regular the heart rhythm.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":3345073,"ranking":9,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches:The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.he left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":2637605,"ranking":10,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"This artery supplies blood to the back of the heart. Left Coronary Artery. Left Coronary Artery: The left coronary artery (LCA), which divides into the left anterior descending artery and the circumflex branch, supplies blood to the heart ventricles and left atrium. Coronary arteries supply blood to the heart muscle.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":778446,"ranking":11,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The right coronary artery and the left coronary artery branch off the aorta (just after it leaves the heart) to deliver oxygen-rich blood to the heart muscle. These two arteries branch into other arteries, including the circumflex artery, that also supply blood to the heart.The cardiac veins collect blood from the heart muscle and empty it into a large vein on the back surface of the heart called the coronary sinus, which returns the blood to the right atrium.lood Supply of the Heart. Like all organs, the heart needs a constant supply of oxygen-rich blood. A system of arteries and veins, called the coronary circulation, supplies the heart muscle (myocardium) with oxygen-rich blood and then returns oxygen-depleted blood to the right atrium.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":6111869,"ranking":12,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches:The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.he left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":6111870,"ranking":13,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary artery divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the lateral side and back of the heart.he left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary artery divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":930705,"ranking":14,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary artery divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the lateral side and back of the heart.he left main coronary artery divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":2535395,"ranking":15,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.Right coronary artery (RCA). The right coronary artery supplies blood to the right ventricle, the right atrium, and the SA (sinoatrial) and AV (atrioventricular) nodes, which regular the heart rhythm.The right coronary artery divides into smaller branches, including the right posterior descending artery and the acute marginal artery.he left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":2535399,"ranking":16,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle.This artery supplies blood to the outer side and back of the heart.he left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":3604005,"ranking":17,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches: The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart. The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":4218902,"ranking":18,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches:The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.he left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches:","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":3056056,"ranking":19,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"The two main coronary arteries are the left main and right coronary arteries. Left main coronary artery (LMCA). The left main coronary artery supplies blood to the left side of the heart muscle (the left ventricle and left atrium). The left main coronary divides into branches:The left anterior descending artery, which branches off the left coronary artery and supplies blood to the front of the left side of the heart.The circumflex artery, which branches off the left coronary artery and encircles the heart muscle. This artery supplies blood to the outer side and back of the heart.he right coronary artery supplies blood to the right ventricle, the right atrium, and the SA (sinoatrial) and AV (atrioventricular) nodes, which regular the heart rhythm. The right coronary artery divides into smaller branches, including the right posterior descending artery and the acute marginal artery.","bm25_label":"high","relevance_label":0.0},{"query_id":993748,"passage_id":6157566,"ranking":20,"query_text":"which organ is supplied with blood by the coronary arteries","passage_text":"Coronary artery disease (CAD) or coronary heart disease is a condition in which plaque builds up inside the coronary arteries, which supplies oxygen rich blood to the heart muscles.oronary artery disease (CAD) or coronary heart disease is a condition in which plaque builds up inside the coronary arteries, which supplies oxygen rich blood to the heart muscles.","bm25_label":"high","relevance_label":0.0}]