[{"query_id":993987,"passage_id":7276263,"ranking":1,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"**Which muscle type is involved in the function of the digestive tract and blood vessels? Smooth smooth muscle functions in many systems of the body, including the digestive tract and blood vessels. **How does cardiac muscle differ from the other types of muscle? **True or false?","bm25_label":"high","relevance_label":1.0},{"query_id":993987,"passage_id":5942886,"ranking":2,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"An integrated group of structurally and functionally linked parts (including muscles, nerves, blood and lymphatic vessels, glands, stroma and so on) which act in concert to perform a particular function, as in digestion, which is performed by the alimentary apparatus (now preferentially known as the GI tract).","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":5814952,"ranking":3,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"apparatus Anatomy An integrated group of structurally and functionally linked parts (including muscles, nerves, blood and lymphatic vessels, glands, stroma and so on) which act in concert to perform a particular function, as in digestion, which is performed by the alimentary apparatus (now preferentially known as the GI tract).","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":5311663,"ranking":4,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"As with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement.s with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":5279698,"ranking":5,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"As with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement.If one...s with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement. If one...","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":832998,"ranking":6,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"As with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement.If one...Click to read more below.s with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement. If one... Click to read more below.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":3114574,"ranking":7,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"As with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":7755470,"ranking":8,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"As with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement. If one...","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":3058967,"ranking":9,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Visceral muscle tissue, or smooth muscle, is tissue associated with the internal organs of the body, especially those in the abdominal cavity.There are three types of muscle in the body: skeletal, smooth, and cardiac.s with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement. If one...","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":5311662,"ranking":10,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Visceral muscle tissue, or smooth muscle, is tissue associated with the internal organs of the body, especially those in the abdominal cavity. There are three types of muscle in the body: skeletal, smooth, and cardiac.s with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":904504,"ranking":11,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Visceral muscle tissue, or smooth muscle, is tissue associated with the internal organs of the body, especially those in the abdominal cavity. There are three types of muscle in the body: skeletal, smooth, and cardiac.s with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement. If one...","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":3862295,"ranking":12,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"The stomach is a muscular, hollow, dilated part of the digestive system which functions as an important organ of the digestive tract in many animals, including vertebrates, echinoderms, insects (mid-gut), and molluscs.he stomach is surrounded by parasympathetic (stimulant) and orthosympathetic (inhibitor) plexuses (networks of blood vessels and nerves in the anterior gastric, posterior, superior and inferior, celiac and myenteric), which regulate both the secretions activity and the motor (motion) activity of its muscles.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":8536633,"ranking":13,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Function of the Digestive System The function of the digestive system is digestion and absorption. Digestion is the breakdown of food into small molecules, which are then absorbed into the body. The digestive system is divided into two major parts: The digestive tract (alimentary canal) is a continuous tube with two openings: the mouth and the anus. It includes the mouth, pharynx, esophagus, stomach, small intestine, and large intestine. Food passing through the internal cavity, or lumen, of the digestive tract does not technically enter the body until it is absorbed through the walls of the digestive tract and passes into blood or lymphatic vessels.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":5069277,"ranking":14,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"25. The aortic arches connect the ventral blood vessel, a tube lying under the digestive tract, with the dorsal blood vessel, a tube lying on top of the digestive tract. The dorsal blood vessel is the main pumping organ for the blood and it carries blood in an anterior direction.The ventral blood vessel carries blood to the rear of the worm. Lateral blood vessels branch off from the two main vessels and carry blood to and from the internal organs.n animals, examples of organs are the brain, liver, heart, kidney, stomach, etc. Each organ has one or more particular functions to perform and the tissues in a particular organ work with each other to perform these functions. For example the human heart has the function of pumping blood throughout the body.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":120229,"ranking":15,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"CREST syndrome: Introduction. CREST syndrome is a type of systemic scleroderma and an ongoing, progressive, autoimmune disease that attacks the connective tissues of the body. CREST syndrome can also affect any part of the body.CREST is an acronym for a group of conditions that are hallmarks of CREST syndrome and affect the skin, muscles, digestive tract and other organs and blood vessels. The exact cause of CREST syndrome is not known, but it is classified as an autoimmune disease.REST is an acronym for a group of conditions that are hallmarks of CREST syndrome and affect the skin, muscles, digestive tract and other organs and blood vessels. The exact cause of CREST syndrome is not known, but it is classified as an autoimmune disease.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":5896203,"ranking":16,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Autoimmune Diseases. Autoimmune diseases can affect almost any part of the body, including the heart, brain, nerves, muscles, skin, eyes, joints, lungs, kidneys, glands, the digestive tract, and blood vessels. The classic sign of an autoimmune disease is inflammation, which can cause redness, heat, pain, and swelling.utoimmune diseases can affect almost any part of the body, including the heart, brain, nerves, muscles, skin, eyes, joints, lungs, kidneys, glands, the digestive tract, and blood vessels. The classic sign of an autoimmune disease is inflammation, which can cause redness, heat, pain, and swelling.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":5279697,"ranking":17,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Visceral Muscle Tissue. Visceral muscle tissue, or smooth muscle, is tissue associated with the internal organs of the body, especially those in the abdominal cavity.There are three types of muscle in the body: skeletal, smooth, and cardiac.s with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement. If one...","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":3234398,"ranking":18,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Smooth muscle lines the blood vessels, hair follicles, urinary tract, digestive tract, and genital tract. Its speed of contraction is slower than that of striated muscle, but it can remain contracted longer. Cardiac muscle is striated like skeletal muscle but, like smooth muscle, is controlled involuntarily.","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":3166068,"ranking":19,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"Smooth muscle has been implicated to play a role in a large number of diseases affecting blood vessels, the respiratory tract (e.g., asthma), the digestive system (e.g. irritable bowel syndrome) and the urinary tract (e.g., urinary incontinence).These disease processes are not usually confined to the muscular tissue.mooth muscle has been implicated to play a role in a large number of diseases affecting blood vessels, the respiratory tract (e.g., asthma), the digestive system (e.g. irritable bowel syndrome) and the urinary tract (e.g., urinary incontinence).","bm25_label":"high","relevance_label":0.0},{"query_id":993987,"passage_id":3058528,"ranking":20,"query_text":"which muscle type is involved in the function of the digestive tract and blood vessels?","passage_text":"As with any muscle, the smooth, involuntary muscles of the visceral muscle tissue (which lines the blood vessels, stomach, digestive tract, and other internal organs) are composed of bundles of specialized cells capable of contraction and relaxation to create movement. If one... Click to read more below.","bm25_label":"high","relevance_label":0.0}]