[{"query_id":995221,"passage_id":7274101,"ranking":1,"query_text":"which contestant on the bachelor was missing","passage_text":"This Bachelor Contestant Was a Missing Person Before Going on the Show 2 weeks ago","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":7274096,"ranking":2,"query_text":"which contestant on the bachelor was missing","passage_text":"In what may be the most dramatic mix-up ever, The Bachelor contestant Bekah M. was reported missing in November by her mother. In what may be the most dramatic mix-up ever, The Bachelor contestant Bekah M. was reported missing in November by her mother. Continue to Variety SKIP AD You will be redirected back to your article in seconds","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":7274098,"ranking":3,"query_text":"which contestant on the bachelor was missing","passage_text":"'Bachelor' contestant Rebekah Martinez was originally reported missing, but later spotted on reality TV series","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":7274099,"ranking":4,"query_text":"which contestant on the bachelor was missing","passage_text":"'Bachelor' contestant was listed as a missing person Trump holds listening session with students on mass shootings Deputies will now carry AR-15 rifles on school grounds in Fla. county, sheriff says","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":7274100,"ranking":5,"query_text":"which contestant on the bachelor was missing","passage_text":"Rebekah Martinez, 22, of Fresno, Calif., had been reported missing by her mother on Nov. 18, but was later discovered to be a contestant on the newest season of ABC's hit reality show The Bachelor. (abc)","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":7274095,"ranking":6,"query_text":"which contestant on the bachelor was missing","passage_text":"'Bachelor' Contestant Rebekah Martinez Was Reported Missing Last Year, But She's Been Very Visible Entertainment 4:59 PM PST, February 2, 2018 - Deborah Hastings Rebekah Martinez was hiding in plain sight.","bm25_label":"high","relevance_label":1.0},{"query_id":995221,"passage_id":7274093,"ranking":7,"query_text":"which contestant on the bachelor was missing","passage_text":"Rebekah Martinez was originally reported missing by her mother, but the 22-year-old was actually busy filming The Bachelor. (abc) Rebekah Martinez, who was once listed as a missing person, was actually just busy filming The Bachelor. The contestant's mother became concerned when she could not reach her daughter. She reported the 22-year-old missing on Nov. 18. According to The Daily Mail, her mother told the Humboldt County Sheriff's Office that she had not been able to locate her daughter for six days.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":7274094,"ranking":8,"query_text":"which contestant on the bachelor was missing","passage_text":"Signing up for The Bachelor means agreeing to fall off the face of the earth for several weeksâ\u0080\u0094so it's important to keep moms informed. It appears Bekah Martinez, the youngest contestant on season 22 of ABC's The Bachelor, may have dropped the ball there. Martinez was reported missing to the Humboldt County Sheriff's Office in November, around the same time the ABC reality dating show was filming.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":2768218,"ranking":9,"query_text":"which contestant on the bachelor was missing","passage_text":"CONTESTANT NAME Jessica Terrill LOCAL TITLE Miss North Central MS HOME TOWN Starkville, MS SCHOOL Mississippi College School of Law; Graduate of Mississippi State University MAJOR I received my Bachelor of Arts degree in Communication, with an emphasis on Public Relations and Broadcasting.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":7274102,"ranking":10,"query_text":"which contestant on the bachelor was missing","passage_text":"Indeed, Ms. Martinez, a 22-year-old contestant on the current season of ABCâ\u0080\u0099s reality show â\u0080\u009cThe Bachelor,â\u0080\u009d was reported missing by her mother on Nov. 18, about a month and a half before her season would premiere on Jan. 1, according to the Humboldt County sheriffâ\u0080\u0099s office.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":3813844,"ranking":11,"query_text":"which contestant on the bachelor was missing","passage_text":"How many Bachelor contestants have died? With the recent tragic news of Bachelorette contestant Eric Hill dying in a paragliding accident on Wednesday, many people are thinking of other cast members of the show who have passed tragically. Sadly there has been more than one death of a Bachelor contestant. In fact there have been a total of 3 (5 as of 3\/2016) deaths in the Bachelor family.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":5160734,"ranking":12,"query_text":"which contestant on the bachelor was missing","passage_text":"Hereâ\u0080\u0099s how much money people on 'The Bachelor' get paid. Bachelor season 21 star Nick Viall with Sarah, a contestant. â\u0080¢ The Bachelor and Bachelorette stars are typically paid $100,000. â\u0080¢ The contestants make no money. â\u0080¢ The real money happens after the show when they make appearances.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":6891542,"ranking":13,"query_text":"which contestant on the bachelor was missing","passage_text":"'The Bachelor' 2016 Remaining Contestants. It's episode 5 of The Bachelor 2016 and there are 11 girls remaining, hoping to win the heart of star Ben Higgins. On tonight's episode, the contestants start to let Higgins know that cast member Olivia may not be the girl for him.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":8008855,"ranking":14,"query_text":"which contestant on the bachelor was missing","passage_text":"STARKVILLE, Miss. â\u0080\u0093 Home games against LSU, Alabama and Ole Miss and a Thursday night road contest at Missouri highlight the 2015 Mississippi State football schedule, which was announced by the Southeastern Conference Tuesday evening.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":1351084,"ranking":15,"query_text":"which contestant on the bachelor was missing","passage_text":"Alongside its traditional rival, the Miss World contest, the Miss Universe pageant is one of the two most recognized and publicized beauty contests in the world. The current Miss Universe is Paulina Vega of Colombia who was crowned on 25 January 2015 in Doral, USA.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":3211585,"ranking":16,"query_text":"which contestant on the bachelor was missing","passage_text":"It started off as Festive Bikini Contest in 1951, but the media panned it as Miss World, and it did for good. When Eric Morley, president of the contest, came to know about the upcoming Miss Universe contest the following year in 1952, then he decided to make it an annual event. And the rest is historyâ\u0080¦.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":3434268,"ranking":17,"query_text":"which contestant on the bachelor was missing","passage_text":"Who gets Nick Viall's first impression rose? Meet 'The Bachelor' contestant Rachel Lindsay. The biggest scandal to erupt on Monday's premiere episode of The Bachelor â\u0080\u0094 aside from the fact that Nick Viall already slept with one of the contestants at a wedding (gasp!) â\u0080\u0094 was the sea of red dresses.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":3683695,"ranking":18,"query_text":"which contestant on the bachelor was missing","passage_text":"ABC casts first black 'Bachelorette,' and it's Rachel Lindsay from this season's 'The Bachelor'. Rachel Lindsay, a Texas attorney who is currently a contestant on â\u0080\u009cThe Bachelor,â\u0080\u009d has been tapped for the 13th season â\u0080\u0094 which premieres on May 22â\u0080\u0094 of â\u0080\u009cThe Bachelorette,â\u0080\u009d a source close to the show told The Times.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":4287225,"ranking":19,"query_text":"which contestant on the bachelor was missing","passage_text":"Alongside its traditional rival, the Miss World contest, the Miss Universe pageant is one of the two most recognized and publicized beauty contests in the world. The current Miss Universe is Paulina Vega of Colombia who was crowned on 25 January 2015 in Doral, USA. Traditionally, Miss Universe lives in New York City during her reign.","bm25_label":"high","relevance_label":0.0},{"query_id":995221,"passage_id":4339837,"ranking":20,"query_text":"which contestant on the bachelor was missing","passage_text":"Heather is a contestant in Total Drama: All Stars as a member of the Villainous Vultures. Heather is introduced along with the returning contestants, and is shocked when Chris pranks them with a feral Ezekiel. While on the beach, Lindsay asks Heather if she misses her honey bunny, to which Heather realizes.","bm25_label":"high","relevance_label":0.0}]