[{"query_id":995526,"passage_id":3148447,"ranking":1,"query_text":"where is the federal penitentiary in ind","passage_text":"Timothy McVeigh, the cold-hearted mass murderer of 168 people, was put to death Monday in the federal penitentiary in Terre Haute, Ind.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":2972953,"ranking":2,"query_text":"where is the federal penitentiary in ind","passage_text":"Morris and the Anglin brothers had first become acquainted while being incarcerated at the the Federal Penitentiary in Atlanta, where John and Clarence attempted multiple prison escapes.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":5941236,"ranking":3,"query_text":"where is the federal penitentiary in ind","passage_text":"Yet when he is put to death by lethal injection, it's expected to be at the US Penitentiary in Terre Haute, Indiana. Terre Haute is a high-security prison complex consisting of a maximum security penitentiary, a medium security federal correctional institute, and a low security camp.ocation: Executions are performed at the U.S. Penitentiary in Terre Haute, Indiana. A judge may choose to relocate the execution to a state where the death penalty is legal if that would be more convenient for victims and family members to access.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":7037616,"ranking":4,"query_text":"where is the federal penitentiary in ind","passage_text":"United States Penitentiary, McCreary. The United States Penitentiary, McCreary (USP McCreary) is a high-security United States federal prison for male inmates in Kentucky. It is operated by the Federal Bureau of Prisons, a division of the United States Department of Justice.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":5838121,"ranking":5,"query_text":"where is the federal penitentiary in ind","passage_text":"Policemen guard the site where a tunnel, connected to the Altiplano Federal Penitentiary and used by drug lord Joaquin 'El Chapo' Guzman to escape, was located in Almoloya de Juarez, on the outskirts of Mexico City, July 12, 2015.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":8802822,"ranking":6,"query_text":"where is the federal penitentiary in ind","passage_text":"Litchfield Penitentiary is the primary setting of Orange is the New Black. It houses both a minimum-security prison (where the events of the show take place) and a maximum-security prison. In Seasons One and Two, it was run by the Federal Department of Corrections.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":7793214,"ranking":7,"query_text":"where is the federal penitentiary in ind","passage_text":"Federal Penitentiary Atlanta 1920 postcard. The United States Penitentiary, Atlanta (USP Atlanta) is a medium-security United States federal prison for male inmates in Atlanta, Georgia. It is operated by the Federal Bureau of Prisons, a division of the United States Department of Justice.hey were the beneficiaries of the Three Prisons Act of 1891, which established penitentiaries in Leavenworth, Kansas; Atlanta, Georgia; and McNeil Island, Washington. The first two remain open today, the third closed in 1976.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":1624784,"ranking":8,"query_text":"where is the federal penitentiary in ind","passage_text":"United States Penitentiary, Leavenworth. Prison from the southwest. The United States Penitentiary, Leavenworth (USP Leavenworth) is a medium-security United States federal prison for male inmates in northeast Kansas. It is operated by the Federal Bureau of Prisons, a division of the United States Department of Justice.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":5838125,"ranking":9,"query_text":"where is the federal penitentiary in ind","passage_text":"Policemen guard the site where a tunnel, connected to the Altiplano Federal Penitentiary and used by drug lord Joaquin 'El Chapo' Guzman to escape, was located in Almoloya de Juarez, on the outskirts of Mexico City, July 12, 2015. Tomas Bravo \/ Reuters.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":7926561,"ranking":10,"query_text":"where is the federal penitentiary in ind","passage_text":"United States Penitentiary, Terre Haute. The United States Penitentiary, Terre Haute (USP Terre Haute) is a high-security United States federal prison for male inmates in Terre Haute, Indiana. It is part of the Terre Haute Federal Correctional Complex (FCC Terre Haute) and is operated by the Federal Bureau of Prisons, a division of the United States Department of Justice.","bm25_label":"high","relevance_label":1.0},{"query_id":995526,"passage_id":1143379,"ranking":11,"query_text":"where is the federal penitentiary in ind","passage_text":"Criminal. A native of Austria, Bowers was arrested for a post office robbery in 1931 and was sentenced to 25 years in prison. After spending some time at McNeil Island Penitentiary and later Leavenworth Federal Penitentiary, he was transferred to the newly opened Alcatraz Federal Penitentiary in 1934.rison guards, assuming that he was trying to escape, opened fire in the attempt to stop him. Bowers was hit, knocked off the fence, and fell 60 feet down the cliff behind it to his death. He is considered to be the first federal prisoner to attempt to escape from Alcatraz.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":7088149,"ranking":12,"query_text":"where is the federal penitentiary in ind","passage_text":"United States Penitentiary, Tucson. The United States Penitentiary, Tucson (USP Tucson) is a high-security United States federal prison for male inmates in Arizona. It is part of the Tucson Federal Correctional Complex (FCC Tucson) and is operated by the Federal Bureau of Prisons, a division of the United States Department of Justice. The facility also has a satellite prison camp for minimum-security male offenders.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":3028289,"ranking":13,"query_text":"where is the federal penitentiary in ind","passage_text":"For other uses, see Alcatraz (disambiguation). The Alcatraz Federal Penitentiary or United States Penitentiary, Alcatraz Island (often just referred to as Alcatraz) was a maximum high-security federal prison on Alcatraz Island, 1.25 miles (2.01 km) off the coast of San Francisco, California, which operated from 1934 to 1963.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":7403688,"ranking":14,"query_text":"where is the federal penitentiary in ind","passage_text":"jail, prison, and penitentiary In British English, there is no clear difference between jail and prison, and the word penitentiary is not now used. He was arrested for drunkenness and spent a night in the city jail. He was sentenced to 40 years in a state\/federal prison.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":8380163,"ranking":15,"query_text":"where is the federal penitentiary in ind","passage_text":"List of inmates of United States Penitentiary, Atlanta. This is a list of notable current and former inmates of the United States Penitentiary in Atlanta. Inmates who were released from custody prior to 1982 are not listed on the Federal Bureau of Prisons website. Contents.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":6126723,"ranking":16,"query_text":"where is the federal penitentiary in ind","passage_text":"Yet when he is put to death by lethal injection, it's expected to be at the US Penitentiary in Terre Haute, Indiana. Terre Haute is a high-security prison complex consisting of a maximum security penitentiary, a medium security federal correctional institute, and a low security camp.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":5269182,"ranking":17,"query_text":"where is the federal penitentiary in ind","passage_text":"History: Federal Penitentiary. The army transferred Alcatraz to the civilian Bureau of Prisons (BOP) in 1934. The BOP quickly converted the aging military prison in to a maximum-security, state-of-the-art civilian penitentiary. Alcatraz would shortly become the most famous federal prison in United States history. Alcatraz was designed to serve as Americaâ\u0080\u0099s first maximum-security, minimum-privilege penitentiary, what is today referred to as a â\u0080\u009csuper maxâ\u0080\u009d institution. From 1934 to 1963, Alcatraz housed some of Americaâ\u0080\u0099s most notorious offenders, escape artists, gang leaders and general trouble makers.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":5838119,"ranking":18,"query_text":"where is the federal penitentiary in ind","passage_text":"The Mexican government canâ\u0080\u0099t bring El Chapo, its most notorious drug criminal, to justice. Policemen guard the site where a tunnel, connected to the Altiplano Federal Penitentiary and used by drug lord Joaquin 'El Chapo' Guzman to escape, was located in Almoloya de Juarez, on the outskirts of Mexico City, July 12, 2015.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":7088148,"ranking":19,"query_text":"where is the federal penitentiary in ind","passage_text":"List of federal prisons. United States Penitentiaries. Most United States Penitentiaries (USPs) are high-security facilities, which have highly secured perimeters with walls or reinforced fences, multiple and single-occupant cell housing, the highest staff-to-inmate ratio, and close control of inmate movement.","bm25_label":"high","relevance_label":0.0},{"query_id":995526,"passage_id":7088150,"ranking":20,"query_text":"where is the federal penitentiary in ind","passage_text":"List of federal prisons United States Penitentiaries Most United States Penitentiaries (USPs) are high-security facilities, which have highly secured perimeters with walls or reinforced fences, multiple and single-occupant cell housing, the highest staff-to-inmate ratio, and close control of inmate movement.","bm25_label":"high","relevance_label":0.0}]