[{"query_id":998591,"passage_id":7267821,"ranking":1,"query_text":"where is mathura","passage_text":"Top Places to Visit in Mathura, Uttar Pradesh: See TripAdvisor's 1,523 traveller reviews and photos of Mathura attractions.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7267822,"ranking":2,"query_text":"where is mathura","passage_text":"The city of Mathura is located in the western part of the state of Uttar Pradesh, in the north of India. It is a part of the great northern plains and is situated on the west bank of the river Yamuna. Mathura is 140 km south of Delhi and 60 km northwest of Agra. The climate of Mathura is extreme and tropical. Summers are extremely hot and winters are cold and foggy.","bm25_label":"high","relevance_label":1.0},{"query_id":998591,"passage_id":4798868,"ranking":3,"query_text":"where is mathura","passage_text":"The holi festival is a very famous festival of the Mathura and Vrindavan. Some highly enthusiastic people living in other regions of India gather at Mathura and Vrindavan especially to see the holi celebration.Mathura and Vrindavan is the great land where Lord Krishna took birth and do lots of activities.here are many reasons to celebrate the holi festival every year. It is the grand celebration of colors, delicious foods, unity and love. Traditionally, it is celebrated to get success over the evil power or badness of goodness. It is named as â\u0080\u009cPhagwahâ\u0080\u009d, as it is celebrated in the Hindi month, Phalgun.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7267815,"ranking":4,"query_text":"where is mathura","passage_text":"According to the Garuda Purana, Mathura along with Ayodhya, Avantika, Kasi, Puri, Kanchi and Dwarka are the seven sites which grant moksha. Even though the city is linked mainly with the life of Lord Krishna, it is sacred to Jains and Buddhists also. The ghats and the serene banks of river Yamuna give Mathura a tranquil feel. The festivals celebrated in the city revolve around the life of Lord Krishna. Janmashtami and Holi are celebrated with great zeal. Barsana, 27 km from Mathura, is known for the celebration of Lathmaar Holi. Listing image: By Nico Crisafulli from USA\/Wikimedia commons best places to stay in mathura","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7267814,"ranking":5,"query_text":"where is mathura","passage_text":"Mathura Tourism . Famous as the birthplace of much loved Lord Krishna, Mathura is a city located on the banks of river Yamuna in the state of Uttar Pradesh and draws flocks of Hindu tourists every year looking to visit the numerous temples in the city.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7729944,"ranking":6,"query_text":"where is mathura","passage_text":"Vrindavan City, the Living place of lord Krishna. Vrindavan (also spelled as Vrindaban or Brindavan) city is located at Mathura district in the state of Uttar Pradesh about 11 km away from Mathura city close to the Agra-Delhi highway.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":2261861,"ranking":7,"query_text":"where is mathura","passage_text":"In 2018, Holi will be celebrated on March 2. The festival takes place a day earlier in West Bengal and Odisha. In addition, in some parts of India (such as Mathura and Vrindavan) festivities commence a week or so earlier. Find out when is Holi in future years. Where is Holi Celebrated? Holi celebrations take place in most areas of India. However, they're more exuberant in some places than others. Check out these 10 Places to Celebrate the Holi Festival in India (and one region that should be avoided). Traditional Holi celebrations are the biggest at Mathura and Vrindavan, four hours from Delhi.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":1681699,"ranking":8,"query_text":"where is mathura","passage_text":"People in Mathura celebrate holi with lots of fun-frolic activities. Holi festival is of great significance of love and devotion for them where lots of romance is found to see and experience. A whole week celebration takes place with a huge crowd of people from every corner of India.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7267823,"ranking":9,"query_text":"where is mathura","passage_text":"Offerings are not allowed in the temple.After, drive to Mathura. Famed for being the birthplace of the much-loved Hindu god Krishna, Mathura is one of Hinduismâ\u0080\u0099s seven sacred cities and attracts floods of pilgrims round the year. Visit the Shri Krishna Janambhoomi Temple, the birthplace of the ancient Hindu God Lord Krishna.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7729940,"ranking":10,"query_text":"where is mathura","passage_text":"Vrindavan (also spelled as Vrindaban or Brindavan) city is located at Mathura district in the state of Uttar Pradesh about 11 km away from Mathura city close to the Agra-Delhi highway. According to the mythology of Hindu, God Krishna used to live here during his childhood days before 3000BC.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":5752052,"ranking":11,"query_text":"where is mathura","passage_text":"Mathura is situated 145 kms from capital city of India, New Delhi. This is at a distance of 58 kms from Agra. Well developed road and railways are available to reach the place. Mathura is one of the major city between New Delhi and Agra and daily many number of buses and trains run between the two.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7267818,"ranking":12,"query_text":"where is mathura","passage_text":"Offerings are not allowed in the temple.10:30am - Drive to Mathura. Famed for being the birthplace of the much-loved Hindu god Krishna, Mathura is one of Hinduismâ\u0080\u0099s seven sacred cities and attracts floods of pilgrims round the year. 11am - Visit Shri Krishna Janambhoomi. This temple is the birthplace of the ancient Hindu God Lord Krishna.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7959794,"ranking":13,"query_text":"where is mathura","passage_text":"NH-2 and Grand Trunk Road are not same[edit] Between Delhi and Etawah, NH-2 and Grand Trunk road are not same, Grand Trunk road passes through Aligarh and I think it meets NH-2 at Shikohabad where as NH-2 goes through Palwal, Mathura, Agra, Tundla, Firozabad, Shikohabad, Etawah, Kanpur etc.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7990250,"ranking":14,"query_text":"where is mathura","passage_text":"The temple will be a 700 feet high skyscraper spread over an area of 5.5 acres. It will also have 70 floors. Mathura: The International Society for Krishna Consciousness (ISKCON) is doing the ground breaking ceremony at Mathura, the birth place of Lord Krishna, to build the world's tallest temple. It will be a 700 feet high skyscraper spread over an area of 5.5 acres and also have 70 floors. The ISKCON is hoping to complete the work in the next 5 years.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7267817,"ranking":15,"query_text":"where is mathura","passage_text":"Mathura is a city found in Uttar Pradesh, India. It is located 27.5 latitude and 77.68 longitude and it is situated at 191 meters above sea level","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":8706029,"ranking":16,"query_text":"where is mathura","passage_text":"â\u0080\u0098It was reported to the Emperor (Aurangzeb) that in the temple of Keshava Rai at Mathura, there is a stone railing presented by Bishukoh (one without dignity i.e. Prince Dara, Aurangzeb's elder brother).","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7729938,"ranking":17,"query_text":"where is mathura","passage_text":"Vrindavan is situated in the north Indian state of Uttar Pradesh at a distance of 140 km south-east of Delhi, 65 km north west of Agra and 15 kms from Mathura.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7267816,"ranking":18,"query_text":"where is mathura","passage_text":"The famous cities\/villages of Mathura District are as follows. 1  Vrindavan. 2  Baldeo. 3  Nandgaon. 4  Barsana. 5  Goverdhan. 6  Gokul. 7  Chaumuhan. 8  Kosi Kalan.","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":943741,"ranking":19,"query_text":"where is mathura","passage_text":"Janmashtami is celebrated when Krishna is believed to have been born according to Hindu tradition, which is in Mathura, at midnight on the eighth day of Bhadrapada month (overlaps with August and September in the Gregorian calendar).","bm25_label":"high","relevance_label":0.0},{"query_id":998591,"passage_id":7729943,"ranking":20,"query_text":"where is mathura","passage_text":"Situated in the state of Uttar Pradesh; Vrindavan is around 151 km south of Delhi. The place is just 10 km off Mathura, being a land of peace and serenity. It is well connected by means of road, air and railway.","bm25_label":"high","relevance_label":0.0}]