[{"query_id":998641,"passage_id":7267615,"ranking":1,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Long John Silver's Goldsboro - Hours & Locations. All Stores > Long John Silver's Locations & Hours > Long John Silver's Goldsboro NC locations, hours, phone number, map and driving directions.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":7267611,"ranking":2,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Long John Silver's nearby at 214 N Berkeley Blvd, Goldsboro, NC: Get restaurant menu, locations, hours, phone numbers, driving directions and more. home all menus","bm25_label":"high","relevance_label":1.0},{"query_id":998641,"passage_id":7267619,"ranking":3,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Get reviews, hours, directions, coupons and more for Long John Silver's at 214 N Berkeley Blvd, Goldsboro, NC. Search for other Fast Food Restaurants in Goldsboro on YP.com. Start your search by typing in the business name below.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":7267618,"ranking":4,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Long John Silver's, 214 North Berkeley Blvd., Goldsboro, North Carolina locations and hours of operation. Opening and closing times for stores near by. Address, phone number, directions, and more.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":7267610,"ranking":5,"query_text":"where is long john silver located in goldsboro nc","passage_text":"People Also Viewed. 1  Chick-Fil-A (1) 619 N Berkeley Blvd Ste B, Goldsboro, NC. 2  McAlister's Deli 431 N Berkeley Blvd, Goldsboro, NC. 3  Jersey Mike's Subs 2503 E Ash St Ste C, Goldsboro, NC. 4  Chick-Fil-A 1201 N Berkeley Blvd, Goldsboro, NC. 5  Pizza Hut (1) 2518 E Ash St, Goldsboro, NC. Texas Roadhouse. 600 N Berkeley Blvd, Goldsboro, NC","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":6515313,"ranking":6,"query_text":"where is long john silver located in goldsboro nc","passage_text":"User Reviews. Description of Brian Center Health and Rehabilitation\/goldsboro in GOLDSBORO, NC. Number of Beds : 130. Brian Center Health, and Rehabilitation - Goldsboro is a professional care community in a quiet residential area of Goldsboro, NC.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":6587676,"ranking":7,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Cliffs of the Neuse State Park is located in Wayne County, 14 miles southeast of Goldsboro on NC 111. From I-40 in Raleigh, take US 70 east for approximately 50 miles. After driving through Goldsboro, turn right onto NC 111 and travel south for about eight miles.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":7267614,"ranking":8,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Home > Long John Silver's > North Carolina Long John Silver's North Carolina Store Locator Address, Contact Information, & Hours of Operation for Long John Silver's Locations in North Carolina Locations:","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":7267617,"ranking":9,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Add a Long John Silver's Store We have 4 Long John Silver's locations with hours of operation and phone number. Popular Cities With Long John Silver's locations","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":6587679,"ranking":10,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Driving. Cliffs of the Neuse State Park is located in Wayne County, 11 miles southeast of Goldsboro on NC 111. From I-40 in Raleigh, take US 70 east for approximately 50 miles. After driving through Goldsboro, turn right onto NC 111 and travel south for about ten miles.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":7245560,"ranking":11,"query_text":"where is long john silver located in goldsboro nc","passage_text":"pirate band and Long John Silver is their leader. When they arrive on the island where the treasure is suppose to be located, the pirates try to take over. Jim and his friends hold on at first while Long John Silver seems to change sides several times depending on who he thinks is winning. Jim and his friends are able to survive the island and return with the treasure, but Long John Silver escapes.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":6587681,"ranking":12,"query_text":"where is long john silver located in goldsboro nc","passage_text":"35Â°14'7N, 77Â°53'36W. Cliffs of the Neuse State Park is located in Wayne County, 11 miles southeast of Goldsboro on NC 111. From I-40 in Raleigh, take exit 309 and head east on US 70 for approximately 50 miles. After driving through Goldsboro, turn onto NC 111 south and travel for about ten miles.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":4599723,"ranking":13,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Fire-safe hotels and motels in Goldsboro, North Carolina: 1  Econo Lodge, 704 Hwy-70 Byp E, Goldsboro, NC 27530, Phone: (919) 736-4510. 2  Best Western Plus Goldsboro, 909 N Spence Ave, Goldsboro, NC 27534, Phone: (919) 751-1999, Fax: (919) 751-1506.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":1157995,"ranking":14,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Lowe's - Goldsboro 1202 Berkeley Blvd., Goldsboro NC 27534 Phone Number: (919) 778-9969","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":1157991,"ranking":15,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Lowe's - Goldsboro 1202 North Berkeley Boulevard, Goldsboro NC 27534 Phone Number: (919) 759-2672","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":7245553,"ranking":16,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Jim overhears a. conversation and discovers that most of the crew is part of a. pirate band and Long John Silver is their leader. When they. arrive on the island where the treasure is suppose to be located, the pirates try to take over. Jim and his friends hold on at first. while Long John Silver seems to change sides several times. depending on who he thinks is winning.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":8111647,"ranking":17,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Chevrolet of Goldsboro, CCOG 23 years in business 3300 US Highway 70 Bypass East Goldsboro, NC 27534-8379","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":6515306,"ranking":18,"query_text":"where is long john silver located in goldsboro nc","passage_text":"BRIAN CENTER HEALTH AND REHABILITATION\/GOLDSBORO - GOLDSBORO, NC. Institution representatives - add corrected or new information about BRIAN CENTER HEALTH AND REHABILITATION\/GOLDSBORO Â». Your IP address 157.55.39.110 will be logged.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":6515312,"ranking":19,"query_text":"where is long john silver located in goldsboro nc","passage_text":"Selecting the right skilled nursing facility can be critical to your speedy recovery. Brian Center Health and Rehabilitation\/Goldsboro located in Goldsboro, NC, in Wayne County, offers a variety of therapies and care services to help you regain your independence. Skilled nurses, therapists and licensed care professionals are available to guide you through your personalized therapy.","bm25_label":"high","relevance_label":0.0},{"query_id":998641,"passage_id":6515311,"ranking":20,"query_text":"where is long john silver located in goldsboro nc","passage_text":"About Brian Center Health and Rehabilitation\/goldsboro. Brian Center Health and Rehabilitation\/goldsboro is a nursing home in Goldsboro, NC that provides patients with skilled nursing care as well as private or shared accommodations. Contact Brian Center Health and Rehabilitation\/goldsboro for more details on housing, services, and rates.","bm25_label":"high","relevance_label":0.0}]